{
  "story_id": "GN_20250823_191629_a264b342",
  "metadata": {
    "title": "Sri Lanka Arrests Ex-President Wickremesinghe Over Alleged Misuse of State Funds",
    "timestamp": "2025-08-23T19:16:29.155459",
    "url": "https://ground.news/article/former-sri-lankan-president-wickremesinghe-arrested-on-allegations-of-misusing-state-funds_31b6f9"
  },
  "bias_distribution": {
    "total_sources": "149",
    "leaning_left": "40",
    "center": "24",
    "leaning_right": "22"
  },
  "perspective_summaries": {
    "left": [
      "Former Sri Lankan President Ranil Wickremesinghe was arrested for allegedly misusing government funds.",
      "Wickremesinghe is under investigation for a September 2023 visit to London related to a ceremony for his wife.",
      "The Criminal Investigation Department alleges that government funds were used for Wickremesinghe's travel and bodyguards.",
      "Wickremesinghe stated the visit was privately funded, but charges accuse him of using state resources for personal purposes."
    ],
    "center": [
      "Ranil Wickremesinghe, who previously served as Sri Lanka’s president, was detained in Colombo on August 22, 2024, over allegations of improper use of state funds connected to his official travel.",
      "In July 2022, Wickremesinghe assumed the presidency after Gotabaya Rajapaksa resigned in the wake of prolonged protests sparked by the nation's most severe financial crisis and economic turmoil.",
      "The arrest concerns a September 2023 stopover in London made by Wickremesinghe after attending a G77 summit in Havana, which the Criminal Investigation Department claims was a private trip funded with approximately $56,000 of government money.",
      "During his presidency, Wickremesinghe undertook 23 international trips costing over $2 million, and authorities are now formally accusing him of misappropriating state assets for personal use as they present him before the Colombo Fort magistrate.",
      "Wickremesinghe, recognized for helping to restore stability to Sri Lanka’s economy following the crisis, was defeated in the presidential election held in September 2023 amid widespread public frustration over corruption and poor governance."
    ],
    "right": [
      "Former Sri Lankan President Ranil Wickremesinghe was arrested for allegedly misusing state funds, according to police reports.",
      "His arrest is linked to allegations of using government money for a personal trip to London in 2023, as mentioned by police officials.",
      "Former staff members were questioned regarding their roles in arranging Wickremesinghe's visit, based on information from Newswire.",
      "The legal proceedings against Wickremesinghe are expected to follow."
    ]
  },
  "sources": [
    {
      "news_title": "Ex-Lanka president remanded in graft case",
      "news_link": "https://tribune.com.pk/story/2562738/ex-lanka-president-remanded-in-graft-case",
      "bias": "Center",
      "text": "Former Sri Lankan President Ranil Wickremesinghe, who led the country during a devastating economic crisis, was arrested and remanded in custody on Friday over allegations he misused state funds while in office, police said.\nWickremesinghe, 76, who lost power in a 2024 election, had been investigated over a visit he made to Britain to attend a special graduation lunch as part of the celebrations of his wife's honorary professorship at a university there, local media reported.\nPolice confirmed his arrest for alleged misuse of public funds. \"Former President Ranil Wickremesinghe has been arrested and produced in court. He will be in remand custody till August 26,\" police spokesman FU Wootler told Reuters.\nAn ally from his United National Party (UNP) proclaimed his innocence and suggested the case was politically motivated. \"Ranil Wickremesinghe has never misused public funds or state funds,\" UNP member Nishantha Sri Warnasinghe told reporters\n\"He was the person who stepped up and accepted the challenge to save this country when the economy collapsed,\" Warnasinghe said. \"That is the person who is being treated like this today by this government,\" she told reporters outside the Colombo court where Wickremesinghe appeared.\nPolitical family\nWickremesinghe, a lawyer and the UNP head, who also served as Sri Lanka's prime minister a record six times, became the president in 2022 at the height of the Indian Ocean island nation's debilitating financial crisis.\nWickremesinghe took over after widespread protests caused by an economic meltdown forced his predecessor Gotabaya Rajapaksa to flee the country and later resign.\nCOMMENTS\nComments are moderated and generally will be posted if they are on-topic and not abusive.\nFor more information, please see our Comments FAQ"
    },
    {
      "news_title": "Former Lanka president Ranil Wickremesinghe cited ill health, wife’s cancer in bail plea, remanded till Aug 29",
      "news_link": "https://www.wionews.com/world/former-lanka-president-ranil-wickremesinghe-cited-ill-health-wife-s-cancer-in-bail-plea-remanded-till-aug-29-1755888645828",
      "bias": "Center",
      "text": "The former Sri Lankan president argues that the trip was funded by his wife and they did not use public money for it. However, the Criminal Investigation Department (CID) has alleged that Wickremesinghe used government funds for the trip, including covering the expenses of his bodyguards.\nFormer Sri Lankan president Ranil Wickremesinghe was refused bail by the Colombo Fort Magistrate Court after his arrest on the charge of ‘misusing government funds’ and remanded in custody till 26 August. Wickremesinghe, who served as head of state from 2022 to 2024 and was a six-time prime minister, was arrested earlier on Friday by the Criminal Investigation Department (CID) over the allegations of misusing state funds to finance a private trip to London for attending the graduation ceremony of his wife, Professor Maithree Wickremesinghe, during his presidency.\nWickremesinghe’s legal counsel argued in the court that detaining the former president posed a serious risk to his security and health and pleaded that bail be granted to him.\nPresident’s counsel Anuja Premaratne appeared for Wickremesinghe and said he is “76 years old, suffering from heart disease for seven years, as well as diabetes and hypertension”.\n“For the first time today, it is revealed that his wife is a cancer patient. They have no children and depend solely on each other. He is scheduled to be the chief guest at the Commonwealth Youth Council in India on August 24. Prison is not a safe place for a former president. I therefore respectfully request Your Honour to release my client on suitable bail conditions.”\nHowever, the magistrate, Nilupuli Lankapura, denied the request and ruled that Wickremesinghe would remain in custody until Tuesday.\nWickremesinghe’s supporters gathered outside the court and started chanting in anger when the remand order was announced and he was escorted away. Senior political figures, including Namal Rajapaksa, former president Maithripala Sirisena, and former prime minister Dinesh Gunawardena, had earlier visited court in a show of solidarity and were present at the time of the court order.\nIt is the first time a former head of state has ever been detained on the island. Sri Lankan Muslim Congress leader Rauff Hakeem condemned the detention of Wickremesinghe as “unbecoming” and akin to treating him “like a common criminal.”\nFormer Maldivian president Mohamed Nasheed also voiced support, stating he looked forward to Wickremesinghe’s “return home shortly.”\nWickremesinghe will remain in remand prison until 26 August, when the case is scheduled to be reviewed."
    },
    {
      "news_title": "Former Sri Lankan president arrested for alleged corruption offences",
      "news_link": "https://www.abc.net.au/news/2025-08-23/ranil-wickremesinghe-arrested-for-alleged-corruption-offences/105688628",
      "bias": "Lean Left",
      "text": "Sri Lanka's former president has been arrested for allegedly misusing public funds while in office.\nRanil Wickremesinghe is the most high-profile politician to come under investigation for corruption offences.\nWhat's next?\nHe has been remanded in custody and will face court again next week.\nSri Lankan police have arrested former president Ranil Wickremesinghe over allegations he misused public funds during his time as head of state.\nPolice alleged that Mr Wickremesinghe, who served as the island nation's president from 2022 to 2024, was arrested on allegations of using public funds to attend his wife's graduation ceremony in London after an official visit to the US, spokesman Fedrick Wootler told The Associated Press.\nThe former president was taken to a court after being arrested by the Financial Crimes Investigations Department.\nThe court remanded him in custody until a second hearing on the matter on Tuesday.\nHe is the first Sri Lankan former head of state to be arrested and is the most high-profile leader who is under investigation for corruption under President Anura Kumara Dissanayake's government, which came to power last year promising to punish those accused of corruption under previous governments\nMr Dissanayake won the presidential election in September last year in an election that saw voters reject an old guard accused of leading the country into an economic crisis.\nTwo months later, his party won a landslide victory in the parliamentary election, enabling him to form a strong government.\nAlready, more than a dozen political leaders of the previous government and former high government officials have been arrested and are under investigation for alleged corruption and malpractice.\nMr Wickremesinghe became president after Sri Lanka's economic upheaval led to a political crisis that forced then-president Gotabaya Rajapaksa to resign in 2022.\nHe is credited with stabilising the crumbling economy, with inflation falling, the local currency strengthened and foreign reserves increased.\nHowever, he was severely criticised for implementing stringent austerity measures, including raising taxes and utility bills, that came as part of a bailout package with the International Monetary Fund entered into by his government."
    },
    {
      "news_title": "UNP files complaint with CID over YouTubers claim on Ranils arrest",
      "news_link": "http://www.adaderana.lk/news.php?nid=111748",
      "bias": "Lean Left",
      "text": "UNP files complaint with CID over YouTubers claim on Ranils arrest\nAugust 22, 2025 08:41 pm\nThe United National Party (UNP) has filed a complaint with the Criminal Investigation Department (CID) today (22), requesting an investigation into a statement made by YouTuber Sudaththa Thilaksiri on his channel, claiming that former President Ranil Wickremesinghe would be arrested today and remanded for 14 days.\nOn August 21, Thilaksiri had stated on his YouTube channel that the former President would definitely be arrested today and remanded for 14 days.\nAccordingly, a group of attorneys representing the UNP filed a complaint with the CID, requesting an investigation into the issuance of such a statement before any official action had been taken.\nMeanwhile, Opposition Leader Sajith Premadasa says that a YouTuber predicting the arrest of a former President before it even happens cannot be a coincidence.\n“A YouTuber predicting the arrest of a former President before it even happens? That can’t be a coincidence, could it be planned? If true, it’s a sad day when something as sacred as law and order is reduced to cheap theatrics,” he said, in a post on ‘X’ (formerly Twitter)."
    },
    {
      "news_title": "Sri Lanka’s former president Wickremesinghe arrested over alleged misuse of state funds",
      "news_link": "https://www.dawn.com/news/1934130",
      "bias": "Lean Left",
      "text": "Former Sri Lankan president Ranil Wickremesinghe, who led the country during a devastating 2019-2024 economic crisis, was arrested and appeared in court on Friday over allegations he misused state funds while in office, police said.\nWickremesinghe, 76, who lost power in a 2024 election, had been investigated over a visit he made to London to attend his wife’s graduation ceremony, local media reported.\nPolice confirmed his arrest for alleged misuse of public funds.\n“Former president Ranil Wickremesinghe has been arrested and produced in court. We are awaiting the court directive to decide what further steps need to be taken,” a police spokesperson said.\nWickremesinghe’s office did not respond to a request for comment from Reuters.\nAn ally from his United National Party (UNP) proclaimed his innocence and suggested the case was politically motivated.\n“Ranil Wickremesinghe has never misused public funds or state funds,” UNP member Nishantha Sri Warnasinghe told reporters gathered outside the court complex where the former president appeared in Colombo.\n“He was the person who stepped up and accepted the challenge to save this country when the economy collapsed,” Warnasinghe said. “That is the person who is being treated like this today by this government.”\nSri Lanka’s cabinet spokesperson did not immediately respond to a request for comment.\nPolitical Family\nWickremesinghe, a lawyer who also served as Sri Lanka’s prime minister a record six times, became president in 2022 at the height of the Indian Ocean island nation’s debilitating financial crisis.\nWickremesinghe, who leads the UNP, took over after widespread protests caused by an economic meltdown forced his predecessor, Gotabaya Rajapaksa, to flee the country and later resign.\nHe finished third in last year’s presidential election — the first since the economic crisis — behind Marxist-leaning Anura Kumara Dissanayake, who won the vote, and opposition leader Sajith Premadasa.\nThe election was largely seen as a referendum on Wickremesinghe, who led a successful but fragile economic recovery that included painful austerity measures.\nBorn into a prominent family of politicians and businessmen with significant media interests, Wickremesinghe was, at 29, appointed the country’s youngest cabinet minister by his uncle, then-President Junius Jayewardene in 1978.\nIn 1994, following the assassinations of several of his senior colleagues, Wickremesinghe became leader of the UNP."
    },
    {
      "news_title": "Sri Lanka's former president Ranil Wickremesinghe arrested",
      "news_link": "https://saudigazette.com.sa/article/654378",
      "bias": "Lean Left",
      "text": "COLOMBO – Sri Lanka's former president Ranil Wickremesinghe has been arrested in connection with the alleged misuse of funds, police have said.\nThe charge relates to trips he took abroad while serving as president.\nHe arrived at magistrates court in the capital Colombo on Friday, having already given a statement to the Criminal Investigations Department (CID) earlier in the day.\nWickremesinghe served as president from 2022 to 2024, stepping into the role after the country's worst ever economic crisis triggered a popular uprising caused his predecessor Gotabaya Rajapaksa to flee.\nHe was widely credited with helping put the island nation back on the road to economic recovery.\nWickremesinghe also served six separate terms as prime minister from the 1990s onwards.\nAccording to BBC Sinhala, the 76-year-old made 23 foreign trips during his time as president, at a cost of more than Rs 600 million ($2m; £1.4m).\nFriday's arrest relates to a stop over made in the UK in 2023, on Wickremesinghe's way back from a G77 summit in Cuba, news agency AFP reports.\nOn that occasion, he and his wife had attended a University of Wolverhampton ceremony.\nSri Lanka's CID allege this was a private visit for which state funds were used – something Wickremesinghe has denied.\nTheir investigation was initially referred to a court in June.\nWickremesinghe, who is the first former president to be arrested in Sri Lanka, has been a feature of the island nation's politics since he was first elected as MP in 1977.\nA lawyer by profession, he comes from an affluent family of politicians and businessmen.\nHe was credited with cleaning up the image of the United National Party (UNP) after taking over its leadership in 1994 by bringing in a disciplinary commission to get rid of corrupt party members.\nOver the years, he went on to make several bids to become president – only getting the role he had long-wanted in 2022 after Rajapaksa fled.\nAt the time his party was almost wiped out in the 2020 elections, and he was left as its sole representative in parliament.\nHe lost the 2024 election to the left-leaning Anura Kumara Dissanayake. – BBC"
    },
    {
      "news_title": "Former Sri Lanka President Ranil Wickremesinghe arrested",
      "news_link": "https://www.aljazeera.com/news/2025/8/22/former-sri-lanka-president-ranil-wickremesinghe-arrested",
      "bias": "Lean Left",
      "text": "Former Sri Lanka President Ranil Wickremesinghe arrested\nPolice say the former leader is accused of misuse of public funds in relation to a trip to London.\nFormer Sri Lankan President Ranil Wickremesinghe has been arrested and appeared in court over allegations he misused state funds while in office, police say.\nWickremesinghe, 76, who led the country during a devastating 2019-2024 economic crisis, had been investigated over a visit he made to London to attend his wife’s graduation, local media reported on Friday.\nRecommended Stories\nlist of 4 items‘Need a change’: Sri Lanka’s leftist win sparks hopes, bridges old divides\nSri Lanka parliament votes to fire impeached police chief\nWho is to blame for Sri Lanka’s crises?\nPolice confirmed his arrest for alleged misuse of public funds.\n“Former President Ranil Wickremesinghe has been arrested and produced in court. We are awaiting the court directive to decide what further steps need to be taken,” a police spokesperson said.\nLater on Friday, a court in Sri Lanka’s capital Colombo, ordered Wickremesinghe to be held in custody until August 26 when a fresh hearing will be held into the allegations.\nSri Lanka’s anticorruption units have led a crackdown since President Anura Kumara Dissanayake came to power in September on a promise to fight corruption.\nA Wickremesinghe ally from his United National Party (UNP) proclaimed his innocence and suggested the case was politically motivated.\n“Ranil Wickremesinghe has never misused public funds or state funds,” UNP member Nishantha Sri Warnasinghe told reporters outside the court complex in Colombo where the former president appeared.\n“He was the person who stepped up and accepted the challenge to save this country when the economy collapsed,” Warnasinghe said. “That is the person who is being treated like this today by this government.”\nTravel expenses\nWickremesinghe had stopped in London in 2023 on his way back to Sri Lanka from Havana, where he attended a G77 summit.\nHis office had previously denied that he abused his position to visit London.\nThree of his then-senior aides were questioned this month by the Criminal Investigation Department (CID).\nHe and his wife, Maithree, attended a University of Wolverhampton ceremony, where she received an honorary professorship.\nWickremesinghe had maintained that his wife’s travel expenses were met by her and no state funds were used.\nHowever, the CID alleged that Wickremesinghe used government money for his travel on a private visit and his bodyguards were also paid by the state.\nWickremesinghe became president in July 2022 after Gotabaya Rajapaksa stepped down following months of street protests over alleged corruption and mismanagement. Wickremesinghe lost power in a 2024 election.\nHe secured a $2.9bn bailout from the International Monetary Fund in early 2023 and was credited with stabilising the economy after Sri Lanka’s worst-ever financial meltdown in 2022.\nHe doubled taxes and removed energy subsidies as part of tough austerity measures to raise state revenues."
    },
    {
      "news_title": "Former Sri Lankan president Wickremesinghe arrested over alleged misuse of state funds",
      "news_link": "https://english.news.cn/20250822/861d7bb21afa42b1bb563ea9c1b79f31/c.html",
      "bias": "Left",
      "text": "Former Sri Lankan president Ranil Wickremesinghe is arrested in Colombo, Sri Lanka, on Aug. 22, 2025. Wickremesinghe was arrested on Friday by the Criminal Investigation Department (CID) over alleged misuse of state funds, state media reported. (Photo by Gayan Sameera/Xinhua)\nCOLOMBO, Aug. 22 (Xinhua) -- Former Sri Lankan president Ranil Wickremesinghe was arrested on Friday by the Criminal Investigation Department (CID) over alleged misuse of state funds, state media reported.\nWickremesinghe was arrested for charges of misusing state funds to visit London to attend a graduation ceremony of his wife, during his tenure as president in September 2023, according to local media.\nIt is the first time a former executive president has been arrested in Sri Lanka's history, and he has been brought to the Colombo Fort Magistrate's Court following his arrest, according to local media.\nAs part of the investigations, the CID had previously recorded statements from the former president's private secretary and his presidential secretary.\nWickremesinghe arrived at the CID to provide a statement on Friday morning, and he was taken into custody following the recording of the statement, said media reports.\nFile photo taken on Sept. 21, 2024 shows Ranil Wickremesinghe (Front) leaving a polling station after casting his vote for the presidential election 2024 in Colombo, Sri Lanka. Former Sri Lankan president Ranil Wickremesinghe was arrested on Aug. 22, 2025 by the Criminal Investigation Department (CID) over alleged misuse of state funds, state media reported. (Xinhua/Wu Yue)"
    },
    {
      "news_title": "Former Sri Lankan president Ranil Wickremesinghe arrested over UK visit",
      "news_link": "https://www.independent.co.uk/asia/south-asia/sri-lanka-president-arrested-ranil-wickremesinghe-b2812428.html",
      "bias": "Lean Left",
      "text": "Former Sri Lankan president Ranil Wickremesinghe arrested over UK visit\nThis marks the first arrest of a former Sri Lankan president\nSri Lanka’s former president Ranil Wickremesinghe has been arrested over alleged misuse of state funds for personal travel, police said.\nWickremesinghe, 76, who served as president from 2022 to 2024 and had six prior terms as prime minister, has denied the allegations.\nAuthorities are seeking to question Mr Wickremesinghe over allegations that he used state funds for a personal stopover in the UK while returning from an official trip in 2023.\nThis marks the first arrest of a former Sri Lankan president.\nIn 2023, Mr Wickremesinghe made a stopover in London on his return from Cuba, where he had attended a G77 summit. During the visit, he and his wife, Maithree, participated in a ceremony at the University of Wolverhampton, according to AFP.\nMr Wickremesinghe has insisted that his wife covered her own expenses and that no public funds were used.\nBut Sri Lanka’s Criminal Investigation Department (CID) said state money financed the private visit, including the costs of his bodyguards.\nEarlier this month, authorities also questioned Mr Wickremesinghe’s former presidential secretary, Saman Ekanayake, and his former private secretary, Sandra Perera, regarding their involvement in organising the visit.\nOn Friday afternoon, local TV captured Mr Wickremesinghe arriving at the Fort Magistrate’s Court in Colombo.\nMr Wickremesinghe has been a prominent political figure since 1977 and was credited with helping Sri Lanka recover from its worst economic crisis. He played a key role in securing an International Monetary Fund (IMF) bailout in 2023.\nMr Wickremesinghe is a lawyer by profession and comes from a politically influential family. He was first elected to parliament in 1977 at the age of just 28.\nAs leader of the United National Party (UNP), he held multiple terms as prime minister between 1993 and 2019. Amid the 2022 protests that forced Gotabaya Rajapaksa to resign, Mr Wickremesinghe was appointed prime minister and then became president, despite having no parliamentary seat.\nMr Wickremesinghe has faced criticism from human rights groups for promoting repressive laws, cracking down on protests, and suppressing memorial events, according to Sri Lankan outlet the Tamil Guardian.\nMr Wickremesinghe lost last year’s election to populist challenger Anura Kumara Dissanayake, who ran on an anti-corruption platform.\nJoin our commenting forum\nJoin thought-provoking conversations, follow other Independent readers and see their replies\nComments"
    },
    {
      "news_title": "Sri Lankan ex-president arrested for funds misuse",
      "news_link": "https://www.canberratimes.com.au/story/9047961/sri-lankan-ex-president-arrested-for-funds-misuse/",
      "bias": "Lean Left",
      "text": "Sri Lankan police have arrested the country's former president and senior opposition politician Ranil Wickremesinghe over allegations of misusing public funds during his tenure as president.\nSubscribe today for the news that matters\nor signup to continue reading\nWickremesinghe, who served as the island nation's president from 2022 to 2024, was arrested on Friday on allegations of using public funds to attend his wife's graduation ceremony in London after an official visit to the US, police spokesman Fedrick Wootler told The Associated Press.\nWickremesinghe's aide, Danushka Ramanayake, said the former president had been taken to a court after being arrested by the Financial Crimes Investigations Department.\nWickremesinghe is the first Sri Lankan former head of state to be arrested and is the most high-profile leader who is under investigation for corruption under President Anura Kumara Dissanayake's government which came to power in 2024 promising to punish those accused of corruption under previous governments\nDissanayake won the presidential election last September, with voters rejecting an old guard accused of leading the country into an economic crisis.\nTwo months later, his party won a landslide victory in the parliamentary election that enabled him to form a strong government.\nAlready, more than a dozen political leaders of the previous government and ex-high government officials have been arrested and are under investigation for alleged corruptions and malpractices.\nWickremesinghe became president after Sri Lanka's economic upheaval led to a political crisis that forced then-president Gotabaya Rajapaksa to resign in 2022.\nWickremesinghe is credited with stabilising the crumbling economy with inflation falling, the local currency strengthened and foreign reserves increased under him.\nBut he was severely criticised for implementing stringent austerity measures including raising taxes and utility bills that came as a part of a bailout package with the International Monetary Fund entered into by his government.\nAustralian Associated Press"
    },
    {
      "news_title": "Former Sri Lanka president arrested in anti-corruption crackdown",
      "news_link": "https://www.standardmedia.co.ke/asia/article/2001527555/former-sri-lanka-president-arrested-in-anti-corruption-crackdown",
      "bias": "Lean Right",
      "text": "Sri Lankan police arrested former president Ranil Wickremesinghe on Friday, making him the most senior opposition figure to be detained under an anti-corruption crackdown by the new leftist government.\nSri Lanka's anti-graft units have led the crackdown since President Anura Kumara Dissanayake came to power in September on a promise to fight corruption.\nWickremesinghe, 76, who lost the last election to Dissanayake, was taken into custody after being questioned about a September 2023 visit to London to attend a ceremony for his wife at a British university, a police detective told AFP.\n\"We are producing him before the Colombo Fort magistrate,\" the officer said, adding that they were pressing charges for using state resources for personal purposes.\nWickremesinghe had stopped in London in 2023 on his way back from Havana, where he attended a G77 summit.\nHis office had previously denied that he abused his position to visit London.\nThree of his then senior aides were questioned this month by the Criminal Investigation Department (CID).\nHe and his wife, Maithree, attended a University of Wolverhampton ceremony where she was conferred an honorary professorship.\nWickremesinghe had maintained that his wife's travel expenses were met by her and that no state funds were used.\nHowever, the CID alleged that Wickremesinghe used government money for his travel on a private visit and that his bodyguards were also paid by the state.\nWickremesinghe became president in July 2022 for the remainder of Gotabaya Rajapaksa's term after Rajapaksa stepped down following months of street protests over alleged corruption and mismanagement.\nWickremesinghe secured a $2.9 billion bailout from the International Monetary Fund (IMF) in early 2023 and was credited with stabilising the economy after the country's worst-ever financial meltdown in 2022.\nHe doubled taxes and removed energy subsidies as part of tough austerity measures to raise state revenue.\nHe lost his re-election bid in September but remained a key opposition figure despite his coalition holding only two seats in the 225-member parliament.\nStay informed. Subscribe to our newsletter\nMembers of Wickremesinghe's United National Party were seen arriving at the Colombo Fort magistrate's court, where he was due to be taken later on Friday.\nKey opposition politicians, including two former senior ministers, have been jailed for up to 25 years for corruption since the new leftist government took office.\nSeveral members of former president Mahinda Rajapaksa's family have also been charged with misusing state funds and are being prosecuted. Many of them are currently on bail pending court hearings.\nDissanayake's government earlier this month impeached the police chief after accusing him of running a criminal network that supported politicians. The prisons chief was also jailed for corruption."
    },
    {
      "news_title": "Former Sri Lanka President Ranil Wickremesinghe arrested on misuse of funds charges",
      "news_link": "https://www.upi.com/Top_News/World-News/2025/08/22/sri-lanka-president-Wickremesinghe-arrested/8421755874078/",
      "bias": "Center",
      "text": "Aug. 22 (UPI) -- Sri Lanka's former president was arrested Friday for the alleged misuse of public funds, police said.\nRanil Wickremesinghe was arrested in Colombo, the Sri Lankan capitol, while giving a statement to the country's Criminal Investigations Department. He's been facing multiple government investigations into widespread bribery and corruption. The charge in his arrest was for using public funds for his personal travel.\nFriday's arrest was about a detour Wickremesinghe, 76, made to Britain in 2023 on his way back to Sri Lanka from an official visit to the United States. He made the stop to attend an awards ceremony for his wife, Maithree Wickremesinghe, who was awarded an honorary professorship from the University of Wolverhampton. The government alleged that it was a personal trip for which about $56,000 of public money was used.\nWickremesinghe was widely credited with helping put the country back on the road to economic recovery. He also served six separate terms as prime minister since the 1990s.\nRelated\nHe made 23 foreign trips during his time as president, at a cost of more than $2 million, according to BBC Sinhala.\nHe served as president from 2022 to 2024, stepping into the role after the country's worst ever economic crisis triggered a popular uprising that caused his predecessor Gotabaya Rajapaksa to flee.\nWickremesinghe's arrest is the most high-profile case since the National People's Power, a leftist coalition, won the presidential election in September. Its leader Anura Kumara Dissanayake became president. Dissanayake, 56, campaigned on a promise of weeding out corruption and prosecuting those who had misused public funds.\nIn 2019, Sri Lanka fell into a downward spiral, partly driven by poor policymaking by the government of Rajapaksa that depleted foreign reserves and eventually forced the country to default on its debt. Terrorist bombings in 2019 and the COVID-19 pandemic, which crushed tourism, also eroded the domestic economy.\nBy 2022, when Sri Lanka's foreign exchange reserves ran so low that it couldn't buy fuel, public anger led to protests and the ouster of Rajapaksa.\nAs president, Wickremesinghe helped secure an International Monetary Fund bailout in 2023. But the deal required austerity measures. Those unpopular policies, a growing sense among people that he was part of the old guard, and discomfort that he was close to Rajapaksa, led Sri Lankans to reject him during last year's elections."
    },
    {
      "news_title": "Sri Lanka arrests former president Wickremesinghe: local media",
      "news_link": "https://www.geo.tv/latest/619906-sri-lanka-arrests-former-president-wickremesinghe-local-media-reports",
      "bias": "Lean Right",
      "text": "August 22, 2025\nCOLOMBO: Former Sri Lankan President Ranil Wickremesinghe was arrested by the Criminal Investigation Department (CID) on Friday in connection with allegations of misuse of state funds, local television channel Ada Derana reported.\nWickremesinghe, 76, was taken into custody after arriving at the CID office in the capital Colombo to record a statement in an investigation into his visit to London to attend his wife's graduation ceremony, the report said.\nA Sri Lankan police spokesperson did not immediately confirm the arrest. Wickremesinghe's office did not respond to a request for comment from Reuters.\nHe was due to appear in court later on Friday, local media reported.\nA lawyer who served as Sri Lanka's prime minister a record six times, Wickremesinghe was made president in 2022 during the Indian Ocean island nation's debilitating financial crisis.\nWickremesinghe, who is the leader of the United National Party (UNP), took over after widespread protests caused by an economic meltdown forced his predecessor Gotabaya Rajapaksa to flee the country and later resign.\nHe finished third in last year's presidential election - the first since the economic crisis - behind Marxist-leaning Anura Kumara Dissanayake, who won the vote, and opposition leader Sajith Premadasa.\nThe election was a referendum on Wickremesinghe, who led a successful but fragile economic recovery that included austerity measures that angered voters.\nBorn into a prominent family of politicians and businessmen with large media interests, in 1978 Wickremesinghe was, at 29, made the country's youngest cabinet minister by his uncle, President Junius Jayewardene.\nIn 1994, following assassinations that wiped out several of his senior colleagues, Wickremesinghe became leader of the UNP."
    },
    {
      "news_title": "Sri Lankan ex-president arrested over misuse of state funds",
      "news_link": "https://www.scmp.com/news/asia/south-asia/article/3322854/sri-lankan-ex-president-ranil-wickremesinghe-arrested-over-misuse-state-funds",
      "bias": "Center",
      "text": "Sri Lankan ex-president Ranil Wickremesinghe arrested over misuse of state funds\nThe arrest of Ranil Wickremesinghe marks the first time a former Sri Lankan head of state has been detained\nFormer Sri Lankan president Ranil Wickremesinghe was arrested by the Criminal Investigation Department (CID) on Friday in connection with allegations of misuse of state funds, local television channel Ada Derana reported.\nWickremesinghe, 76, was taken into custody after arriving at the CID office in the capital, Colombo, to record a statement in an investigation into his visit to London to attend his wife’s graduation ceremony, the report said.\nWickremesinghe claims that his wife’s travel expenses were paid by her and that no state funds were used.\nHowever, the CID alleges that Wickremesinghe used government money for his travel on a private visit and that his bodyguards were also paid by the state.\nA Sri Lankan police spokesperson did not immediately confirm the arrest. Wickremesinghe’s office did not respond to a request for comment.\nHe was due to appear in court later on Friday, local media reported.\nWickremesinghe is the first Sri Lankan former head of state to be arrested."
    },
    {
      "news_title": "Sri Lanka arrests ex-president Wickremesinghe over alleged misuse of state funds for London trip to wife’s graduation",
      "news_link": "https://www.malaymail.com/news/world/2025/08/22/sri-lanka-arrests-ex-president-wickremesinghe-over-alleged-misuse-of-state-funds-for-london-trip-to-wifes-graduation/188593",
      "bias": "Lean Right",
      "text": "- Wickremesinghe arrested over alleged misuse of state funds\n- Arrest linked to London trip for wife’s graduation\n- Wickremesinghe was PM a record six times, made president in 2022\nCOLOMBO, Aug 22 — Former Sri Lankan President Ranil Wickremesinghe was arrested by the Criminal Investigation Department today in connection with allegations of misuse of state funds, local television channel Ada Derana reported.\nWickremesinghe, 76, was taken into custody after arriving at the CID office in the capital Colombo to record a statement in an investigation into his visit to London to attend his wife’s graduation ceremony, the report said.\nA Sri Lankan police spokesperson did not immediately confirm the arrest. Wickremesinghe’s office did not respond to a request for comment from Reuters.\nHe was due to appear in court later today, local media reported.\nA lawyer who served as Sri Lanka’s prime minister a record six times, Wickremesinghe was made president in 2022 during the Indian Ocean island nation’s debilitating financial crisis.\nWickremesinghe, who is the leader of the United National Party (UNP), took over after widespread protests caused by a economic meltdown forced his predecessor Gotabaya Rajapaksa to flee the country and later resign.\nHe finished third in last year’s presidential election — the first since the economic crisis — behind Marxist-leaning Anura Kumara Dissanayake, who won the vote, and opposition leader Sajith Premadasa.\nThe election was a referendum on Wickremesinghe, who led a successful but fragile economic recovery that included austerity measures that angered voters.\nBorn into a prominent family of politicians and businessmen with large media interests, in 1978 Wickremesinghe was, at 29, made the country’s youngest cabinet minister by his uncle, President Junius Jayewardene.\nIn 1994, following assassinations that wiped out several of his senior colleagues, Wickremesinghe became leader of the UNP. — Reuters"
    },
    {
      "news_title": "Sri Lanka Ex-President Arrested on Alleged Fund Misuse, AFP Says",
      "news_link": "https://www.bloomberg.com/news/articles/2025-08-22/sri-lanka-ex-president-arrested-on-alleged-fund-misuse-afp-says",
      "bias": "Lean Left",
      "text": null
    },
    {
      "news_title": "Former Sri Lanka President Ranil Wickremesinghe arrested: What is the case against the veteran politician? Explained",
      "news_link": "https://www.livemint.com/news/world/former-sri-lanka-president-ranil-wickremesinghe-arrested-what-is-the-case-against-the-veteran-politician-explained-11755855125207.html",
      "bias": "Center",
      "text": "Former Sri Lanka President Ranil Wickremesinghe was arrested on Friday on charges of allegedly misusing state funds, police said.\nThe Criminal Investigation Department (CID) of Sri Lanka arrested Wickremesinghe at its headquarters in Colombo, where he was summoned to record his statement in an investigation against him.\nThe former President of Sri Lanka has been taken into custody and is expected to be produced before the Colombo Fort Magistrate Court shortly.\nWickremesinghe, 76, has been accused of misusing state funds during a private trip to England in 2023.\nHere is all you need to know about the case against Ranil Wickremesinghe, who was arrested by the CID.\nAccording to a report by AFP, Ranil Wickremesinghe was taken into custody after CID officials questioned him about a visit to London in September 2023 to attend a convocation ceremony of his wife, Prof Maithree.\n“We are producing him before the Colombo Fort magistrate,” a senior police detective was quoted as saying by AFP, who added that they were pressing charges for using state resources for personal purposes.\nAccording to the report, the former Sri Lanka President attended the University of Wolverhampton ceremony with his wife on his way back from Havanna, where he was participating in a G77 meet.\nWickremesinghe had earlier maintained that the travel expenses of his wife was made by her and that no state funds were used.\nHowever, the CID investigation alleged that the former President used government money for a private visit. He has also been accused of using state-funded bodyguards during the event.\nThe CID had previously questioned his staff about the travel expenses.\nAccording to a report by Newswire quoted by ANI, former presidential secretary Saman Ekanayake and former private secretary Sandra Perera were questioned in August with link to their alleged role in setting up the visit.\nThe veteran politician is the most senior political figure to face arrest in recent years. The detention of Wickremesinghe is expected to intensify scrutiny over the use of public funds by top officials.\nRanil Wickremesinghe became president in July 2022 for the remainder of Gotabaya Rajapaksa's term, after Rajapaksa stepped down following months of protests over alleged corruption and mismanagement.\nHe is credited with stabilising the economy of Sri Lanka after it suffered its worst-ever financial crisis in 2022.\nStay updated with the latest Trending, India , World and US news. Read the latest updates on the Supreme Court verdict regarding Delhi-NCR stray dog relocation and ongoing protests now on Livemint."
    },
    {
      "news_title": "Former Sri Lankan President Wickremesinghe arrested on allegations of misusing state funds",
      "news_link": "https://apnews.com/article/sri-lanka-wickremesinghe-arrested-3057941fe6d62e681f23e5f190812fbc",
      "bias": "Lean Left",
      "text": "Former Sri Lankan President Wickremesinghe arrested on allegations of misusing state funds\nFormer Sri Lankan President Wickremesinghe arrested on allegations of misusing state funds\nCOLOMBO, Sri Lanka (AP) — Police in Sri Lanka arrested former President Ranil Wickremesinghe on Friday over allegations that the senior opposition politician misused public funds during his presidency, police said.\nWickremesinghe, who was president from 2022 to 2024, is accused of using the funds to attend his wife’s graduation ceremony in London after an official visit to the United States, police spokesman Fredrick Wootler told The Associated Press.\nWickremesinghe appeared for a lengthy hearing before a magistrate court in the capital, Colombo, and was ordered to be kept in custody until Aug. 26. He didn’t comment during the hearing, and there was no immediate statement from his office. A large crowd of Wickremesinghe’s supporters gathered outside the court to protest his arrest.\nWickremesinghe is the first Sri Lankan former head of state to be arrested and the most prominent leader under investigation for corruption under the government of President Anura Kumara Dissanayake, who came to power last year on an anti-corruption platform.\nDissanayake won the presidential election in September when voters rejected an old guard accused of leading the country into an economic crisis. Two months later, his party won a landslide victory in the parliamentary election that enabled him to form a strong government.\nAlready more than a dozen former high government officials and political leaders are under investigation for alleged wrongdoing.\nWickremesinghe became president after Sri Lanka’s economic upheaval led to a political crisis that forced then-President Gotabaya Rajapaksa to resign in 2022.\nWickremesinghe was credited with stabilizing the crumbling economy. Under his leadership, inflation fell, the local currency strengthened and foreign reserves increased. But he faced public backlash over his government’s stringent austerity measures, including raising taxes and utility rates, imposed as part of a bailout package with the International Monetary Fund."
    },
    {
      "news_title": "Sri Lanka’s ex-President Wickremesinghe arrested over misuse of state funds",
      "news_link": "https://www.aa.com.tr/en/asia-pacific/sri-lanka-s-ex-president-wickremesinghe-arrested-over-misuse-of-state-funds/3666281",
      "bias": "Right",
      "text": "Sri Lanka’s ex-President Wickremesinghe arrested over misuse of state funds\nWickremesinghe served as Sri Lanka's president from 2022 to 2024\nANKARA\nFormer Sri Lankan President Ranil Wickremesinghe on Friday was arrested after appearing at the Criminal Investigation Department (CID) in Colombo, according to local media.\nThe arrest came after allegations that Wickremesinghe misused state funds to finance a private trip to London, where he attended a university graduation ceremony, Newswire reported.\nInvestigators say the visit was not an official engagement but was paid for with government funds.\nEarlier this month, former presidential secretary Saman Ekanayake and former private secretary Sandra Perera were questioned over their involvement in organizing the trip.\nWickremesinghe served as president from 2022 to 2024.\n*Writing by Islamuddin Sajid\nAnadolu Agency website contains only a portion of the news stories offered to subscribers in the AA News Broadcasting System (HAS), and in summarized form. Please contact us for subscription options."
    },
    {
      "news_title": "Sri Lanka Arrests Former President Wickremesinghe, Local Media Reports",
      "news_link": "https://www.usnews.com/news/world/articles/2025-08-22/sri-lanka-arrests-former-president-wickremesinghe-local-media-reports",
      "bias": "Lean Left",
      "text": null
    },
    {
      "news_title": "Ranil Wickremesinghe: Sri Lanka's former president arrested",
      "news_link": "https://www.bbc.com/news/articles/cwye3y3dyn6o",
      "bias": "Center",
      "text": "Sri Lanka's former president Ranil Wickremesinghe arrested\nSri Lanka's former president Ranil Wickremesinghe has been arrested in connection with the alleged misuse of funds, police have said.\nHe faces three charges related to trips he took abroad while serving as president.\nWickremesinghe arrived at magistrates' court in the capital Colombo on Friday, having already given a statement to the Criminal Investigations Department (CID) earlier in the day. He has been remanded in custody, despite his application for bail on health grounds.\nHe served as president from 2022 to 2024, stepping into the role after the country's worst ever economic crisis triggered a popular uprising which caused his predecessor Gotabaya Rajapaksa to flee.\nHe was widely credited with helping put the island nation back on the road to economic recovery.\nWickremesinghe also served six separate terms as prime minister from the 1990s onwards.\nAccording to BBC Sinhala, the 76-year-old made 23 foreign trips during his time as president, at a cost of more than Rs 600 million ($2m; £1.4m).\nFriday's arrest relates to a stop over made in the UK in 2023, on Wickremesinghe's way back from a G77 summit in Cuba, news agency AFP reports.\nOn that occasion, he and his wife had attended a University of Wolverhampton ceremony.\nSri Lanka's CID allege this was a private visit for which state funds were used - something Wickremesinghe has denied.\nTheir investigation was initially referred to a court in June.\nWickremesinghe, who is the first former president to be arrested in Sri Lanka, has been a feature of the island nation's politics since he was first elected as MP in 1977.\nA lawyer by profession, he comes from an affluent family of politicians and businessmen.\nHe was credited with cleaning up the image of the United National Party (UNP) after taking over its leadership in 1994 by bringing in a disciplinary commission to get rid of corrupt party members.\nOver the years, he went on to make several bids to become president - only getting the role he had long-wanted in 2022 after Rajapaksa fled.\nAt the time his party was almost wiped out in the 2020 elections, and he was left as its sole representative in parliament.\nHe lost the 2024 election to the left-leaning Anura Kumara Dissanayake."
    },
    {
      "news_title": "Ranil Wickremesinghe, Sri Lanka's Ex-President, Arrested",
      "news_link": "https://www.outlookindia.com/international/ranil-wickremesinghe-sri-lankas-ex-president-arrested-over-alleged-misuse-of-fund",
      "bias": "Lean Left",
      "text": "1: Sri Lanka's ex-president Ranil Wickremesinghe and six time Prime Minister was arrested on Friday after arriving at the CID office in the capital Colombo.\n2: He had allegedly used state funds to visit his wife's graduation ceremony in London.\nSri Lanka's former president Ranil Wickremesinghe was arrested on Friday for allegedly \"misusing government funds\", AFP reported.\nThe source said that Wickremesinghe, 76, was taken into custody by the Criminal Investigation Department for questioning about a September 2023 visit to London where he attended a convocation ceremony of his wife, Professor Maithree Wickremesingh, at University of Wolverhampton while he was in office.\nHe was on his way back from Havana, where he attended a G77 summit.\n\"We are producing him before the Colombo Fort magistrate,\" the officer told AFP, adding that the charges were of using state funds for personal purposes.\nWickremesinghe, credited for stabilising the economy after the 2022 financial crisis in Sri Lanka, became President in July 2022. He had taken over Gotabaya Rajapaksa's remaining term, who had to step down from office after agitation over alleged corruption and mismanagement.\nWickremesinghe lost his re-election bid in September."
    },
    {
      "news_title": "Former Sri Lankan President Ranil Wickremesinghe arrested for allegedly misusing government funds",
      "news_link": "https://scroll.in/latest/1085795/former-sri-lankan-president-ranil-wickremesinghe-arrested-for-allegedly-misusing-government-funds",
      "bias": "Lean Left",
      "text": "Former Sri Lankan President Ranil Wickremesinghe arrested for allegedly misusing government funds\nWickremesinghe was taken into custody in connection with a private visit to London in September 2023.\nSri Lanka’s former President Ranil Wickremesinghe was on Friday arrested in Colombo for allegedly misusing government funds for a private visit to London in 2023, AFP reported.\nWickremesinghe was taken into custody after appearing before the Sri Lankan Police’s Criminal Investigation Department, Newswire reported. He was questioned about his visit to the United Kingdom in September 2023 to attend a ceremony for his wife at a British university while he was head of state, an unidentified official told AFP.\nThe official was quoted as saying that the former president would be produced before a magistrate and that charges would be filed against him for using government resources for personal purposes.\nWickremesinghe had stopped in London in September 2023 after attending a Group of 77 summit in Havana, AFP reported. The G77 is a coalition of developing countries within the United Nations.\nAccording to the news agency, the former president and his wife Maithree had attended a ceremony at the University of Wolverhampton in London.\nWickremesinghe has maintained that no government funds were used during the visit and that his wife’s travel expenses were paid for by her. However, the Criminal Investigation Department alleged that he used government money for his travel on a private visit.\nEarlier in August, former Presidential Secretary Saman Ekanayake and former Private Secretary Sandra Perera were also questioned in connection with their roles in arranging the visit, Newswire reported.\nWickremesinghe, a former prime minister, was Sri Lanka’s president between 2022 and 2024.\nHe had taken over the presidency in July 2022 through an extraordinary parliamentary vote after Gotabaya Rajapaksa, who held the position at the time, was forced out amid an economic and political crisis. The country declared bankruptcy that month.\nWickremesinghe was credited with stabilising Sri Lanka’s economy after its worst-ever financial crisis in 2022.\nHowever, Wickremesinghe lost his re-election bid in September 2024."
    },
    {
      "news_title": "Ex-Sri Lanka President Wickremesinghe Arrested Over Alleged Misuse Of State Funds For London Trip",
      "news_link": "https://news.abplive.com/news/world/sri-lanka-ex-president-ranil-wickremesinghe-arrested-over-alleged-misuse-of-state-funds-1796060",
      "bias": "Lean Right",
      "text": "Ex-Sri Lanka President Wickremesinghe Arrested Over Alleged Misuse Of State Funds For London Trip\nInvestigators claim the trip, part of a larger overseas tour, was not an official engagement. The arrest, the most senior in recent years, follows questioning of his former secretaries.\nColombo [Sri Lanka], August 22 (ANI): Former Sri Lankan President Ranil Wickremesinghe was arrested on Friday on allegations of state funds' misuse as reported by Newswire Lanka\nCiting officials familiar with the matter, Newswire reported that the former Sri Lankan president was arrested after appearing before the Criminal Investigation Department (CID) in Colombo.\nAs per Newswire, his arrest is linked to allegations of using state funds to cover the expenses for a private visit to London, where he had attended a university graduation ceremony.\nIt was further reported that the investigators claim the trip, which formed part of a wider overseas tour, was not an official engagement but was financed with government money.\nAs per Newswire, earlier in August, former presidential secretary Saman Ekanayake and former private secretary Sandra Perera were questioned over their roles in arranging the visit.\nRanil Wickremesinghe, had served as Sri Lanka's president from 2022 to 2024.\nAs per reports, he is the most senior political figure to face arrest in recent years. The detention of Ranil Wickremesinghe is expected to intensify scrutiny over the use of public funds by top officials.\nAccording to newswire, the court proceedings and formal charges are expected to follow.\nRanil Wickremesinghe, a six-time prime minister, assumed office as Sri Lanka's interim president in July 2022 following Gottabaya Rajapaksa's removal. He lost the Presidential Elections to Anura Kumara Dissanayake, the leader of National People's Power in September 2024. (ANI)\n(Disclaimer: This report has been published as part of the auto-generated syndicate wire feed. Apart from the headline, no editing has been done in the copy by ABP Live.)"
    },
    {
      "news_title": "Sri Lanka Ex-president Arrested In Anti-corruption Crackdown",
      "news_link": "https://www.barrons.com/news/sri-lanka-ex-president-arrested-in-anti-corruption-crackdown-1c3271b9",
      "bias": "Center",
      "text": "Sri Lanka Ex-president Arrested In Anti-corruption Crackdown\nSri Lankan police arrested former president Ranil Wickremesinghe on Friday, making him the most senior opposition figure to be detained under an anti-corruption crackdown by the new leftist government.\nThe Barron's news department was not involved in the creation of the content above. This article was produced by AFP. For more information go to AFP.com.\n© Agence France-Presse\nContinue reading this article with a Barron’s subscription\nSUBSCRIBE NOW"
    },
    {
      "news_title": "Former Sri Lankan President Ranil Wickremesinghe Arrested for Misuse of Government Funds",
      "news_link": "https://www.republicworld.com/india/former-sri-lankan-president-ranil-wickremesinghe-arrested-for-misuse-of-government-funds",
      "bias": "Lean Right",
      "text": "Updated 22 August 2025 at 17:22 IST\nNew Delhi: Ranil Wickremesinghe, who served as Sri Lanka’s President from 2022 to 2024, is arrested on Friday by the Criminal Investigation Department (CID) in Colombo. Wickremesinghe arrested after allegations of misusing government funds to finance a private trip to London in September 2023, where he attended a graduation ceremony for his wife, Professor Maithree Wickremesinghe, at the University of Wolverhampton.\nThe trip was misrepresented as an official engagement but was later found to be personal.\nPrimary investigation reports suggests that state funds were used improperly, and a full fledged probe into financial misconduct is underway.\nFormer aides, including presidential secretary Saman Ekanayake and private secretary Sandra Perera, have also been questioned regarding their roles in arranging the visit.\nThis arrest is being seen as strong anti-corruption actions in Sri Lanka’s recent history. Wickremesinghe, a veteran politician and former Prime Minister, is now the most senior political figure to face arrest in years.\nThe case dig deeper into the use of public funds by top Sri Lankan officials when the country continues to recover from a severe economic crisis.\nAfter the arrest court proceedings and formal charges are expected to follow.\nThis is a developing story, and more details are likely to come up in the next few days.\nGet Current Updates on India News, Entertainment News, Cricket News along with Latest News and Web Stories from India and around the world.\nPublished By : Rishi Shukla\nPublished On: 22 August 2025 at 14:43 IST"
    },
    {
      "news_title": "Former Sri Lanka President Ranil Wickremesinghe Arrested on Allegations of State Funds Misuse",
      "news_link": "https://www.latestly.com/agency-news/world-news-former-sri-lanka-president-ranil-wickremesinghe-arrested-on-allegations-of-state-funds-misuse-7072107.html",
      "bias": "Right",
      "text": "Colombo, August 22: Former Sri Lankan President Ranil Wickremesinghe was arrested on Friday on allegations of state funds' misuse as reported by Newswire Lanka Citing officials familiar with the matter, Newswire reported that the former Sri Lankan president was arrested after appearing before the Criminal Investigation Department (CID) in Colombo.\nAs per Newswire, his arrest is linked to allegations of using state funds to cover the expenses for a private visit to London, where he had attended a university graduation ceremony. It was further reported that the investigators claim the trip, which formed part of a wider overseas tour, was not an official engagement but was financed with government money. Ranil Wickremesinghe Bids an Emotional Farewell to Lanka Presidency.\nAs per Newswire, earlier in August, former presidential secretary Saman Ekanayake and former private secretary Sandra Perera were questioned over their roles in arranging the visit. Ranil Wickremesinghe, had served as Sri Lanka's president from 2022 to 2024. As per reports, he is the most senior political figure to face arrest in recent years. The detention of Ranil Wickremesinghe is expected to intensify scrutiny over the use of public funds by top officials. India-Sri Lanka Naval Exercise SLINEX-25 Concludes in Colombo.\nAccording to newswire, the court proceedings and formal charges are expected to follow. Ranil Wickremesinghe, a six-time prime minister, assumed office as Sri Lanka's interim president in July 2022 following Gottabaya Rajapaksa's removal. He lost the Presidential Elections to Anura Kumara Dissanayake, the leader of National People's Power in September 2024.\n(The above story is verified and authored by ANI staff, ANI is South Asia's leading multimedia news agency with over 100 bureaus in India, South Asia and across the globe. ANI brings the latest news on Politics and Current Affairs in India & around the World, Sports, Health, Fitness, Entertainment, & News. The views appearing in the above post do not reflect the opinions of LatestLY)"
    },
    {
      "news_title": "Sri Lanka’s former President Ranil Wickremesinghe arrested",
      "news_link": "https://www.thehindu.com/news/international/sri-lankas-former-president-ranil-wickremesinghe-arrested/article69963941.ece",
      "bias": "Lean Left",
      "text": "Sri Lanka’s former President and six-time Premier Ranil Wickremesinghe was on Friday (August 22, 2025) arrested on charges misusing state funds during his Presidency. The 76-year-old leader was remanded in custody until August 26, 2025, when the next hearing is due.\nA senior official told The Hindu that Mr. Wickremesinghe was taken into custody after the Sri Lanka Police’s Criminal Investigation Department questioned him about his visit to a British university in September 2023 when he was head of state, to attend a ceremony where his wife, a senior academic, was honoured.\nMr. Wickremesinghe’s party has denied any misuse of state funds in connection with the visit. The former President, while returning from the G-77 summit in Cuba, had travelled to the United States to address the United Nations General Assembly in New York, and later stopped over in the United Kingdom, where he also held diplomatic meetings, his office earlier said.\nThe development marks the first instance of a former President being arrested in Sri Lanka and comes amid the government’s efforts to probe corruption. Several senior politicians and officials have been arrested in the last few months.\nMr. Wickremesinghe, leader of the centre-right United National Party, one of Sri Lanka’s oldest political parties, was elected President in an urgent Parliamentary vote after former President Gotabaya Rajapaksa quit office in July 2022, in the wake of a citizen’s uprising sparked by an economic crash. Mr. Wickremesinghe helmed the country’s top office for two years, and is credited with steering the crisis-hit island nation towards recovery. He ran for the presidency in 2024, and lost to Anura Kumara Dissanayake, who won on an anti-corruption plank.\nFormer President Maithripala Sirisena, several politicians and opposition parliamentarians, including Namal Rajapaksa, son of former President Mahinda Rajapaksa, were seen at the Colombo Magistrate Court premises on Friday. While some former politicians and Opposition figures slammed the government for arresting a former head of state, Minister of Public Security Ananda Wijepala told Parliament that the law was being “applied equally” to everyone.\nFriday’s arrest is the second major setback for the former President in recent months. Last month, Sri Lanka’s Supreme Court ruled that the State of Emergency declared by him in 2022, as Acting President, was “unconstitutional and violated fundamental human rights”.\nPublished - August 22, 2025 02:33 pm IST"
    },
    {
      "news_title": "Sri Lanka arrests ex-Prez Wickremsinghe for ‘musing govt funds’; he attended ceremony for wife in London",
      "news_link": "https://www.firstpost.com/world/sri-lanka-arrests-ex-prez-wickremsinghe-for-musing-govt-funds-he-attended-ceremony-for-wife-in-london-13927052.html",
      "bias": "Lean Right",
      "text": "Sri Lanka’s former president Ranil Wickremesinghe was arrested on Friday for allegedly “misusing government funds”, a senior police detective told AFP.\nWickremesinghe was taken into custody after being questioned about a September 2023 visit to London to attend a ceremony for his wife at a British university while he was head of state, the officer said.\n“We are producing him before the Colombo Fort magistrate,” the officer said, adding that they were pressing charges for using state resources for personal purposes.\nWickremesinghe had stopped in London in 2023 on his way back from Havana, where he attended a G77 summit.\nHe and his wife, Maithree, attended a University of Wolverhampton ceremony.\nWickremesinghe had maintained that his wife’s travel expenses were met by her and that no state funds were used.\nHowever, the Criminal Investigation Department of the police alleged that Wickremesinghe used government money for his travel on a private visit and that his bodyguards were also paid by the state.\nWickremesinghe became president in July 2022 for the remainder of Gotabaya Rajapaksa’s term, after Rajapaksa stepped down following months of protests over alleged corruption and mismanagement.\nWickremesinghe is credited with stabilising the economy after the country’s worst-ever financial meltdown in 2022.\nHe lost his re-election bid in September."
    },
    {
      "news_title": "Ranil Wickremesinghe arrest: Sri Lanka’s former president Ranil Wickremesinghe arrested over alleged misuse of state funds",
      "news_link": "https://indianexpress.com/article/world/sri-lanka-former-president-ranil-wickremesinghe-arrest-10204649/",
      "bias": "Lean Left",
      "text": null
    },
    {
      "news_title": "Sri Lanka arrests former president Ranil Wickremesinghe in anti-corruption crackdown",
      "news_link": "https://www.straitstimes.com/asia/south-asia/sri-lanka-ex-president-ranil-wickremesinghe-arrested",
      "bias": "Lean Right",
      "text": "Sri Lanka arrests former president Ranil Wickremesinghe in anti-corruption crackdown\nSign up now: Get ST's newsletters delivered to your inbox\nFollow topic:\nCOLOMBO - Former Sri Lankan president Ranil Wickremesinghe was arrested on Aug 22, making him the most senior opposition figure to be detained under an anti-corruption crackdown by the new leftist government.\nSri Lanka’s anti-graft units have led the crackdown since President Anura Kumara Dissanayake came to power in September on a promise to fight corruption.\nMr Wickremesinghe, 76, who lost the last election to Mr Dissanayake, was taken into custody after being questioned about a September 2023 visit to London to attend a ceremony for his wife at a British university while he was head of state, the officer said.\n“We are producing him before the Colombo Fort magistrate,” the officer said, adding that they were pressing charges for using state resources for personal purposes.\nMr Wickremesinghe stopped in London in 2023 on his way back from Havana, where he attended a Group of 77 summit.\nHis office had previously denied that he abused his position to visit London.\nThree of his then senior aides were questioned in August by the Criminal Investigation Department (CID).\nHe and his wife Maithree attended a University of Wolverhampton ceremony. Mr Wickremesinghe maintained that his wife’s travel expenses were met by her and that no state funds were used.\nBut the CID alleged that Mr Wickremesinghe used government money for his trip, on a private visit, and that his bodyguards were also paid by the state.\nMr Wickremesinghe became president in July 2022\nMr Wickremesinghe secured a US$2.9 billion (S$3.7 billion) bailout from the International Monetary Fund (IMF) in early 2023 and was credited with stabilising the economy after the country’s worst-ever financial meltdown in 2022.\nHe doubled taxes and removed energy subsidies as part of tough austerity measures to raise state revenue.\nHe lost his re-election bid in September 2024, but remained a key opposition figure despite his coalition holding only two seats in the 225-member Parliament.\nAn ally from his United National Party (UNP) proclaimed his innocence and suggested the case was politically motivated.\n“Ranil Wickremesinghe has never misused public funds or state funds,” UNP member Nishantha Sri Warnasinghe told reporters gathered outside the court complex where the former president appeared in Colombo.\n“He was the person who stepped up and accepted the challenge to save this country when the economy collapsed,” Mr Warnasinghe said.\n“That is the person who is being treated like this today by this government.”\nKey opposition politicians, including two former senior ministers, have been jailed for up to 25 years for corruption since the new leftist government took office.\nSeveral members of former president Mahinda Rajapaksa’s family have also been charged with misusing state funds and are being prosecuted. Many of them are currently on bail pending court hearings.\nMr Dissanayake’s government earlier in August impeached the police chief after accusing him of running a criminal network that supported politicians. The prisons chief was also jailed for corruption. AFP"
    },
    {
      "news_title": "Sri Lanka ex-president Wickremesinghe arrested over alleged misuse of government funds",
      "news_link": "https://www.channelnewsasia.com/asia/sri-lanka-ex-president-ranil-wickremesinghe-arrested-5308831",
      "bias": "Center",
      "text": "Sri Lanka ex-president Wickremesinghe arrested over alleged misuse of government funds\nCOLOMBO: Sri Lanka's former President Ranil Wickremesinghe was arrested on Friday (Aug 22) for allegedly \"misusing government funds\", a senior police detective told AFP.\nWickremesinghe was taken into custody after being questioned about a September 2023 visit to London to attend a ceremony for his wife at a British university while he was head of state, the officer said.\n\"We are producing him before the Colombo Fort magistrate,\" the officer said, adding that they were pressing charges for using state resources for personal purposes.\nWickremesinghe had stopped in London in 2023 on his way back from Havana, where he attended a G77 summit.\nHe and his wife, Maithree, attended a University of Wolverhampton ceremony.\nWickremesinghe had maintained that his wife's travel expenses were met by her and that no state funds were used.\nHowever, the Criminal Investigation Department of the police alleged that Wickremesinghe used government money for his travel on a private visit and that his bodyguards were also paid by the state.\nWickremesinghe became president in July 2022 for the remainder of Gotabaya Rajapaksa's term, after Rajapaksa stepped down following months of protests over alleged corruption and mismanagement.\nWickremesinghe is credited with stabilising the economy after the country's worst-ever financial meltdown in 2022.\nHe lost his re-election bid in September but remained a key opposition figure despite his coalition holding only two seats in the 225-member parliament.\nMembers of Wickremesinghe's United National Party were seen arriving at the Colombo Fort magistrate's court, where he was due to be taken later on Friday.\nKey opposition politicians, including two former senior ministers, have been jailed for up to 25 years for corruption since the new leftist government took office.\nSeveral members of former president Mahinda Rajapaksa's family have also been charged with misusing state funds and are being prosecuted. Many of them are currently on bail pending court hearings.\nDissanayake's government earlier this month impeached the police chief after accusing him of running a criminal network that supported politicians. The prisons chief was also jailed for corruption."
    },
    {
      "news_title": "Sri Lanka’s former president Ranil Wickremesinghe arrested",
      "news_link": "https://www.arabnews.com/node/2612652/world",
      "bias": "Lean Right",
      "text": "COLOMBO: Sri Lanka’s former president Ranil Wickremesinghe was arrested on Friday for allegedly “misusing government funds,” a senior police detective said.\nWickremesinghe was taken into custody after being questioned about a September 2023 visit to London to attend a ceremony for his wife at a British university while he was head of state, the officer said.\n“We are producing him before the Colombo Fort magistrate,” the officer said, adding that they were pressing charges for using state resources for personal purposes.\nWickremesinghe had stopped in London in 2023 on his way back from Havana, where he attended a G77 summit.\nHe and his wife, Maithree, attended a University of Wolverhampton ceremony.\nWickremesinghe had maintained that his wife’s travel expenses were met by her and that no state funds were used.\nHowever, the Criminal Investigation Department of the police alleged that Wickremesinghe used government money for his travel on a private visit and that his bodyguards were also paid by the state.\nWickremesinghe became president in July 2022 for the remainder of Gotabaya Rajapaksa’s term, after Rajapaksa stepped down following months of protests over alleged corruption and mismanagement.\nWickremesinghe is credited with stabilizing the economy after the country’s worst-ever financial meltdown in 2022.\nHe lost his re-election bid in September.\nSri Lanka’s former president Ranil Wickremesinghe arrested\nhttps://arab.news/4yj2e\nSri Lanka’s former president Ranil Wickremesinghe arrested\n- Wickremesinghe was taken into custody after being questioned about a September 2023 visit to London to attend a ceremony for his wife\n- Wickremesinghe is credited with stabilizing the economy after the country’s worst-ever financial meltdown in 2022"
    },
    {
      "news_title": "Ex-Sri Lanka president Ranil Wickremesinghe arrested in misuse of state funds case",
      "news_link": "https://www.indiatoday.in/world/story/former-sri-lanka-president-ranil-wickremesinghe-arrested-over-misuse-of-funds-probe-2775236-2025-08-22",
      "bias": "Lean Right",
      "text": "Ex-Sri Lanka president Ranil Wickremesinghe arrested in misuse of state funds case\nFormer Sri Lanka president Ranil Wickremesinghe was arrested by the CID after being questioned over allegations of using Rs 17 million state funds for a personal overseas trip to London.\nFormer Sri Lanka president Ranil Wickremesinghe was arrested on Friday by the Criminal Investigation Department (CID) after being summoned to record a statement in connection with an investigation into the alleged misuse of government funds.\nThe inquiry relates to a private overseas trip said to have taken place on September 22 and 23, 2023, which reportedly involved ten individuals including the former president.\nAccording to sources, the investigations centre on a visit to the United Kingdom to attend a university graduation ceremony in London. It is alleged that the visit was a personal one, but state funds amounting to approximately Rs 17 million were used.\nAs part of the ongoing probe, the CID had earlier recorded statements from Saman Ekanayake, the former secretary to the president, and Sandra Perera, who served as Wickremesinghe’s private secretary during his tenure.\nSources said Wickremesinghe had received a call from the CID on Tuesday, following which he informed them through his lawyers that he would appear on Friday. Today, he presented himself before the investigators and his statement was recorded.\nIt is expected that the CID will forward Wickremesinghe’s statement to the Attorney General’s Department for further action.\nSpeculation was widespread yesterday that the former president might be arrested today. However, late in the evening, some sources suggested that he was likely to leave the CID premises with his lawyers after giving his statement."
    },
    {
      "news_title": "Former Sri Lankan President Ranil Wickremesinghe arrested over alleged misuse of state funds",
      "news_link": "https://www.indiatvnews.com/news/world/former-sri-lankan-president-ranil-wickremesinghe-arrested-over-alleged-misuse-of-state-funds-2025-08-22-1004652",
      "bias": "Lean Right",
      "text": "Former President of Sri Lanka, Ranil Wickremesinghe, was arrested today by the Criminal Investigation Department (CID) in Colombo after he appeared to record a statement regarding allegations of misusing public funds for a personal visit to the United Kingdom during his presidency, reported by\nThe arrest marks a dramatic turn in the ongoing investigation into whether Wickremesinghe, who served as President from 2022 to 2024, diverted government resources to fund a trip to attend the PhD graduation ceremony of his wife, Professor Maithree Wickremesinghe, at the University of Wolverhampton in September 2023.\nFormer President of Sri Lanka, Ranil Wickremesinghe, was arrested today by the Criminal Investigation Department (CID) in Colombo after he appeared to record a statement regarding allegations of misusing public funds for a personal visit to the United Kingdom during his presidency.\nThe arrest marks a dramatic turn in the ongoing investigation into whether Wickremesinghe, who served as President from 2022 to 2024, diverted government resources to fund a trip to attend the PhD graduation ceremony of his wife, Professor Maithree Wickremesinghe, at the University of Wolverhampton in September 2023.\nLondon visit under scrutiny\nAccording to police documents submitted to the Colombo Fort Magistrate’s Court, the trip—part of a broader overseas tour that included official visits to Cuba and the United States—was allegedly extended to include the UK for personal reasons. Investigators claim the London segment of the journey included no official engagements, yet was financed using public funds amounting to approximately Rs. 16.9 million.\nThe CID stated that a ten-member delegation accompanied the former president, further inflating the cost of what officials now describe as a private excursion disguised as official travel.\nFormer presidential staff questioned\nEarlier this month, CID officials also questioned Saman Ekanayake, Wickremesinghe’s former presidential secretary, and Sandra Perera, his former private secretary, regarding their roles in organizing the controversial trip. The CID has indicated that more former staffers may be summoned as part of the expanding probe.\nWickremesinghe denies allegations\nWickremesinghe’s office has rejected the allegations, calling the reports “false and misleading.” A statement from his media team claimed there was no visit to the University of Wolverhampton on the dates in question and asserted that a formal rebuttal would be issued following legal consultation.\nDespite his denial, today's arrest makes Wickremesinghe the most senior political figure to be detained in Sri Lanka in recent years, amid mounting pressure on authorities to tackle corruption and abuse of power at the highest levels.\nA long and controversial political career\nRanil Wickremesinghe, leader of the United National Party (UNP), has been a towering figure in Sri Lankan politics for nearly five decades. First elected to Parliament in 1977, he has served six terms as Prime Minister and assumed the presidency in 2022 following Gotabaya Rajapaksa’s resignation during Sri Lanka’s economic crisis.\nHis political career, however, has not been without controversy. Most notably, Wickremesinghe has long faced criticism over his alleged involvement in the Batalanda torture complex during the 1980s and 1990s. A 1995 Presidential Commission of Inquiry accused him of being aware of, and having administrative responsibility for, the Batalanda housing scheme, which was used as a covert detention and torture site targeting members of the Janatha Vimukthi Peramuna (JVP).\nThough the Commission recommended that he be stripped of his civic rights, no criminal charges were ever filed, and the recommendation was never implemented. The allegations resurfaced earlier this year following a widely criticised interview he gave to Al Jazeera.\nThe CID is expected to produce Wickremesinghe before the Colombo Magistrate's Court for a bail hearing. Legal experts say the arrest signals a new phase in Sri Lanka’s anti-corruption drive, with more high-profile figures likely to come under investigation in the coming months."
    },
    {
      "news_title": "Former Sri Lankan president Ranil Wickremesinghe arrested over alleged fund misuse",
      "news_link": "https://www.newindianexpress.com/world/2025/Aug/22/former-sri-lankan-president-ranil-wickremesinghe-arrested",
      "bias": "Lean Left",
      "text": "COLOMBO: Sri Lanka's former president Ranil Wickremesinghe was arrested on Friday for allegedly misusing the state funds, police said.\nWickremesinghe, 76, was arrested at the Criminal Investigation Department (CID) headquarters, where he was summoned to record a statement in connection with an investigation into the alleged misuse of government funds, police said.\nHe has been accused of using state funds to travel to England to attend a convocation ceremony of his wife, Prof Maithree, in September 2023.\nIt has been alleged that Wickremesinghe was returning from the US after an official engagement and visited the UK at the state's expense to attend the private engagement of his wife.\nThe CID had previously questioned his staff about the travel expenses.\nWickremesinghe, who had replaced Gotabaya Rajapaksa as the President to serve the balance term until the end of 2024, was credited with steering Sri Lanka out of the economic crisis of 2022.\nHe was president from July 2022 to September 2024. The veteran politician also served as Sri Lanka's prime minister six times."
    },
    {
      "news_title": "Former Sri Lankan President Ranil Wickremesinghe arrested",
      "news_link": "https://www.financialexpress.com/world-news/former-sri-lankan-president-ranil-wickremesinghe-arrested-reports/3954534/",
      "bias": "Lean Right",
      "text": "Sri Lanka’s former president Ranil Wickremesinghe was arrested on Friday on charges of misusing state funds, police said.\nThe 76 year old was arrested after he went to the CID office in Colombo to give a statement about his trip to London last year to attend his wife’s graduation, according to reports. The police have not officially confirmed the arrest, and Wickremesinghe’s office did not respond to Reuters’ request for comment.\nA lawyer by profession, Wickremesinghe served as Sri Lanka’s prime minister six times, the most in the country’s history. He became president in 2022, when Sri Lanka was in the grip of its worst financial crisis, after mass protests forced then-president Gotabaya Rajapaksa to flee the country and resign.\nWickremesinghe’s tenure as president from 2022-25 was filled with controversies. In 2023, the Supreme Court of Sri Lanka ruled that Wickremesinghe had acted “unlawfully” by delaying local government elections. He argued that the delay was needed to focus on fixing the economy, but the court said it violated people’s right to vote. Many saw this as a way for him to avoid facing the public during a period of anger and hardship.\nWickremesinghe comes from a well-known political and business family with strong media interests. His political career began early – at just 29, he was appointed the youngest cabinet minister in Sri Lanka by his uncle, then-president Junius Jayewardene, in 1978. In 1994, after several senior leaders of his party were assassinated, he rose to become the head of the United National Party (UNP).\nThroughout his presidency, he also faced corruption investigations and political attempts to remove him through no-confidence votes. Still, he managed to hold on, insisting his policies were necessary to save the country, according to the multiple media reports."
    },
    {
      "news_title": "Former President Ranil Wickremesinghe Arrested on August 22 by CID for alleged misuse of State funds for personal UK trip in 2023 and Remanded by Colombo Fort Magistrate Until Aug 26 – dbsjeyaraj.com",
      "news_link": "https://dbsjeyaraj.com/dbsj/?p=86306",
      "bias": "unknown",
      "text": "Former President Ranil Wickremesinghe was yesterday ( Aug 22 ) remanded by the Colombo Fort Magistrate’s Court for four days until 26 August.\nWickremesinghe was arrested earlier in the day by the Criminal Investigation Department (CID) after appearing before the sleuths to record a statement.\nThe arrest follows an investigation into allegations that Wickremesinghe used State funds for a private visit to London in September 2023 to attend a university ceremony with his wife, Prof. Maithree Wickremesinghe.\nThe trip coincided with his return from the Group of 77 (G77) Summit in Havana, but was not classified as an official engagement. Investigators allege that Government resources, including security, were misused.\nEarlier, the CID questioned former Presidential Secretary Saman Ekanayake and former Private Secretary Sandra Perera in connection with the arrangements for the visit. It had also presented evidence before the Colombo Fort Magistrate’s Court in June.\nWickremesinghe, President from July 2022 to September 2024, has denied wrongdoing, stating that his wife bore her own expenses and no State funds were used.\nThis marks the first time a former President of Sri Lanka has been taken into custody and remanded.\nWickremesinghe is widely regarded as the architect behind Sri Lanka’s recovery from its worst economic crisis in history, which came soon after the COVID-19 pandemic, when Sri Lanka defaulted on its debts.\nProceedings on Wickremesinghe’s bail application at the Colombo Fort Magistrate’s Court were adjourned for half an hour and further delayed by another half hour due to a blackout.\nCourtesy:Daily FT"
    },
    {
      "news_title": "Former President Ranil admitted to Prison Hospital - LankaXpress",
      "news_link": "https://www.lankaxpress.com/former-president-ranil-admitted-to-prison-hospital/",
      "bias": "unknown",
      "text": "Former President Ranil admitted to Prison Hospital\nFormer President Ranil Wickremesinghe, who was arrested and remanded in custody on Friday over allegations he misused state funds while in office, has been admitted to the Prisons Hospital on the advice of doctors, according to the Prisons Spokesman.\nWickremesinghe became the most senior opposition figure to be hauled up in an anti-corruption crackdown by the new government as he was ordered remanded until August 26 by the Fort Magistrate’s Court.\n“The suspect (Wickremesinghe) will be held in custody till Tuesday, but considering his medical condition he could be admitted to the prison hospital or another hospital,” Magistrate Nilupuli Lankapura said ordering his remand.\nWickremesinghe, whose lawyers said was suffering from heart disease and diabetes, was charged under the Public Property Act and two counts of the penal code – “dishonest misappropriation of property” and “criminal breach of trust.”\nWickremesinghe, 76, was taken into custody after being questioned about a September 2023 visit to London to attend a ceremony for his wife at a British university.\nWickremesinghe had stopped in London in 2023 on his way back from Havana, where he attended a G77 summit, and the UN General Assembly in New York.\nThe brief UK visit was to participate in the conferring of an honorary professorship on his wife Maithree by the University of Wolverhampton.\nHis office had previously denied that he abused his position to visit Britain. Three of his then senior aides were questioned this month by the Criminal Investigation Department (CID).\nWickremesinghe had maintained that his wife’s travel expenses were met by her and that no state funds were used.\nHowever, the CID alleged that Wickremesinghe used 16.6 million rupees of government money for his travel on a private visit with a delegation of 10 people, including bodyguards.\nWickremesinghe, who was ordered to be remanded in custody, was taken to the Welikada Prison. The former President was seen being brought to the Welikada Prison in a prison bus amid tight security.\n–With Agencies Inputs"
    },
    {
      "news_title": "Ex-President Ranil refused bail, gets remanded for abuse of power",
      "news_link": "https://www.ft.lk/top-story/Ex-President-Ranil-refused-bail-gets-remanded-for-abuse-of-power/26-780681",
      "bias": "unknown",
      "text": "Saturday Aug 23, 2025\nSaturday, 23 August 2025 00:34 - - {{hitsCtrl.values.hits}}\nFormer President Ranil Wickremesinghe was yesterday night remanded by the Colombo Fort Magistrate’s Court for four days until 26 August.\nWickremesinghe was arrested earlier in the day by the Criminal Investigation Department (CID) after appearing before the sleuths to record a statement.\nThe arrest follows an investigation into allegations that Wickremesinghe used State funds for a private visit to London in September 2023 to attend a university ceremony with his wife, Prof. Maithree Wickremesinghe.\nThe trip coincided with his return from the Group of 77 (G77) Summit in Havana, but was not classified as an official engagement. Investigators allege that Government resources, including security, were misused.\nEarlier, the CID questioned former Presidential Secretary Saman Ekanayake and former Private Secretary Sandra Perera in connection with the arrangements for the visit. It had also presented evidence before the Colombo Fort Magistrate’s Court in June.\nWickremesinghe, President from July 2022 to September 2024, has denied wrongdoing, stating that his wife bore her own expenses and no State funds were used.\nThis marks the first time a former President of Sri Lanka has been taken into custody and remanded.\nWickremesinghe is widely regarded as the architect behind Sri Lanka’s recovery from its worst economic crisis in history, which came soon after the COVID-19 pandemic, when Sri Lanka defaulted on its debts.\nProceedings on Wickremesinghe’s bail application at the Colombo Fort Magistrate’s Court were adjourned for half an hour and further delayed by another half hour due to a blackout."
    },
    {
      "news_title": "Ex Sri Lankan president arrested over misuse of state funds",
      "news_link": "https://www.dailyfinland.fi/worldwide/44813/Ex-Sri-Lankan-president-arrested-over-misuse-of-state-funds",
      "bias": "unknown",
      "text": "Ex Sri Lankan president arrested over misuse of state funds\nPublished : 22 Aug 2025, 23:35\nFormer Sri Lankan president Ranil Wickremesinghe was arrested on Friday by the Criminal Investigation Department (CID) over alleged misuse of state funds, reported Xinhua, quoting state media.\nWickremesinghe was arrested for charges of misusing state funds to visit London to attend a graduation ceremony of his wife, during his tenure as president in September 2023, according to local media.\nIt is the first time a former executive president has been arrested in Sri Lanka's history, and he has been brought to the Colombo Fort Magistrate's Court following his arrest, according to local media.\nAs part of the investigations, the CID had previously recorded statements from the former president's private secretary and his presidential secretary.\nWickremesinghe arrived at the CID to provide a statement on Friday morning, and he was taken into custody following the recording of the statement, said media reports."
    },
    {
      "news_title": "Sri Lanka: Former President Wickremesinghe  arrested on charges of misusing public funds – The Indian Awaaz",
      "news_link": "https://theindianawaaz.com/sri-lanka-former-president-wickremesinghe-arrested-on-charges-of-misusing-public-funds/",
      "bias": "unknown",
      "text": "AMN/ WEB DESK\nFormer Sri Lankan President Ranil Wickremesinghe was arrested after being questioned by the Criminal Investigation Department (CID) over allegations that he misused public funds to finance a private trip to London in 2023.\nPolice allege the 76-year-old leader diverted state money to cover expenses when he travelled to Britain to attend the PhD graduation of his wife, Professor Maithree Wickremesinghe, at the University of Wolverhampton. The visit, investigators say, was tagged onto an official tour of Cuba and the United States but had no government purpose. Funds of about $50,000 was reportedly spent on airfare, accommodation, and related costs for the London leg.\nThe CID inquiry began earlier this year, with Mr. Wickremesinghe’s former presidential secretary Saman Ekanayake and private secretary Sandra Perera questioned about their roles in arranging the trip. Earlier today, the ex-president was taken into custody. A short while ago, he was produced before Colombo Fort Magistrate’s Court.\nThe arrest marks the first time in years that a Sri Lankan head of state has faced detention on corruption allegations. Public Security Minister Ananda Wijepala told Parliament that the law applies equally to everyone and warned that no office-bearer is beyond scrutiny.\nMr. Wickremesinghe’s party, the United National Party (UNP), released an official invitation from the University of Wolverhampton addressed to the president and first lady, insisting that no public funds were misused. The former leader has also denied the charges.\nParliament today witnessed sharp exchanges over the case. MP Chamara Sampath Dasanayake questioned how a YouTuber appeared to predict Wickremesinghe’s arrest before it happened, calling it “a joke.” Former minister Ali Sabry urged an end to what he described as a cycle of political retribution, recalling Wickremesinghe’s role in stabilizing the country during crises in 1993, 2000 and 2022.\nMr. Wickremesinghe, who led Sri Lanka from 2022 to 2024, now faces the possibility of indictment under anti-corruption laws and the Public Property Act. His detention is seen as a major test of Colombo’s promise to hold powerful figures accountable amid public anger over past abuses of state resources."
    },
    {
      "news_title": "Historic First: Ex-President Wickremesinghe Taken Into Custody By Sri Lanka CID - The Commune",
      "news_link": "https://thecommunemag.com/historic-first-ex-president-wickremesinghe-taken-into-custody-by-sri-lanka-cid/",
      "bias": "unknown",
      "text": "In a major development in the island nation, Former Sri Lankan President Ranil Wickremesinghe was taken into custody on Friday by the country’s Criminal Investigation Department (CID), the first such arrest of a former President in the nation’s history, local media reported. Wickremesinghe was summoned by the CID over allegations of misuse of State funds and subsequently arrested following a four-hour-long statement.\nExtensive security arrangements were made as Wickremesinghe was produced before the Colombo Fort Magistrate’s Court late Friday afternoon where a huge crowd of supporters had also gathered. The investigation relates to Wickremesinghe’s September 2023 visit to the United Kingdom during his tenure as President to attend a University of Wolverhampton graduation ceremony for his wife, Maithree Wickremesinghe.\nThe investigators alleged that State funds were used for travel and security expenses. According to the CID’s investigation, the trip, which involved a group of 10, is estimated to have cost the Government approximately 16.9 million Lankan rupees. However, the Former President dismissed the allegations, insisting that his wife covered her own expenses and no State funds were misused, Lankan newspaper ‘Daily Mirror’ reported.\nPreviously, as part of the ongoing investigation, the CID also took statements from his former Private Secretary, Sandra Perera, and former Presidential secretary Saman Ekanayake over their roles in arranging the visit. Reports suggest that Perera was grilled for nearly six hours after she was summoned to the CID to record a statement in connection with the investigation into a foreign trip which was allegedly funded using financial allocations from the Presidential Secretariat.\nEarlier in June, the CID informed the Fort Magistrate’s Court that it had initiated an investigation into the foreign trips made by the former President during his Presidency. While laying out the facts before Court, CID officers stated that the probe is being carried out under the Offences Against Public Property Act. Wickremesinghe became President in July 2022 after Gotabaya Rajapaksa’s resignation and was defeated in the September 2024 Presidential election.\n-IANS\nSubscribe to our channels on Telegram, WhatsApp, and Instagram and get the best stories of the day delivered to you personally."
    },
    {
      "news_title": "Sri Lanka Former President Arrested over State Funds Misuse Allegations",
      "news_link": "https://see.news/sri-lanka-former-president-arrested-over-state-funds-misuse-allegations",
      "bias": "unknown",
      "text": "Sri Lankan authorities have detained former President Ranil Wickremesinghe in connection with allegations of misusing public funds, according to reports by local broadcaster Ada Derana on Friday.\nThe Criminal Investigation Department (CID) in Colombo took the 76-year-old former leader into custody to record a statement regarding his visit to London to attend his wife’s graduation ceremony.\nPolice officials have not yet confirmed the arrest, and Wickremesinghe’s office has not responded to requests for comment. Local media reported that he is expected to appear before a court later today.\nWickremesinghe, a lawyer by profession, has held the position of Prime Minister six times and assumed the presidency in 2022 during one of Sri Lanka’s most severe financial crises."
    },
    {
      "news_title": "Sri Lanka's former president Ranil Wickremesinghe arrested - Kahawatungu",
      "news_link": "https://kahawatungu.com/sri-lankas-former-president-ranil-wickremesinghe-arrested/",
      "bias": "unknown",
      "text": "Sri Lanka’s former president Ranil Wickremesinghe has been arrested in connection with the alleged misuse of funds, police have said.\nHe faces three charges related to trips he took abroad while serving as president.\nWickremesinghe arrived at magistrates court in the capital Colombo on Friday, having already given a statement to the Criminal Investigations Department (CID) earlier in the day.\nHe served as president from 2022 to 2024, stepping into the role after the country’s worst ever economic crisis triggered a popular uprising caused his predecessor Gotabaya Rajapaksa to flee.\nHe was widely credited with helping put the island nation back on the road to economic recovery.\nWickremesinghe also served six separate terms as prime minister from the 1990s onwards.\nAccording to BBC Sinhala, the 76-year-old made 23 foreign trips during his time as president, at a cost of more than Rs 600 million ($2m; £1.4m).\nFriday’s arrest relates to a stop over made in the UK in 2023, on Wickremesinghe’s way back from a G77 summit in Cuba, news agency AFP reports.\nOn that occasion, he and his wife had attended a University of Wolverhampton ceremony.\nSri Lanka’s CID allege this was a private visit for which state funds were used – something Wickremesinghe has denied.\nTheir investigation was initially referred to a court in June.\nWickremesinghe, who is the first former president to be arrested in Sri Lanka, has been a feature of the island nation’s politics since he was first elected as MP in 1977.\nA lawyer by profession, he comes from an affluent family of politicians and businessmen.\nHe was credited with cleaning up the image of the United National Party (UNP) after taking over its leadership in 1994 by bringing in a disciplinary commission to get rid of corrupt party members.\nOver the years, he went on to make several bids to become president – only getting the role he had long-wanted in 2022 after Rajapaksa fled.\nAt the time his party was almost wiped out in the 2020 elections, and he was left as its sole representative in parliament.\nHe lost the 2024 election to the left-leaning Anura Kumara Dissanayake.\nBy BBC News\nEmail your news TIPS to Editor@Kahawatungu.com — this is our only official communication channel"
    },
    {
      "news_title": "Former Lankan President Wickremesinghe arrested on charges of misuse of State funds",
      "news_link": "https://www.mangalorean.com/former-lankan-president-wickremesinghe-arrested-on-charges-of-misuse-of-state-funds/",
      "bias": "unknown",
      "text": "Former Lankan President Wickremesinghe arrested on charges of misuse of State funds\nColombo: In a major development in the island nation, Former Sri Lankan President Ranil Wickremesinghe was taken into custody on Friday by the country’s Criminal Investigation Department (CID), the first such arrest of a former President in the nation’s history, local media reported.\nWickremesinghe was summoned by the CID over allegations of misuse of State funds and subsequently arrested following a four-hour-long statement.\nExtensive security arrangements were made as Wickremesinghe was produced before the Colombo Fort Magistrate’s Court late Friday afternoon where a huge crowd of supporters had also gathered.\nThe investigation relates to Wickremesinghe’s September 2023 visit to the United Kingdom during his tenure as President to attend a University of Wolverhampton graduation ceremony for his wife, Maithree Wickremesinghe. The investigators alleged that State funds were used for travel and security expenses.\nAccording to the CID’s investigation, the trip, which involved a group of 10, is estimated to have cost the Government approximately 16.9 million Lankan rupees.\nHowever, the Former President dismissed the allegations, insisting that his wife covered her own expenses and no State funds were misused, Lankan newspaper ‘Daily Mirror’ reported.\nPreviouly, as part of the ongoing investigation, the CID also took statements from his former Private Secretary, Sandra Perera, and former Presidential secretary Saman Ekanayake over their roles in arranging the visit.\nReports suggest that Perera was grilled for nearly six hours after she was summoned to the CID to record a statement in connection with the investigation into a foreign trip which was allegedly funded using financial allocations from the Presidential Secretariat.\nEarlier in June, the CID informed the Fort Magistrate’s Court that it had initiated an investigation into the foreign trips made by the former President during his Presidency.\nWhile laying out the facts before Court, CID officers stated that the probe is being carried out under the Offences Against Public Property Act.\nWickremesinghe became President in July 2022 after Gotabaya Rajapaksa’s resignation and was defeated in the September 2024 Presidential election."
    },
    {
      "news_title": "Former Sri Lanka President Arrested",
      "news_link": "https://thekenyatimes.com/breaking-news/former-sri-lanka-president-arrested/",
      "bias": "unknown",
      "text": "Sri Lanka’s former President Ranil Wickremesinghe was arrested on Friday, August 21, 2025, by the Criminal Investigation Department (CID) over allegations of misusing state funds.\nThe case relates to several foreign trips he made during his presidency, including a controversial stopover in the UK in 2023 while returning from a G77 summit in Cuba.\nOn that occasion, Wickremesinghe and his wife attended a University of Wolverhampton ceremony, which investigators allege was a private visit funded by the state.\nPolice authorities stated that the trip was not an official engagement, yet it was financed with state funds.\nAccording to BBC Sinhala, his 23 official foreign trips as president cost the state more than Ksh 258 million ($2 million).\nThe former president appeared before a magistrate’s court in Colombo after recording a statement with the CID, becoming the first ex-head of state in Sri Lanka’s history to be arrested.\nWickremesinghe served as the island nation’s president from 2022 to 2024.\nAlso Read: President Salva Kiir & GSU Officer Arrested in Nairobi\nProfile of Ranil Wickremesinghe\nRanil Wickremesinghe, born on March 24, 1949, hails from an influential political family. His uncle, Junius Richard Jayewardene, served as both president and prime minister of Sri Lanka.\nTrained as a lawyer, Wickremesinghe entered politics in the late 1970s, winning his first parliamentary election in 1977.\nHe went on to become prime minister for the first time in 1993 and has held the position six times in total, making him one of Sri Lanka’s longest-serving political leaders.\nWickremesinghe has been seen as a practical politician, often finding ways to survive political crisis and stay relevant.\nEven after his party, the United National Party (UNP), performed poorly in the 2020 elections and failed to win a single seat, he made a comeback by becoming prime minister again in 2022.\nAlso Read: Political Ugandan Activist Kizza Besigye Arrested Again\nHis Leadership as Sri Lanka President\nHis leadership has been marked by both reformist and controversial decisions. He has pushed for constitutional reforms aimed at reducing presidential powers, re-established international relations, and engaged with global institutions such as the International Monetary Fund (IMF) and World Bank to address Sri Lanka’s financial crisis.\nHowever, Wickremesinghe’s political career has not been free of criticism. He has been accused of nepotism and protecting political rivals during his tenure as prime minister between 2015 and 2019.\nDespite these controversies, Wickremesinghe is credited with establishing Sri Lanka’s first Special Economic Zone in the late 1980s and advancing economic liberalization.\nFollow our WhatsApp Channel and X Account for real-time news updates."
    },
    {
      "news_title": "Sri Lanka ex-president arrested on corruption charges - Saaz o Awaz",
      "news_link": "https://eawaz.com/world-news/sri-lanka-ex-president-arrested-on-corruption-charges/",
      "bias": "unknown",
      "text": "Sri Lankan police arrested former president Ranil Wickremesinghe on Friday.\nThis making him the most senior opposition figure to be detained under an anti-corruption crackdown by the new government. Sri Lanka’s anti-graft units have led the crackdown since President Anura Kumara Dissanayake came to power in September on a promise to fight corruption. Wickremesinghe, 76, who lost the last election to Dissanayake, was taken into custody after being questioned about a September 2023 visit to London to attend a ceremony for his wife at a British university."
    },
    {
      "news_title": "Former Sri Lankan President Ranil Wickremesinghe Arrested On Corruption Allegations",
      "news_link": "https://8pmnews.com/sri-lankan-president-ranil-arrested-on-corruption/",
      "bias": "unknown",
      "text": "Former Sri Lankan President Ranil Wickremesinghe was arrested on Friday following an investigation into the alleged misuse of state funds. The arrest came after he was questioned by the Financial Crimes Investigation Division (FCID) regarding a trip to London in September 2023, which he took while he was head of state.\nAccording to police officials cited by AFP, Wickremesinghe was taken into custody in connection with a visit to a ceremony for his wife, Maithree, at a British university. He had made the stop in London on his return journey from a G77 summit in Havana. The police are alleging that he used government money for his and his bodyguards’ travel, arguing that the visit was personal, not official.\nWickremesinghe has consistently maintained that no state funds were used for the trip and that his wife covered her own travel expenses. Despite his defense, an officer told AFP that they are pressing charges for “using state resources for personal purposes” and would be producing him before the Colombo Fort magistrate.\nWickremesinghe, who became president in July 2022 after his predecessor Gotabaya Rajapaksa resigned, is widely credited with stabilizing Sri Lanka’s economy during the country’s severe financial crisis. He lost his re-election bid in September of the previous year to left-wing candidate AK Disannayake.\nTrump Administration Intensifies Immigration Crackdown with Visa Reviews\nOver 55 Million Visa Holders Under “Continuous Vetting,” Trucker Visas Paused\nThe Trump administration is escalating its immigration crackdown with a sweeping review of more than 55 million U.S. visa holders and applicants. The U.S. State Department confirmed that all visa holders, including tourists, are now subject to “continuous vetting” to identify any violations that could lead to visa revocation and deportation.\nThe vetting process is looking for indicators of ineligibility, such as overstaying a visa, criminal activity, threats to public safety, or involvement with terrorism. If a violation is found, the visa will be revoked, and if the individual is in the U.S., they will be subject to deportation. The State Department stated it is reviewing all available information, including law enforcement and immigration records, and any information that comes to light after a visa is issued.\nIn a related move, U.S. Secretary of State Marco Rubio announced an immediate pause on all visas for foreign truck drivers. Rubio stated the decision was made to protect “American lives and undercutting the livelihoods of American truckers,” following a recent fatal crash in Florida involving a foreign driver. This pause is part of a broader push to tighten immigration rules and enhance vetting, with the administration also focusing on stricter English proficiency requirements for truckers.\nThe intensified scrutiny and visa pauses reflect a broader agenda from the Trump administration to prioritize stringent enforcement and national security."
    },
    {
      "news_title": "Sri Lanka arrests former President Wickremesinghe, local media reports, Asia News",
      "news_link": "https://www.asiaone.com/asia/sri-lanka-arrests-former-president-wickremesinghe-local-media-reports",
      "bias": "unknown",
      "text": "COLOMBO — Former Sri Lankan President Ranil Wickremesinghe was arrested by the Criminal Investigation Department on Friday (Aug 22) in connection with allegations of misuse of state funds, local television channel Ada Derana reported.\nWickremesinghe, 76, was taken into custody after arriving at the CID office in the capital Colombo to record a statement in an investigation into his visit to London to attend his wife's graduation ceremony, the report said.\nA Sri Lankan police spokesperson did not immediately confirm the arrest. Wickremesinghe's office did not respond to a request for comment from Reuters.\nHe was due to appear in court later on Friday, local media reported.\nA lawyer who served as Sri Lanka's prime minister a record six times, Wickremesinghe was made president in 2022 during the Indian Ocean island nation's debilitating financial crisis.\nWickremesinghe, who is the leader of the United National Party (UNP), took over after widespread protests caused by a economic meltdown forced his predecessor Gotabaya Rajapaksa to flee the country and later resign.\nHe finished third in last year's presidential election — the first since the economic crisis — behind Marxist-leaning Anura Kumara Dissanayake, who won the vote, and opposition leader Sajith Premadasa.\nThe election was a referendum on Wickremesinghe, who led a successful but fragile economic recovery that included austerity measures that angered voters.\nBorn into a prominent family of politicians and businessmen with large media interests, in 1978 Wickremesinghe was, at 29, made the country's youngest cabinet minister by his uncle, President Junius Jayewardene.\nIn 1994, following assassinations that wiped out several of his senior colleagues, Wickremesinghe became leader of the UNP.\n[[nid:721614]]"
    },
    {
      "news_title": "Ex-Sri Lanka president arrested for misappropriation allegation",
      "news_link": "https://economynext.com/ex-sri-lanka-president-arrested-for-misappropriation-allegation-237824/",
      "bias": "unknown",
      "text": null
    },
    {
      "news_title": "Former Sri Lankan President Ranil Wickremesinghe arrested for misuse of state funds",
      "news_link": "https://madhyamamonline.com/world/former-sri-lankan-president-ranil-wickremesinghe-arrested-for-misuse-of-state-funds-1440064",
      "bias": "unknown",
      "text": "Former Sri Lankan President Ranil Wickremesinghe arrested for misuse of state funds\ntext_fieldsSri Lanka’s former President Ranil Wickremesinghe was arrested on Friday by the Criminal Investigation Department (CID) over allegations of misusing public money for a private overseas trip during his tenure.\nAccording to police officials, Wickremesinghe, 76, is accused of using government funds to travel to England in September 2023 to attend his wife Professor Maithree Wickremesinghe’s convocation ceremony at a British university. “We are producing him before the Colombo Fort magistrate,” an officer told AFP, adding that charges were being pursued for using state resources for personal purposes.\nThe former leader had stopped in London on his return from Havana, where he participated in the G77 summit.\nIn the UK, he and his wife attended a University of Wolverhampton ceremony. While Wickremesinghe has insisted that his wife covered her own expenses and no state money was involved, the CID maintains that government funds were used for his travel and that the costs of his security detail were also borne by the state.\nEarlier, investigators questioned members of his staff regarding the expenses linked to the trip.\nWickremesinghe, who assumed office in July 2022 following Gotabaya Rajapaksa’s resignation amid mass protests over corruption and economic mismanagement, is credited with steering the country through its worst financial crisis. However, he lost his bid for re-election in September."
    },
    {
      "news_title": "Ex-Sri Lankan President Wickremesinghe Arrested Over Alleged Misuse Of State Funds",
      "news_link": "https://stratnewsglobal.com/sri-lanka/ex-sri-lankan-president-wickremesinghe-arrested-over-alleged-misuse-of-state-funds/",
      "bias": "unknown",
      "text": "Former Sri Lankan President Ranil Wickremesinghe was taken into custody by the Criminal Investigation Department (CID) on Friday over allegations of misusing state funds, according to local television channel Ada Derana.\nWickremesinghe, 76, was arrested after arriving at the CID office in the capital Colombo to record a statement in an investigation into his visit to London to attend his wife’s graduation ceremony, the report said.\nA Sri Lanka Police spokesperson did not immediately confirm the arrest. Wickremesinghe’s office did not respond to a request for comment from Reuters.\nA lawyer who served as Sri Lanka’s prime minister a record six times, Wickremesinghe was made president in 2022 during the island nation’s debilitating financial crisis.\nWickremesinghe, who is the leader of the United National Party (UNP), took over after widespread protests caused by an economic meltdown forced his predecessor, Gotabaya Rajapaksa, to flee Sri Lanka and later resign.\nBorn into a prominent family of politicians and businessmen with large interests in the media, a 29-year-old Wickremesinghe was made the country’s youngest cabinet minister by his uncle, President Junius Jayewardene, in 1978.\nIn 1994, following assassinations that wiped out several of his senior colleagues, Wickremesinghe became leader of the UNP.\nCase Against Wickremesinghe\nIn 2023, Ranil Wickremesinghe made a stopover in London while returning from Havana, where he had taken part in the G77 summit. During his stay in the British capital, he, along with his wife, attended a ceremonial event hosted by the University of Wolverhampton.\nWickremesinghe has consistently maintained that the travel expenses of his wife were borne by her personally and that there was no use of public funds for her trip.\nThe Criminal Investigation Department, however, has alleged that Wickremesinghe misused state money to cover his own travel costs during what was described as a private visit. Furthermore, the CID claims that his security personnel accompanying him were also financed with government funds.\n(With inputs from Reuters and IBNS)"
    },
    {
      "news_title": "Ex-Sri Lankan president Ranil Wickremesinghe arrested",
      "news_link": "https://www.rediff.com/news/report/ex-sri-lankan-president-ranil-wickremesinghe-arrested/20250822.htm",
      "bias": "unknown",
      "text": "Sri Lanka's former president Ranil Wickremesinghe was arrested on Friday for allegedly misusing the state funds, police said.\nWickremesinghe, 76, was arrested at the Criminal Investigation Department (CID) headquarters, where he was summoned to record a statement in connection with an investigation into the alleged misuse of government funds, police said.\nHe has been accused of using state funds to travel to England to attend a convocation ceremony of his wife, Prof Maithree, in September 2023.\nIt has been alleged that Wickremesinghe was returning from the US after an official engagement and visited the UK at the state's expense to attend the private engagement of his wife.\nThe CID had previously questioned his staff about the travel expenses.\nWickremesinghe, who had replaced Gotabaya Rajapaksa as the President to serve the balance term until the end of 2024, was credited with steering Sri Lanka out of the economic crisis of 2022. He was president from July 2022 to September 2024.\nThe veteran politician also served as Sri Lanka's prime minister six times."
    },
    {
      "news_title": "Sri Lanka ex-president Wickremesinghe arrested for alleged fund misuse - OrissaPOST",
      "news_link": "https://www.orissapost.com/sri-lanka-ex-president-wickremesinghe-arrested-for-alleged-fund-misuse/",
      "bias": "unknown",
      "text": "Colombo: Sri Lanka‘s former president Ranil Wickremesinghe was arrested Friday for allegedly misusing the state funds, police said.\nWickremesinghe, 76, was arrested at the Criminal Investigation Department (CID) headquarters, where he was summoned to record a statement in connection with an investigation into the alleged misuse of government funds, police said.\nHe has been accused of using state funds to travel to England to attend a convocation ceremony of his wife, Prof Maithree, in September 2023.\nIt has been alleged that Wickremesinghe was returning from the US after an official engagement and visited the UK at the state’s expense to attend the private engagement of his wife.\nThe CID had previously questioned his staff about the travel expenses.\nWickremesinghe, who had replaced Gotabaya Rajapaksa as the President to serve the balance term until the end of 2024, was credited with steering Sri Lanka out of the economic crisis of 2022. He was president from July 2022 to September 2024.\nThe veteran politician also served as Sri Lanka’s prime minister six times."
    },
    {
      "news_title": "Sri Lankan ex-President Ranil Wickremesinghe arrested",
      "news_link": "https://www.news9live.com/world/sri-lankan-ex-president-ranil-wickremesinghe-arrested-2884007",
      "bias": "unknown",
      "text": "Sri Lankan ex-President Ranil Wickremesinghe arrested\nEx- Sri Lankan President Ranil Wickremesinghe was arrested by the Criminal Investigation Department (CID) on Friday.\nColombo: Former Sri Lankan President Ranil Wickremesinghe was arrested by the Criminal Investigation Department (CID) on Friday in connection with an ongoing investigation, local television channel Ada Derana reported.\nWickremesinghe was arrested after arriving at the CID office to record a statement, the report said.\nClick for more latest World news. Also get top headlines and latest news from India and around the world at News9.\nLatest Stories\nNext Article"
    },
    {
      "news_title": "Former President Wickremesinghe Arrested Over Alleged Misuse of State Funds • Sri Lanka Brief",
      "news_link": "https://srilankabrief.org/former-president-wickremesinghe-faces-arrest-over-alleged-misuse-of-state-funds/",
      "bias": "unknown",
      "text": "Colombo’s Criminal Investigation Department (CID) today recorded a statement from former President Ranil Wickremesinghe as part of an ongoing probe into allegations of financial misconduct during his tenure.\nAfter recording the statement, he was arrested and will be produced in court.\nThe investigation centers on claims that Wickremesinghe diverted public funds to finance a private trip to London in September 2023, where he reportedly attended the PhD graduation ceremony of his wife, Professor Maithree Wickramasinghe, at the University of Wolverhampton. According to police submissions to the Colombo Fort Magistrate’s Court, the visit was folded into a broader overseas tour that included official stops in Cuba and the United States—but the UK leg, investigators argue, lacked any formal state engagements.\nDocuments submitted in court allege that the London trip involved a delegation of ten individuals and cost the government approximately Rs. 16.9 million. Earlier this month, CID officers questioned two senior aides—former presidential secretary Saman Ekanayake and private secretary Sandra Perera—regarding their roles in organizing the travel.\nWickremesinghe, who held office from 2022 to 2024, is now the highest-ranking political figure to be arrested in recent memory. His detention comes amid heightened public scrutiny of corruption and financial abuse among Sri Lanka’s political elite—an issue that has long simmered beneath the surface with few consequences.\nIn response, Wickremesinghe’s office has categorically denied the allegations, dismissing reports of the Wolverhampton visit as “false and misleading.” A formal statement is expected following legal consultations.\nAs the veteran United National Party (UNP) leader—who first entered Parliament in 1977 and served multiple terms as prime minister—prepares to face court proceedings, Colombo’s political establishment braces for the fallout.\n(With the inputs from Tamil Guardian)"
    },
    {
      "news_title": "Sri Lanka arrests former President Wickremesinghe, local media reports",
      "news_link": "https://upstract.com/x/829d9081c18af4e1?ref=rss",
      "bias": "unknown",
      "text": null
    },
    {
      "news_title": "Former President Ranil Wickremesinghe Taken Into Custody - LNW Lanka News Web",
      "news_link": "https://lankanewsweb.net/archives/119077/former-president-ranil-wickremesinghe-taken-into-custody/",
      "bias": "unknown",
      "text": "Former President Ranil Wickremesinghe has been taken into custody.\nHe had arrived at the Criminal Investigation Department (CID) this morning (22) to provide a statement, and was arrested shortly after giving it.\nWickremesinghe was summoned in connection with an investigation into allegations that, during his presidency, he undertook a private trip to London at state expense."
    },
    {
      "news_title": "Former Sri Lankan President Ranil Wickremesinghe arrested on allegations of misusing state funds - The Arabian Stories News",
      "news_link": "https://www.thearabianstories.com/2025/08/22/former-sri-lankan-president-ranil-wickremesinghe-arrested-on-allegations-of-misusing-state-funds/",
      "bias": "unknown",
      "text": "COLOMBO : Former Sri Lankan President Ranil Wickremesinghe was arrested on Friday on allegations of state funds’ misuse as reported by Newswire Lanka.\nCiting officials familiar with the matter, Newswire reported that the former Sri Lankan president was arrested after appearing before the Criminal Investigation Department (CID) in Colombo.\nAs per Newswire, his arrest is linked to allegations of using state funds to cover the expenses for a private visit to London, where he had attended a university graduation ceremony.\nIt was further reported that the investigators claim the trip, which formed part of a wider overseas tour, was not an official engagement but was financed with government money.\nAs per Newswire, earlier in August, former presidential secretary Saman Ekanayake and former private secretary Sandra Perera were questioned over their roles in arranging the visit.\nRanil Wickremesinghe, had served as Sri Lanka’s president from 2022 to 2024.\nAs per reports, he is the most senior political figure to face arrest in recent years. The detention of Ranil Wickremesinghe is expected to intensify scrutiny over the use of public funds by top officials.\nAccording to newswire, the court proceedings and formal charges are expected to follow.\nRanil Wickremesinghe, a six-time prime minister, assumed office as Sri Lanka’s interim president in July 2022 following Gottabaya Rajapaksa’s removal. He lost the Presidential Elections to Anura Kumara Dissanayake, the leader of National People’s Power in September 2024. (ANI)\nRead More\n- Glacier burst and floods devastate Ghizer in PoGB, 330 homes damaged as artificial lake forms\n- UAE court overturns death penalty in drug trafficking case, imposes life term on Asian expat\n- Kuwait bets big on Vision 2035: $32 bln investment and 50,000 jobs to reshape the nation\n- Trump to take “important decision” in 2 weeks on Russia-Ukraine war, says may impose “massive sanctions or do nothing”\n- Chinese toy giant Pop Mart to launch new mini Labubu series"
    },
    {
      "news_title": "Former President Wickremesinghe Booked Over State Funds - Asian News from UK",
      "news_link": "https://asianlite.com/2025/top-news/former-president-wickremesinghe-booked-over-state-funds/",
      "bias": "unknown",
      "text": "Wickremesinghe was summoned by the CID over allegations of misuse of State funds and subsequently arrested following a four-hour-long statement…reports Asian Lite News\nIn a major development, former Sri Lankan President Ranil Wickremesinghe was taken into custody on Friday by the country’s Criminal Investigation Department (CID), marking the first-ever arrest of a former President in the nation’s history, local media reported.\nWickremesinghe was summoned by the CID over allegations of misuse of State funds and subsequently arrested following a four-hour-long statement.\nExtensive security arrangements were made as Wickremesinghe was produced before the Colombo Fort Magistrate’s Court late Friday afternoon where a huge crowd of supporters had also gathered.\nThe investigation relates to Wickremesinghe’s September 2023 visit to the United Kingdom during his tenure as President to attend a University of Wolverhampton graduation ceremony for his wife, Maithree Wickremesinghe. The investigators alleged that State funds were used for travel and security expenses.\nAccording to the CID’s investigation, the trip, which involved a group of 10, is estimated to have cost the Government approximately 16.9 million Lankan rupees.\nHowever, the Former President dismissed the allegations, insisting that his wife covered her own expenses and no State funds were misused, Lankan newspaper ‘Daily Mirror’ reported.\nPreviously, as part of the ongoing investigation, the CID also took statements from his former Private Secretary, Sandra Perera, and former Presidential secretary Saman Ekanayake over their roles in arranging the visit.\nReports suggest that Perera was grilled for nearly six hours after she was summoned to the CID to record a statement in connection with the investigation into a foreign trip which was allegedly funded using financial allocations from the Presidential Secretariat.\nEarlier in June, the CID informed the Fort Magistrate’s Court that it had initiated an investigation into the foreign trips made by the former President during his Presidency.\nWhile laying out the facts before Court, CID officers stated that the probe is being carried out under the Offences Against Public Property Act.\nWickremesinghe became President in July 2022 after Gotabaya Rajapaksa’s resignation and was defeated in the September 2024 Presidential election."
    },
    {
      "news_title": "Sri Lanka's former president Ranil Wickremesinghe arrested over alleged misuse of state funds",
      "news_link": "https://www.millenniumpost.in/world/sri-lankas-former-president-ranil-wickremesinghe-arrested-over-alleged-misuse-of-state-funds-624104",
      "bias": "unknown",
      "text": "Sri Lanka's former president Ranil Wickremesinghe arrested over alleged misuse of state funds\nBY Agencies22 Aug 2025 11:30 AM IST\nX\nAgencies22 Aug 2025 11:30 AM IST\nColombo: Sri Lanka's former president Ranil Wickremesinghe was arrested on Friday for allegedly misusing the state funds, police said. Wickremesinghe, 76, has been accused of using public funds to travel to England to attend a convocation ceremony of his wife Maithree in September 2023, police said. The police had previously questioned his staff about the travel expenses.\nNext Story"
    },
    {
      "news_title": "Ranil Wickremesinghe appears before FCID",
      "news_link": "https://www.onlanka.com/news/ranil-wickremesinghe-appears-before-fcid.html",
      "bias": "unknown",
      "text": "Ranil Wickremesinghe appears before FCID\nFormer Sri Lanka President Ranil Wickremesinghe arrived at the Financial Crimes Investigation Division (FCID) this morning (August 22) to provide a statement in connection with an investigation into his visit to London during his tenure as President.\nThe investigation relates to an alleged private foreign trip said to have been undertaken using government funds.\nThe visit took place on September 22 and 23, 2023, when Wickremesinghe travelled to London to attend the graduation ceremony of his wife, Professor Maithree Wickremesinghe.\nReports indicate that 10 individuals had accompanied the former President on this trip.\nAs part of the ongoing probe, the CID has already recorded statements from the former President’s Secretary Saman Ekanayake and his former Private Secretary Sandra Perera.\nLatest Headlines in Sri Lanka\n- Ranil Wickremesinghe transferred to Colombo National Hospital August 23, 2025\n- Mahinda and Sajith visit Ranil Wickremesinghe at Prison Hospital August 23, 2025\n- Ranil Wickremesinghe admitted to prison hospital August 23, 2025\n- Ranil Wickremesinghe remanded until August 26, 2025 August 22, 2025\n- Sri Lanka to repeal Prevention of Terrorism Act by September, 2025 August 22, 2025"
    }
  ]
}