{
  "story_id": "GN_20250823_145537_33270cf4",
  "metadata": {
    "title": "ADB to back Pakistan rail upgrade as China financing stalls, sources say",
    "timestamp": "2025-08-23T14:55:37.191260",
    "url": "https://ground.news/article/adb-steps-in-to-finance-pakistan-railway-upgrade-after-china-delays"
  },
  "bias_distribution": {
    "total_sources": "12",
    "leaning_left": "2",
    "center": "4",
    "leaning_right": "5"
  },
  "perspective_summaries": {
    "left": [
      "On Friday, the Asian Development Bank revealed plans to provide $2 billion in funding to modernize a 500-kilometer section of the railway running between Karachi and Rohri in southern Pakistan.",
      "The upgrade replaces stalled Chinese financing under a $60 billion Belt and Road Initiative announced in 2015 amid Pakistan's debt difficulties with Beijing.",
      "The modernization will improve tracks and bridges, allowing faster diesel trains and connecting Rohri to a branch carrying copper concentrate from the Reko Diq mine.",
      "Earlier this week, the Asian Development Bank committed $410 million to support the Reko Diq mining project, while project director Tim Cribb mentioned that the government and Barrick are collaborating to obtain additional funds for upgrading the rail line to Rohri.",
      "The upgrade aims to address urgent transport needs for the mine in insurgency-hit Balochistan, signalling closer ADB involvement while Pakistan maintains strategic ties with China."
    ],
    "center": [
      "On Friday, the Asian Development Bank revealed plans to provide $2 billion in funding to modernize a 500-kilometer section of the railway running between Karachi and Rohri in southern Pakistan.",
      "The upgrade replaces stalled Chinese financing under a $60 billion Belt and Road Initiative announced in 2015 amid Pakistan's debt difficulties with Beijing.",
      "The modernization will improve tracks and bridges, allowing faster diesel trains and connecting Rohri to a branch carrying copper concentrate from the Reko Diq mine.",
      "Earlier this week, the Asian Development Bank committed $410 million to support the Reko Diq mining project, while project director Tim Cribb mentioned that the government and Barrick are collaborating to obtain additional funds for upgrading the rail line to Rohri.",
      "The upgrade aims to address urgent transport needs for the mine in insurgency-hit Balochistan, signalling closer ADB involvement while Pakistan maintains strategic ties with China."
    ],
    "right": [
      "The Asian Development Bank will finance upgrades to Pakistan's railway system, replacing China due to delays in securing Chinese funding, according to two sources.",
      "ADB is in advanced talks to finance a $2 billion upgrade for a 500-km railway line from Karachi to Rohri, as reported by two sources familiar with the discussions.",
      "The upgrade is urgent for transporting copper ore from the Reko Diq mine being developed by Barrick Mining Corp, as stated by sources.",
      "The ADB announced $410 million in financing for the Reko Diq mine, which faces security issues in Balochistan, according to recent reports."
    ]
  },
  "sources": [
    {
      "news_title": "ADB looks to back rail upgrade connecting Reko Diq to Karachi",
      "news_link": "https://www.dawn.com/news/1934902",
      "bias": "Lean Left",
      "text": "ISLAMABAD: After prolonged delays in securing financing from Beijing threatened to put a strain on a strategic mining project, the Asian Development Bank (ADB) has stepped in to fund upgrades to part of Pakistan’s railway system.\nThe ADB is in advanced talks to lead the financing of a $2 billion upgrade of a 500-km stretch of the railway line, which had previously been part of the Chinese project, two sources with direct knowledge of the discussions told Reuters.\nThe proposed rail upgrade would modernise the track and bridges from the commercial capital Karachi to Rohri, near Sukkur, so that trains can run faster.\nIn Rohri, the line will meet a branch coming from the area of the Reko Diq mine and will carry the copper concentrate to port.\nThe upgrade has become urgent, sources said, as it is needed to transport copper ore from the Reko Diq mine currently being developed by Canada’s Barrick Mining Corp.\nEarlier this week, ADB announced $410 million in financing for the Reko Diq mine itself, and its president is due to visit Islamabad next week, they said.\nTim Cribb, Reko Diq’s project director, told Reuters that the government and Barrick would work together on securing financing for the upgrading of the branch coming from the west to Rohri.\nThe Reko Diq copper and gold mine is due to enter production in 2028 with anticipated annual output of some 200,000 metric tons of copper concentrate.\nOne of the world’s largest untapped copper deposits, it is Pakistan’s largest foreign investment in recent years.\n“We will have a crisis. How will you evacuate output from Reko Diq? The exhausted line will come under even more pressure,” a senior government official said.\nThere was no immediate comment from Pakistan’s railways ministry or China’s foreign ministry.\nThe ADB would not confirm the finance package, which is being reported for the first time by Reuters. But it said Pakistan’s government and the regional lender “have regular discussions on railway sector development”.\n“Any potential ADB assistance would be subject to comprehensive due diligence and consideration under ADB’s policies and procedures before any commitment is made,” it said.\nPublished in Dawn, August 23rd, 2025"
    },
    {
      "news_title": "Govt turns to ADB for $2b rail project after China funding stalls",
      "news_link": "https://tribune.com.pk/story/2562640/govt-turns-to-adb-for-2b-rail-project-after-china-funding-stalls",
      "bias": "Center",
      "text": "The Asian Development Bank will fund upgrades to part of Pakistan's creaking railway system, replacing China, after prolonged delays in securing financing from Beijing threatened to put a strain on a strategic mining project, two sources said on Friday.\nAn extensive revamp of 1,800 km of railways has been the centrepiece of a $60 billion Chinese investment programme in Pakistan announced in 2015 as part of Beijing's Belt and Road Initiative global infrastructure push.\nA decade of negotiations, however, have yet to produce a finance package for the rail upgrades - the single biggest project under the programme with China. And Pakistan is, meanwhile, struggling to repay Chinese debt owed for other projects.\nThe ADB is in advanced talks to lead the financing of a $2 billion upgrade of a 500-km stretch of the railway line from Karachi to Rohri that had previously been part of the Chinese project, two sources with direct knowledge of the discussions told Reuters.\nAlso Read: 11th NFC formed as Centre, provinces brace for fiscal tug-of-war\nThe upgrade has become urgent, they said, as it is needed to transport copper ore from the Reko Diq mine currently being developed by Canada's Barrick Mining Corp. \"We will have a crisis. How will you evacuate output from Reko Diq? The exhausted line will come under even more pressure,\" one of the sources, a senior government official, said.\nThe ADB would not confirm the finance package, which is being reported for the first time by Reuters. But it said Pakistan's government and the regional lender \"have regular discussions on railway sector development\".\n\"Any potential ADB assistance would be subject to comprehensive due diligence and consideration under ADB's policies and procedures before any commitment is made,\" it wrote in a statement to Reuters.\nThe deal, expected to be announced later this month, would see the ADB lead a consortium to finance the project and bring in an international engineering contractor to carry out the work through a competitive bidding process, the sources said. The ADB announced $410 million in financing for the Reko Diq mine itself earlier this week. And its president is due to visit Islamabad next week, the sources said.\nChina and Pakistan: 'Ironclad friends'?\nThe sources said the plan is diplomatically tricky but has been squared with China. \"We would never do anything to jeopardise that relationship,\" the senior Pakistani official said.\nChina rolled out major power and infrastructure projects after the 2015 launch of the investment programme, known locally as the China-Pakistan Economic Corridor. But momentum has stalled, with the last big project - the Gwadar East Bay Expressway - inaugurated in 2022.\nAlso Read: Chinese FM Wang Yi, COAS Munir meet on regional security, counter-terrorism\nIslamabad has fallen behind on payments for electricity generated by Chinese-built power plants. And following a government report looking at the cost of the power stations, Islamabad has for the past year sought to reschedule debt payments for the plants.\n\"China and Pakistan are ironclad friends and all-weather strategic cooperative partners,\" China's foreign ministry said on August 19, ahead of a visit by Foreign Minister Wang Yi to Islamabad this week.\nIn Wang's meeting with Pakistan's Prime Minister Shehbaz Sharif on Thursday, both sides said they sought to deepen ties and move on to the next phase of CPEC.\nPakistan’s mining ambitions\nThe Reko Diq copper and gold mine - at the heart of the government's strategy to attract investment to Pakistan's mining sector - is due to enter production in 2028 with anticipated annual output of some 200,000 metric ton of copper concentrate. One of the world's largest untapped copper deposits, it is Pakistan's largest foreign investment in recent years.\nThe ADB-financed rail upgrade would modernise the track and bridges from the commercial capital Karachi north to Rohri, close to the city of Sukkur, so that diesel trains can run faster, the sources said. In Rohri, the line will meet a branch coming from the area of the Reko Diq mine and will carry the copper concentrate to port.\nTim Cribb, Reko Diq's project director, told Reuters that the government and Barrick would work together on securing financing for the upgrading of the branch coming from the west to Rohri. The mine also faces security concerns, as it lies in the insurgency-hit western province of Balochistan, with militants frequently targeting the rail network.\nCOMMENTS\nComments are moderated and generally will be posted if they are on-topic and not abusive.\nFor more information, please see our Comments FAQ"
    },
    {
      "news_title": "Pakistan set to get ADB finance for rail upgrade that China was to fund but didn't",
      "news_link": "https://www.firstpost.com/world/pakistan-rail-upgrade-adb-replaces-china-13927246.html",
      "bias": "Lean Right",
      "text": "The Asian Development Bank will fund upgrades to part of Pakistan’s creaking railway system, replacing China, after prolonged delays in securing financing from Beijing threatened to put a strain on a strategic mining project, two sources said on Friday.\nAn extensive revamp of 1,800 km (1,118 miles) of railways has been the centrepiece of a $60 billion Chinese investment programme in Pakistan announced in 2015 as part of Beijing’s Belt and Road Initiative global infrastructure push.\nA decade of negotiations, however, have yet to produce a finance package for the rail upgrades - the single biggest project under the programme with China. And Pakistan is, meanwhile, struggling to repay Chinese debt owed for other projects.\nThe ADB is in advanced talks to lead the financing of a $2 billion upgrade of a 500-km stretch of the railway line from Karachi to Rohri in the country’s south that had previously been part of the Chinese project, two sources with direct knowledge of the discussions told Reuters.\nThe upgrade has become urgent, they said, as it is needed to transport copper ore from the Reko Diq mine currently being developed by Canada’s Barrick Mining Corp.\n“We will have a crisis. How will you evacuate output from Reko Diq? The exhausted line will come under even more pressure,” one of the sources, a senior government official, said.\nThere was no immediate comment from Pakistan’s railways ministry or China’s foreign ministry.\nThe ADB would not confirm the finance package, which is being reported for the first time by Reuters. But it said Pakistan’s government and the regional lender “have regular discussions on railway sector development”.\nImpact Shorts\nView All“Any potential ADB assistance would be subject to comprehensive due diligence and consideration under ADB’s policies and procedures before any commitment is made,” it wrote in a statement to Reuters.\nThe deal, expected to be announced later this month, would see the ADB lead a consortium to finance the project and bring in an international engineering contractor to carry out the work through a competitive bidding process, the sources said.\nThe ADB announced $410 million in financing for the Reko Diq mine itself earlier this week. And its president is due to visit Islamabad next week, the sources said.\nChina and Pakistan: ‘Ironclad friends’?\nThe sources said the plan is diplomatically tricky but has been squared with China.\n“We would never do anything to jeopardise that relationship,” the senior Pakistani official said.\nChina rolled out major power and infrastructure projects after the 2015 launch of the investment programme, known locally as the China-Pakistan Economic Corridor. But momentum has stalled, with the last big project - the Gwadar East Bay Expressway - inaugurated in 2022.\nIslamabad has fallen behind on payments for electricity generated by Chinese-built power plants. And following a government report looking at the cost of the power stations, Islamabad has for the past year sought to reschedule debt payments for the plants.\n“China and Pakistan are ironclad friends and all-weather strategic cooperative partners,” China’s foreign ministry said on August 19, ahead of a visit by Foreign Minister Wang Yi to Islamabad this week.\nIn Wang’s meeting with Pakistan’s Prime Minister Shehbaz Sharif on Thursday, both sides said they sought to deepen ties and move on to the next phase of CPEC.\nPakistan’s mining ambitions\nThe Reko Diq copper and gold mine - at the heart of the government’s strategy to attract investment to Pakistan’s mining sector - is due to enter production in 2028 with anticipated annual output of some 200,000 metric ton of copper concentrate.\nOne of the world’s largest untapped copper deposits, it is Pakistan’s largest foreign investment in recent years.\nThe ADB-financed rail upgrade would modernise the track and bridges from the commercial capital Karachi north to Rohri, close to the city of Sukkur, so that diesel trains can run faster, the sources said.\nIn Rohri, the line will meet a branch coming from the area of the Reko Diq mine and will carry the copper concentrate to port.\nTim Cribb, Reko Diq’s project director, told Reuters that the government and Barrick would work together on securing financing for the upgrading of the branch coming from the west to Rohri.\nThe mine also faces security concerns, as it lies in the insurgency-hit western province of Balochistan, with militants frequently targeting the rail network."
    },
    {
      "news_title": "ADB steps in as China delays: $2bn rail upgrade to support Pakistan’s Reko Diq project - Profit by Pakistan Today",
      "news_link": "https://profit.pakistantoday.com.pk/2025/08/22/adb-steps-in-as-china-delays-2bn-rail-upgrade-to-support-pakistans-reko-diq-project/",
      "bias": "Lean Right",
      "text": "Pakistan is turning to the Asian Development Bank (ADB) for urgent railway upgrades after prolonged financing delays from Beijing stalled progress on a flagship Belt and Road Initiative project, sources revealed on Friday.\nThe ADB is in advanced talks to spearhead a $2 billion upgrade of a 500-km stretch of track from Karachi to Rohri, a segment that was once part of the China-backed scheme. The project has become pressing due to its role in transporting copper ore from the Reko Diq mine, being developed by Canada’s Barrick Mining Corp.\n“We will have a crisis. How will you evacuate output from Reko Diq? The exhausted line will come under even more pressure,” a senior government official warned.\nA formal announcement is expected later this month, with the ADB set to lead a consortium, bring in an international engineering contractor through competitive bidding, and finance the project. The lender’s president is also scheduled to visit Islamabad next week, according to sources.\nEarlier this week, the ADB approved $410 million in financing for the Reko Diq mine itself. The mine, one of the world’s largest untapped copper and gold deposits, is central to Pakistan’s strategy to attract foreign investment in the mining sector. Production is due to begin in 2028, with an annual output of around 200,000 metric tons of copper concentrate.\nTim Cribb, Reko Diq’s project director, told Reuters that Barrick and the government would jointly seek financing to upgrade the western branch line linking the mine to Rohri.\nThe rail upgrade will modernize tracks and bridges between Karachi and Rohri, enabling diesel trains to run faster. From Rohri, the line will connect to the Reko Diq branch and carry ore to port.\nChina’s involvement in Pakistan’s infrastructure has slowed in recent years. Although Beijing poured billions into power and road projects following the 2015 launch of the $60 billion China-Pakistan Economic Corridor (CPEC), progress has since stalled. The last major project, the Gwadar East Bay Expressway, was inaugurated in 2022.\nIslamabad, meanwhile, has struggled to service Chinese debt, including overdue payments to Chinese-built power plants. A government report into project costs has pushed Pakistan to seek debt rescheduling over the past year.\n“China and Pakistan are ironclad friends and all-weather strategic cooperative partners,” China’s foreign ministry said on August 19, ahead of Foreign Minister Wang Yi’s visit to Islamabad this week.\nIn meetings with Prime Minister Shehbaz Sharif on Thursday, Wang reiterated Beijing’s desire to deepen ties and advance to the next phase of CPEC.\nDespite the sensitivities of shifting financing from Beijing to Manila, officials insist the plan has been coordinated with China. “We would never do anything to jeopardise that relationship,” the senior Pakistani official stressed.\nSecurity remains another concern for the project. The Reko Diq mine is located in Balochistan, a province plagued by insurgency, where militants frequently target railway infrastructure.\nThe ADB, while not confirming the exact financing plan reported by Reuters, acknowledged that it holds “regular discussions on railway sector development” with Pakistan. “Any potential ADB assistance would be subject to comprehensive due diligence and consideration under ADB’s policies and procedures before any commitment is made,” the bank said."
    },
    {
      "news_title": "Exclusive: ADB to back Pakistan rail upgrade as China financing stalls, sources say",
      "news_link": "https://www.reuters.com/sustainability/boards-policy-regulation/adb-back-pakistan-rail-upgrade-china-financing-stalls-sources-say-2025-08-22/",
      "bias": "Center",
      "text": null
    },
    {
      "news_title": "ADB to back Pakistan rail upgrade as China financing stalls: Report",
      "news_link": "https://www.cnbctv18.com/world/adb-to-back-pakistan-rail-upgrade-as-china-financing-stalls-reuters-sources-ws-l-19658070.htm",
      "bias": "Lean Right",
      "text": "The Asian Development Bank will fund upgrades to part of Pakistan's creaking railway system, replacing China, after prolonged delays in securing financing from Beijing threatened to put a strain on a strategic mining project, two sources said on Friday.\nAn extensive revamp of 1,800 km (1,118 miles) of railways has been the centrepiece of a $60 billion Chinese investment programme in Pakistan announced in 2015 as part of Beijing's Belt and Road Initiative global infrastructure push.\nA decade of negotiations, however, have yet to produce a finance package for the rail upgrades – the single biggest project under the programme with China. And Pakistan is, meanwhile, struggling to repay Chinese debt owed for other projects.\nThe ADB is in advanced talks to lead the financing of a $2 billion upgrade of a 500-km stretch of the railway line from Karachi to Rohri in the country's south that had previously been part of the Chinese project, two sources with direct knowledge of the discussions told Reuters.\nThe upgrade has become urgent, they said, as it is needed to transport copper ore from the Reko Diq mine currently being developed by Canada's Barrick Mining Corp.\n\"We will have a crisis. How will you evacuate output from Reko Diq? The exhausted line will come under even more pressure,\" one of the sources, a senior government official, said.\nThere was no immediate comment from Pakistan's railways ministry or China's foreign ministry.\nThe ADB would not confirm the finance package, which is being reported for the first time by Reuters. But it said Pakistan's government and the regional lender \"have regular discussions on railway sector development\".\n\"Any potential ADB assistance would be subject to comprehensive due diligence and consideration under ADB's policies and procedures before any commitment is made,\" it wrote in a statement to Reuters.\nThe deal, expected to be announced later this month, would see the ADB lead a consortium to finance the project and bring in an international engineering contractor to carry out the work through a competitive bidding process, the sources said.\nThe ADB announced $410 million in financing for the Reko Diq mine itself earlier this week. And its president is due to visit Islamabad next week, the sources said.\nCHINA AND PAKISTAN: 'IRONCLAD FRIENDS'?\nThe sources said the plan is diplomatically tricky but has been squared with China.\n\"We would never do anything to jeopardise that relationship,\" the senior Pakistani official said.\nChina rolled out major power and infrastructure projects after the 2015 launch of the investment programme, known locally as the China-Pakistan Economic Corridor. But momentum has stalled, with the last big project – the Gwadar East Bay Expressway – inaugurated in 2022.\nIslamabad has fallen behind on payments for electricity generated by Chinese-built power plants. And following a government report looking at the cost of the power stations, Islamabad has for the past year sought to reschedule debt payments for the plants.\n\"China and Pakistan are ironclad friends and all-weather strategic cooperative partners,\" China's foreign ministry said on August 19, ahead of a visit by Foreign Minister Wang Yi to Islamabad this week.\nIn Wang's meeting with Pakistan's Prime Minister Shehbaz Sharif on Thursday, both sides said they sought to deepen ties and move on to the next phase of CPEC.\nPAKISTAN'S MINING AMBITIONS\nThe Reko Diq copper and gold mine – at the heart of the government's strategy to attract investment to Pakistan's mining sector – is due to enter production in 2028 with anticipated annual output of some 200,000 metric ton of copper concentrate.\nOne of the world's largest untapped copper deposits, it is Pakistan's largest foreign investment in recent years.\nThe ADB-financed rail upgrade would modernise the track and bridges from the commercial capital Karachi north to Rohri, close to the city of Sukkur, so that diesel trains can run faster, the sources said.\nIn Rohri, the line will meet a branch coming from the area of the Reko Diq mine and will carry the copper concentrate to port.\nTim Cribb, Reko Diq's project director, told Reuters that the government and Barrick would work together on securing financing for the upgrading of the branch coming from the west to Rohri.\nThe mine also faces security concerns, as it lies in the insurgency-hit western province of Balochistan, with militants frequently targeting the rail network.\nAn extensive revamp of 1,800 km (1,118 miles) of railways has been the centrepiece of a $60 billion Chinese investment programme in Pakistan announced in 2015 as part of Beijing's Belt and Road Initiative global infrastructure push.\nA decade of negotiations, however, have yet to produce a finance package for the rail upgrades – the single biggest project under the programme with China. And Pakistan is, meanwhile, struggling to repay Chinese debt owed for other projects.\nThe ADB is in advanced talks to lead the financing of a $2 billion upgrade of a 500-km stretch of the railway line from Karachi to Rohri in the country's south that had previously been part of the Chinese project, two sources with direct knowledge of the discussions told Reuters.\nThe upgrade has become urgent, they said, as it is needed to transport copper ore from the Reko Diq mine currently being developed by Canada's Barrick Mining Corp.\n\"We will have a crisis. How will you evacuate output from Reko Diq? The exhausted line will come under even more pressure,\" one of the sources, a senior government official, said.\nThere was no immediate comment from Pakistan's railways ministry or China's foreign ministry.\nThe ADB would not confirm the finance package, which is being reported for the first time by Reuters. But it said Pakistan's government and the regional lender \"have regular discussions on railway sector development\".\n\"Any potential ADB assistance would be subject to comprehensive due diligence and consideration under ADB's policies and procedures before any commitment is made,\" it wrote in a statement to Reuters.\nThe deal, expected to be announced later this month, would see the ADB lead a consortium to finance the project and bring in an international engineering contractor to carry out the work through a competitive bidding process, the sources said.\nThe ADB announced $410 million in financing for the Reko Diq mine itself earlier this week. And its president is due to visit Islamabad next week, the sources said.\nCHINA AND PAKISTAN: 'IRONCLAD FRIENDS'?\nThe sources said the plan is diplomatically tricky but has been squared with China.\n\"We would never do anything to jeopardise that relationship,\" the senior Pakistani official said.\nChina rolled out major power and infrastructure projects after the 2015 launch of the investment programme, known locally as the China-Pakistan Economic Corridor. But momentum has stalled, with the last big project – the Gwadar East Bay Expressway – inaugurated in 2022.\nIslamabad has fallen behind on payments for electricity generated by Chinese-built power plants. And following a government report looking at the cost of the power stations, Islamabad has for the past year sought to reschedule debt payments for the plants.\n\"China and Pakistan are ironclad friends and all-weather strategic cooperative partners,\" China's foreign ministry said on August 19, ahead of a visit by Foreign Minister Wang Yi to Islamabad this week.\nIn Wang's meeting with Pakistan's Prime Minister Shehbaz Sharif on Thursday, both sides said they sought to deepen ties and move on to the next phase of CPEC.\nPAKISTAN'S MINING AMBITIONS\nThe Reko Diq copper and gold mine – at the heart of the government's strategy to attract investment to Pakistan's mining sector – is due to enter production in 2028 with anticipated annual output of some 200,000 metric ton of copper concentrate.\nOne of the world's largest untapped copper deposits, it is Pakistan's largest foreign investment in recent years.\nThe ADB-financed rail upgrade would modernise the track and bridges from the commercial capital Karachi north to Rohri, close to the city of Sukkur, so that diesel trains can run faster, the sources said.\nIn Rohri, the line will meet a branch coming from the area of the Reko Diq mine and will carry the copper concentrate to port.\nTim Cribb, Reko Diq's project director, told Reuters that the government and Barrick would work together on securing financing for the upgrading of the branch coming from the west to Rohri.\nThe mine also faces security concerns, as it lies in the insurgency-hit western province of Balochistan, with militants frequently targeting the rail network.\n(Edited by : Sheersh Kapoor)\nCheck out our in-depth Market Coverage, Business News & get real-time Stock Market Updates on CNBC-TV18. Also, Watch our channels CNBC-TV18, CNBC Awaaz and CNBC Bajar Live on-the-go!"
    },
    {
      "news_title": "ADB to back Pakistan rail upgrade as China financing stalls, sources say",
      "news_link": "https://www.marketscreener.com/news/adb-to-back-pakistan-rail-upgrade-as-china-financing-stalls-sources-say-ce7c50dad181fe24",
      "bias": "Center",
      "text": "ISLAMABAD (Reuters) -The Asian Development Bank will fund upgrades to part of Pakistan's creaking railway system, replacing China, after prolonged delays in securing financing from Beijing threatened to put a strain on a strategic mining project, two sources said on Friday.\nAn extensive revamp of 1,800 km (1,118 miles) of railways has been the centrepiece of a $60 billion Chinese investment programme in Pakistan announced in 2015 as part of Beijing's Belt and Road Initiative global infrastructure push.\nA decade of negotiations, however, have yet to produce a finance package for the rail upgrades - the single biggest project under the programme with China. And Pakistan is, meanwhile, struggling to repay Chinese debt owed for other projects.\nThe ADB is in advanced talks to lead the financing of a $2 billion upgrade of a 500-km stretch of the railway line from Karachi to Rohri in the country's south that had previously been part of the Chinese project, two sources with direct knowledge of the discussions told Reuters.\nThe upgrade has become urgent, they said, as it is needed to transport copper ore from the Reko Diq mine currently being developed by Canada's Barrick Mining Corp.\n\"We will have a crisis. How will you evacuate output from Reko Diq? The exhausted line will come under even more pressure,\" one of the sources, a senior government official, said.\nThere was no immediate comment from Pakistan's railways ministry or China's foreign ministry.\nThe ADB would not confirm the finance package, which is being reported for the first time by Reuters. But it said Pakistan's government and the regional lender \"have regular discussions on railway sector development\".\n\"Any potential ADB assistance would be subject to comprehensive due diligence and consideration under ADB's policies and procedures before any commitment is made,\" it wrote in a statement to Reuters.\nThe deal, expected to be announced later this month, would see the ADB lead a consortium to finance the project and bring in an international engineering contractor to carry out the work through a competitive bidding process, the sources said.\nThe ADB announced $410 million in financing for the Reko Diq mine itself earlier this week. And its president is due to visit Islamabad next week, the sources said.\nCHINA AND PAKISTAN: 'IRONCLAD FRIENDS'?\nThe sources said the plan is diplomatically tricky but has been squared with China.\n\"We would never do anything to jeopardise that relationship,\" the senior Pakistani official said.\nChina rolled out major power and infrastructure projects after the 2015 launch of the investment programme, known locally as the China-Pakistan Economic Corridor. But momentum has stalled, with the last big project - the Gwadar East Bay Expressway - inaugurated in 2022.\nIslamabad has fallen behind on payments for electricity generated by Chinese-built power plants. And following a government report looking at the cost of the power stations, Islamabad has for the past year sought to reschedule debt payments for the plants.\n\"China and Pakistan are ironclad friends and all-weather strategic cooperative partners,\" China's foreign ministry said on August 19, ahead of a visit by Foreign Minister Wang Yi to Islamabad this week.\nIn Wang's meeting with Pakistan's Prime Minister Shehbaz Sharif on Thursday, both sides said they sought to deepen ties and move on to the next phase of CPEC.\nPAKISTAN'S MINING AMBITIONS\nThe Reko Diq copper and gold mine - at the heart of the government's strategy to attract investment to Pakistan's mining sector - is due to enter production in 2028 with anticipated annual output of some 200,000 metric ton of copper concentrate.\nOne of the world's largest untapped copper deposits, it is Pakistan's largest foreign investment in recent years.\nThe ADB-financed rail upgrade would modernise the track and bridges from the commercial capital Karachi north to Rohri, close to the city of Sukkur, so that diesel trains can run faster, the sources said.\nIn Rohri, the line will meet a branch coming from the area of the Reko Diq mine and will carry the copper concentrate to port.\nTim Cribb, Reko Diq's project director, told Reuters that the government and Barrick would work together on securing financing for the upgrading of the branch coming from the west to Rohri.\nThe mine also faces security concerns, as it lies in the insurgency-hit western province of Balochistan, with militants frequently targeting the rail network.\n(Reporting by Saeed Shah and Ariba Shahid in Islamabad; Editing by Joe Bavier)\nBy Saeed Shah and Ariba Shahid"
    },
    {
      "news_title": "ADB to Back Pakistan Rail Upgrade as China Financing Stalls, Sources Say",
      "news_link": "https://www.usnews.com/news/world/articles/2025-08-22/exclusive-adb-to-back-pakistan-rail-upgrade-as-china-financing-stalls-sources-say",
      "bias": "Lean Left",
      "text": null
    }
  ]
}