{
  "story_id": "GN_20250823_204915_1ec72ef2",
  "metadata": {
    "title": "HHS derecognizing unions representing staffers at CDC, FDA, NIH and more",
    "timestamp": "2025-08-23T20:49:15.617120",
    "url": "https://ground.news/article/hhs-moves-to-strip-thousands-of-federal-health-workers-of-union-rights"
  },
  "bias_distribution": {
    "total_sources": "68",
    "leaning_left": "9",
    "center": "47",
    "leaning_right": "3"
  },
  "perspective_summaries": {
    "left": [
      "The U.S. Department of Health and Human Services has moved to strip thousands of federal health agency employees of their collective bargaining rights, according to a union that called the effort illegal.",
      "HHS officials confirmed that they are ending recognition of unions and reclaiming office space and equipment used for union activities.",
      "HHS spokesman Andrew Nixon stated that the action ensures resources are focused on safeguarding the health and security of the American people.",
      "Officials with the American Federation of Government Employees said tearing up contracts is a disservice to Americans who benefit from their programs and services."
    ],
    "center": [
      "The U.S. Department of Health and Human Services has moved to strip thousands of federal health agency employees of their collective bargaining rights and ending recognition of unions.",
      "The American Federation of Government Employees condemned HHS's action, saying strong union contracts do not hinder responses to public health emergencies and help agencies like the CDC maintain an experienced workforce.",
      "Despite HHS's actions, the union says it remains intact and vowed to keep fighting for its members, some of whom faced layoffs recently including experts in violence prevention."
    ],
    "right": [
      "The U.S. Department of Health and Human Services plans to end union recognition for thousands of federal health agency employees, according to a union statement.",
      "An appeals court allowed the Trump administration to proceed with an order to end collective bargaining rights for federal employees during ongoing lawsuits.",
      "HHS spokesman Andrew Nixon stated, 'This action ensures that HHS resources and personnel are fully focused on safeguarding the health and security of the American people.'",
      "Union officials argue that strong contracts do not hinder effective responses to public health emergencies."
    ]
  },
  "sources": [
    {
      "news_title": "Union representing CDC, NIOSH employees says Trump admin is moving to 'de-recognize' it",
      "news_link": "https://www.wboy.com/news/union-representing-cdc-niosh-employees-says-trump-admin-is-moving-to-de-recognize-it/",
      "bias": "Center",
      "text": null
    },
    {
      "news_title": "Unions cry foul as HHS moves to strip thousands of federal health workers of bargaining rights",
      "news_link": "https://nypost.com/2025/08/22/us-news/unions-cry-foul-as-hhs-moves-to-strip-thousands-of-federal-health-workers-of-bargaining-rights/",
      "bias": "Lean Right",
      "text": "Unions cry foul as HHS moves to strip thousands of federal health workers of bargaining rights\nThe U.S. Department of Health and Human Services has moved to strip thousands of federal health agency employees of their collective bargaining rights, according to a union that called the effort illegal.\nHHS officials confirmed Friday that the department is ending its recognition of unions for a number of employees, and are reclaiming office space and equipment that had been used for union activities.\nIt’s the latest move by the Trump administration to put an end to collective bargaining with unions that represent federal employees.\nPreviously affected agencies include the Department of Veterans Affairs and the Environmental Protection Agency.\nIn May, an appeals court said the administration could move forward with President Donald Trump’s executive order aimed at ending collective bargaining rights for hundreds of thousands of federal employees while a lawsuit plays out.\n“This action ensures that HHS resources and personnel are fully focused on safeguarding the health and security of the American people,” HHS spokesman Andrew Nixon said in a statement.\nOfficials with the American Federation of Government Employees said strong union contracts do not hinder strong responses to public health emergencies.\nRather, they help make agencies like the Centers for Disease Control and Prevention have a stable, experienced and supported workforce, the union said.\nSome CDC employees said the union has been a source of information and advocacy for the agency’s employees during layoffs this year and in the wake of the Aug. 8 attack at the CDC’s main campus in Atlanta.\nSince then, the union has been trying to advocate for a better emergency alert system and better security.\nOther affected agencies include the Food and Drug Administration, the National Institutes of Health, the Administration for Strategic Preparedness and Response, and at the Office of Refugee Resettlement within the Administration for Children and Families."
    },
    {
      "news_title": "HHS Strips Union Voices for Workers at Multiple Agencies",
      "news_link": "https://www.wlsam.com/2025/08/22/hhs-strips-union-voices-for-workers-at-multiple-agencies/",
      "bias": "Right",
      "text": "The Department of Health and Human Services moved to revoke recognition of labor unions representing staff at several agencies, arguing the step would “remove unnecessary obstacles to mission-critical work.”\nThe move affects several offices represented by the National Treasury Employees Union; the American Federation of Government Employees; the National Alliance of Postal and Federal Employees; and the United Automobile, Aerospace, and Agricultural Implement Workers of America, The Hill reported Friday.\n“This action ensures that HHS resources and personnel are fully focused on safeguarding the health and security of the American people,” HHS spokesperson Andrew Nixon told The Hill. “By implementing President [Donald] Trump’s Executive Order 14251, HHS is removing unnecessary obstacles to mission-critical work and space previously used for union activities.\n“This change strengthens our ability to respond rapidly to public health threats, advance national security, and deliver results for the American taxpayer.”\nThe Hill reported Friday’s move will impact, among other areas within HHS, the Office of the Secretary, Office of the General Counsel, the Food and Drug Administration, the Centers for Disease Control and Prevention, the Administration for Strategic Preparedness and Response, the National Institute of Allergy and Infectious Diseases, the National Institutes of Health, the Office of Refugee Resettlement, and the Administration for Children and Families.\nThe move came after HHS this week gave permanent termination notices to 600 CDC employees in the wake of a recent court decision that protected some CDC employees from layoffs but not others.\n“This administration’s illegal and immoral assault on federal workers and their labor unions is punishing hundreds of thousands of dedicated public servants who serve our veterans, ensure the safety of the food we eat and the air we breathe, and now those who protect our public health,” American Federation of Government Employees National President Everett Kelley said in a statement.\n“Tearing up our contracts is a disservice to every American who benefits from the programs and services our members deliver. But let me be clear: Our union isn’t going anywhere.”\nTrump in March signed an executive order that ended collective bargaining for wide swaths of federal employees, as part of his campaign to reshape the federal government’s workforce. The White House in a fact sheet said the Civil Service Reform Act of 1978 gave Trump the authority to halt collective bargaining at agencies with national security missions. It excluded law enforcement.\nEarlier this month, a three-judge panel of the 9th U.S. Circuit Court of Appeals rescinded a district court injunction blocking the Trump administration’s effort to strip hundreds of thousands of workers from engaging in union bargaining with federal agencies. The 9th Circuit ruled that Trump’s executive order on its face “does not express any retaliatory animus,” and it agreed with the Trump administration that the president “would have taken the same action even in the absence of the protected conduct.”\n© 2025 Newsmax. All rights reserved."
    },
    {
      "news_title": "HHS Moves to Strip Thousands of Federal Health Workers of Union Rights",
      "news_link": "https://www.usnews.com/news/health-news/articles/2025-08-22/hhs-moves-to-strip-thousands-of-federal-health-workers-of-union-rights",
      "bias": "Lean Left",
      "text": null
    },
    {
      "news_title": "HHS moves to strip thousands of federal health workers of union rights",
      "news_link": "https://apnews.com/article/hhs-cdc-unions-96ac80031b9c4da4d5f68e3c7fc8d156",
      "bias": "Lean Left",
      "text": "HHS moves to strip thousands of federal health workers of union rights\nNEW YORK (AP) — The U.S. Department of Health and Human Services has moved to strip thousands of federal health agency employees of their collective bargaining rights, according to a union that called the effort illegal.\nHHS officials confirmed Friday that the department is ending its recognition of unions for a number of employees, and are reclaiming office space and equipment that had been used for union activities.\nIt’s the latest move by the Trump administration to put an end to collective bargaining with unions that represent federal employees. Previously affected agencies include the Department of Veterans Affairs and the Environmental Protection Agency.\nIn May, an appeals court said the administration could move forward with President Donald Trump’s executive order aimed at ending collective bargaining rights for hundreds of thousands of federal employees while a lawsuit plays out.\n“This action ensures that HHS resources and personnel are fully focused on safeguarding the health and security of the American people,” HHS spokesman Andrew Nixon said in a statement.\nOfficials with the American Federation of Government Employees said strong union contracts do not hinder strong responses to public health emergencies. Rather, they help make agencies like the Centers for Disease Control and Prevention have a stable, experienced and supported workforce, the union said.\nSome CDC employees said the union has been a source of information and advocacy for the agency’s employees during layoffs this year and in the wake of the Aug. 8 attack at the CDC’s main campus in Atlanta.\nSince then, the union has been trying to advocate for a better emergency alert system and better security.\nOther affected agencies include the Food and Drug Administration, the National Institutes of Health, the Administration for Strategic Preparedness and Response, and at the Office of Refugee Resettlement within the Administration for Children and Families.\n___\nThe Associated Press Health and Science Department receives support from the Howard Hughes Medical Institute’s Science and Educational Media Group and the Robert Wood Johnson Foundation. The AP is solely responsible for all content."
    },
    {
      "news_title": "HHS derecognizing unions representing staffers at CDC, FDA, NIH and more",
      "news_link": "https://thehill.com/homenews/5466412-hhs-de-recognizes-labor-unions/",
      "bias": "Center",
      "text": null
    },
    {
      "news_title": "Union blasts HHS for stripping CDC, NIOSH staff of bargaining rights",
      "news_link": "https://www.krem.com/article/news/nation-world/union-responds-hhs-stripping-cdc-niosh-staff-bargaining-rights/507-260527e8-3553-447c-bd45-c6011f6e8054",
      "bias": "Center",
      "text": "WASHINGTON — The American Federation of Government Employees is condemning the Department of Health and Human Services after the agency moved to strip thousands of workers at the Centers for Disease Control and Prevention and the National Institute for Occupational Safety and Health of their union rights while carrying out sweeping layoffs.\nAFGE National President Everett Kelley called the action “illegal and immoral,” saying in a statement it punishes hundreds of thousands of employees who safeguard public health. “Tearing up our contracts is a disservice to every American who benefits from the programs and services our members deliver. But let me be clear: our union isn’t going anywhere.”\nThe union says HHS notified the press, not unions, that it would decertify bargaining units representing CDC, NIOSH and Food and Drug Administration staff.\nThe move comes as at least 600 CDC employees are receiving final termination notices following an April restructuring. The cuts include experts in violence prevention, some of whom lost jobs less than two weeks after a gunman opened fire at the CDC campus, killing a police officer.\nHHS has said the downsizing is aimed at making agencies more responsive, but union leaders argue gutting contracts and jobs undercuts readiness.\n“Canceling our CBAs and gutting our workforce at the same time weakens CDC’s readiness and makes America less safe and less healthy,” Brendan Demich, vice president of AFGE Local 1916 said in the statement. “You cannot cut capacity, silence workers, and then claim you are strengthening public health. Those two positions contradict each other.”\nDespite HHS’s actions, AFGE leaders say their unions remain intact and vowed to keep fighting for members.\n“Whether or not HHS recognizes us on paper, we will continue standing together, side-by-side as coworkers, to defend our rights and protect the nation’s health,” AFGE Local 3840 Vice President Micah Niemeier-Walsh said."
    }
  ]
}