{
  "story_id": "GN_20250823_215810_89751e6c",
  "metadata": {
    "title": "25 people killed in Gaza as Gaza City becomes the focus of famine and a military offensive",
    "timestamp": "2025-08-23T21:58:10.459543",
    "url": "https://ground.news/article/25-people-killed-in-gaza-as-gaza-city-becomes-the-focus-of-famine-and-a-military-offensive_b881ca"
  },
  "bias_distribution": {
    "total_sources": "80",
    "leaning_left": "22",
    "center": "37",
    "leaning_right": "6"
  },
  "perspective_summaries": {
    "left": [
      "Israeli strikes in Gaza have killed at least 25 people, including displaced civilians, according to medics.",
      "The Integrated Food Security Phase Classification announced that Gaza City is experiencing famine, affecting nearly half a million people.",
      "Doctors Without Borders reported increased patient numbers as civilians flee bombardments in Gaza City.",
      "Israeli Prime Minister Benjamin Netanyahu's office denounced the famine claims, labeling them as lies."
    ],
    "center": [
      "On August 23, 2025, at least 25 Palestinians lost their lives in Gaza due to Israeli attacks involving both airstrikes and shootings, occurring amid worsening famine and ongoing conflict in Gaza City.",
      "The violence follows a 22-month Israeli offensive triggered by Hamas attacks on October 7, 2023, with preparations underway for a possible new military operation in Gaza City.",
      "Reports indicate that around 500,000 individuals in Gaza are experiencing severe hunger due to ongoing blockades and limited humanitarian aid, with displaced populations becoming increasingly at risk amid intensified airstrikes and ground operations.",
      "UNRWA Commissioner-General urged Israel to acknowledge the famine it has caused, while Israel's government rejected the famine report as an 'outright lie' and accused Hamas of starving hostages; grieving relatives pleaded for a truce, saying, 'We want to rest.'",
      "The ongoing humanitarian crisis and military escalation suggest continued civilian suffering, displacement, and international pressure as ceasefire efforts remain on hold awaiting Israel's response."
    ],
    "right": [
      "Eight Palestinians, including two children, died from malnutrition in Gaza, increasing the total famine-related deaths to 281, according to Munir al-Bursh, director general of Gaza’s Health Ministry.",
      "At least 25 Palestinians were killed in recent Israeli attacks across Gaza, including 16 in artillery strikes and others from drone attacks and shootings.",
      "Israel has killed nearly 62,300 Palestinians since October 2023, according to Gaza's Health Ministry.",
      "The International Criminal Court has issued arrest warrants for Benjamin Netanyahu and Yoav Gallant for war crimes in Gaza."
    ]
  },
  "sources": [
    {
      "news_title": "Israeli strikes and gunfire kill 33 as Gaza City becomes focus of famine and a military offensive",
      "news_link": "https://www.reflector.com/news/national/israeli-strikes-and-gunfire-kill-33-as-gaza-city-becomes-focus-of-famine-and-a/article_1db96968-07e5-52d1-a1ec-6174122a184f.html",
      "bias": "Lean Left",
      "text": null
    },
    {
      "news_title": "Israeli strikes around Gaza kill 25 as famine announcement raises pressure",
      "news_link": "https://spectrumlocalnews.com/nyc/all-boroughs/international/2025/08/23/israel-hamas-war-gaza",
      "bias": "Center",
      "text": "KHAN YOUNIS, Gaza Strip — Israeli strikes and gunfire killed at least 25 Palestinians including people sheltering in tents or seeking scarce food Saturday in Gaza, local hospitals said, as a report of famine in Gaza's largest city sparks new pressure on Israel over its 22-month offensive.\nIsrael's defense minister has warned that Gaza City could be destroyed in a new military operation perhaps just days away, even as famine spreads there.\nAid groups have long cautioned that the war, sparked by Hamas' Oct. 7, 2023, attack, and months of Israeli restrictions on food and medical supplies entering Gaza are causing starvation.\nIsrael has rejected the data-based famine declaration as \"an outright lie.\" Ceasefire efforts are on hold as mediators await Israel's next steps.\nIsraeli strikes killed at least 14 people in southern Gaza, more than half of them women and children, according to morgue records and health officials at Nasser Hospital. The officials said the strikes targeted tents sheltering displaced people in Khan Younis.\n\"Awad, why did you leave me?\" a small boy asked his brother's plastic-wrapped body.\nAnother grieving relative, Hekmat Foujo, pleaded for a truce.\n\"We want to rest,\" Foujo said through her tears. ''Have some mercy on us.\"\nIn northern Gaza, Israeli gunfire killed at least five aid-seekers near the Zikim crossing with Israel, where U.N. and other agencies' truck convoys enter the territory, health officials at the Sheikh Radwan field hospital told the AP.\nSix people were killed in attacks elsewhere, according to hospitals and the Palestinian Red Crescent.\nIsrael's military said it was not aware of a strike in Khan Younis at that location and was looking into the other incidents.\nMohamed Saada was among thousands of people who sought food from a delivery in the Zikim area on Saturday — and one of many who left empty-handed.\n\"I came here to bring food for my children but couldn't get anything, due to the huge numbers of people and the difficulty of the situation between the shootings and the trucks running over people,\" he said.\nSome carried sacks of food like lentils and flour. Others carried the wounded, including on a wooden pallet. They navigated fetid puddles and the rubble of war as temperatures reached above 92 degrees Fahrenheit.\nFriday's report by the Integrated Food Security Phase Classification said Gaza City is gripped by famine that is likely to spread if fighting and restrictions on aid continue. It said nearly half a million people in Gaza — about one-fourth of the population — face catastrophic hunger.\nThe rare pronouncement came after Israel imposed a 2 1/2-month blockade on Gaza earlier this year, then resumed some access with a focus on a new U.S.-backed private aid supplier, the Gaza Humanitarian Foundation.\nIn response to global outrage over images of emaciated children, Israel has also allowed airdrops and a new influx of aid by land, but the U.N. and others say it's still far from enough.\nAP journalists have seen chaos on roads leading to aid deliveries, and there have been almost daily reports of Israeli troops firing toward aid-seekers. Israel's military says it fires warning shots if people approach troops or pose a threat.\nIsraeli Prime Minister Benjamin Netanyahu's office asserts it has allowed enough aid to enter during the war, while accusing Hamas of starving the Israeli hostages it holds.\nWith ground troops already active in strategic areas, the military operation in Gaza City could start within days in an area that has hundreds of thousands of civilians.\nAid group Doctors without Borders, or MSF, said its clinics around Gaza City are seeing high numbers of patients as people flee. Caroline Willemen, MSF project coordinator in the city, noted a marked increase in airstrikes since early August.\n\"Those who have not moved are wondering what they should do,\" she told the AP. \"People want to stay, they have been displaced endlessly before, but they also know that at some point it will become very dangerous to remain.\"\nIsrael's military has said troops are operating on the outskirts of Gaza City and in the city's Zeitoun neighborhood. Israel says Gaza City is still a Hamas stronghold, with a network of militant tunnels.\nMany Israelis fear the assault on Gaza City could doom the 20 hostages who are believed to have survived captivity since 2023. A further 30 are thought to be dead. Hundreds of thousands of Israelis protested a week ago for a deal to end the war and bring everyone home.\nNetanyahu said Thursday he had instructed officials to begin immediate negotiations to release hostages and end the war on Israel's terms. It was unclear if Israel would return to talks mediated by the United States, Egypt and Qatar after Hamas said earlier this week it accepted a new proposal from Arab mediators.\nHamas has said it will release hostages in exchange for ending the war, but rejects disarming without the creation of a Palestinian state.\nU.S. President Donald Trump has expressed frustration with Hamas' stance, suggesting the militant group is less interested in making deals with few hostages left alive.\n\"I actually think (the hostages are) safer in many ways if you went in and you really went in fast and you did it,\" Trump told reporters Friday.\nGaza's Health Ministry said at least 62,622 Palestinians have been killed in the war, including missing people now confirmed dead by a special ministry judicial committee.\nThe total number of malnutrition-related deaths rose by eight to 281, the ministry said.\nA small group of Israelis protested against the far-right national security minister, Itamar Ben-Gvir, as he walked to a synagogue in Kfar Malal, north of Tel Aviv. Videos showed the minister arguing with the protesters.\n\"We don't want him in our village. Our message is to bring back the hostages,\" one of the protesters, Boaz Levinstein, told the AP.\nBen-Gvir is a key partner in Netanyahu's political coalition and a staunch opponent of reaching a deal with Hamas, which hostages' families see as the only way to secure the release of loved ones."
    },
    {
      "news_title": "Israeli strikes kill 25 in Gaza as famine announcement raises pressure",
      "news_link": "https://www.wcvb.com/article/israeli-strikes-gaza-famine-announcement-pressure/65877329",
      "bias": "Center",
      "text": "Israeli strikes kill 33 in Gaza as famine announcement raises pressure\nIsraeli strikes and gunfire killed at least 33 Palestinians in Gaza on Saturday, including people sheltering in tents or seeking scarce food, local hospitals said as a famine in Gaza’s largest city sparks new pressure on Israel over its 22-month offensive.\nIsrael's defense minister has warned that Gaza City could be destroyed in a new military operation perhaps just days away, even as famine spreads there.\nAid groups have long warned that the war, sparked by Hamas’ Oct. 7, 2023, attack, and months of Israeli restrictions on food and medical supplies entering Gaza are causing starvation.\nIsrael has rejected the data-based famine declaration as “an outright lie.\"\nHamas recently agreed to the terms for a six-week ceasefire, but hopes for a ceasefire that could forestall the offensive are on hold as mediators await Israel's next steps.\nWomen and children struck and killed in tents\nIsraeli strikes killed at least 17 people in southern Gaza, more than half of them women and children, according to morgue records and health officials at Nasser Hospital. The officials said the strikes targeted tents sheltering displaced people in Khan Younis.\n“Awad, why did you leave me?” a small boy asked his brother's plastic-wrapped body.\nAnother grieving relative, Hekmat Foujo, pleaded for a truce.\n“We want to rest,” Foujo said through her tears. ‘’Have some mercy on us.\"\nIn northern Gaza, Israeli gunfire killed at least five aid-seekers near the Zikim crossing with Israel, where U.N. and other agencies' truck convoys enter the territory, health officials at the Sheikh Radwan field hospital told the AP.\nSix people were killed in attacks elsewhere, according to hospitals and the Palestinian Red Crescent.\nIsrael's military said it was not aware of a strike in Khan Younis at that location and was looking into the other incidents.\nBraving gunfire and crowds for food\nMohamed Saada was among thousands of people who sought food from a delivery in the Zikim area on Saturday — and one of many who left empty-handed.\n“I came here to bring food for my children but couldn’t get anything, due to the huge numbers of people and the difficulty of the situation between the shootings and the trucks running over people,” he said.\nSome carried sacks of food like lentils and flour. Others carried the wounded, including on a wooden pallet. They navigated fetid puddles and the rubble of war as temperatures reached above 92 degrees Fahrenheit.\nFriday's report by the Integrated Food Security Phase Classification said Gaza City is gripped by famine that is likely to spread if fighting and restrictions on aid continue. It said nearly half a million people in Gaza — about one-fourth of the population — face catastrophic hunger.\nThe rare pronouncement came after Israel imposed a 2 1/2-month total blockade on Gaza earlier this year, then resumed some access with a focus on a new U.S.-backed private aid supplier, the Gaza Humanitarian Foundation. Over 1,000 people have been killed near GHF distribution sites.\nIn response to global outrage over images of emaciated children, Israel has also allowed airdrops and a new influx of aid by land, but the U.N. and others say it's still far from enough.\nAP journalists have seen chaos on roads leading to aid deliveries, and there have been almost daily reports of Israeli troops firing toward aid-seekers. Israel's military says it fires warning shots if people approach troops or pose a threat.\nIsraeli Prime Minister Benjamin Netanyahu’s office asserts it has allowed enough aid to enter during the war. It also accuses Hamas of starving the Israeli hostages it holds.\nAn increase in Israeli airstrikes this month\nWith ground troops already active in strategic areas, the military operation in Gaza City could start within days in an area that has hundreds of thousands of civilians.\nAid group Doctors without Borders, or MSF, said its clinics around Gaza City are seeing high numbers of patients as people flee. Caroline Willemen, MSF project coordinator in the city, noted a marked increase in airstrikes since early August.\n“Those who have not moved are wondering what they should do,” she told the AP. “People want to stay; they have been displaced endlessly before, but they also know that at some point, it will become very dangerous to remain.”\nIsrael's military has said troops are operating on the outskirts of Gaza City and in the city’s Zeitoun neighborhood. Israel says Gaza City is still a Hamas stronghold, with a network of militant tunnels.\nCeasefire efforts await Israel's response\nMany Israelis fear the assault on Gaza City could doom the 20 hostages who are believed to have survived captivity since 2023. A further 30 are thought to be dead. Hundreds of thousands of Israelis protested a week ago for a deal to end the war and bring everyone home.\nNetanyahu said Thursday he had instructed officials to begin immediate negotiations to release hostages and end the war on Israel’s terms. It was unclear if Israel would return to talks mediated by the United States, Egypt and Qatar after Hamas said earlier this week it accepted a new proposal from Arab mediators.\nHamas has said it will release hostages in exchange for ending the war, but rejects disarming without the creation of a Palestinian state.\nU.S. President Donald Trump has expressed frustration with Hamas’ stance, suggesting the militant group is less interested in making deals with few hostages left alive.\n“I actually think (the hostages are) safer in many ways if you went in and you really went in fast and you did it,\" Trump told reporters Friday.\nGaza's Health Ministry said at least 62,622 Palestinians have been killed in the war, including missing people now confirmed dead by a special ministry judicial committee.\nThe total number of malnutrition-related deaths rose by eight to 281, the ministry said.\nIsraeli protest against far-right security minister\nA small group of Israelis protested against the far-right national security minister, Itamar Ben-Gvir, as he walked to a synagogue in Kfar Malal, north of Tel Aviv. Videos showed the minister arguing with the protesters.\n“We don’t want him in our village. Our message is to bring back the hostages,” one of the protesters, Boaz Levinstein, told the AP.\nBen-Gvir is a key partner in Netanyahu’s political coalition and a staunch opponent of reaching a deal with Hamas, which hostages’ families see as the only way to secure the release of loved ones.\nMagdy reported from Cairo. Sam Mednick in Jerusalem and Michelle Price in Washington contributed."
    },
    {
      "news_title": "Israeli attacks kill 37 in Gaza as more Palestinians die from starvation",
      "news_link": "https://www.aljazeera.com/news/2025/8/23/israeli-attacks-kill-37-in-gaza-as-more-palestinians-die-from-starvation",
      "bias": "Lean Left",
      "text": "Israeli attacks kill 51 in Gaza as more Palestinians die from starvation\nHealth authorities say eight more people, including two children, die from malnutrition after famine declared in Gaza.\nAt least 51 Palestinians, including 16 seeking aid, have been killed in Israeli attacks across Gaza, medical sources told Al Jazeera, as health authorities in the besieged territory recorded eight more deaths from malnutrition amid a deepening hunger crisis.\nIsraeli artillery shelled tents sheltering displaced families in the Asdaa area northwest of Khan Younis in southern Gaza, killing 16 people, including six children, on Saturday, according to medical sources.\nRecommended Stories\nlist of 4 itemsFamine in Gaza is a “war crime of starvation”\nWorld reacts as UN-backed body declares famine in Gaza\nDutch foreign minister resigns over Israel sanctions deadlock\nIn central Gaza, two people were killed in an Israeli drone strike on a house in the Maghazi refugee camp.\nA Palestinian was shot dead by Israeli forces while waiting for aid near a distribution point close to the so-called “Morag axis”, southeast of Khan Younis.\nAnother civilian seeking aid was shot dead near the Israeli-controlled Netzarim Corridor.\nStarvation deaths\nPalestinian health authorities said on Saturday that eight more Palestinians, including two children, died from malnutrition over the past 24 hours, raising the total death toll to 281 since the onset of the humanitarian crisis.\nMunir al-Bursh, the director-general of Gaza’s Health Ministry, said on social media that 114 children were among the victims.\n“The famine is silently ravaging the bodies of civilians, depriving children of their right to life, and turning tents and hospitals into daily scenes of tragedy,” he added.\nThe United Nations on Friday officially declared a famine in Gaza, the first time it has done so in the Middle East, with experts warning 500,000 people face “catastrophic” hunger.\nThe UN has accused Israel of “systematic obstruction” of aid deliveries to the war-ravaged Palestinian territory, and Secretary-General Antonio Guterres described the famine as a “man-made disaster”.\nThe Integrated Food Security Phase Classification (IPC) system, a global hunger monitor, said 514,000 people – close to a quarter of Palestinians in Gaza – are experiencing famine, with the number due to rise to 641,000 by the end of September.\nReporting from Deir el-Balah, Al Jazeera’s Hind Khoudary said many other Palestinians in Gaza were at risk from malnutrition.\n“The UN famine report has been very late, according to Palestinians. They have been witnessing weeks and months of this ongoing starvation,” she said.\n‘Engineering of starvation’\nThe Palestinian Health Ministry in Gaza said on Saturday that it “appreciates” the declaration of famine in the enclave, although it believes the announcement was late.\n“We emphasise that the engineering of starvation is one aspect of the chapters of genocide, which also include the systematic destruction of the health sector and other sectors, mass killing, and the policy of exterminating generations,” the ministry wrote in a statement on Telegram.\nSince May 27, Israel has enforced a unilateral aid delivery mechanism through the so-called “Gaza Humanitarian Foundation,” backed by Israel and the US but rejected by the UN and major relief groups.\nAccording to Gaza’s Health Ministry, more than 2,076 Palestinians have been killed and more than 15,300 people wounded while seeking aid since the GHF scheme was launched.\nIsrael has killed more than 62,600 Palestinians in Gaza since the Hamas-led October 2023 attack on southern Israel."
    },
    {
      "news_title": "New Israeli strikes around Gaza kill 25 as famine announcement raises pressure",
      "news_link": "https://www.cbsnews.com/news/israel-gaza-strikes-famine-announcement/",
      "bias": "Lean Left",
      "text": "New Israeli strikes around Gaza kill 25 as famine announcement raises pressure\nPalestinians sheltering in tents or seeking scarce food aid were among at least 25 people killed by Israeli strikes and shootings Saturday in Gaza, according to local hospitals, as the world confronted an exceptional announcement that famine is now gripping Gaza's largest city.\nThe famine determination by the world's leading authority on food crises galvanized governments and aid groups to intensify pleas for Israel to halt its 22-month offensive on Gaza, prompted by Hamas' Oct. 7, 2023, attacks. Aid groups have warned for months that the war and Israel's restrictions of food into Gaza are causing starvation among civilians.\nIsrael denounced the famine declaration as lies and the military is pressing ahead with preparations to seize Gaza City. Efforts toward a ceasefire that could forestall the offensive are on hold as mediators await Israel's next steps.\nIsraeli strikes killed at least 14 people in the southern Gaza Strip early Saturday, according to morgue records and health officials at Nasser Hospital. The officials said the strikes targeted tents sheltering displaced people in Khan Younis, which became home to hundreds of thousands who had fled from elsewhere in Gaza. More than half of the dead were women and children.\nAwad Abu Agala, uncle of two children who died, said no place in Gaza is now safe.\n\"The entire Gaza Strip is being bombed ... In the south. In the north. Everywhere,\" Abu Agala told The Associated Press, saying the children were targeted overnight while in their tents.\nA grieving relative, Hekmat Foujo, pleaded for a truce.\n\"We want to rest,\" Foujo said, fighting through her tears. ''Have some mercy on us.''\nIn northern Gaza, Israeli gunfire killed at least five aid-seekers Saturday near the Zikim crossing with Israel, where U.N. and other agencies' convoys enter the enclave, health officials at the Sheikh Radwan field hospital told the AP.\nSix people were killed in other attacks on Gaza elsewhere Saturday, according to hospitals and the Palestinian Red Crescent.\nThe Israeli military did not immediately respond to questions about the deaths.\nA famine announcement ups the pressure\nA report by the Integrated Food Security Phase Classification, or IPC, said Friday that Gaza City is gripped by famine that is likely to spread if fighting and restrictions on humanitarian aid continue.\nIt was a highly rare pronouncement by the group, its first in the Middle East, and came after Israel imposed a 2 1/2-month blockade on Gaza earlier this year, then eased access with a focus on a new U.S.-backed private aid supplier, the Gaza Humanitarian Foundation, or GHF.\nIn response to global outrage over images of emaciated children, Israel in recent weeks has allowed airdrops and a new influx of aid entering by land, but U.N. and other aid agencies say the quantity of food reaching Gaza is still insufficient.\nAP journalists have seen chaos and security problems on roads leading to aid delivery points, and there have been reports of Israeli troops firing toward aid-seekers. Israel's military says they fire warning shots if individuals approach the troops or pose a threat to soldiers.\nThe IPC said nearly half a million people in Gaza, about one-fourth of the population, face catastrophic hunger that leaves many at risk of dying. It said hunger has been magnified by widespread displacement and the collapse of food production.\nNetanyahu's office denounced the IPC report as \"an outright lie,'' and accuses Hamas of starving the hostages. Israel says it has allowed enough aid to enter during the war.\nActivity is escalating ahead of Gaza City offensive\nWith ground troops already active on the edges of Gaza City, a wide-scale operation there could start within days.\nAid group Doctors without Borders, or MSF, said Saturday its clinics around Gaza City are seeing high numbers of patients as people flee recent bombardments. The group said in a statement that \"strikes are forcing people, including MSF staff, to flee their homes once again, and we are seeing displacement across Gaza City.\"\nThe Israeli military has said troops are operating on the outskirts of Gaza City and in the city's Zeitoun neighborhood.\nIsrael says Gaza City is still a Hamas stronghold, with a network of militant tunnels. The city also is home to hundreds of thousands of civilians, some of whom have fled from elsewhere.\nCeasefire efforts await Israel's response\nMany Israelis fear the assault on Gaza City could doom the roughly 20 hostages who have survived captivity since 2023.\nNetanyahu said Thursday he had instructed officials to begin immediate negotiations to release hostages and end the war on Israel's terms. It is unclear if Israel will return to long-running talks mediated by the United States, Egypt and Qatar after Hamas said earlier this week that it accepted a new proposal from the Arab mediators.\nHamas has said it would release captives in exchange for ending the war, but rejects disarmament without the creation of a Palestinian state.\nU.S. President Donald Trump expressed frustration with Hamas' stance, suggesting the militant group was less interested in making deals to release hostages with so few left alive.\n\"The situation has to end. It's extortion, and it has to end,\" Trump told reporters Friday. \"I actually think (the hostages are) safer in many ways if you went in and you really went in fast and you did it.\"\nGaza's Health Ministry said Saturday that at least 62,622 people have been killed since the war began, including missing people now confirmed dead by a special ministry judicial committee.\nThe total number of malnutrition-related deaths rose by eight to 281, the ministry said.\nIsraeli protest against far-right security minister\nA small group of Israelis protested against the far-right national security minister, Itamar Ben-Gvir, as he walked to a synagogue in Kfar Malal, north of Tel Aviv. Videos showed the minister arguing with the protesters.\n\"We don't want him in our village. Our message is to bring back the hostages,\" one of the protesters, Boaz Levinstein, told the AP.\nBen-Gvir is a key partner in Netanyahu's political coalition and a staunch opponent of reaching a deal with Hamas, which hostages' families see as the only way to secure the release of loved ones."
    },
    {
      "news_title": "Israeli strikes in Gaza kill 25; famine announcement raises pressure",
      "news_link": "https://dnyuz.com/2025/08/23/israeli-strikes-in-gaza-kill-25-famine-announcement-raises-pressure/",
      "bias": "Lean Right",
      "text": "Palestinians sheltering in tents or seeking scarce food aid were among at least 25 people killed by Israeli strikes and shootings Saturday in Gaza, according to local hospitals, as the world confronted an exceptional announcement that famine is now gripping Gaza’s largest city.\nThe famine determination by the world’s leading authority on food crises galvanized governments and aid groups to intensify pleas for Israel to halt its 22-month offensive on Gaza, prompted by Hamas’ Oct. 7, 2023, attacks. Aid groups have warned for months that the war and Israel’s restrictions of food into Gaza are causing starvation among civilians.\nIsrael denounced the famine declaration as lies and the military is pressing ahead with preparations to seize Gaza City. Efforts toward a ceasefire that could forestall the offensive are on hold as mediators await Israel’s next steps.\nIsraeli strikes killed at least 14 people in the southern Gaza Strip early Saturday, according to morgue records and health officials at Nasser Hospital. The officials said the strikes targeted tents sheltering displaced people in Khan Younis, which became home to hundreds of thousands who had fled from elsewhere in Gaza. More than half of the dead were women and children.\nAwad Abu Agala, uncle of two children who died, said no place in Gaza is now safe.\n“The entire Gaza Strip is being bombed … In the south. In the north. Everywhere,” Abu Agala told The Associated Press, saying the children were targeted overnight while in their tents.\nA grieving relative, Hekmat Foujo, pleaded for a truce.\n“We want to rest,” Foujo said, fighting through her tears. ”Have some mercy on us.”\nIn northern Gaza, Israeli gunfire killed at least five aid-seekers Saturday near the Zikim crossing with Israel, where U.N. and other agencies’ convoys enter the enclave, health officials at the Sheikh Radwan field hospital told the AP.\nSix people were killed in other attacks on Gaza elsewhere Saturday, according to hospitals and the Palestinian Red Crescent.\nThe Israeli military did not immediately respond to questions about the deaths.\nA famine announcement ups the pressure\nA report by the Integrated Food Security Phase Classification, or IPC, said Friday that Gaza City is gripped by famine that is likely to spread if fighting and restrictions on humanitarian aid continue.\nIt was a highly rare pronouncement by the group, its first in the Middle East, and came after Israel imposed a 2 1/2-month blockade on Gaza earlier this year, then eased access with a focus on a new U.S.-backed private aid supplier, the Gaza Humanitarian Foundation, or GHF.\nIn response to global outrage over images of emaciated children, Israel in recent weeks has allowed airdrops and a new influx of aid entering by land, but U.N. and other aid agencies say the quantity of food reaching Gaza is still insufficient.\nAP journalists have seen chaos and security problems on roads leading to aid delivery points, and there have been reports of Israeli troops firing toward aid-seekers. Israel’s military says they fire warning shots if individuals approach the troops or pose a threat to soldiers.\nThe IPC said nearly half a million people in Gaza, about one-fourth of the population, face catastrophic hunger that leaves many at risk of dying. It said hunger has been magnified by widespread displacement and the collapse of food production.\nNetanyahu’s office denounced the IPC report as “an outright lie,” and accuses Hamas of starving the hostages. Israel says it has allowed enough aid to enter during the war.\nActivity is escalating ahead of Gaza City offensive\nWith ground troops already active on the edges of Gaza City, a wide-scale operation there could start within days.\nAid group Doctors without Borders, or MSF, said Saturday its clinics around Gaza City are seeing high numbers of patients as people flee recent bombardments. The group said in a statement that “strikes are forcing people, including MSF staff, to flee their homes once again, and we are seeing displacement across Gaza City.”\nThe Israeli military has said troops are operating on the outskirts of Gaza City and in the city’s Zeitoun neighborhood.\nIsrael says Gaza City is still a Hamas stronghold, with a network of militant tunnels. The city also is home to hundreds of thousands of civilians, some of whom have fled from elsewhere.\nCeasefire efforts await Israel’s response\nMany Israelis fear the assault on Gaza City could doom the roughly 20 hostages who have survived captivity since 2023.\nNetanyahu said Thursday he had instructed officials to begin immediate negotiations to release hostages and end the war on Israel’s terms. It is unclear if Israel will return to long-running talks mediated by the United States, Egypt and Qatar after Hamas said earlier this week that it accepted a new proposal from the Arab mediators.\nHamas has said it would release captives in exchange for ending the war, but rejects disarmament without the creation of a Palestinian state.\nU.S. President Donald Trump expressed frustration with Hamas’ stance, suggesting the militant group was less interested in making deals to release hostages with so few left alive.\n“The situation has to end. It’s extortion, and it has to end,” Trump told reporters Friday. “I actually think (the hostages are) safer in many ways if you went in and you really went in fast and you did it.”\nThe post Israeli strikes in Gaza kill 25; famine announcement raises pressure appeared first on CBS News."
    },
    {
      "news_title": "At least 25 killed in Israeli strikes in Gaza, say medics",
      "news_link": "https://www.rte.ie/news/2025/0823/1529819-gaza-israel-strikes/",
      "bias": "Center",
      "text": "Palestinians sheltering in tents or seeking food were among at least 25 people killed by Israeli strikes and shootings in Gaza, medics have said.\nIsraeli strikes killed at least 14 people in southern Gaza early this morning, according to morgue records and health officials at Nasser Hospital.\nThe officials said the strikes targeted tents sheltering displaced people in Khan Younis, which became home to hundreds of thousands who had fled from elsewhere in Gaza. More than half of the dead were women and children.\nIn northern Gaza, Israeli gunfire killed at least five people seeking aid near the Zikim crossing with Israel, where the UN and other agencies' convoys enter the enclave, health officials at the Sheikh Radwan field hospital said.\nSix people were killed in other attacks on Gaza elsewhere, the Palestinian Red Crescent said.\nThe Israeli military did not immediately respond to questions about the deaths.\nWatch: Smoke billows in Deir Al Balah following Israeli airstrike\nThe strikes come a day after a UN-backed global hunger monitor announced that famine is now gripping the enclave’s largest city.\nThe famine determination by the world’s leading authority on food crises has galvanised governments and aid groups to intensify their pleas for Israel to halt its 22-month offensive on Gaza.\nAid groups have warned for months that the war and Israel’s restrictions of food into Gaza are causing starvation among civilians.\nIsrael denounced the famine declaration as lies and the military is pressing ahead with preparations to seize Gaza City.\nEfforts toward a ceasefire that could forestall the offensive are on hold as mediators await Israel’s next steps.\nThe report by the Integrated Food Security Phase Classification (IPC) said Gaza City is gripped by famine that it is likely to spread if fighting and restrictions on humanitarian aid continue.\nIt was a rare pronouncement by the group, its first in the Middle East, and came after Israel imposed a two-and-a-half-month blockade on Gaza earlier this year, then eased access with a focus on a new US-backed private aid supplier, the Gaza Humanitarian Foundation (GHF).\nIn response to global outrage over images of emaciated children, Israel in recent weeks has allowed airdrops and a new influx of aid entering by land, but the UN and other aid agencies say the food reaching Gaza is still not nearly enough.\nJournalists have seen chaos and security problems on roads leading to aid deliveries, and there have been reports of Israeli troops firing towards people seeking aid.\nIsrael’s military says warning shots are fired if individuals approach the troops or pose a threat to soldiers.\nThe IPC said nearly half a million people in Gaza, about a quarter of the population, face catastrophic hunger that leaves many at risk of dying. It said hunger has been magnified by widespread displacement and the collapse of food production.\nRead more:\nIsraeli prime minister Benjamin Netanyahu’s office denounced the IPC report as \"an outright lie\", and accused Hamas of starving hostages. Israel says it has allowed enough aid to enter during the war.\nWith ground troops already active in strategic areas, the widescale operation in Gaza City could start within days.\nAid group Doctors without Borders (MSF) has said its clinics around Gaza City are seeing high numbers of patients as people flee recent bombardments.\nThe group said in a statement that \"strikes are forcing people, including MSF staff, to flee their homes once again, and we are seeing displacement across Gaza City″.\nThe Israeli military has said troops are operating on the outskirts of Gaza City and in the city’s Zeitoun area.\nAccreditation: AP"
    },
    {
      "news_title": "Latest Israeli strikes kill 25 around Gaza as famine announcement raises pressure",
      "news_link": "https://www.stuff.co.nz/world-news/360801037/latest-israeli-strikes-kill-25-around-gaza-famine-announcement-raises-pressure",
      "bias": "Lean Left",
      "text": null
    },
    {
      "news_title": "Israeli strikes in Gaza as famine call raises pressure",
      "news_link": "https://www.canberratimes.com.au/story/9048179/israeli-strikes-in-gaza-as-famine-call-raises-pressure/",
      "bias": "Lean Left",
      "text": "Palestinians sheltering in tents or seeking scarce food aid are among at least 25 people killed by Israeli strikes and shootings in Gaza, according to local hospitals, as the world confronts an exceptional announcement that famine now grips Gaza's largest city.\nSubscribe today for the news that matters\nor signup to continue reading\nThe famine determination by the world's leading authority on food crises galvanised governments and aid groups to intensify pleas for Israel to halt its 22-month offensive on Gaza, prompted by Hamas's October 7, 2023, attacks.\nAid groups have warned for months that the war and Israel's restrictions of food into Gaza are causing starvation among civilians.\nIsrael denounced the famine declaration as lies and the military is pressing ahead with preparations to seize Gaza City.\nEfforts towards a ceasefire that could forestall the offensive are on hold as mediators await Israel's next steps.\nIsraeli strikes killed at least 14 people in the southern Gaza Strip early on Saturday, according to morgue records and health officials at Nasser Hospital.\nThe officials said the strikes targeted tents sheltering displaced people in Khan Younis, which became home to hundreds of thousands who had fled from elsewhere in Gaza.\nMore than half of the dead were women and children.\nIn northern Gaza, Israeli gunfire killed at least five aid-seekers on Saturday near the Zikim crossing with Israel, where UN and other agencies' convoys enter the enclave, health officials at the Sheikh Radwan field hospital told the AP.\nSix people were killed in other attacks on Gaza elsewhere on Saturday, according to hospitals and the Palestinian Red Crescent.\nThe Israeli military did not immediately respond to questions about the deaths.\nA report by the Integrated Food Security Phase Classification, or IPC, said on Friday that Gaza City was gripped by famine that was likely to spread if fighting and restrictions on humanitarian aid continued.\nIt was a highly rare pronouncement by the group, its first in the Middle East.\nIt came after Israel imposed a two-and-a-half-month blockade on Gaza earlier in 2025, then eased access with a focus on a new US-backed private aid supplier, the Gaza Humanitarian Foundation, or GHF.\nIn response to global outrage over images of emaciated children, Israel in recent weeks has allowed airdrops and a new influx of aid entering by land, but UN and other aid agencies say the food reaching Gaza is still not nearly enough.\nThe IPC said nearly half a million people in Gaza, about a quarter of the population, face catastrophic hunger that leaves many at risk of dying.\nHunger had been magnified by widespread displacement and the collapse of food production, it said.\nNetanyahu's office denounced the IPC report as \"an outright lie\", and accuses Hamas of starving the hostages.\nIsrael says it has allowed enough aid to enter during the war.\nWith ground troops already active in strategic areas, the wide-scale operation in Gaza City could start within days.\nThe Israeli military has said troops are operating on the outskirts of Gaza City and in the city's Zeitoun neighbourhood.\nIsrael says Gaza City is still a Hamas stronghold, with a network of militant tunnels.\nThe city also is home to hundreds of thousands of civilians, some of whom have fled from elsewhere.\nMany Israelis fear the assault on Gaza City could doom the roughly 20 hostages who have survived captivity since 2023.\nNetanyahu said on Thursday he had instructed officials to begin immediate negotiations to release hostages and end the war on Israel's terms.\nIt is unclear if Israel will return to long-running talks mediated by the United States, Egypt and Qatar after Hamas said earlier this week that it accepted a new proposal from the Arab mediators.\nHamas has said it would release captives in exchange for ending the war, but rejects disarmament without the creation of a Palestinian state.\nAustralian Associated Press"
    },
    {
      "news_title": "Deadly Israeli strikes hit Gaza as famine announcement raises pressure",
      "news_link": "https://www.irishnews.com/news/world/deadly-israeli-strikes-hit-gaza-as-famine-announcement-raises-pressure-HJ7BTP5LNRKUFAE3SHV3MABZ5Q/",
      "bias": "Lean Left",
      "text": "Palestinians sheltering in tents or seeking food were among at least 33 people killed by Israeli strikes and shootings in Gaza, medics said, as the world confronts an exceptional announcement that famine is now gripping its largest city.\nThe famine determination by the world’s leading authority on food crises galvanised governments and aid groups to intensify their pleas for Israel to halt its 22-month offensive on Gaza, prompted by Hamas’ attacks on October 7 2023.\nAid groups have warned for months that the war and Israel’s restrictions of food into Gaza are causing starvation among civilians.\n\"It’s time for the Government of Israel to stop denying the famine it has created in #Gaza.\nAll of those who have influence must use it with determination and a sense of moral duty.\nEvery hour counts.\"\n— UNRWA Commissioner-General @UNLazzarini pic.twitter.com/g6tng6LxCr\n— UNRWA (@UNRWA) August 23, 2025\nIsrael denounced the famine declaration as lies and the military is pressing ahead with preparations to seize Gaza City.\nEfforts toward a ceasefire that could forestall the offensive are on hold as mediators await Israel’s next steps.\nIsraeli strikes killed at least 17 people in the southern Gaza Strip early on Saturday, according to morgue records and health officials at Nasser Hospital.\nThe officials said the strikes targeted tents sheltering displaced people in Khan Younis, which became home to hundreds of thousands who had fled from elsewhere in Gaza. More than half of the dead were women and children.\nIn northern Gaza, Israeli gunfire killed at least five aid-seekers on Saturday near the Zikim crossing with Israel, where the UN and other agencies’ convoys enter the enclave, health officials at the Sheikh Radwan field hospital said.\nEleven people were killed in other attacks on Gaza elsewhere on Saturday, according to hospitals and the Palestinian Red Crescent.\nIsrael’s military said it was not aware of a strike in Khan Younis at that location and was looking into the other incidents.\n🔴 #GazaStrip#Famine is confirmed in #Gaza Governorate, projected to expand to Deir al-Balah and Khan Younis Governorates by the end of September.\nAfter 22 months of relentless conflict, over half a million people in the Gaza Strip are facing #starvation, #destitution and… pic.twitter.com/y11HIxBNMt\n— The Integrated Food Security Phase Classification (@theIPCinfo) August 22, 2025\nOn Friday, a report by the Integrated Food Security Phase Classification (IPC) said Gaza City is gripped by famine that is likely to spread if fighting and restrictions on humanitarian aid continue.\nIt was a rare pronouncement by the group, its first in the Middle East, and came after Israel imposed a two-and-a-half-month blockade on Gaza earlier this year, then eased access with a focus on a new US-backed private aid supplier, the Gaza Humanitarian Foundation (GHF).\nIn response to global outrage over images of emaciated children, Israel in recent weeks has allowed airdrops and a new influx of aid entering by land, but UN and other aid agencies say the food reaching Gaza is still not nearly enough.\nJournalists have seen chaos and security problems on roads leading to aid deliveries, and there have been reports of Israeli troops firing towards people seeking aid.\nIsrael’s military says warning shots are fired if individuals approach the troops or pose a threat to soldiers.\nThe IPC said nearly half a million people in Gaza, about a quarter of the population, face catastrophic hunger that leaves many at risk of dying. It said hunger has been magnified by widespread displacement and the collapse of food production.\nIsraeli prime minister Benjamin Netanyahu’s office denounced the IPC report as “an outright lie”, and accuses Hamas of starving the hostages. Israel says it has allowed enough aid to enter during the war.\nWith ground troops already active in strategic areas, the widescale operation in Gaza City could start within days.\nAid group Doctors without Borders (MSF) said on Saturday its clinics around Gaza City are seeing high numbers of patients as people flee recent bombardments.\nThe group said in a statement that “strikes are forcing people, including MSF staff, to flee their homes once again, and we are seeing displacement across Gaza City″.\nThe Israeli military has said troops are operating on the outskirts of Gaza City and in the city’s Zeitoun area."
    },
    {
      "news_title": "25 killed in new Israeli strikes as famine threatens Gaza",
      "news_link": "https://www.scmp.com/news/world/middle-east/article/3322928/israel-launches-deadly-strikes-across-gaza-killing-25-famine-threatens-enclave",
      "bias": "Center",
      "text": "Israel launches deadly strikes across Gaza, killing 25 as famine threatens enclave\nThe military escalation comes as mediators await a response from Israel to a ceasefire proposal that Hamas has already accepted\nPalestinians sheltering in tents or seeking scarce food aid were among at least 25 people killed by Israeli strikes and shootings on Saturday in Gaza, according to local hospitals, as the world confronted an exceptional announcement that famine is now gripping Gaza’s largest city.\nThe famine determination by the world’s leading authority on food crises galvanised governments and aid groups to intensify pleas for Israel to halt its 22-month offensive on Gaza, prompted by Hamas’ October 7, 2023, attacks. Aid groups have warned for months that the war and Israel’s restrictions on food into Gaza are causing starvation among civilians.\nIsrael denounced the famine declaration as lies, and the military is pressing ahead with preparations to seize Gaza City. Efforts towards a ceasefire that could forestall the offensive are on hold as mediators await Israel’s next steps.\nGaza hospitals take in new dead and wounded\nIsraeli strikes killed at least 14 people in the southern Gaza Strip early on Saturday, according to morgue records and health officials at Nasser Hospital. The officials said the strikes targeted tents sheltering displaced people in Khan Younis, which became home to hundreds of thousands who had fled from elsewhere in Gaza. More than half of the dead were women and children.\nAwad Abu Agala, uncle of two children who died, said no place in Gaza is now safe.\n“The entire Gaza Strip is being bombed … In the south. In the north. Everywhere,” Abu Agala said, adding that children were targeted overnight while in their tents.\nA grieving relative, Hekmat Foujo, pleaded for a truce."
    },
    {
      "news_title": "25 people killed in Gaza as Gaza City becomes the focus of famine and a military offensive",
      "news_link": "https://apnews.com/article/israel-palestinians-hamas-gaza-war-hostages-08-23-2025-7b138340106e247f9da13293ef8cf8e7",
      "bias": "Lean Left",
      "text": "Israeli strikes and gunfire kill 33 as Gaza City becomes focus of famine and a military offensive\nIsraeli strikes and gunfire kill 33 as Gaza City becomes focus of famine and a military offensive\nKHAN YOUNIS, Gaza Strip (AP) — Israeli strikes and gunfire killed at least 33 Palestinians in Gaza on Saturday, including people sheltering in tents or seeking scarce food, local hospitals said as a famine in Gaza’s largest city sparks new pressure on Israel over its 22-month offensive.\nIsrael’s defense minister has warned that Gaza City could be destroyed in a new military operation perhaps just days away, even as famine spreads there.\nAid groups have long warned that the war, sparked by Hamas’ Oct. 7, 2023, attack, and months of Israeli restrictions on food and medical supplies entering Gaza are causing starvation.\nIsrael has rejected the data-based famine declaration as “an outright lie.” Ceasefire efforts are on hold as mediators await Israel’s next steps.\nWomen and children struck and killed in tents\nIsraeli strikes killed at least 17 people in southern Gaza, more than half of them women and children, according to morgue records and health officials at Nasser Hospital. The officials said the strikes targeted tents sheltering displaced people in Khan Younis.\n“Awad, why did you leave me?” a small boy asked his brother’s plastic-wrapped body.\nAnother grieving relative, Hekmat Foujo, pleaded for a truce.\n“We want to rest,” Foujo said through her tears. ‘’Have some mercy on us.”\nIn northern Gaza, Israeli gunfire killed at least five aid-seekers near the Zikim crossing with Israel, where U.N. and other truck convoys enter the territory, health officials at Sheikh Radwan field hospital told the AP.\nEleven people were killed in attacks elsewhere, according to hospitals and the Palestinian Red Crescent.\nIsrael’s military said it was not aware of a strike in Khan Younis at that location and was looking into the other incidents.\nBraving gunfire and crowds for food\nMohamed Saada was among thousands seeking food from a delivery in the Zikim area on Saturday — and one of many who left empty-handed.\n“I came here to bring food for my children but couldn’t get anything, due to the huge numbers of people and the difficulty of the situation between the shootings and the trucks running over people,” he said.\nSome carried sacks of food like lentils and flour. Others carried the wounded, including on a wooden pallet. They navigated fetid puddles and the rubble of war as temperatures reached above 92 degrees Fahrenheit (33 Celsius).\nFriday’s report by the Integrated Food Security Phase Classification said famine in Gaza City is likely to spread if fighting and restrictions on aid continue. It said nearly half a million people — about one-fourth of Gaza’s population — face catastrophic hunger.\nThe rare pronouncement came after Israel imposed a 2 1/2-month blockade on Gaza earlier this year, then resumed some access with a focus on a new U.S.-backed private aid supplier, the Gaza Humanitarian Foundation.\nIn response to global outrage over images of emaciated children, Israel has also allowed airdrops and new deliveries by land, but the U.N. and others say it’s still far from enough.\nAP journalists have seen chaos on roads leading to aid deliveries, and there have been almost daily reports of Israeli troops firing toward aid-seekers. Israel’s military says it fires warning shots if people approach troops or pose a threat.\nIsraeli Prime Minister Benjamin Netanyahu’s office asserts it has allowed enough aid to enter during the war, while accusing Hamas of starving the hostages it holds.\nAn increase in Israeli airstrikes this month\nWith ground troops already active in strategic areas, the military operation in Gaza City could start within days in an area that has hundreds of thousands of civilians.\nAid group Doctors without Borders, or MSF, said its clinics around Gaza City see high numbers of patients as people flee. Caroline Willemen, MSF project coordinator there, noted a marked increase in airstrikes since early August.\n“Those who have not moved are wondering what they should do,” she told the AP. “People want to stay, they have been displaced endlessly before, but they also know that at some point it will become very dangerous to remain.”\nIsrael’s military has said troops are operating on the outskirts of Gaza City and in its Zeitoun neighborhood. Israel says Gaza City is still a Hamas stronghold, with a network of militant tunnels.\nCeasefire efforts await Israel’s response\nMany Israelis fear the assault on Gaza City could doom the 20 hostages who are believed to have survived since 2023. Another 30 are thought to be dead. Hundreds of thousands of Israelis protested a week ago for a deal to end the fighting and bring everyone home.\nNetanyahu said Thursday he had instructed officials to begin immediate negotiations to release hostages and end the war on Israel’s terms. It was unclear if Israel would return to talks mediated by the United States, Egypt and Qatar after Hamas said it accepted a new proposal from Arab mediators.\nHamas has said it will release hostages in exchange for ending the war, but rejects disarming without the creation of a Palestinian state.\nU.S. President Donald Trump has expressed frustration with Hamas’ stance, suggesting the militant group is less interested in making deals with few hostages left alive.\n“I actually think (the hostages are) safer in many ways if you went in and you really went in fast and you did it,” Trump told reporters Friday.\nGaza’s Health Ministry said at least 62,622 Palestinians have been killed in the war, including missing people now confirmed dead by a special ministry judicial committee.\nThe number of malnutrition-related deaths rose by eight to 281, the ministry said.\nIsraeli protest against far-right security minister\nA small group of Israelis protested against the far-right national security minister, Itamar Ben-Gvir, as he walked to a synagogue in Kfar Malal, north of Tel Aviv. Videos showed the minister arguing with the protesters.\n“We don’t want him in our village. Our message is to bring back the hostages,” one of the protesters, Boaz Levinstein, told the AP.\nBen-Gvir is a key partner in Netanyahu’s political coalition and a staunch opponent of reaching a deal with Hamas, which hostages’ families see as the only way to secure the release of loved ones.\n___\nMagdy reported from Cairo. Associated Press writers Sam Mednick in Jerusalem and Michelle Price in Washington contributed to this report.\n___\nFollow AP’s war coverage at https://apnews.com/hub/israel-hamas-war"
    },
    {
      "news_title": "Gaza famine claims 8 more lives in 24 hours, including 2 children",
      "news_link": "https://www.aa.com.tr/en/middle-east/gaza-famine-claims-8-more-lives-in-24-hours-including-2-children/3667079",
      "bias": "Right",
      "text": "Gaza famine claims 8 more lives in 24 hours, including 2 children\nDeath toll from Israeli-imposed famine rises to 281, including 114 children, since start of crisis, says Health Ministry\nANKARA\nEight more Palestinians, including two children, died from malnutrition caused by the Israeli blockade in Gaza over the past 24 hours, raising the total death toll to 281 since the onset of the humanitarian crisis, local sources reported on Saturday.\nMunir al-Bursh, the director general of Gaza’s Health Ministry, said on the US social media company X that among the victims, 114 are children.\n“The famine is silently ravaging the bodies of civilians, depriving children of their right to life, and turning tents and hospitals into daily scenes of tragedy,” he added.\nIsrael has killed nearly 62,300 Palestinians in Gaza since October 2023. The military campaign has devastated the enclave, which is facing famine.\nLast November, the International Criminal Court issued arrest warrants for Netanyahu and his former Defense Minister Yoav Gallant for war crimes and crimes against humanity in Gaza.\nIsrael also faces a genocide case at the International Court of Justice for its war on the enclave.\nAnadolu Agency website contains only a portion of the news stories offered to subscribers in the AA News Broadcasting System (HAS), and in summarized form. Please contact us for subscription options."
    },
    {
      "news_title": "Gaza famine claims 8 more lives as Israeli strikes kill 25 across Strip",
      "news_link": "https://www.dailysabah.com/world/mid-east/gaza-famine-claims-8-more-lives-as-israeli-strikes-kill-25-across-strip",
      "bias": "Right",
      "text": "Eight more Palestinians, including two children, died from malnutrition caused by the Israeli blockade in Gaza over the past 24 hours, raising the total famine-related death toll to 281 since the onset of the humanitarian crisis, local health officials said Saturday.\nMunir al-Bursh, director general of Gaza’s Health Ministry, said in a post on X that 114 of those killed by starvation are children. “The famine is silently ravaging the bodies of civilians, depriving children of their right to life, and turning tents and hospitals into daily scenes of tragedy,” he said.\nAt the same time, at least 25 Palestinians were killed in a new wave of Israeli attacks across the Gaza Strip, according to medical sources.\nArtillery fire struck tents sheltering displaced families in the Asdaa area northwest of Khan Younis, killing 16 people, including six children and an infant. Several others were injured.\nIsraeli drones also hit homes in the Maghazi and Nuseirat refugee camps in central Gaza, leaving multiple casualties, while two civilians waiting for aid were shot dead in separate incidents near Khan Younis and the Israeli-controlled Netzarim corridor.\nGaza’s Health Ministry said Israel’s controversial unilateral “Gaza Humanitarian Foundation” aid mechanism has turned distribution points into “death traps,” with at least 2,060 people killed and more than 15,000 wounded while waiting for aid since late May.\nIsrael has killed nearly 62,300 Palestinians in Gaza since October 2023, according to the ministry. The military campaign has devastated the enclave, which faces a worsening famine alongside relentless bombardment.\nLast November, the International Criminal Court issued arrest warrants for Israeli Prime Minister Benjamin Netanyahu and former Defense Minister Yoav Gallant on war crimes and crimes against humanity charges. Israel also faces a genocide case at the International Court of Justice over its conduct in Gaza."
    }
  ]
}