{
  "story_id": "GN_20250823_203851_ebe1b92e",
  "metadata": {
    "title": "California Gov. Gavin Newsom’s national profile soars with latest Trump fight, but there are risks",
    "timestamp": "2025-08-23T20:38:51.778037",
    "url": "https://ground.news/article/california-gov-gavin-newsoms-national-profile-soars-with-latest-trump-fight-but-there-are-risks_2c3d6b"
  },
  "bias_distribution": {
    "total_sources": "16",
    "leaning_left": "11",
    "center": "2",
    "leaning_right": "1"
  },
  "perspective_summaries": {
    "left": [
      "Charlamagne Tha God stated that Gavin Newsom has been doing what Democrats want for a long time, indicating support for Newsom's actions in the political landscape.",
      "Ben Tulchin noted that Newsom is gaining national media exposure that portrays him as a leader showing strength.",
      "Boyd Brown criticized the actions of Newsom and Texas Governor Greg Abbott as a \"train wreck.\"",
      "Newsom's upcoming election win in November is seen as a potential boost for his national ambitions, as he ties his campaign to a conflict with Trump."
    ],
    "center": [
      "Last week, California Governor Gavin Newsom emerged as a leading Democratic adversary to President Donald Trump, asking voters to approve new U.S. House districts in a November special election with 16 months left in his final term.",
      "Facing Republican mapmaking, Newsom's initiative redraws new maps adding five Democratic U.S. House seats to counter Texas' gerrymander and prompt other states to soon redraw maps.",
      "Newsom's media strategy combines national media exposure, a snarky Trump-mimicking social media style, a podcast featuring Steve Bannon, and listening tours in Trump-won towns to energize Democrats.",
      "Analysts warn that off-cycle contests favor Republican turnout, raising risk for the November special election, and even if California voters approve new maps, Democrats are not guaranteed wins in the 2026 midterm elections.",
      "Longer term, Gavin Newsom's gambit intensifies conflict with the Trump administration seeking to block California policies, while some Democrats worry California-style politics embarrass the Democratic Party amid Republican control of many state legislatures."
    ],
    "right": [
      "Last week, California Governor Gavin Newsom emerged as a leading Democratic adversary to President Donald Trump, asking voters to approve new U.S. House districts in a November special election with 16 months left in his final term.",
      "Facing Republican mapmaking, Newsom's initiative redraws new maps adding five Democratic U.S. House seats to counter Texas' gerrymander and prompt other states to soon redraw maps.",
      "Newsom's media strategy combines national media exposure, a snarky Trump-mimicking social media style, a podcast featuring Steve Bannon, and listening tours in Trump-won towns to energize Democrats.",
      "Analysts warn that off-cycle contests favor Republican turnout, raising risk for the November special election, and even if California voters approve new maps, Democrats are not guaranteed wins in the 2026 midterm elections.",
      "Longer term, Gavin Newsom's gambit intensifies conflict with the Trump administration seeking to block California policies, while some Democrats worry California-style politics embarrass the Democratic Party amid Republican control of many state legislatures."
    ]
  },
  "sources": [
    {
      "news_title": "Gavin Newsom bets on MAGA liberalism",
      "news_link": "https://www.semafor.com/article/08/22/2025/gavin-newsom-bets-on-maga-liberalism",
      "bias": "Lean Left",
      "text": "David’s view\nWhat is Gavin Newsom doing? It’s been the most interesting question in liberal politics since November, with a different answer every month.\nFirst came his listening tour of Trump-won towns in California, which had multiplied, even with a California-born Democrat on the ballot. Then came the podcast; empathetic conversations with Charlie Kirk and Steve Bannon, and Newsom agreeing that it was “deeply unfair” for trans athletes to compete against women. Skip ahead to this week: Newsom aping Donald Trump’s syntax on social media, and setting up a special election to zap five Republicans out of their House seats.\nDid the governor want to understand the MAGA movement, or did he want to lead the resistance to it? The answer is: Yes. The Trump administration is working to make California’s brand of liberalism not just impossible (repealing its electric vehicle mandate) but illegal (suing to roll back its diversity programs). The Democratic Party, which needs to win in much more conservative states to take power nationally, is sometimes embarrassed by California liberalism.\nNewsom is not. Last week, at the pre-vote launch of the gerrymandering ballot measure, he noted that he was speaking from Los Angeles, “the most diverse city, in the most diverse country, in the most diverse state, in the world’s most diverse democracy.” Every governor is an evangelist for his or her state. Newsom defends California as it exists — not perfect, just superior — against the idea that it’s a disaster that other states should learn from and avoid.\nIn the short term, he is doing this to cancel out Texas’ gerrymander, convincing Democratic voters and Democratic-leaning independents that they need to make their state a bulwark against Republicans. (He’ll win the ballot measure if those voters turn out, because there are not enough California Republicans to stop it.) Newsom has pulled much of the party along with him, crippling the “good government” groups like Common Cause that spent decades arguing that it’s inherently unfair for one party to keep power by drawing its own electoral districts.\nAfter his short self-tutelage in MAGA country, Newsom figured out that the modern GOP’s tactics and rhetoric are effective. Would Democrats prefer it if voters read more political essays and fewer AI-generated memes? Absolutely. They are, increasingly, the party of the college town. Do they prefer Barack Obama’s 2004 DNC speech to ALL CAPS TWEETS? Do they ever! It doesn’t matter if they lose.\nNewsom and his team have grown more confident about this approach as Republicans grew more annoyed with it. Nothing validated their thinking like the vice president, who transformed himself from Trump critic to wingman, telling Fox News that Newsom “ignores the fundamental genius of President Trump’s political success, which is that he’s authentic.”\nRepublicans don’t see Newsom pulling this off. He has a math problem; they have more states they can gerrymander Democrats out of, and their lower-tax communities are attracting high-tax exiles every day. He has a reality problem; Republicans are winning more “diverse” electorates without any California-style policies. In Texas, the five-seat GOP gerrymander assumes that the party will keep gaining ground with Latino voters, and it’s being cheered on by a party chairman who immigrated to the United States from India.\nIt’s too simple to look at Newsom and see a 2028 presidential campaign. The party’s primary voters are going to be hyper-focused on electability, which their last California nominee couldn’t give them. The drive to draw five more Democratic seats, overwhelming rural Republicans with votes from blue cities, is a test of Trump-infused, MAGA-hating liberalism.\nNotable\n- For the Associated Press, Meg Kinnard reports on Barack Obama’s endorsement of the Newsom strategy.\n- In Politico, Adam Wren covers the Newsom social media approach: “Newsom’s MAGA-flavored posts have birthed an organic outburst of user-generated memes — not dissimilar to the dynamic Trump has inspired.”"
    },
    {
      "news_title": "The Democrats’ troubling psychological profile",
      "news_link": "https://www.americanthinker.com/blog/2025/08/the_democrats_troubling_psychological_profile.html",
      "bias": "Far Right",
      "text": "The Democrats’ troubling psychological profile\nBy Governor Gavin Newsom’s narcissistic lights, the Democrats have the GOP right where it wants it. On Aug. 12, Newsom tried too hard by half to tweet in the style of President Trump, implying that Republicans will rue its Texas redistricting by having “missed the deadline” to stop it. Declaring himself America’s “favorite governor,” Newsom said California Democrats will respond by redistricting which favors their party. He then said on August 20 that “We’re fighting fire with fire. And we’re gonna punch these sons of bitches in the mouth.”\nSurely the use of the word ‘fire’ as a rhetorical weapon of revenge is noticeable to Californians affected by the L.A. Fires of 2025, including those whose own government may be “fighting” against their attempt to rebuild their properties. As of Aug. 21, there were only 178 parcels with building permits issued compared to 12,048 estimated damaged or destroyed parcels in that area, according to the LA County Permitting Progress Dashboard. But that is a small matter for Governor Newsom, who also took time this week to belittle the quaint notion of job creation in California. Writing sarcastically on X about Bed Bath & Beyond, he said “We wish them well in their efforts to become relevant again as they try to open a 2nd store.” Newsom is perhaps experiencing schadenfreude, liberating his mind of the burden of sincerely caring about voters. He resorts to passive-aggressive mockery to declare publicly that which has long been understood practically about Democrats’ contempt for the private sector.\nEarlier this year in New York, its Democrat Attorney General Letitia James said in a likely moment of ego defense, that “I will not be silenced, I will not be bullied… No one is above the law, including the president of the United States.” Indeed, and on August 21, New York’s Appellate Division court could not partake in James’ delusions of grandeur as it struck down the nearly $500 million civil fine against the Trump Organization. Finding an Eighth Amendment excessive fine violation, the appeals court left the door open for further proceedings. Nevertheless, New York State’s lawsuit itself was excessive, along with the exceeding examples of Democrat rhetorical shrillness crying out for a diagnosis -- such as House Democrat Leader Hakeem Jeffries’ panicked tweet on August 11 that Donald Trump should “[g]et lost” for federalizing police in the District of Columbia.\nThe author and speaker John C. Maxwell wrote “The greatest enemy of good thinking is busyness.” The Democrat Party has been busy, to the detriment of a sound mind. Whether it is Letitia James casting President Trump as a bully, or Gavin Newsom assuring us the Texas Republican Party is acting far beyond norms, the Left is engaging in the defensive art of psychological projection. The desperate goal is simple: project anything on Republicans that surely a Democrat has already said or done.\nBut the game is up. On August 20, the New York Times published an analysis of voter registration data gathered by the L2 tracking firm. Between the 2020 and 2024 elections, Democrats lost 2.1 million voters in the states that track registration by party. During that same time, registered Republicans (those pesky ‘SOBs’) increased by 2.4 million.\nAs the voter registration numbers show, people living in the real world with responsibilities, budgets, and risks know which policies improve lives instead of those that project mirages. Shaming, jealous sarcasm, and double standards won’t bring these voters back to liberals. The Democrat Party will thus be left to lie on the therapist’s couch, blaming everyone but themselves for not seeing things their way.\nAlan Loncar is an attorney in Macomb County, Michigan.\nImage: AT via Magic Studio"
    },
    {
      "news_title": "California Gov. Gavin Newsom’s national profile soars with latest Trump fight, but there are risks",
      "news_link": "https://www.seattletimes.com/nation-world/nation/california-gov-gavin-newsoms-national-profile-soars-with-latest-trump-fight-but-there-are-risks/",
      "bias": "Lean Left",
      "text": "LOS ANGELES (AP) — Gavin Newsom is having a moment.\nIn the national struggle over U.S. House control, perhaps no politician has more at stake than the California governor, who has emerged as the leading Democratic adversary to President Donald Trump in what many see as a lightly masked trial run for his own future White House bid.\nThe liberal former San Francisco mayor, who is nearing the end of a spotty tenure in Sacramento, is being cheered by Democrats and party activists who see his scrappy, Trump-mocking, profanity-tinged speeches and snarky social media posts as signs of new life in a party left dispirited and rudderless after 2024 election losses.\nNewsom “has been doing what I’ve wanted a Democrat to do for a long time,” radio host Charlamagne Tha God said on his syndicated “Breakfast Club” program. In directly confronting the president Newsom is “matching energy, and I like it.”\nDemocratic pollster Ben Tulchin said Newsom is benefitting from a torrent of national media exposure that “makes him look like a leader, portraying strength.”\nIn a party that even many of its own members describe as ineffective and weak, Newsom is challenging Trump and “punching the bully in the nose,” added Tulchin, who worked for Sen. Bernie Sanders’ presidential campaigns. With 16 months left in his final term — a time in his tenure when many governors would be seen as fading away — he’s “driving the conversation.”\nBut Newsom’s strategy is not without risk as he plans to ask voters in a November special election to approve new House districts. The new maps have been jiggered to add five Democratic U.S. House seats in California to offset Trump’s moves in Texas to gain five Republican districts before the 2026 midterm elections.\nThe faceoff between California and Texas is spreading nationally, and other states could soon begin redrawing House maps, which are crafted state by state. That could lead to an even more deeply partisan Washington, which already is strangled by gridlock.\nNewsom ‘Should be ashamed’ with political maneuvers\nWhile Newsom’s maneuvers may be winning plaudits from the Democratic base, “This is a train wreck,” said Boyd Brown, a former Democratic National Committee member and legislator from South Carolina.\nIf states follow Texas and California and keep rigging House maps for partisan advantage “that’s a good way to ruin a democratic process,” Brown said, adding the Democrats could end up disadvantaged nationally since Republicans control more than half of the state legislatures.\nNewsom and Republican Texas Gov. Greg Abbott “should be ashamed of what they are doing” Brown added. “We are going to have a polarized Congress for decades to come,” he said. “Who does that benefit?”\n“It is government malpractice at its highest level,” he added. “It should concern every American.”\nRisk for Newsom in what could lead to 2028 campaign\nFor Newsom, an election win in November would be a springboard for his national ambitions, with the fundraising he’s doing ahead of the November election building out his list of national supporters. But a loss in his heavily Democratic home state would inevitably dim his luster on the national stage, even if Democrats give him credit for trying.\nAnd if new House maps are approved by voters, there’s no guarantee Democrats will prevail in the reshaped districts in 2026, when Republicans will be trying to defend their party’s fragile House majority. A loss of the House would dramatically alter the prospects for Trump’s agenda in the latter half of his term.\nBut first, Newsom needs California voters to approve the new maps, which some see as no sure thing.\n“Republicans vote in higher propensity in elections that are off cycle,” noted Democratic consultant Bill Burton, referring to this fall’s special election.\nThat means Newsom “is going to face that kind of natural pressure in this one,” said Burton, who was national press secretary for Barack Obama’s 2008 presidential campaign. “I don’t think it will be easy.”\nA snarky social media style gets national attention\nNewsom’s salesmanship for his plan for new House districts has come when he has been elevating his profile on social media — his press office account has gotten national attention parroting Trump’s all-capital-letter posts peppered with off-color jokes and dismissive comments about the president.\n“WOW!!! MY MAPS (THE BEST MAPS EVER MADE) WILL SOON PASS IN THE GREATEST LEGISLATURE ANYWHERE IN THE WORLD (NOT JUST AMERICA). AMERICA CAN THANK ME,” his press office riffed in a recent tweet.\nIt’s part of a longer political evolution that has seen the governor edge toward the political center while welcoming conservatives — including Steve Bannon, an architect of Trump’s 2016 campaign — to his podcast.\nNewsom “is sort of mixing the funny posts and the hysterical digs at the Trump administration with actual action. And I think that’s the part that people are really appreciating and getting behind,” said Lindsay Meyer-Harley, an online clothing retailer behind Still We Rise, an Instagram page promoting progressive agenda.\nAt a recent rally in Los Angeles, Newsom veered away from discussing the technical grist of reshaping districts and instead depicted the looming battle as a conflict with all things Trump, tying it explicitly to the fate of American democracy and echoing the 2024 presidential campaign.\n“We can’t stand back and watch this democracy disappear district by district all across the country,” Newsom warned.\n___\nAssociated Press writer Tran Nguyen in Sacramento, Calif., contributed."
    },
    {
      "news_title": "California Gov. Gavin Newsom's national profile soars with latest Trump fight, but there are risks",
      "news_link": "https://apnews.com/article/newsom-trump-california-house-texas-redistricting-e9546ed352cf5f3eb7739199ac8548c7",
      "bias": "Lean Left",
      "text": "California Gov. Gavin Newsom’s national profile soars with latest Trump fight, but there are risks\nLOS ANGELES (AP) — Gavin Newsom is having a moment.\nIn the national struggle over U.S. House control, perhaps no politician has more at stake than the California governor, who has emerged as the leading Democratic adversary to President Donald Trump in what many see as a lightly masked trial run for his own future White House bid.\nThe liberal former San Francisco mayor, who is nearing the end of a spotty tenure in Sacramento, is being cheered by Democrats and party activists who see his scrappy, Trump-mocking, profanity-tinged speeches and snarky social media posts as signs of new life in a party left dispirited and rudderless after 2024 election losses.\nNewsom “has been doing what I’ve wanted a Democrat to do for a long time,” radio host Charlamagne Tha God said on his syndicated “Breakfast Club” program. In directly confronting the president Newsom is “matching energy, and I like it.”\nDemocratic pollster Ben Tulchin said Newsom is benefitting from a torrent of national media exposure that “makes him look like a leader, portraying strength.”\nIn a party that even many of its own members describe as ineffective and weak, Newsom is challenging Trump and “punching the bully in the nose,” added Tulchin, who worked for Sen. Bernie Sanders’ presidential campaigns. With 16 months left in his final term — a time in his tenure when many governors would be seen as fading away — he’s “driving the conversation.”\nBut Newsom’s strategy is not without risk as he plans to ask voters in a November special election to approve new House districts. The new maps have been jiggered to add five Democratic U.S. House seats in California to offset Trump’s moves in Texas to gain five Republican districts before the 2026 midterm elections.\nThe faceoff between California and Texas is spreading nationally, and other states could soon begin redrawing House maps, which are crafted state by state. That could lead to an even more deeply partisan Washington, which already is strangled by gridlock.\nNewsom ‘Should be ashamed’ with political maneuvers\nWhile Newsom’s maneuvers may be winning plaudits from the Democratic base, “This is a train wreck,” said Boyd Brown, a former Democratic National Committee member and legislator from South Carolina.\nIf states follow Texas and California and keep rigging House maps for partisan advantage “that’s a good way to ruin a democratic process,” Brown said, adding the Democrats could end up disadvantaged nationally since Republicans control more than half of the state legislatures.\nNewsom and Republican Texas Gov. Greg Abbott “should be ashamed of what they are doing” Brown added. “We are going to have a polarized Congress for decades to come,” he said. “Who does that benefit?”\n“It is government malpractice at its highest level,” he added. “It should concern every American.”\nRisk for Newsom in what could lead to 2028 campaign\nFor Newsom, an election win in November would be a springboard for his national ambitions, with the fundraising he’s doing ahead of the November election building out his list of national supporters. But a loss in his heavily Democratic home state would inevitably dim his luster on the national stage, even if Democrats give him credit for trying.\nAnd if new House maps are approved by voters, there’s no guarantee Democrats will prevail in the reshaped districts in 2026, when Republicans will be trying to defend their party’s fragile House majority. A loss of the House would dramatically alter the prospects for Trump’s agenda in the latter half of his term.\nBut first, Newsom needs California voters to approve the new maps, which some see as no sure thing.\n“Republicans vote in higher propensity in elections that are off cycle,” noted Democratic consultant Bill Burton, referring to this fall’s special election.\nThat means Newsom “is going to face that kind of natural pressure in this one,” said Burton, who was national press secretary for Barack Obama’s 2008 presidential campaign. “I don’t think it will be easy.”\nA snarky social media style gets national attention\nNewsom’s salesmanship for his plan for new House districts has come when he has been elevating his profile on social media — his press office account has gotten national attention parroting Trump’s all-capital-letter posts peppered with off-color jokes and dismissive comments about the president.\n“WOW!!! MY MAPS (THE BEST MAPS EVER MADE) WILL SOON PASS IN THE GREATEST LEGISLATURE ANYWHERE IN THE WORLD (NOT JUST AMERICA). AMERICA CAN THANK ME,” his press office riffed in a recent tweet.\nIt’s part of a longer political evolution that has seen the governor edge toward the political center while welcoming conservatives — including Steve Bannon, an architect of Trump’s 2016 campaign — to his podcast.\nNewsom “is sort of mixing the funny posts and the hysterical digs at the Trump administration with actual action. And I think that’s the part that people are really appreciating and getting behind,” said Lindsay Meyer-Harley, an online clothing retailer behind Still We Rise, an Instagram page promoting progressive agenda.\nAt a recent rally in Los Angeles, Newsom veered away from discussing the technical grist of reshaping districts and instead depicted the looming battle as a conflict with all things Trump, tying it explicitly to the fate of American democracy and echoing the 2024 presidential campaign.\n“We can’t stand back and watch this democracy disappear district by district all across the country,” Newsom warned.\n___\nAssociated Press writer Tran Nguyen in Sacramento, Calif., contributed."
    },
    {
      "news_title": "CNN Data Guru Breaks Down ‘Rising Tide of Support’ for Newsom: Feud With Trump Is ‘Working’",
      "news_link": "https://www.mediaite.com/media/tv/cnn-data-guru-breaks-down-rising-tide-of-support-for-newsom-feud-with-trump-is-working/",
      "bias": "Lean Left",
      "text": "CNN Data Guru Breaks Down ‘Rising Tide of Support’ for Newsom: Feud With Trump Is ‘Working’\nCalifornia Gov. Gavin Newsom (D) taking the fight to President Donald Trump is “working,” CNN chief data analyst Harry Enten said Friday.\nIn recent days, Newsom’s social media presence underwent a radical shift when he decided to copy the president’s rhetoric. The governor’s new posts include phrases the president frequently says, as well as a heavy use of all-caps typing and derogatory nicknames for other prominent conservative figures.\nLooking at polling data from Newsom’s state, Enten explained to CNN’s Kate Bolduan how the strategy has given the governor a significant boost in popularity:\nI absolutely think it’s showing signs of working; and let’s take a look at the voters who know Gavin Newsom best — those voters out in California, those California Democrats. California Democrats on Newsom for [president]. You go back to 2023, just 35% wanted him to run for president. Look at the percentage now who are excited for a run for president for Gavin Newsom. What is that? That’s a 40-point climb, my goodness gracious! A rising tide of support for Gavin Newsom.\nRemember, back in 2023, the majority of Democrats did not want Joe Biden to run for another term; but California Democrats in Gavin Newsom’s home state did not want him to run, either. And now, 75% are excited for him to run; and more than that, he’s getting a higher percentage of the vote than Kamala Harris in her home state. He is beating the former vice president — who, of course, was the Democratic nominee in 2024. As I said, a rising tide of support for the California governor.\nAlthough the next presidential election is still more than three years away, Enten broke down why the early polls were a promising sign for Newsom should he decide to run:\nIt’s one of those benchmarks, the home state polling for presidential candidates. If they can’t win the primary in their home state, they ain’t going to win anywhere. What are we talking about? [Presidential] nominees in home state primaries. All of them won. All the nominees won, and all of them led in the early polls. So yes, winning California is not tantamount to winning the nomination; but it is one of those stepping stones that you have to make it to if you, in fact, want to win the nomination, historically. And of course, in California, it has the most delegates out of any of the states that of course take part in the Democratic primary.\nWatch above via CNN"
    },
    {
      "news_title": "Newsom’s national profile soars with latest Trump fight",
      "news_link": "https://www.avpress.com/news/newsom-s-national-profile-soars-with-latest-trump-fight/article_fc5f0e5c-001c-431d-8d49-588823460763.html",
      "bias": "unknown",
      "text": null
    }
  ]
}