{
  "story_id": "GN_20250823_203629_6f5a8849",
  "metadata": {
    "title": "Consumer watchdog ends investigation into buy now, pay later company linked to Donald Trump Jr.",
    "timestamp": "2025-08-23T20:36:29.888684",
    "url": "https://ground.news/article/consumer-watchdog-ends-investigation-into-buy-now-pay-later-company-linked-to-donald-trump-jr_5a448e"
  },
  "bias_distribution": {
    "total_sources": "28",
    "leaning_left": "5",
    "center": "16",
    "leaning_right": "4"
  },
  "perspective_summaries": {
    "left": [
      "The Consumer Financial Protection Bureau has ended its investigation into a buy now, pay later company linked to Donald Trump Jr. due to accusations of bias.",
      "The agency indicated that the investigation, which began during Joe Biden's presidency, was politically motivated against firearms companies.",
      "Despite the investigation's closure, the company has faced numerous consumer complaints and settlements for state consumer protection violations.",
      "Donald Sherman stated that the CFPB’s decision is emblematic of the toxic stew of corruption associated with administration officials helping allies."
    ],
    "center": [
      "The Consumer Financial Protection Bureau has ended its investigation into a buy now, pay later company linked to Donald Trump Jr. due to accusations of bias.",
      "The agency indicated that the investigation, which began during Joe Biden's presidency, was politically motivated against firearms companies.",
      "Despite the investigation's closure, the company has faced numerous consumer complaints and settlements for state consumer protection violations.",
      "Donald Sherman stated that the CFPB’s decision is emblematic of the toxic stew of corruption associated with administration officials helping allies."
    ],
    "right": [
      "The Consumer Financial Protection Bureau has dropped its investigation into Credova, a buy now, pay later company linked to Donald Trump Jr., claiming it was biased and politically motivated.",
      "Donald Sherman, executive director of Citizens for Responsibility and Ethics in Washington, stated that the case's dismissal reflects the 'toxic stew of corruption' in the administration.",
      "Michael Seifert, CEO of Public Square, stated that the closure of the investigation validates the trust in their company and is a win for their community.",
      "Despite the investigation's dismissal, there have been over 50 consumer complaints filed against Credova with the CFPB."
    ]
  },
  "sources": [
    {
      "news_title": "Donald Trump Jr. calls Portland, Seattle ‘craphole cities,’ hints at federal takeover of police forces",
      "news_link": "https://www.oregonlive.com/crime/2025/08/donald-trump-jr-calls-portland-seattle-craphole-cities-hints-at-federal-takeover-of-police-forces.html",
      "bias": "Center",
      "text": "President Donald Trump’s eldest son referred to Portland and Seattle as “craphole cities” in an interview with Newsmax when talking about the administration’s takeover of the Washington, D.C., police force.\nDonald Trump Jr. also suggested the possibility of a federal takeover of police forces in the two Pacific Northwest cities.\n“Maybe we should roll out the tour to Portland, Seattle, the other craphole cities of the country,” Trump Jr. said to Newsmax on Thursday. “Not because they’re crapholes but because Democrats made them so. Maybe we’re going to expand this.”\nEarlier this month, President Trump ordered National Guard troops onto Washington, D.C.’s streets, stating without evidence that crime was rampant in the city.\nTrump Jr. echoed those claims to Newsmax and suggested the murder rate is “through the roof” in Democratic-run cities.\nTrump Jr.’s comments were reminiscent of President Trump in 2018 reportedly referring to Haiti and African nations as “s—hole countries” – a remark he denied making.\nDespite the rhetoric of Trump Jr. and other national figures about crime in Portland, the city has seen consistent declines in homicides and shootings year over year since they peaked in 2021 and 2022.\nKillings in Portland dropped 51% in the first half of 2025 compared to 2024, according to data from the Major City Chiefs Association. Similarly, Seattle also saw its homicide numbers decrease by a third, the organization noted.\nPresident Trump has, on occasion, focused his ire on Portland, calling it a “destroyed” city last summer prior to the election. His border czar, Tom Homan, made a brief visit to the city this week.\nOn Friday, according to the Associated Press, the president said the federal government would next turn its attention to Chicago in its crackdown on crime.\n—Zaeem Shaikh covers the Portland Police Bureau and criminal justice issues for The Oregonian/OregonLive. Reach him at 503-221-4323, zshaikh@oregonian.com or on X@zaeemshake.\nLatest Public Safety News\n- Washington investigates truck driver’s license in fatal Florida crash caught on camera\n- Judge rules ICE detention of Guatemalan fieldworker in Oregon lawful\n- Police find shooting victim hiding in SE Portland, suspects at large\n- Human remains recovered from car in Columbia River, diver says; mystery obsessed investigators for decades"
    },
    {
      "news_title": "Donald Trump Jr. wants federal takeover of these Democratic ‘craphole cities’",
      "news_link": "https://www.al.com/politics/2025/08/donald-trump-jr-wants-federal-takeover-of-these-democratic-craphole-cities.html",
      "bias": "Center",
      "text": "The federalization of Washington, D.C.’s police force is such a smashing success that the model should be taken to other Democratic-run “craphole cities,” according to Donald Trump Jr.\nThe president’s eldest son said candid interviews of people on the streets of D.C. show that residents now feel safe “despite all the uproar you saw from the Democrats and the media.”\nTrump Jr. suggested expanding the federalization, which could include activating the National Guard, in other Democratic-run cities.\n“Maybe we should roll out the tour to Seattle, Portland, the other what we call ‘craphole cities of the country,” Trump Jr. said. “Not because they’re crapholes, but because Democrats made them so ... Maybe we can expand this.\nNearly 2,000 National Guard members have been stationed in D.C, with the arrival this week of hundreds of troops from several Republican-led states.\nTrump initially called up 800 members of the District of Columbia National Guard to assist federal law enforcement in his bid to crack down on crime, homelessness and illegal immigration. Since then, six states have sent troops to the city, growing the military presence.\nIt was unclear if the guard’s role in the federal intervention could be changing. The troops have not taken part in law enforcement and largely have been protecting landmarks including the National Mall and Union Station and helping with crowd control.\nTrump has boasted that the city is safer than ever because of his intervention. He told reporters Friday that “it’s a miracle what’s happened.”\n“D.C. was a hell hole,” he said. “But now it’s safe.”\nHe suggested that he could prolong the deployment of troops and federal agents in Washington.\n“The big question is how long do we stay?” he said. “Because if we stay, we want to make sure it doesn’t come back. So we have to take care of these criminals and get them out.”\nThe Associated Press contributed to this report."
    },
    {
      "news_title": "Consumer watchdog ends investigation into buy now, pay later company linked to Donald Trump Jr.",
      "news_link": "https://apnews.com/article/cfpb-trump-jr-credova-investigation-dropped-3c1e6bdcd5ebed03de857908a0037e5d",
      "bias": "Lean Left",
      "text": "Consumer watchdog ends investigation into buy now, pay later company linked to Donald Trump Jr.\nConsumer watchdog ends investigation into buy now, pay later company linked to Donald Trump Jr.\nWASHINGTON (AP) — The Consumer Financial Protection Bureau has dropped an investigation into a buy now, pay later company with close ties to President Donald Trump’s son Donald Trump Jr., saying the investigation was conducted in a biased manner and based off politics.\nThe CFPB on Tuesday notified Credova Financial, a subsidiary of Public Square Holdings, where Trump Jr. is a board member and investor, that it was no longer under investigation. Public Square is a directory of businesses that sell American-made products, including financing for firearms and family pets, that market to conservative-leaning customers. Credova provides buy now, pay later services to Trump Jr.’s GrabAGun firearms marketplace, which went public this year.\nThe agency says the investigation, initiated during Democrat Joe Biden’s presidency, was politically motivated against firearms companies and Trump Jr. However, the company has a record of dozens if not hundreds of consumer complaints and settlements over state consumer protection violations.\nThe closure of the investigation also comes when the CFPB, a watchdog agency that helps oversee the nation’s banks and financial services companies, has been undoing rulemaking, dropping other cases and ending law enforcement work that was done under previous administrations, including Trump’s first term.\nThe CFPB in Trump’s second term determined the Credova investigation “exemplifies the type of weaponization against disfavored industries and individuals” that Trump and the agency’s acting director, Russell Vought, are committed to ending, according to a letter sent to the chief counsel of Public Square Holdings. The CFPB during Biden’s term ratcheted up settlement demands on the company the day Trump Jr. joined Public Square’s board of directors, the letter said.\nFormer CFPB employees, from during Biden’s term, declined to speak about the decision, saying they’re not permitted to discuss investigations.\nPrevious claims against Credova\nMichael Seifert, chairman and CEO of Public Square, said in a statement that the closure of the CFPB investigation “confirms the strength and integrity of our company and validates the trust our merchants and consumers place in us” and is ”a win for our entire company, our board, our customers, and a 2nd Amendment community that has seen years of government attempts to regulate businesses like ours out of existence.”\nHowever, the firm had for years been accused of charging junk fees to customers or violating state consumer protection rules.\nIn 2021, Credova and another Nevada-based finance firm reached a settlement with the Massachusetts attorney general’s office to waive balances totaling more than $126,000 to resolve allegations they illegally leased dogs in violation of the Massachusetts Consumer Protection Act.\nIn January 2024, Credova and the California Department of Financial Protection and Innovation entered into a consent order to resolve allegations the firm failed to disclose potential third-party fees to consumers. As a result, Credova was required to pay a $50,000 penalty and disclose potential third-party convenience fees to consumers in the future.\nThere have also been more than 50 consumer complaints filed against Credova to the CFPB, a search of the database shows. Many of the complaints relate to debt collection practices.\nA search of the Better Business Bureau Database shows 134 complaints have been filed against the company in the past three years, with 21 closed in the past 12 months. A review of many of those complaints relate to customers being charged undisclosed junk fees.\nTrump Jr.'s ties to the company\nTrump Jr. joined the board of directors for Public Square’s parent company, PSQ Holdings, in December 2024.\nAndy Surabian, a spokesman for Trump Jr., said in a statement Trump Jr. “had nothing what so ever to do with this and it’s a classic cheap media tactic to imply otherwise when the AP knows that they have no evidence to the contrary.” Trump Jr. owns 697,403 shares in Public Square, which are worth roughly $1.1 million.\nDonald Sherman, the executive director and chief counsel of Citizens for Responsibility and Ethics in Washington, said the CFPB’s dropping of the case against Credova is “emblematic of the toxic stew of corruption” associated with administration officials assisting allies.\n“It’s not just that this particular company has ties to the president’s son, who has along with his father sought to monetize and profit off of the presidency at every step of the way,” Sherman said. “It’s also that this administration has taken aggressive actions to use every aspect of federal law enforcement to benefit its perceived political allies and harm its enemies.”\n___\nAssociated Press writer Ken Sweet in New York contributed to this report."
    },
    {
      "news_title": "Consumer Financial Protection Bureau drops probe into company with ties to Don Jr.",
      "news_link": "https://justthenews.com/government/federal-agencies/consumer-financial-protection-bureau-drops-probe-public-square",
      "bias": "Lean Right",
      "text": "Consumer Financial Protection Bureau drops probe into company with ties to Don Jr.\nThe investigation began under the Biden administration, and the bureau said it was politically motivated against firearms companies and Donald Trump, Jr.\nThe Consumer Financial Protection Bureau has dropped its investigation into a Public Square subsidiary which has ties to Donald Trump, Jr., saying it was conducted in a biased manner.\nOn Tuesday, the CFPB notified Credova Financial, a subsidiary of Public Square Holdings, for which Trump is a board member and investor, that it was no longer under investigation, The Associated Press reported. Public Square is a directory of businesses that sell American-made products marketed to conservative-leaning customers. Credova provides buy-now, pay-later services to Trump's GrabAGun firearms marketplace, which went public this year.\nThe investigation began under the Biden administration. The bureau called it politically motivated against firearms companies and Trump.\nThe CFPB determined that the investigation “exemplifies the type of weaponization against disfavored industries and individuals” that Trump and the bureau's acting director, Russell Vought, are committed to ending, reads the letter sent to Public Square Holdings's chief counsel. The letter also noted that, during former President Biden’s term, the bureau ratcheted up settlement demands on the company the day Trump joined Public Square’s board of directors.\nPublic Square's chairman and CEO, Michael Seifert, said in a statement that the closure of the investigation “confirms the strength and integrity of our company and validates the trust our merchants and consumers place in us,” and is ”a win for our entire company, our board, our customers, and a 2nd Amendment community that has seen years of government attempts to regulate businesses like ours out of existence.”\nMore than 50 consumer complaints have been filed against Credova to the CFPB, many of which relate to debt collection practices, according to the AP's search of the agency's database.\nThe wire service's search of the Better Business Bureau Database showed that 134 complaints have been filed against Credova in the past three years, with 21 closed in the past year. Many of those complaints are regarding customers being charged undisclosed junk fees.\nAndy Surabian, a spokesman for Trump, said in a statement that the president's son “had nothing what so ever [sic] to do with this and it’s a classic cheap media tactic to imply otherwise when the AP knows that they have no evidence to the contrary.”\nTrump owns 697,403 shares in Public Square, worth roughly $1.1 million."
    },
    {
      "news_title": "Consumer watchdog launches investigation into 'sneaky, confusing' energy retailer tactics",
      "news_link": "https://johnmenadue.com/post/2025/08/consumer-watchdog-launches-investigation-into-sneaky-confusing-energy-retailer-tactics/",
      "bias": "unknown",
      "text": "Consumer watchdog launches investigation into 'sneaky, confusing' energy retailer tactics\nAugust 23, 2025\nA “super complaint” alleging “sneaky, confusing energy pricing tactics” by Australian electricity retailers has sparked an investigation by the national competition watchdog, amid concerns consumers are being deliberately misled about which energy plans to choose.\nThe Australian Competition and Consumer Commission (ACCC) has this week revealed it will investigate whether energy retailers are misleading consumers by promoting plans that promise savings or good value when they actually offer poor value.\n“We are concerned that consumers may be misled or deceived by plan names or descriptions of plans that offer ‘savings’ that are not genuine, or that consumers may be discouraged from switching to cheaper plans that are available to them,” said ACCC deputy chair Catriona Lowe.\nAnd while this statement may provoke a “well duh” response from many consumers and consumer advocates, formal recognition from the ACCC that this is a “significant or systemic market issue” is a big deal.\n“The ACCC is satisfied that the designated complaint made by Choice (magazine) relates to a significant or systemic market issue that affects consumers,” the watchdog said on Tuesday.\n“If the ACCC identifies conduct that may contravene the Australian Consumer Law following its investigation of the issues raised by this complaint, it may take enforcement action where appropriate. The ACCC may also prepare industry guidance or contribute to policy or law reform initiatives.”\nThe issue around retailer tariffs has become a critical one, given the extraordinary hikes announced by most retailers at the start of the financial year, well beyond the recommendations of the energy retailer.\nThey are causing consumer hardship, and putting the social licence for the green energy transition at risk, even if the issue is more about unfettered market power than it is about the switch of technologies from coal to green.\nThe ACCC investigation comes as a result of the new designated complaints framework in the Competition and Consumer Act 2010 (CCA).\nThis came into effect in May 2024 and is currently accessible to three designated complainants – Australian Consumers’ Association (Choice), Consumer Action Law Centre and the Council of Small Business Organisations Australia.\nThe first ever designated “ super’ complaint” — as they are also known — was lodged with the ACCC by the CALC, calling for a nationwide ban on unsolicited sales practices, including door-knocking and cold-calling.\nChoice followed, in May, with its own first designated complaint alleging three “widespread concerning practices” by energy retailers, including prompts to switch better offers that refer to plans that do not appear to be available, or for which the customer is not eligible.\nThe practices of using identical plan names to represent plans with different prices, and of using plan names and descriptions that refer to “savings” for poor-value plans, were also singled out by Choice.\n“Our complaint highlighted a number of energy plans with names and descriptions including phrases like ‘save’ or ‘saver’ that were more expensive than other plans offered by the same retailer,” the association said in a statement.\n“In some instances, they were even more expensive than the retailer’s standing offer. Many consumers rely on these representations as indicators of value to inform their decision-making, but we found that many of these names and descriptions may not reflect genuine value.\n“In our opinion, the systemic nature of these practices means any breach warrants strong, court-based action to deter similar conduct in other complex markets.”\nBetter offer, but not better off\nWhat is particularly galling is that some of the practices called out by Choice appear to have arisen from recent efforts of the Australian Energy Regulator to make it easier for consumers to find better value retail energy offers.\nUnder the Better Bills Guideline, which came into effect in 2023, residential electricity bills are required to include a “Better Offer” message at least every 100 days to alert customers to whether they can save money if they switch to a different plan with the same retailer.\nThese savings can be huge. For example, a family member — who has a rooftop solar system — was getting a message on their monthly electricity bill saying they could shave nearly $1000 a year off their bill by changing to a different plan. With help — the family member is 82 — this change was made, but it took roughly 40 minutes on the phone with back-up assistance and careful supervision from a third-party.\nBut the ACCC says it will focus its investigation on whether or not consumers are being misled or deceived by energy plan names or descriptions of plans that offer “savings” that are not genuine, or are otherwise being discouraged from switching to cheaper offers.\n“It is essential that energy retailers provide clear and accurate information about their energy plans so that consumers can make informed decisions when choosing an energy provider and plan,” Lowe said.\nLowe says the ACCC is satisfied issues around “Better Offer” messaging are being effectively addressed through review and law reform processes currently underway by the AER and the Victoria’s Essential Services Commission.\nIn May this year, the AER updated the rules to say retailers that re-use plan names are required to add the following information below any better offer message alerting customers to a cheaper plan:\n“If this plan has the same name as your current plan, you are on an older version of the plan which has different rates. You can still save money by switching to a newer version.”\nChoice said this week it welcomes the ACCC’s decision, which it says will “help address harmful systemic practices that make it very hard to know if you’re being ripped off” by your energy retailer.\n“We chose energy plans for our first super complaint because consumers are very concerned about the cost of electricity,” said Choice’s director of campaigns, Rosie Thomas, on Tuesday.\n“Consumers are often encouraged to shop around in order to save on their energy bills, but that’s impossible to do if the information they receive from retailers is inaccurate, incomplete or designed to overwhelm.\n“Choice is calling on the ACCC to take strong action against the energy retailers to send a clear message that misleading consumers about savings or value is unacceptable,” Thomas says.\n“We are also pleased to see some of the other concerning energy practices Choice raised in its complaint will be considered as part of upcoming reviews by the Australian Energy Regulator and Victorian Essential Services Commission.”\nRepublished from Renew Economy, 20 August 2025\nThe views expressed in this article may or may not reflect those of Pearls and Irritations."
    }
  ]
}