{
  "story_id": "GN_20250823_205817_4887568f",
  "metadata": {
    "title": "Governor DeSantis Defies Judge's Order to Halt Operations at 'Alligator Alcatraz': 'We're Not Gonna Be Deterred'",
    "timestamp": "2025-08-23T20:58:17.453495",
    "url": "https://ground.news/article/desantis-responds-to-alligator-alcatraz-ruling-touts-deportation-depot"
  },
  "bias_distribution": {
    "total_sources": "19",
    "leaning_left": "6",
    "center": "7",
    "leaning_right": "3"
  },
  "perspective_summaries": {
    "left": [
      "Governor Ron DeSantis announced that deportations will continue at Alligator Alcatraz, despite a judge's order to halt operations and dismantle parts of the facility.",
      "U.S. District Judge Kathleen Williams issued a temporary injunction requiring the dismantling of parts of Alligator Alcatraz due to environmental risks.",
      "The lawsuit against Alligator Alcatraz was filed by Friends of the Everglades, the Center for Biological Diversity, and the Miccosukee Tribe, claiming violations of environmental regulations.",
      "DeSantis asserted that his administration would continue deportations, stating, \"this is not going to deter us\" from their mission."
    ],
    "center": [
      "On Thursday, U.S. District Judge Kathleen Williams ordered the Everglades-based Alligator Alcatraz dismantled within 60 days, while Governor Ron DeSantis announced the new Deportation Depot at Baker Correctional Institution with 1,300 beds.",
      "The June 27 lawsuit filed by Friends of the Everglades, the Center for Biological Diversity, and the Miccosukee Tribe alleges construction violated environmental rules, risking 2,000 acres used by Florida panthers.",
      "U.S. District Judge Rodolfo Ruiz earlier this week ordered a detainee-rights suit moved to the Middle District of Florida and barred further TNT site expansion or added industrial lighting.",
      "Florida appealed the order Friday to the 11th U.S. Circuit Court of Appeals , and Governor Ron DeSantis vowed the ruling will not deter state deportation efforts with President Donald Trump.",
      "Betty Osecola of the Miccosukee Tribe said `This is a win for the environment` as Alligator Alcatraz, inside Big Cypress National Preserve near the Miccosukee reservation, bypassed review after a state of emergency declaration."
    ],
    "right": [
      "On Thursday, U.S. District Judge Kathleen Williams ordered the Everglades-based Alligator Alcatraz dismantled within 60 days, while Governor Ron DeSantis announced the new Deportation Depot at Baker Correctional Institution with 1,300 beds.",
      "The June 27 lawsuit filed by Friends of the Everglades, the Center for Biological Diversity, and the Miccosukee Tribe alleges construction violated environmental rules, risking 2,000 acres used by Florida panthers.",
      "U.S. District Judge Rodolfo Ruiz earlier this week ordered a detainee-rights suit moved to the Middle District of Florida and barred further TNT site expansion or added industrial lighting.",
      "Florida appealed the order Friday to the 11th U.S. Circuit Court of Appeals , and Governor Ron DeSantis vowed the ruling will not deter state deportation efforts with President Donald Trump.",
      "Betty Osecola of the Miccosukee Tribe said `This is a win for the environment` as Alligator Alcatraz, inside Big Cypress National Preserve near the Miccosukee reservation, bypassed review after a state of emergency declaration."
    ]
  },
  "sources": [
    {
      "news_title": "Florida Appeals Judge’s Ruling Against Expansion of ‘Alligator Alcatraz’",
      "news_link": "https://www.theepochtimes.com/us/florida-appeals-judges-ruling-against-expansion-of-alligator-alcatraz-5905108",
      "bias": "Lean Right",
      "text": "Florida Gov. Ron DeSantis’s administration on Aug. 21 appealed a ruling made by a federal judge halting the expansion of the “Alligator Alcatraz” illegal immigrant detention center in the Everglades.\nThe appeal follows U.S. Judge Kathleen Williams’s ruling on Aug. 21 in favor of environmental groups who had brought a lawsuit against the facility, saying that it endangers the Everglades and its wildlife."
    },
    {
      "news_title": "DeSantis Vows to Increase Illegal Immigrant Jails",
      "news_link": "https://www.wlsam.com/2025/08/22/desantis-vows-to-increase-illegal-immigrant-jails/",
      "bias": "Right",
      "text": null
    },
    {
      "news_title": "DeSantis comments on recent Alligator Alcatraz ruling",
      "news_link": "https://www.wfla.com/video/desantis-comments-on-recent-alligator-alcatraz-ruling/11006985/",
      "bias": "Center",
      "text": null
    },
    {
      "news_title": "DeSantis: 'Alligator Alcatraz' ruling won’t ‘deter’ Florida immigration enforcement",
      "news_link": "https://www.politico.com/news/2025/08/22/desantis-alligator-alcatraz-ruling-wont-deter-florida-immigration-enforcement-00519721",
      "bias": "Lean Left",
      "text": null
    },
    {
      "news_title": "\"Not Going to Deter Us\" - Governor DeSantis Responds To Judge's Order to Close 'Alligator Alcatraz'",
      "news_link": "https://www.thegatewaypundit.com/2025/08/not-going-deter-us-governor-desantis-responds-judges/",
      "bias": "Far Right",
      "text": "Yesterday, The Gateway Pundit reported that US District Judge Kathleen Williams had ordered a South Florida Detention Facility affectionately nicknamed ‘Alligator Alcatraz’ to cease receiving new detainees and dismantle the facility in 60 days.\n“The Court ENTERS a Preliminary Injunction prohibiting the State and Federal Defendants and their officers, agents, employees, attorneys, and any person who is in active concert or participation with them from (1) installing any additional industrial-style lighting (described by witnesses as “Sunbelt” lighting); or doing any paving, filling, excavating, or fencing; or doing any other site expansion, including placing or erecting any additional buildings, tents, dormitories, or other residential or administrative facilities on the TNT site; and (2) bringing any additional persons onto the TNT site who were not already being detained at the site at the time of this Order going into effect,” the judge wrote in an 82-page order reviewed by The Gateway Pundit.\nThe facility is located inside the Big Cypress National Preserve in Ochopee, FL at the Dade-Collier Training and Transition Airport.\nThis morning, during a press conference with Florida Highway Patrol to announce the results of a major immigration enforcement operation, Governor Ron DeSantis said that the ruling “is not going to deter us.”\nThis was not something that was unexpected. This is a judge that was not going to give us a fair shake. This was preordained. Very much an activist judge that is trying to do policy from the bench. This is not going to deter us. We are going to continue working on the deportations, advancing that mission. We knew that this would be something that would likely happen and we will respond accordingly.\nWe’re now in this position where we’re leading the state effort to help the Trump administration actually enforce the law and actually remove these illegal aliens from not just Florida, but from our country. That’s something that we didn’t have for four years and now that’s something that we’re absolutely on board with making sure happens going forward.\nNot only did Governor DeSantis stand in the gap against a federal judge trying to dismantle a state facility, the Florida governor doubled down on the creation of a new facility in the northern portion of the state to be known as the “Deportation Depot”:\nI would also note that because of the success of Alligator Alcatraz, there’s demand for more. So I did announce that we’re going to be opening another facility right outside of Jacksonville in Baker County. We’ve called that the “Deportation Depot.” So that is something will be able to hold another 2,000 and there’s an airport close by. So you have the processing and the removal.\nDuring the announcement, Gov. DeSantis called on the Republican-led Congress to defund sanctuary states like California, who issued a commercial drivers license to an illegal alien who killed three Floridians when he made an illegal U-turn on the Florida Turnpike in St. Lucie County.\nJUST IN – GOV. RON DESANTIS: “We’ve got a Republican Congress! All these guys that run when they ask you for their vote, ‘Oh, I’m going to secure the border, I’m going to be tough on immigration.’ Not one runs openly on being weak on immigration, right? Because they know they… pic.twitter.com/WBZ3hBvgQT\n— Florida’s Voice (@FLVoiceNews) August 22, 2025\nBREAKING: @GovRonDeSantis announces deportations will continue at Alligator Alcatraz as they fight the ruling from an activist judge\n“We’re not gonna be deterred. We’re totally in the right on this.”\n“We are gonna be opening another facility…Deportation Depot.” pic.twitter.com/9YL6RKJyN3\n— Florida’s Voice (@FLVoiceNews) August 22, 2025\nGovernor DeSantis Announces Results of Major Immigration Enforcement Operation https://t.co/A1oooXaW3D\n— Ron DeSantis (@GovRonDeSantis) August 22, 2025"
    },
    {
      "news_title": "DeSantis responds to ‘Alligator Alcatraz’ ruling, touts ‘Deportation Depot’",
      "news_link": "https://thehill.com/homenews/state-watch/5466219-desantis-responds-to-alligator-alcatraz-ruling-touts-deportation-depot/",
      "bias": "Center",
      "text": null
    },
    {
      "news_title": "DeSantis plans to challenge judge’s ruling to shut down Alligator Alcatraz",
      "news_link": "https://www.tampabay.com/news/florida-politics/2025/08/22/desantis-alligator-alcatraz-judge-immigrant-detention/",
      "bias": "Center",
      "text": "Anyone can view a sampling of recent comments, but you must be a Times subscriber to contribute. Log in above or subscribe here.\nConversations are opinions of our readers and are subject to the Community Guidelines.\nThe Tampa Bay Times e-Newspaper is a digital replica of the printed paper seven days a week that is available to read on desktop, mobile, and our app for subscribers only. To enjoy the e-Newspaper every day, please subscribe."
    },
    {
      "news_title": "Immigration efforts continue in Florida despite judge’s ruling",
      "news_link": "https://floridaphoenix.com/2025/08/22/immigration-efforts-continue-in-florida-despite-judges-ruling/",
      "bias": "Left",
      "text": null
    },
    {
      "news_title": "DeSantis says Florida remains 'committed to the mission' despite ruling to stop expanding 'Alligator Alcatraz'",
      "news_link": "https://www.wptv.com/news/state/desantis-says-florida-remains-committed-to-the-mission-despite-ruling-to-stop-expanding-alligator-alcatraz",
      "bias": "Center",
      "text": "PANAMA CITY, Fla. — Gov. Ron DeSantis doubled down on his commitment to \"Alligator Alcatraz,\" a day after a judge ruled that the immigration detention center built in the middle of the Everglades must halt expansion.\nDuring a news conference in Panama City, the governor said the ruling by U.S. District Judge Kathleen Williams was something the state was expecting and would \"respond accordingly.\"\nWATCH BELOW: DeSantis says judge's ruling won't 'deter' state\n\"This is a judge that was not going to give us a fair shake,\" DeSantis said. \"This was preordained, very much an activist judge who is trying to do policy from the bench. This is not going to deter us.\"\nDespite the controversy surrounding \"Alligator Alcatraz,\" the governor called the facility a \"success,\" prompting a \"demand for more\" centers to hold undocumented immigrants.\nThe governor said his push to open a similar facility in Baker County, deemed the \"Deportation Depot,\" would not be set back by Thursday's ruling.\n\"We're committed to the mission,\" the governor said. \"We'll make sure to get the job done in the end.\"\nRead the judge's 82-page ruling below:\nState Files Appeal\nThe state of Florida filed a notice of appeal Thursday night, shortly after the ruling was issued.\n\"The deportations will continue until morale improves,\" DeSantis spokesman Alex Lanfranconi said in response to the judge's ruling.\nWilliams said she expected the population of the facility to decline within 60 days through the transferring of the detainees to other facilities, and once that happened, fencing, lighting and generators should be removed. She wrote that the state and federal defendants can't bring anyone other than those who are already being detained at the facility onto the property. The order does not prohibit modification or repairs to existing facilities, \"which are solely for the purpose of increasing safety or mitigating environmental or other risks at the site.\"\nThe preliminary injunction includes \"those who are in active concert or participation with” the state of Florida or federal defendants or their officers, agents, employees,\" the judge wrote in an 82-page order.\nWilliams said state officials never sufficiently explained why the facility needed to be in the middle of the Florida Everglades.\n\"What is apparent, however, is that in their haste to construct the detention camp, the State did not consider alternative locations,\" Williams said.\nWATCH BELOW: Environmental groups call ruling 'victory for the rule of law'\nJudge cites decades-long efforts to preserve Everglades\nWilliams said her order gave the state and federal defendants time to wind down the facility so that it can undergo the required environmental assessments. She noted the three-quarters century of efforts to preserve the Everglades.\n\"Since that time, every Florida governor, every Florida senator, and countless local and national political figures, including presidents, have publicly pledged their unequivocal support for the restoration, conservation, and protection of the Everglades,\" she wrote. \"This order does nothing more than uphold the basic requirements of legislation designed to fulfill those promises.\"\nPresident Donald Trump toured the facility last month and suggested it could be a model for future lockups nationwide as his administration races to expand the infrastructure necessary for increasing deportations.\nEnvironmental groups and the Miccosukee Tribe had argued that further construction and operations should be stopped until federal and state officials complied with federal environmental laws. Their lawsuit claims the project threatens environmentally sensitive wetlands that are home to protected plants and animals and would reverse billions of dollars' worth of environmental restoration.\nEve Samples, executive director of Friends of the Everglades, called the ruling a landmark victory for the Everglades and Americans who believe this imperiled wilderness should be protected.\n\"It sends a clear message that environmental laws must be respected by leaders at the highest levels of our government — and there are consequences for ignoring them,\" Samples said in a statement.\nSamples said Friday the ruling was a \"victory for the rule of law and for holding government accountable.\"\nMiccosukee Tribe Chairman Talbert Cypress said this isn't the first time the tribe has had to fight for its land and rights.\n\"We will always stand up for our culture, our sovereignty, and for the Everglades,\" Cypress said in a statement.\nThe state unsuccessfully argued in its defense that the National Environmental Policy Act doesn't apply to them, contending that it only applies to federal agencies.\n\"We also intend to vindicate other environmental laws, including violations we noticed under the Endangered Species Act, Clean Water Act, and laws that govern our public lands, like Big Cypress National Preserve,\" Elise Bennett, senior attorney for the Center for Biological Diversity, said.\nAttorneys for the state and federal defendants didn't immediately respond to emailed inquiries late Thursday. But they have previously argued that, although the detention center would be holding federal detainees, the construction and operation of the facility was entirely under the state of Florida, meaning the federal environmental law didn't apply.\nThe judge has said the detention facility was, at a minimum, a joint partnership between the state and federal government.\nThe detention center was quickly built almost two months ago at a lightly used, single-runway training airport in the middle of the Everglades. It currently holds several hundred detainees but was designed to eventually hold up to 3,000 detainees in temporary tent structures.\nRead more of WPTV's related coverage below:\nNational Politics\nFlorida must stop expanding ‘Alligator Alcatraz’ immigration center, judge says\nWPTV Investigates\nMan with disability deported, allegedly signed papers he couldn't understand\nMiami-Dade\nPart of lawsuit over legal rights of detainees at Everglades facility dismissed\nMiami-Dade\nHearing for 'Alligator Alcatraz' ends without immediate ruling\nWPTV Investigates\nWhat a federal lawsuit reveals about the inner-workings of Alligator Alcatraz\nWPTV Investigates\nEnvironmental court battle over 'Alligator Alcatraz' exposes impacts on state\nState\nDeSantis admin left county officials in the dark as detention facility built\nState\nThe Miccosukee Tribe of Florida wants to join lawsuit against Alligator Alcatraz\nMiami-Dade\nFlorida Democrats condemn 'Alligator Alcatraz' conditions after tour\nMiami-Dade\nWorms in food and wastewater on floor, say detainees at Everglades facility\nState\nNew lawsuit filed after state lawmakers denied access to Everglades facility\nMiami-Dade\nAttorney says client had no access to running water at Alligator Alcatraz\nMiami-Dade\nDetainees allege inhumane conditions at Everglades detention center\nState\n'Alligator Alcatraz' 2.0: Second detention center planned in Florida Everglades\nNational Politics\nFirst immigration detainees arrive at 'Alligator Alcatraz' center in Florida\nMiami-Dade\nPresident Trump visits 'Alligator Alcatraz' detention center\nMiami-Dade\nProtesters arrive at Alligator Alcatraz to share concerns, praise project\nState\nProtesters line highway in Florida Everglades to oppose 'Alligator Alcatraz'\nState\nEnvironmental groups sue to block 'Alligator Alcatraz'\nState\nDeSantis floats building another detention center in northern Florida\nMiami-Dade"
    },
    {
      "news_title": "‘Alligator Alcatraz’ fight: DeSantis vows to appeal judge's order to scale back Everglades immigrant-detention center",
      "news_link": "https://www.fox35orlando.com/news/alligator-alcatraz-fight-desantis-vows-appeal-judges-order-scale-back-everglades-immigrant-detention-center",
      "bias": "Center",
      "text": "‘Alligator Alcatraz’ fight: DeSantis vows to appeal judge's order to scale back Everglades immigrant-detention center\nORLANDO, Fla. - Florida Gov. Ron DeSantis is pushing ahead with plans for a controversial immigrant-detention center in the Everglades despite a federal judge’s order to begin dismantling parts of the facility.\nWhat we know:\nA federal judge has ordered Gov. Ron DeSantis’ administration to begin dismantling portions of a controversial immigrant-detention center in the Everglades, known as \"Alligator Alcatraz.\"\nCLICK TO DOWNLOAD THE FOX LOCAL APP\nThe ruling halts further construction, bans the transfer of new detainees and requires removal of fencing, lighting and equipment within 60 days. Environmental groups and the Miccosukee Tribe sued, arguing the state skipped a required federal environmental review.\nWhat we don't know:\nIt remains unclear whether the state will comply with the order during the appeals process. DeSantis’ office has not confirmed if dismantling will begin while the case moves to the 11th U.S. Circuit Court of Appeals.\nQuestions also linger over why the site was chosen in the Everglades and whether other detention centers, including one DeSantis has proposed in Baker County, will face similar challenges.\nThe backstory:\nThe lawsuit claims both the DeSantis and Trump administrations failed to follow the National Environmental Policy Act, which requires environmental-impact studies and public input before projects can proceed.\nThe Miccosukee Tribe says the facility, located near the Big Cypress National Preserve, threatens sacred ceremonial sites, tribal traditions and endangered species habitats. The facility has already disrupted access to off-road trails and plants used for medicine and ceremonies.\nWhat they're saying:\nThe Everglades facility has become a point of contention for critics who accuse the state of prioritizing political theater over legal requirements.\n\"We knew the minute this judge got the case, we knew exactly what she was going to do,\" said Gov. Ron DeSantis. \"This is not anything that was unexpected, but we will make sure to get the job done in the end.\"\nEnvironmental advocates say runoff and wastewater from the complex could pollute waterways where most Miccosukee tribal members live.\n\"We are still concerned because the psychic harm, the mental trauma that our children and our young adults are going to have to live with … will be felt for generations,\" explained Curtis Osceola, Miccosukee attorney. \"When it comes to our homelands, there is no compromise, and we will continue to fight.\"\nAttorney Paul Schwiep, for environmental groups, said, \"Any rational NEPA analysis … would conclude it makes no sense to build a 5,000-person detention center in the heart of the Everglades.\"\nSIGN-UP FOR FOX 35'S BREAKING NEWS, DAILY NEWS NEWSLETTERS\nThe Source: This story was written based on reporting by the Associated Press, the News Service of Florida, court filings and a news conference by Gov. Ron DeSantis, held on Aug. 22, 2025."
    },
    {
      "news_title": "Desantis vows to continue work on Alligator Alcatraz despite ruling ordering a halt",
      "news_link": "https://www.palmbeachpost.com/story/news/politics/state/2025/08/22/gov-ron-desantis-says-recent-ruling-wont-affect-running-of-alligator-alcatraz-mission/85779317007/",
      "bias": "Center",
      "text": "Desantis vows to continue work on Alligator Alcatraz despite ruling ordering a halt\n- A federal judge issued a temporary injunction to halt operations at \"Alligator Alcatraz,\" a Florida immigration detention center.\n- Florida Gov. Ron DeSantis vowed to continue deportations despite the ruling.\n- The Miccosukee Tribe and environmental groups celebrated the injunction as a win.\n- A separate lawsuit regarding detainee rights was transferred to a different court.\nThe aftershock of U.S. District Judge Kathleen Williams' is sending waves through the environmental and political realms as the future of Alligator Alcatraz, at this point, is unsure.\nBut less than a day after the ruling halting operations, Gov. Ron DeSantis said the state will not be deterred.\n\"We had a judge try to upset the apple cart with respect to our deportation and detainee center in south Florida at Alligator Alcatraz,\" Desantis said at a news conference in Panama City on Aug. 22. \"This is not something that was not expected. This was a judge that was not going to give us a fair shake.\"\nWilliams put in place a temporary injunction that says DeSantis and President Donald Trump should pack up all the trucks, bunks, tarps, fences and people and vacate the property.\nDeSantis response was no surprise to the opposition.\n\"This is a win for the environment,\" said Betty Osecola, an influential member of the Miccosukee Tribe of Indians of Florida. \"And though the preliminary injunction was issued, we still need to take a stand to continue this fight because we know very well the state and the federal government are going to continue in their efforts in appealing this decision.\"\nThe Miccosukee reservation is just a few miles from the Alligator Alcatraz site, which was formly a flight training center operated by Miami-Dade County.\nTo make matters more complicated, the facility is actually in Collier County, where commissioners have vowed to stay out of this divisive matter.\nAlligator Alcatraz is a controversial immigration detention center at the enterface of the Big Cypress National Preserve and Everglades National Park.\nConstruction started in June, after Florida Attorney General James Uthmeier announced the detention center on social media.\nThe center wasn't the idea of a planning staff, a review committee or even the Department of Homeland Security.\nAnd Alligator Alcatraz didn't go through the typical review process as DeSantis declared a state of emergency to avoid staff review and public comment periods.\n\"You have people that are in the country that have already been ordered to be removed by the system,\" DeSantis said. \"And the previous administration didn’t want to do anything.\"\nEarlier Aug. 22, Alex Lanfranconi, the governor's communications director, released a statement: “The deportations will continue until morale improves.”\nThe ruling stems from a June 27 lawsuit filed by Friends of the Everglades, the Center for Biological Diversity, and joined by the Miccosukee Tribe of Indians of Florida. The defendants in the case include the Florida Division of Emergency Management, the Department of Homeland Security, ICE, and Miami-Dade County.\n\"So, let's celebrate this win today, but let's stay determined for that fight for the long haul,\" Osceola said.\nDeSantis remained committed to the plan.\n\"We’re in the position of leading the state efforts to help the Trump administration remove these illegal aliens not just from Florida but from our country,\" he said.\nThe other Alligator Alcatraz lawsuit\nIn another case focusing on plaintiffs legal and civil rights, U.S. District Judge Rodolfo Ruiz ruled Aug. 18 the matter should move to a different court while also declaring part of the lawsuit moot.\nAt the heart of the case was whether the government had violated detainees’ rights to due process and legal counsel. Civil rights attorneys had said the remote Everglades facility made it nearly impossible for immigrants to speak confidentially with lawyers or even find out which immigration court can hear their cases.\nThe plaintiffs’ attorneys filed suit in the Southern District of Florida, which includes Miami-Dade County, though state and federal officials argued that it should have been filed in the Middle District of Florida, which includes Collier County.\nIn his 47-page order, Ruiz agreed, transferring the case to the middle district. He also dismissed the immigration-court allegations in the lawsuit, saying they were moot after a federal decision that judges at Krome North Processing Service Center would handle the detainees’ cases.\nThe case now heads to “a sister court in the Middle District of Florida to reach the merits of plaintiffs’ remaining claims under the First Amendment,” Ruiz wrote.\nDeSantis said the most recent ruling won't affect operations.\n\"This is not going to deter us. \"We’re going to continue the deportations and this mission,\" he said.\nBreaking News and Visuals Editor Stacey Henson contributed to this report."
    },
    {
      "news_title": "Governor DeSantis Defies Judge's Order to Halt Operations at 'Alligator Alcatraz': 'We're Not Gonna Be Deterred'",
      "news_link": "https://www.latintimes.com/governor-desantis-defies-judges-order-halt-operations-alligator-alcatraz-were-not-gonna-588731",
      "bias": "Lean Left",
      "text": "Florida Governor Ron DeSantis has responded defiantly to U.S. District Judge Kathleen Williams' ruling halting operations at Alligator Alcatraz by saying that his administration \"will not be deterred\" by the order.\nSpeaking at a news conference in Panama City, DeSantis introduced the subject noting that \"we had a judge try to upset the apple cart with respect to our deportation and detainee center in south Florida at Alligator Alcatraz.\"\nHe then continued:\n\"This was not something that was unexpected. This was a judge that was not going to give us a fair shake, this was preordained. It's an act from this judge that is trying to do policy from the bench. This is not going to deter us. We're going to keep working on the deportations, advancing that mission\"\nDeSantis went on to say that he's confident that \"we're totally in the right on this\" since \"we're leading the state efforts to help the Trump administration actually enforce the law to remove these illegal aliens from not just Florida but from our country.\" He also took the opportunity to say that he'd be doubling down on efforts with the recently-announced \"Deportation Depot.\"\nWilliams issued a temporary injunction on Thursday, requiring Florida authorities to begin dismantling parts of the Alligator Alcatraz facility—including temporary fencing, lighting, and generators—within 60 days, and to conduct environmental studies before further work proceeds. The court cited risks to the surrounding habitat, including the reduction of 2,000 acres of land used by Florida panthers and loss of access to trails for members of the Miccosukee Tribe.\nThe injunction stems from a June 27 lawsuit filed by Friends of the Everglades, the Center for Biological Diversity, and the Miccosukee Tribe. The plaintiffs argued that the construction and operation of the detention center violated environmental regulations and failed to consult stakeholders or assess risks.\nThe case is not the only one Alligator Alcatraz is facing, as Fort Myers News-Press points out. In another case focusing on plaintiffs legal and civil rights, U.S. District Judge Rodolfo Ruiz ruled earlier this week the matter should move to a different court while also declaring part of the lawsuit moot.\nAt the heart of that case is whether the government violated detainees' rights to due process and legal counsel, as civil rights attorneys have said the remote Everglades facility made it nearly impossible for immigrants to speak confidentially with lawyers or even find out which immigration court can hear their cases.\n© 2025 Latin Times. All rights reserved. Do not reproduce without permission."
    },
    {
      "news_title": "DeSantis vows to continue work on Alligator Alcatraz despite ruling ordering a halt",
      "news_link": "https://www.news-press.com/story/news/environment/2025/08/22/gov-ron-desantis-says-recent-ruling-wont-affect-running-of-alligator-alcatraz-mission/85775302007/",
      "bias": "Lean Left",
      "text": null
    },
    {
      "news_title": "DeSantis administration appeals judge's halt to ‘Alligator Alcatraz' expansion",
      "news_link": "https://www.nbcmiami.com/news/local/desantis-administration-appeals-judges-halt-to-alligator-alcatraz-expansion/3681267/",
      "bias": "Lean Left",
      "text": "Gov. Ron DeSantis’ administration quickly appealed a federal judge’s ruling Thursday that sided with environmental groups and the Miccosukee Tribe and required winding down operations at a controversial immigrant-detention facility in the Everglades.\nThe state filed a notice of appealing a preliminary injunction issued by U.S. District Judge Kathleen Williams that prevents additional construction and bringing additional detainees to the facility, which the state has dubbed “Alligator Alcatraz.” Williams also ordered the removal within 60 days of temporary fencing, detention-center lighting and such things as generators.\nWatch NBC6 free wherever you are\nAs is common, the notice filed by the state did not detail arguments the DeSantis administration will make at the Atlanta-based 11th U.S. Circuit Court of Appeals. Williams’ ruling came in a lawsuit filed against state and federal officials by Friends of the Everglades and the Center for Biological Diversity and joined by the Miccosukee Tribe.\n'ALLIGATOR ALCATRAZ' LATEST\n“Plaintiffs have provided extensive evidence supporting their claims of significant ongoing and likely future environmental harms from the project,” the 82-page ruling said. “By contrast, while the defendants repeatedly espouse the importance of immigration enforcement, they offered little to no evidence why this detention camp, in this particular location, is uniquely suited and critical to that mission.”\nThe state opened the detention facility last month at the Dade-Collier Training and Transition Airport, which is used for flight training. State officials touted it as part of an effort to support President Donald Trump’s fight against illegal immigration.\nState officials have disputed that the facility poses environmental threats and have cited the decades-long use of the airport. But Williams rejected such arguments, pointing to issues such as additional paving for the detention facility and high-powered lights.\n“The light pollution is far worse now than before the camp’s construction,” Williams wrote. “The addition of 800,000 square feet of asphalt paving (with another 1 million planned) increases harmful water runoff relative to the areas previously paved. The frenetic human activity, including vehicular traffic and wastewater from thousands of people daily, was essentially absent prior to the detention camp’s construction.”\nSpeaking at a news conference on Friday, DeSantis criticized the ruling from Williams, who was appointed by then-President Barack Obama.\n\"This was not something that was unexpected. This is a judge that was not going to give us a fair shake. This was preordained, very much an activist judge that is trying to do policy from the bench,\" DeSantis said. \"This is not going to deter us. We're going to continue working on the deportations, advancing that mission. We knew that this would be something that would likely happen, and we will respond accordingly.\"\nThe lawsuit, filed in the federal Southern District of Florida, alleges violations of the National Environmental Policy Act, a federal law that requires evaluating potential environmental impacts before such a project can move forward.\nWilliams wrote Thursday that there was “no process” to evaluate the risks of the facility, which is surrounded by the Big Cypress National Preserve.\nIt was not immediately clear how many immigrants are detained at the facility. State officials initially said it would house up to 3,000 detainees and could be expanded to add 1,000 people. State Division of Emergency Management Director Kevin Guthrie said last week the facility had a capacity for 2,000 detainees and held 1,000.\n\"This mission is important. You either have a country or you don't. You have people that are in this country that have already been ordered to be removed by the current system, and yet the previous administration didn't want to do anything about it,\" DeSantis said Friday. \"We're committed to the mission. We're not going to be deterred. We see this happening all over the country. We knew the minute this judge got the case, we knew exactly what she was going to do. This is not anything that was unexpected, but we'll make sure to get the job done in the end.\"\nWilliams’ ruling Thursday came after she issued a temporary restraining order on Aug. 7 that blocked state and federal officials from further expansion of the facility. The temporary restraining order was slated to last two weeks.\nThe environmental lawsuit is one of two closely watched cases about the facility. The other case involves issues about access to legal representation for detainees."
    },
    {
      "news_title": "“Not Going to Deter Us” – Governor DeSantis Responds To Judge’s Order to Close ‘Alligator Alcatraz’",
      "news_link": "https://politicom.com.au/not-going-to-deter-us-governor-desantis-responds-to-judges-order-to-close-alligator-alcatraz/?utm_source=rss&utm_medium=rss&utm_campaign=not-going-to-deter-us-governor-desantis-responds-to-judges-order-to-close-alligator-alcatraz",
      "bias": "unknown",
      "text": "Yesterday, The Gateway Pundit reported that US District Judge Kathleen Williams had ordered a South Florida Detention Facility affectionately nicknamed ‘Alligator Alcatraz’ to cease receiving new detainees and dismantle the facility in 60 days.\n“The Court ENTERS a Preliminary Injunction prohibiting the State and Federal Defendants and their officers, agents, employees, attorneys, and any person who is in active concert or participation with them from (1) installing any additional industrial-style lighting (described by witnesses as “Sunbelt” lighting); or doing any paving, filling, excavating, or fencing; or doing any other site expansion, including placing or erecting any additional buildings, tents, dormitories, or other residential or administrative facilities on the TNT site; and (2) bringing any additional persons onto the TNT site who were not already being detained at the site at the time of this Order going into effect,” the judge wrote in an 82-page order reviewed by The Gateway Pundit.\nThe facility is located inside the Big Cypress National Preserve in Ochopee, FL at the Dade-Collier Training and Transition Airport.\nThis morning, during a press conference with Florida Highway Patrol to announce the results of a major immigration enforcement operation, Governor Ron DeSantis said that the ruling “is not going to deter us.”\nThis was not something that was unexpected. This is a judge that was not going to give us a fair shake. This was preordained. Very much an activist judge that is trying to do policy from the bench. This is not going to deter us. We are going to continue working on the deportations, advancing that mission. We knew that this would be something that would likely happen and we will respond accordingly.\nWe’re now in this position where we’re leading the state effort to help the Trump administration actually enforce the law and actually remove these illegal aliens from not just Florida, but from our country. That’s something that we didn’t have for four years and now that’s something that we’re absolutely on board with making sure happens going forward.\nNot only did Governor DeSantis stand in the gap against a federal judge trying to dismantle a state facility, the Florida governor doubled down on the creation of a new facility in the northern portion of the state to be known as the “Deportation Depot”:\nI would also note that because of the success of Alligator Alcatraz, there’s demand for more. So I did announce that we’re going to be opening another facility right outside of Jacksonville in Baker County. We’ve called that the “Deportation Depot.” So that is something will be able to hold another 2,000 and there’s an airport close by. So you have the processing and the removal.\nDuring the announcement, Gov. DeSantis called on the Republican-led Congress to defund sanctuary states like California, who issued a commercial drivers license to an illegal alien who killed three Floridians when he made an illegal U-turn on the Florida Turnpike in St. Lucie County.\nJUST IN – GOV. RON DESANTIS: “We’ve got a Republican Congress! All these guys that run when they ask you for their vote, ‘Oh, I’m going to secure the border, I’m going to be tough on immigration.’ Not one runs openly on being weak on immigration, right? Because they know they… pic.twitter.com/WBZ3hBvgQT\n— Florida’s Voice (@FLVoiceNews) August 22, 2025\nBREAKING: @GovRonDeSantis announces deportations will continue at Alligator Alcatraz as they fight the ruling from an activist judge\n“We’re not gonna be deterred. We’re totally in the right on this.”\n“We are gonna be opening another facility…Deportation Depot.” pic.twitter.com/9YL6RKJyN3\n— Florida’s Voice (@FLVoiceNews) August 22, 2025\nGovernor DeSantis Announces Results of Major Immigration Enforcement Operation https://t.co/A1oooXaW3D\n— Ron DeSantis (@GovRonDeSantis) August 22, 2025\nThe post “Not Going to Deter Us” – Governor DeSantis Responds To Judge’s Order to Close ‘Alligator Alcatraz’ appeared first on The Gateway Pundit."
    },
    {
      "news_title": "Sides Gear Up for Continued 'Alcatraz' Fight",
      "news_link": "https://www.newsserviceflorida.com/latest/headlines/sides-gear-up-for-continued-alcatraz-fight/article_9e0faf4c-7c25-487d-8417-616946067895.html",
      "bias": "unknown",
      "text": null
    }
  ]
}