{
  "story_id": "GN_20250823_200532_6d877fc9",
  "metadata": {
    "title": "Texas lawmakers give final approval to Trump-backed election map, sending it to governor",
    "timestamp": "2025-08-23T20:05:32.737060",
    "url": "https://ground.news/article/texas-lawmakers-give-final-approval-to-trump-backed-election-map-sending-it-to-governor_1e3655"
  },
  "bias_distribution": {
    "total_sources": "66",
    "leaning_left": "14",
    "center": "29",
    "leaning_right": "6"
  },
  "perspective_summaries": {
    "left": [
      "Texas lawmakers approved a redrawn election map to increase Republican seats, following a request from President Donald Trump.",
      "The new map could give Republicans up to five additional U.S. House seats in the upcoming midterm elections.",
      "This decision sparked a national redistricting conflict, particularly influencing California's efforts.",
      "Democrats claimed the map would unconstitutionally suppress Black and Latino votes in Texas."
    ],
    "center": [
      "Early Saturday, the Texas state Senate approved a new Republican-leaning congressional map, sending it to Governor Greg Abbott who is expected to sign it into law.",
      "National GOP pressure led Republican-controlled states, including Texas, to redraw maps aimed at helping the GOP retain a slim House majority for 2026.",
      "Democrats delayed passage with prolonged debate and a walkout as state senators voted 18-11 along party lines after more than eight hours, with Republicans ending a filibuster using a rare motion.",
      "Governor Greg Abbott is expected to quickly sign the maps into law, while Democrats vow court challenges and Democratic Representative Lloyd Doggett announced Thursday he will not seek reelection if the new map takes effect.",
      "The effort has triggered a nationwide wave of redistricting, with California Democrats and Governor Gavin Newsom proposing a special election in November and the U.S. Supreme Court setting limits on partisan and race-based map drawing."
    ],
    "right": [
      "The Texas Senate approved a Republican-leaning congressional voting map, sending it to Governor Greg Abbott for his signature, with a vote of 18-11 after eight hours of debate.",
      "President Donald Trump backed the map aimed at maintaining Republican control in the 2026 midterm elections, featuring five new districts favoring the GOP.",
      "Democrats in Texas planned to challenge the map in court, expressing concerns about its legality and ethics.",
      "Governor Greg Abbott stated, 'The One Big Beautiful Map has passed the Senate and is on its way to my desk, where it will be swiftly signed into law."
    ]
  },
  "sources": [
    {
      "news_title": "Texas Senate Passes Redistricting Map, Sends It to Governor",
      "news_link": "https://www.newsmax.com/politics/redistricting-texas-california/2025/08/23/id/1223629/",
      "bias": "Right",
      "text": "The Texas Senate gave final approval to a new, Republican-leaning congressional voting map early Saturday, sending it to Gov. Greg Abbott for his signature.\nPresident Donald Trump has pushed for the map to help the GOP maintain its slim majority in Congress in the 2026 midterm elections. It has five new districts that would favor Republicans.\nAbbott, a Republican, is expected to quickly sign it into law, though Democrats have vowed to challenge it in court.\nThe effort by Trump and Texas’ Republican-majority Legislature prompted state Democrats to hold a two-week walkout and kicked off a wave of redistricting efforts across the country.\nDemocrats had prepared for a final show of resistance, with plans to push the Senate vote into the early morning hours in a last-ditch attempt to delay passage.\nState Sen. Carol Alvarado, leader of the Senate Democratic caucus, announced on social media that she planned to filibuster the bill with a long speech and intended to speak for several hours. But just when she expected to start, the Senate broke for a long dinner break.\nWhen members returned, Alvarado never had a chance to filibuster because Republicans accused her of breaking a rule, saying she used a campaign email to promote her filibuster as fundraising.\nSen. Charles Perry said it “appears to be potentially unlawful, at least unethical, using state resources for a campaign purpose.”\nA spokesperson for Alvarado did not immediately respond to a request for comment.\nThe weekslong showdown has roiled the Texas Legislature, marked by a Democratic walkout and threats of arrest from Republicans. Much of the drama unfolded in the House, where the map ultimately passed Wednesday.\nDemocrats had already delayed the bill's passage during hours of debate, pressing Republican Sen. Phil King, the measure’s sponsor, on the proposal's legality, with many alleging that the redrawn districts violate the Voting Rights Act by diluting voters’ influence based on race.\nKing vehemently denied that accusation, saying, “I had two goals in mind: That all maps would be legal and would be better for Republican congressional candidates in Texas.”\n“There is extreme risk the Republican majority will be lost” in the House if the map does not pass, King said.\nThe showdown has also inflamed a broader, state-by-state redistricting battle, with governors from both parties pledging to redraw congressional maps.\nCalifornia Democrats approved legislation Thursday calling for a special election in November for residents to vote on a redrawn congressional map designed to help Democrats win five more House seats next year. Gov. Gavin Newsom quickly signed it.\n“This is not something six weeks ago that I ever imagined that I’d be doing,” Newsom said. “This is a reaction to an assault on our democracy in Texas.”\nCalifornia’s map needs voter approval because, unlike in Texas, a nonpartisan commission normally draws the map to avoid the sort of political battle that is playing out.\nOn Friday, Abbott called California’s redistricting “a joke” and asserted that Texas’ new map is constitutional but California’s would be overturned.\nOn a national level, the partisan makeup of existing districts puts Democrats within three seats of a majority. The incumbent president’s party usually loses seats in the midterms.\nThe Texas redraw is already reshaping the 2026 race, with Democratic Rep. Lloyd Doggett, the dean of the state's congressional delegation, announcing Thursday that he will not seek reelection to his Austin-based seat if the new map takes effect. Under the proposed map, Doggett's district would overlap with that of another Democratic incumbent, Rep. Greg Casar.\nThe president has pushed other Republican-controlled states including Indiana and Missouri, to also revise their maps to add more winnable GOP seats. Ohio Republicans were also already scheduled to revise their maps to make them more partisan.\n“Republicans are not finished in the United States,” Abbott said.\nRedistricting typically occurs once a decade, immediately after a census. While some states have their own limitations, there is no national impediment to a state trying to redraw districts in the middle of the decade.\nThe U.S. Supreme Court has said the Constitution does not outlaw partisan gerrymandering, only using race to redraw district lines.\nMore Democratic-run states have commission systems like California’s or other redistricting limits than Republican ones do, leaving the GOP with a freer hand to swiftly redraw maps. New York, for example, cannot draw new maps until 2028 — and even then, only with voter approval.\nRepublicans and some Democrats championed a 2008 ballot measure that established California’s nonpartisan redistricting commission, along with a 2010 one that extended its role to drawing congressional maps.\nBoth sides have shown concern over what the redistricting war could lead to.\nCalifornia Assemblyman James Gallagher, the Republican minority leader, said Trump was “wrong” to push for new Republican seats elsewhere. But he warned that Newsom’s approach, which the governor has dubbed “fight fire with fire,” is dangerous.\n“You move forward fighting fire with fire, and what happens?” Gallagher asked. “You burn it all down.”\nCopyright 2025 The Associated Press. All rights reserved. This material may not be published, broadcast, rewritten or redistributed without permission."
    },
    {
      "news_title": "Texas House approves new congressional map",
      "news_link": "https://helenair.com/article_3d9ba7d1-edf5-5c34-8410-77c36a36096a.html",
      "bias": "Center",
      "text": null
    },
    {
      "news_title": "Texas Senate Passes Big Beautiful Congressional Redistricting Map After 8-Hour Debate",
      "news_link": "https://www.breitbart.com/border/2025/08/23/texas-senate-passes-big-beautiful-congressional-redistricting-map-after-8-hour-debate/",
      "bias": "Right",
      "text": "The Texas Senate passed the “Big Beautiful Map” shortly after midnight Saturday morning. The party-line vote to approve the map came after a planned filibuster by Senator Carol Alvarado (D-Houston) was canceled by Republican senators using a parliamentary procedure.\nThe Texas Senate voted 18-11 to pass the Senate bill authorizing a new mid-census congressional redistricting map. The vote took place at 12:30 a.m. on Saturday, following more than eight hours of debate. Senator Alvarado announced plans to filibuster the bill and continue the debate well into Saturday. Her plans were cut short when the Senate Republican Caucus discovered Alvarado planned to use the filibuster as a fund-raising gimmick.\nIn a letter to Lt. Governor Dan Patrick (R), Alvarado described the bill as an “extraordinary attempt to redraw the lines in the middle of the decade.” She said the bill would create a “dangerous precedent where politicians could redraw maps to pick their voters before every election.”\n“I intend to use every procedural tool available under Senate rules” to oppose the bill.\nApparently, according to the New York Post, Alvarado also planned to use a catheter and a urine bag to assist her in carrying out the extended filibuster.\nShortly before Alvarado was to begin her debate, the Senate announced a long break for dinner.\nRELATED ARTICLES:\n- Texas House Democrats Flee State in Order to Block GOP Redistricting Plan\n- Gov. Abbott to Texas House Dems: Show Up to Work Monday or Be Fired\n- Gov. Abbott Orders Arrest of Texas’s ‘Delinquent House Democrats’\n- Texas Governor Orders Criminal Investigation of House Democrats for Possible Bribery Charges\n- FBI Asked to Assist Texas Authorities in Locating, Arresting Texas House Dems Who Fled the State\n- More than Four Dozen Texas House Democrats Fled the State\n- Abbott Files Lawsuit to Start Removal ‘Derelict Democrat Texas House Members’ Who Fled State to Block Redistricting Bill\n- Texas AG Launches Investigation into Beto O’Rourke’s Political Group’s Financial Support of Quorum-Breaking Democrats\n- NO QUORUM: House Speaker Hits Fleeing Texas Dems in Pocketbook, Paychecks Held at Capitol, Budgets Cut\n- Texas Court Blocks ‘Beto Bribes’ Supporting Runaway House Democrats — O’Rourke Loses Again\n- Governor Abbott Delivers George Strait Checks to Texas Flood Victims Ignored by Fleeing House Democrats\n- Gerrymandering by the Numbers: Democrat-Run State Congressional Maps Disenfranchise Republican Voters\n- Report: Texas Democrat Fugitives Concede, Will Return to Austin\n- Texas Democrat Rep. Locks Self in House Chamber After Refusing Police Escort\n- Texas House Passes One Big Beautiful Congressional Redistricting Map\n- Gavin Newsom Signs Gerrymandering Bills; California Moves BEFORE Texas\n- REPORT: Runaway Texas Democrats Fined $9K for Quorum-Busting Stunt\nHer plans came to an abrupt end when Republicans discovered an Alvarado campaign email promoting “her filibuster as a fundraising opportunity,” the Senate Republican Caucus wrote in a statement Saturday morning.\nThe Republican senators said Alvarado’s campaign email violated the “long-standing traditions, ethics, and decorum of the Texas Senate.” The senators seized the opportunity to exercise a parliamentary procedure by “calling the question,” forcing a vote on the measure.\n“Shutting down a filibuster over a fundraising email is unprecedented,” Democratic Sen. Sarah Eckhardt (D-Bastrop) said in a post on social media. “It exposes the hypocrisy of Republicans, who will turn around and raise millions off stealing Texans’ votes while silencing their voices.”\nRepublicans responded, writing:\nUsing the Senators, the employees, and support resources to bolster Sen. Alvarado’s fundraising activities effectively holds hostage the entire Senate and forces emplaoyees to assist and participate in her campaign. Every other Senate member and each employee is a ‘prop’ to support Sen. Alavarado’s campaign.\nGiven this unprededented situation, as the Republican Caucus, we move to call the previous question and end this political debate.\nThe Republican senators also claimed that Alavarado’s filibuster and fundraising campaign would appear to be “unlawfully and unethiclally using state resources for a campaign purpose.”\nAs the vote was called, 18 Republicans voted yea and 11 Democrats voted nay.\nThe Texas House passed the redistricting map earlier this week on a partisan vote of 88-52.\nThe measure now proceeds to Governor Greg Abbott for signature into law.\nAbbott responded to the passage, writing, “The One Big Beautiful Map has passed the Senate and is on its way to my desk, where it will be swiftly signed into law. I promised we would get this done, and delivered on that promise. I thank Lieutenant Governor Dan Patrick for leading the passage in the Senate of a bill that ensures our maps reflect Texans’ voting preferences.”\nBob Price is the Breitbart Texas-Border team’s associate editor and senior news contributor. He is an original member of the Breitbart Texas team. Price is a regular panelist on Fox 26 Houston’s What’s Your Point? Sunday morning talk show. He is a U.S. Air Force veteran and serves as president of Blue Wonder Gun Care Products.\nCOMMENTS\nPlease let us know if you're having issues with commenting."
    },
    {
      "news_title": "Texas Senate approves new map, sending it to Abbott’s desk",
      "news_link": "https://thehill.com/homenews/campaign/5464117-texas-senate-approves-gop-redistricting-map/",
      "bias": "Center",
      "text": null
    },
    {
      "news_title": "Texas senate approves redrawn congressional map favoring GOP, sends to governor",
      "news_link": "https://www.wtae.com/article/texas-senate-approves-redrawn-congressional-map/65876845",
      "bias": "Center",
      "text": "Texas lawmakers give final approval to redrawn congressional map favoring GOP, send to governor\nThe Texas Senate gave final approval to a new, Republican-leaning congressional voting map early Saturday, sending it to Gov. Greg Abbott for his signature.\nPresident Donald Trump has pushed for the map to help the GOP maintain its slim majority in Congress in the 2026 midterm elections. It has five new districts that would favor Republicans.\nAbbott, a Republican, is expected to quickly sign it into law, though Democrats have vowed to challenge it in court.\nThe effort by Trump and Texas’ Republican-majority Legislature prompted state Democrats to hold a two-week walkout and kicked off a wave of redistricting efforts across the country.\nDemocrats had prepared for a final show of resistance, with plans to push the Senate vote into the early morning hours in a last-ditch attempt to delay passage.\nState Sen. Carol Alvarado, leader of the Senate Democratic caucus, announced on social media that she planned to filibuster the bill with a long speech and intended to speak for several hours. But just when she expected to start, the Senate broke for a long dinner break.\nWhen members returned, Alvarado never had a chance to filibuster because Republicans accused her of breaking Senate rules by attempting to fundraise off the coming filibuster.\nSen. Charles Perry said it “appears to be potentially unlawful, at least unethical, using state resources for a campaign purpose.”\nA spokesperson for Alvarado did not immediately respond to an email and phone call from The Associated Press.\n“Shutting down a filibuster over a fundraising email is unprecedented,” Democratic Sen. Sarah Eckhardt said in a post on social media platform X. “It exposes the hypocrisy of Republicans, who will turn around and raise millions off stealing Texans’ votes while silencing their voices.”\nThe weekslong showdown has roiled the Texas Legislature, marked by a Democratic walkout and threats of arrest from Republicans. Much of the drama unfolded in the House, where the map ultimately passed Wednesday.\nDemocrats had already delayed the bill's passage during hours of debate, pressing Republican Sen. Phil King, the measure’s sponsor, on the proposal's legality, with many alleging that the redrawn districts violate the Voting Rights Act by diluting voters’ influence based on race.\nKing vehemently denied that accusation, saying, “I had two goals in mind: That all maps would be legal and would be better for Republican congressional candidates in Texas.”\n“There is extreme risk the Republican majority will be lost” in the House if the map does not pass, King said.\nThe showdown has also inflamed a broader, state-by-state redistricting battle, with governors from both parties pledging to redraw congressional maps.\nCalifornia Democrats approved legislation Thursday calling for a special election in November for residents to vote on a redrawn congressional map designed to help Democrats win five more House seats next year. Gov. Gavin Newsom quickly signed it.\n“This is not something six weeks ago that I ever imagined that I’d be doing,” Newsom said. “This is a reaction to an assault on our democracy in Texas.”\nCalifornia’s map needs voter approval because, unlike in Texas, a nonpartisan commission normally draws the map to avoid the sort of political battle that is playing out.\nOn Friday, Abbott called California’s redistricting “a joke” and asserted that Texas’ new map is constitutional but California’s would be overturned.\nBattle for the House waged via redistricting\nOn a national level, the partisan makeup of existing districts puts Democrats within three seats of a majority. The incumbent president’s party usually loses seats in the midterms.\nThe Texas redraw is already reshaping the 2026 race, with Democratic Rep. Lloyd Doggett, the dean of the state's congressional delegation, announcing Thursday that he will not seek reelection to his Austin-based seat if the new map takes effect. Under the proposed map, Doggett's district would overlap with that of another Democratic incumbent, Rep. Greg Casar.\nThe president has pushed other Republican-controlled states, including Indiana and Missouri, to also revise their maps to add more winnable GOP seats. Ohio Republicans were also already scheduled to revise their maps to make them more partisan.\n“Republicans are not finished in the United States,” Abbott said.\nRedistricting typically occurs once a decade, immediately after a census. While some states have their own limitations, there is no national impediment to a state trying to redraw districts in the middle of the decade.\nThe U.S. Supreme Court has said the Constitution does not outlaw partisan gerrymandering, only using race to redraw district lines.\n‘Fight fire with fire’\nMore Democratic-run states have commission systems like California’s or other redistricting limits than Republican ones do, leaving the GOP with a freer hand to swiftly redraw maps. New York, for example, cannot draw new maps until 2028, and even then, only with voter approval.\nRepublicans and some Democrats championed a 2008 ballot measure that established California’s nonpartisan redistricting commission, along with a 2010 one that extended its role to drawing congressional maps.\nBoth sides have shown concern over what the redistricting war could lead to.\nCalifornia Assemblyman James Gallagher, the Republican minority leader, said Trump was “wrong” to push for new Republican seats elsewhere. But he warned that Newsom’s approach, which the governor has dubbed “fight fire with fire,” is dangerous.\n“You move forward fighting fire with fire, and what happens?” Gallagher asked. “You burn it all down.”\nCappelletti reported from Washington and Golden from Seattle."
    },
    {
      "news_title": "Texas Senate approves redrawn congressional map favouring Republicans",
      "news_link": "https://www.aljazeera.com/news/2025/8/23/texas-senate-approves-redrawn-congressional-map-favouring-republicans",
      "bias": "Lean Left",
      "text": "Texas Senate approves redrawn congressional map favouring Republicans\nGovernor Greg Abbott is expected to quickly sign it into law, though Democrats have vowed to challenge it in court.\nThe Texas Senate has given final approval to a new Republican-leaning congressional voting map, sending it to Governor Greg Abbott for his signature.\nThe state senate voted along party lines to pass the map 18-11 shortly after midnight on Saturday, following more than eight hours of heated debate.\nRecommended Stories\nlist of 4 itemsUS lawmakers approve Democrat redistricting plan in California\nWhat’s the Texas redistricting fight about, and how has California reacted?\nUS court blocks Texas law requiring Ten Commandments in school classrooms\nPresident Donald Trump has pushed for the map to help the GOP maintain its slim majority in Congress in the 2026 midterm elections. It has five new districts that would favour Republicans.\nAbbott, a Republican, is expected to quickly sign it into law, though Democrats have promised to challenge it in court.\nThe effort by Trump and Texas’s Republican-majority legislature prompted state Democrats to hold a two-week walkout and kicked off a wave of redistricting efforts across the country.\nThe weeks-long showdown has roiled the Texas Legislature. Much of the drama unfolded in the House, where the map ultimately passed on Wednesday.\nThe showdown has also inflamed a broader, state-by-state redistricting battle, with governors from both parties pledging to redraw congressional maps.\nCalifornia Democrats approved legislation on Thursday calling for a special election in November for residents to vote on a redrawn congressional map designed to help Democrats win five more House seats next year. Governor Gavin Newsom quickly signed it.\nCalifornia’s map needs voter approval because, unlike in Texas, a nonpartisan commission normally draws the map to avoid the sort of political battle that is playing out.\nOn Friday, Abbott called California’s redistricting “a joke” and asserted that Texas’s new map is constitutional but California’s would be overturned.\nTrump wants more states to revise maps\nOn a national level, the partisan makeup of existing districts puts Democrats within three seats of a majority. The incumbent president’s party usually loses seats in the midterms.\nThe Texas redraw is already reshaping the 2026 race, with Democratic Representative Lloyd Doggett, the dean of the state’s congressional delegation, announcing on Thursday that he will not seek re-election to his Austin-based seat if the new map takes effect.\nUnder the proposed map, Doggett’s district would overlap with that of another Democratic incumbent, Republican Greg Casar.\nTrump has pushed other Republican-controlled states, including Indiana and Missouri, to also revise their maps to add more winnable GOP seats.\nOhio Republicans were also already scheduled to revise their maps to make them more partisan.\nRedistricting typically occurs once a decade, immediately after a census. While some states have their own limitations, there is no national impediment to a state trying to redraw districts in the middle of the decade.\nThe US Supreme Court has said the Constitution does not outlaw partisan gerrymandering, only using race to redraw district lines."
    },
    {
      "news_title": "Week in Politics: Trump and Putin; possible rate cuts; lawmakers and redistricting",
      "news_link": "https://www.npr.org/2025/08/23/nx-s1-5509911/week-in-politics-trump-and-putin-possible-rate-cuts-lawmakers-and-redistricting",
      "bias": "Lean Left",
      "text": "Week in Politics: Trump and Putin; possible rate cuts; lawmakers and redistricting\nWeek in Politics: Trump and Putin; possible rate cuts; lawmakers and redistricting\nWe discuss the latest political developments, including President Trump's crackdown in Wahington, D.C., and redistricting efforts in Texas and California."
    },
    {
      "news_title": "Texas congressional map favouring Republicans passed",
      "news_link": "https://www.newcastleherald.com.au/story/9048114/texas-congressional-map-favouring-republicans-passed/",
      "bias": "Lean Left",
      "text": "The Texas Senate has approved a bill to redraw the state's congressional maps at the behest of President Donald Trump in an effort to flip five seats held by Democrats to Republicans.\nSubscribe today for the news that matters\nor signup to continue reading\nThe approval comes after the state House passed it on Wednesday, US media reported.\nThe measure goes to Governor Greg Abbott, like Trump a Republican, to be signed into law amid a nationwide redistricting battle.\nState senator Carol Alvarado, a Democrat, said on social media on Friday that she planned to delay the measure by speaking continuously about it in the legislature, a move known as a filibuster.\nBut a rare procedural motion by Senate Republicans just after midnight on Saturday ended the debate and killed the filibuster, moving the chamber straight to the final vote, the Texas Tribune reported.\nThe Senate adopted the bill on a party-line vote, 18 to 11, after more than eight hours of debate, the report said.\nRepublicans have acknowledged they believe winning more congressional seats in Texas will help the party maintain its slim majority in the US House of Representatives in the 2026 midterm elections, despite polls showing headwinds for the party.\nMore states controlled by Republicans are considering similar action.\nCalifornia and other states where Democrats hold power vow to counter such moves.\nThe California legislature on Thursday approved a redistricting plan aimed at giving Democrats five more congressional seats - a move that must be approved by voters in November.\nThe Texas plan does not need voter approval, but Democrats have indicated they will challenge it in court.\nThe Texas bill was delayed for two weeks after more than 50 Democratic state House members staged a walkout that denied Republicans the legislative quorum needed. They have returned.\nDuring debate on Friday, some lawmakers echoed criticism that Democrats raised in the House, that the new Texas map violates federal law by diluting Hispanic and Black voting power and discriminating on the basis of race.\nSenator Royce West, a Democrat, predicted the new map would reduce the number of African Americans representing Texas in Washington from four to two.\n\"I call that retrogression,\" West said.\nTexas senator Phil King, a Republican who sponsored the bill, said repeatedly he had not considered race and lawyers had assured him the bill met all legal requirements.\n\"From my perspective, why would I use racial data?\" he told his fellow senators.\n\"Voting history is just much more accurate and is well established as a legal way to draw maps.\"\nMost Americans believe redrawing congressional lines for the sake of maximising political gain, known as gerrymandering, is bad for democracy, a Reuters/Ipsos poll found this week.\nAustralian Associated Press"
    },
    {
      "news_title": "Texas lawmakers give final approval to redrawn congressional map favoring GOP",
      "news_link": "https://abcnews.go.com/Politics/wireStory/texas-lawmakers-give-final-approval-redrawn-congressional-map-124879229",
      "bias": "Lean Left",
      "text": "Texas lawmakers give final approval to redrawn congressional map favoring GOP\nThe Texas Senate has given final approval to a new, Republican-leaning congressional voting map, sending it to Gov. Greg Abbott for his signature\nAUSTIN, Texas -- The Texas Senate gave final approval to a new, Republican-leaning congressional voting map early Saturday, sending it to Gov. Greg Abbott for his signature.\nPresident Donald Trump has pushed for the map to help the GOP maintain its slim majority in Congress in the 2026 midterm elections. It has five new districts that would favor Republicans.\nAbbott, a Republican, is expected to quickly sign it into law, though Democrats have vowed to challenge it in court.\nThe effort by Trump and Texas’ Republican-majority Legislature prompted state Democrats to hold a two-week walkout and kicked off a wave of redistricting efforts across the country.\nDemocrats had prepared for a final show of resistance, with plans to push the Senate vote into the early morning hours in a last-ditch attempt to delay passage.\nState Sen. Carol Alvarado, leader of the Senate Democratic caucus, announced on social media that she planned to filibuster the bill with a long speech and intended to speak for several hours. But just when she expected to start, the Senate broke for a long dinner break.\nWhen members returned, Alvarado never had a chance to filibuster because Republicans accused her of breaking Senate rules by attempting to fundraise off the coming filibuster.\nSen. Charles Perry said it “appears to be potentially unlawful, at least unethical, using state resources for a campaign purpose.”\nA spokesperson for Alvarado did not immediately respond to an email and phone call from The Associated Press.\n“Shutting down a filibuster over a fundraising email is unprecedented,” Democratic Sen. Sarah Eckhardt said in a post on social media platform X. “It exposes the hypocrisy of Republicans, who will turn around and raise millions off stealing Texans’ votes while silencing their voices.”\nThe weekslong showdown has roiled the Texas Legislature, marked by a Democratic walkout and threats of arrest from Republicans. Much of the drama unfolded in the House, where the map ultimately passed Wednesday.\nDemocrats had already delayed the bill's passage during hours of debate, pressing Republican Sen. Phil King, the measure’s sponsor, on the proposal's legality, with many alleging that the redrawn districts violate the Voting Rights Act by diluting voters’ influence based on race.\nKing vehemently denied that accusation, saying, “I had two goals in mind: That all maps would be legal and would be better for Republican congressional candidates in Texas.”\n“There is extreme risk the Republican majority will be lost” in the House if the map does not pass, King said.\nThe showdown has also inflamed a broader, state-by-state redistricting battle, with governors from both parties pledging to redraw congressional maps.\nCalifornia Democrats approved legislation Thursday calling for a special election in November for residents to vote on a redrawn congressional map designed to help Democrats win five more House seats next year. Gov. Gavin Newsom quickly signed it.\n“This is not something six weeks ago that I ever imagined that I’d be doing,” Newsom said. “This is a reaction to an assault on our democracy in Texas.”\nCalifornia’s map needs voter approval because, unlike in Texas, a nonpartisan commission normally draws the map to avoid the sort of political battle that is playing out.\nOn Friday, Abbott called California’s redistricting “a joke” and asserted that Texas’ new map is constitutional but California’s would be overturned.\nOn a national level, the partisan makeup of existing districts puts Democrats within three seats of a majority. The incumbent president’s party usually loses seats in the midterms.\nThe Texas redraw is already reshaping the 2026 race, with Democratic Rep. Lloyd Doggett, the dean of the state's congressional delegation, announcing Thursday that he will not seek reelection to his Austin-based seat if the new map takes effect. Under the proposed map, Doggett's district would overlap with that of another Democratic incumbent, Rep. Greg Casar.\nThe president has pushed other Republican-controlled states including Indiana and Missouri, to also revise their maps to add more winnable GOP seats. Ohio Republicans were also already scheduled to revise their maps to make them more partisan.\n“Republicans are not finished in the United States,” Abbott said.\nRedistricting typically occurs once a decade, immediately after a census. While some states have their own limitations, there is no national impediment to a state trying to redraw districts in the middle of the decade.\nThe U.S. Supreme Court has said the Constitution does not outlaw partisan gerrymandering, only using race to redraw district lines.\nMore Democratic-run states have commission systems like California’s or other redistricting limits than Republican ones do, leaving the GOP with a freer hand to swiftly redraw maps. New York, for example, cannot draw new maps until 2028, and even then only with voter approval.\nRepublicans and some Democrats championed a 2008 ballot measure that established California’s nonpartisan redistricting commission, along with a 2010 one that extended its role to drawing congressional maps.\nBoth sides have shown concern over what the redistricting war could lead to.\nCalifornia Assemblyman James Gallagher, the Republican minority leader, said Trump was “wrong” to push for new Republican seats elsewhere. But he warned that Newsom’s approach, which the governor has dubbed “fight fire with fire,” is dangerous.\n“You move forward fighting fire with fire, and what happens?” Gallagher asked. “You burn it all down.”\n___\nCappelletti reported from Washington and Golden from Seattle."
    },
    {
      "news_title": "Texas adopts electoral map aimed at preserving Trump’s Congress grip",
      "news_link": "https://www.straitstimes.com/world/united-states/texas-adopts-electoral-map-aimed-at-preserving-trumps-congress-grip",
      "bias": "Lean Right",
      "text": "Texas adopts electoral map aimed at preserving Trump’s Congress grip\nSign up now: Get ST's newsletters delivered to your inbox\nFollow topic:\nWASHINGTON - Texas legislators early on Aug 23 approved a new electoral map aimed at carving out five new Republican-leaning seats in the state to help the party retain control of Congress in next year’s midterm elections.\nThe senators voted along party lines to pass the map 18-11 shortly after midnight on Aug 23, following more than eight hours of debate.\nLast week, the state legislature’s lower chamber adopted the Bill.\nDemocratic Senator Carol Alvarado’s plans to filibuster the map as a final protest were thwarted when Republicans used a rare procedural motion to halt debate, end the filibuster, and proceed directly to the final vote.\nIt now heads to the governor’s office for final approval, where Governor Greg Abbot is expected to swiftly approve it.\nDemocratic Senator Sarah Eckhardt said on X that shutting down a filibuster was “unprecedented”.\nShe added: “This is not democracy, this is disgraceful.”\nThe legislation is the culmination of a weeks-long drama that saw Democrats flee the state in an effort to block the vote and drew nationwide attention to the issue of partisan redistricting, known as “gerrymandering.”\nPresident Donald Trump had pressured Republican-run Texas to create the new map\nThe cutthroat political gambit spurred California’s Democratic governor, Mr Gavin Newsom, to launch a process for redrawing his state’s map – this time creating five potentially new seats for Democrats.\nAlthough Mr Newsom hopes to cancel out the Republicans’ advantages gained in Texas, his plan still requires voter approval in an election this November.\nBoth parties are now looking to other states where the rules might allow hasty redrawing of maps in ways that would create more seats.\nThe redistricting battle adds a volatile and high-stakes new element to 2026’s elections.\nRepublicans currently control both houses of Congress and the party’s legislators largely operate to carry out Mr Trump’s wishes.\nBeleaguered Democrats are hoping that the unpopularity of many of Mr Trump’s policies will help spark a takeover of the lower house. If Democrats did win, they would immediately gain power to investigate Mr Trump and his controversial government members. AFP"
    },
    {
      "news_title": "Texas lawmakers approve new electoral map designed to secure Trump's hold on Congress",
      "news_link": "https://www.france24.com/en/americas/20250823-texas-lawmakers-approve-new-electoral-map-designed-to-secure-trump-s-hold-on-congress",
      "bias": "Center",
      "text": "Texas lawmakers approve new electoral map designed to secure Trump's hold on Congress\nTexas lawmakers approved a new electoral map early Saturday that would likely give the Republicans five new seats in next year's midterm elections in a move explicitly designed to preserve US President Donald Trump's grip on Congress. Republican State Governor Greg Abbott is expected to quickly sign it into law.\nTexas legislators early Saturday approved a new electoral map aimed at carving out five new Republican-leaning seats in the state to help the party retain control of Congress in next year's midterm elections.\nThe senators voted along party lines to pass the map 18-11 shortly after midnight on Saturday, following more than eight hours of debate.\nDemocratic Senator Carol Alvarado's plans to filibuster the map as a final protest were thwarted when Republicans used a rare procedural motion to halt debate, end the filibuster, and proceed directly to the final vote.\nIt now heads to the governor's office for final approval. Governor Greg Abbott, a Republican, is expected to quickly sign it into law, though Democrats have vowed to challenge it in court.\nTo display this content from YouTube, you must enable advertisement tracking and audience measurement.\nOne of your browser extensions seems to be blocking the video player from loading. To watch this content, you may need to disable it on this site.\nDemocrats had already delayed the bill's passage during hours of debate, pressing Republican Senator Phil King, the measure’s sponsor, on the proposal's legality, with many alleging that the redrawn districts violate the Voting Rights Act by diluting voters’ influence based on race.\nKing vehemently denied that accusation, saying, “I had two goals in mind: That all maps would be legal and would be better for Republican congressional candidates in Texas.”\n“There is extreme risk the Republican majority will be lost” in the House if the map does not pass, King said.\nPresident Donald Trump had pressured Republican-run Texas to create the new map to help prevent Democratic opponents from taking over the House of Representatives in 2026, halfway through his term.\nThe cutthroat political gambit spurred California's Democratic governor, Gavin Newsom, to launch a process for redrawing his state's map – this time creating five potentially new seats for Democrats.\n\"This is not something six weeks ago that I ever imagined that I’d be doing,” Newsom said. “This is a reaction to an assault on our democracy in Texas.”\nTo display this content from YouTube, you must enable advertisement tracking and audience measurement.\nOne of your browser extensions seems to be blocking the video player from loading. To watch this content, you may need to disable it on this site.\nAlthough Newsom hopes to cancel out the Republicans' advantages gained in Texas, his plan still requires voter approval in an election this November. Unlike in Texas, a nonpartisan commission normally draws the map to avoid the sort of political battle that is playing out.\nBoth parties are now looking to other states where the rules might allow hasty redrawing of maps in ways that would create more seats.\nMore Democratic-run states have commission systems like California’s or other redistricting limits than Republican ones do, leaving the GOP with a freer hand to swiftly redraw maps. New York, for example, cannot draw new maps until 2028 – and even then, only with voter approval.\nThe redistricting battle adds a volatile and high-stakes new element to next year's elections.\nRepublicans currently control both houses of Congress and the party's legislators largely operate to carry out Trump's wishes.\nBeleaguered Democrats are hoping that the unpopularity of many of Trump's policies will help spark a takeover of the lower house. If Democrats did win, they would immediately gain power to investigate Trump and his controversial government members.\n(FRANCE 24 with AFP and AP)"
    },
    {
      "news_title": "Texas Senate Passes Congressional Map That’s Backed by Trump",
      "news_link": "https://www.bloomberg.com/news/articles/2025-08-23/texas-senate-passes-congressional-map-that-s-backed-by-trump",
      "bias": "Lean Left",
      "text": null
    },
    {
      "news_title": "Texas lawmakers pass Trump-backed election map, sending it to governor",
      "news_link": "https://www.washingtonpost.com/politics/2025/08/23/texas-republicans-redistricting-trump-map/",
      "bias": "Lean Left",
      "text": null
    },
    {
      "news_title": "Texas Senate approves redrawn GOP congressional maps, sending bill to Gov. Abbott",
      "news_link": "https://www.khou.com/article/news/local/texas/texas-senate-redistricting-vote-approvaed/285-6cb94724-dcc4-42a2-82a6-2a3fe0adec91",
      "bias": "Center",
      "text": "AUSTIN, Texas — The Texas Senate gave final approval to a new, Republican-leaning congressional voting map early Saturday, sending it to Gov. Greg Abbott for his signature.\nPresident Donald Trump has pushed for the map to help the GOP maintain its slim majority in Congress in the 2026 midterm elections. It has five new districts that would favor Republicans.\nAbbott, a Republican, is expected to quickly sign it into law, though Democrats have vowed to challenge it in court.\nThe effort by Trump and Texas’ Republican-majority Legislature prompted state Democrats to hold a two-week walkout and kicked off a wave of redistricting efforts across the country.\nDemocrats had prepared for a final show of resistance, with plans to push the Senate vote into the early morning hours in a last-ditch attempt to delay passage.\nState Sen. Carol Alvarado, leader of the Senate Democratic caucus, announced on social media that she planned to filibuster the bill with a long speech and intended to speak for several hours. But just when she expected to start, the Senate broke for a long dinner break.\nWhen members returned, Alvarado never had a chance to filibuster because Republicans accused her of breaking Senate rules by attempting to fundraise off the coming filibuster.\nSen. Charles Perry said it “appears to be potentially unlawful, at least unethical, using state resources for a campaign purpose.”\nA spokesperson for Alvarado did not immediately respond to an email and phone call from The Associated Press.\n“Shutting down a filibuster over a fundraising email is unprecedented,” Democratic Sen. Sarah Eckhardt said in a post on social media platform X. “It exposes the hypocrisy of Republicans, who will turn around and raise millions off stealing Texans’ votes while silencing their voices.”\nThe weekslong showdown has roiled the Texas Legislature, marked by a Democratic walkout and threats of arrest from Republicans. Much of the drama unfolded in the House, where the map ultimately passed Wednesday.\nDemocrats had already delayed the bill's passage during hours of debate, pressing Republican Sen. Phil King, the measure’s sponsor, on the proposal's legality, with many alleging that the redrawn districts violate the Voting Rights Act by diluting voters’ influence based on race.\nKing vehemently denied that accusation, saying, “I had two goals in mind: That all maps would be legal and would be better for Republican congressional candidates in Texas.”\n“There is extreme risk the Republican majority will be lost” in the House if the map does not pass, King said.\nThe showdown has also inflamed a broader, state-by-state redistricting battle, with governors from both parties pledging to redraw congressional maps.\nCalifornia Democrats approved legislation Thursday calling for a special election in November for residents to vote on a redrawn congressional map designed to help Democrats win five more House seats next year. Gov. Gavin Newsom quickly signed it.\n“This is not something six weeks ago that I ever imagined that I’d be doing,” Newsom said. “This is a reaction to an assault on our democracy in Texas.”\nCalifornia’s map needs voter approval because, unlike in Texas, a nonpartisan commission normally draws the map to avoid the sort of political battle that is playing out.\nOn Friday, Abbott called California’s redistricting “a joke” and asserted that Texas’ new map is constitutional but California’s would be overturned.\nBattle for the House waged via redistricting\nOn a national level, the partisan makeup of existing districts puts Democrats within three seats of a majority. The incumbent president’s party usually loses seats in the midterms.\nThe Texas redraw is already reshaping the 2026 race, with Democratic Rep. Lloyd Doggett, the dean of the state's congressional delegation, announcing Thursday that he will not seek reelection to his Austin-based seat if the new map takes effect. Under the proposed map, Doggett's district would overlap with that of another Democratic incumbent, Rep. Greg Casar.\nThe president has pushed other Republican-controlled states including Indiana and Missouri, to also revise their maps to add more winnable GOP seats. Ohio Republicans were also already scheduled to revise their maps to make them more partisan.\n“Republicans are not finished in the United States,” Abbott said.\nRedistricting typically occurs once a decade, immediately after a census. While some states have their own limitations, there is no national impediment to a state trying to redraw districts in the middle of the decade.\nThe U.S. Supreme Court has said the Constitution does not outlaw partisan gerrymandering, only using race to redraw district lines.\n‘Fight fire with fire’\nMore Democratic-run states have commission systems like California’s or other redistricting limits than Republican ones do, leaving the GOP with a freer hand to swiftly redraw maps. New York, for example, cannot draw new maps until 2028, and even then only with voter approval.\nRepublicans and some Democrats championed a 2008 ballot measure that established California’s nonpartisan redistricting commission, along with a 2010 one that extended its role to drawing congressional maps.\nBoth sides have shown concern over what the redistricting war could lead to.\nCalifornia Assemblyman James Gallagher, the Republican minority leader, said Trump was “wrong” to push for new Republican seats elsewhere. But he warned that Newsom’s approach, which the governor has dubbed “fight fire with fire,” is dangerous.\n“You move forward fighting fire with fire, and what happens?” Gallagher asked. “You burn it all down.”\nCopyright 2025 Associated Press. All rights reserved. This material may not be published, broadcast, rewritten, or redistributed."
    },
    {
      "news_title": "Texas Senate passes new Republican-drawn congressional map",
      "news_link": "https://www.nbcwashington.com/news/national-international/texas-senate-passes-new-republican-drawn-congressional-map/3979135/",
      "bias": "Lean Left",
      "text": "The Republican-controlled Texas state Senate passed the party’s new congressional maps overnight, completing a legislative odyssey that included significant Democratic delays and sparked a nationwide scramble over redistricting in the process.\nThe vote means the maps, which were designed to pad the Republican majority in the U.S. Congress, will go into effect when signed by Gov. Greg Abbott, a proponent of the plan who has been cheered on by President Donald Trump.\nStream NBC4 newscasts for free right here, right now.\nDemocrats have promised to challenge the measure in court.\nTrump initially led the calls for Texas to redraw its congressional map, saying his party is “entitled to” five more congressional seats from the state. That’s what the maps intend to do: By redrawing congressional district boundaries in key cities as well as along the state’s border, Texas will have 30 congressional districts that Trump carried last fall by a double-digit margin.\nThe GOP currently controls 25 of the state’s 38 congressional districts.\nRepublicans have been adamant, and blunt, from the start of the process that their exercise has been a political one aimed solely at increasing their party’s power in Washington, where the House is almost evenly balanced. Democrats need a net gain of just three seats in the 2026 elections to take the majority.\nDemocrats have accused Republicans of setting a dangerous precedent by not waiting until 2031 to redraw the lines, as is customary, and they said the new maps would hurt minority representation in the state, a charge their Republican colleagues denied.\nU.S. & World\nThe day's top national and international news.\nUnlike the state House, where business ground to a halt earlier this month when dozens of Democrats fled the state to deny the body a quorum to move forward with legislation, forcing Abbott to call another special session, the Senate has not been stymied by those efforts.\nWith Abbott poised to sign the new maps into law, the spotlight shifts to California, where Democratic lawmakers have their own proposal to redraw their state's congressional boundaries as political retribution for Texas' move. Unlike in Texas, where regular legislation is enough to change the maps, California Democrats' proposal must also be approved by the voters in a special election this fall in order to take effect."
    },
    {
      "news_title": "Texas lawmakers give final approval to redrawn congressional map favoring GOP, send to governor",
      "news_link": "https://apnews.com/article/california-texas-redistricting-f93a49178fd3b9cba00880b9c9231799",
      "bias": "Lean Left",
      "text": "Texas lawmakers give final approval to redrawn congressional map favoring GOP, send to governor\nWatch live as the Texas Senate is expected to vote on a new congressional map aimed at electing more Republicans to the U.S. House.\nAUSTIN, Texas (AP) — The Texas Senate gave final approval to a new, Republican-leaning congressional voting map early Saturday, sending it to Gov. Greg Abbott for his signature.\nPresident Donald Trump has pushed for the map to help the GOP maintain its slim majority in Congress in the 2026 midterm elections. It has five new districts that would favor Republicans.\nAbbott, a Republican, is expected to quickly sign it into law, though Democrats have vowed to challenge it in court.\nThe effort by Trump and Texas’ Republican-majority Legislature prompted state Democrats to hold a two-week walkout and kicked off a wave of redistricting efforts across the country.\nDemocrats had prepared for a final show of resistance, with plans to push the Senate vote into the early morning hours in a last-ditch attempt to delay passage.\nState Sen. Carol Alvarado, leader of the Senate Democratic caucus, announced on social media that she planned to filibuster the bill with a long speech and intended to speak for several hours. But just when she expected to start, the Senate broke for a long dinner break.\nWhen members returned, Alvarado never had a chance to filibuster because Republicans accused her of breaking Senate rules by attempting to fundraise off the coming filibuster.\nSen. Charles Perry said it “appears to be potentially unlawful, at least unethical, using state resources for a campaign purpose.”\nA spokesperson for Alvarado did not immediately respond to an email and phone call from The Associated Press.\n“Shutting down a filibuster over a fundraising email is unprecedented,” Democratic Sen. Sarah Eckhardt said in a post on social media platform X. “It exposes the hypocrisy of Republicans, who will turn around and raise millions off stealing Texans’ votes while silencing their voices.”\nThe weekslong showdown has roiled the Texas Legislature, marked by a Democratic walkout and threats of arrest from Republicans. Much of the drama unfolded in the House, where the map ultimately passed Wednesday.\nAP correspondent Ben Thomas reports California Governor Gavin Newsom has signed legislation calling a special election on a redrawn congressional map.\nDemocrats had already delayed the bill’s passage during hours of debate, pressing Republican Sen. Phil King, the measure’s sponsor, on the proposal’s legality, with many alleging that the redrawn districts violate the Voting Rights Act by diluting voters’ influence based on race.\nKing vehemently denied that accusation, saying, “I had two goals in mind: That all maps would be legal and would be better for Republican congressional candidates in Texas.”\n“There is extreme risk the Republican majority will be lost” in the House if the map does not pass, King said.\nThe showdown has also inflamed a broader, state-by-state redistricting battle, with governors from both parties pledging to redraw congressional maps.\nCalifornia Democrats approved legislation Thursday calling for a special election in November for residents to vote on a redrawn congressional map designed to help Democrats win five more House seats next year. Gov. Gavin Newsom quickly signed it.\n“This is not something six weeks ago that I ever imagined that I’d be doing,” Newsom said. “This is a reaction to an assault on our democracy in Texas.”\nCalifornia’s map needs voter approval because, unlike in Texas, a nonpartisan commission normally draws the map to avoid the sort of political battle that is playing out.\nOn Friday, Abbott called California’s redistricting “a joke” and asserted that Texas’ new map is constitutional but California’s would be overturned.\nBattle for the House waged via redistricting\nOn a national level, the partisan makeup of existing districts puts Democrats within three seats of a majority. The incumbent president’s party usually loses seats in the midterms.\nThe Texas redraw is already reshaping the 2026 race, with Democratic Rep. Lloyd Doggett, the dean of the state’s congressional delegation, announcing Thursday that he will not seek reelection to his Austin-based seat if the new map takes effect. Under the proposed map, Doggett’s district would overlap with that of another Democratic incumbent, Rep. Greg Casar.\nThe president has pushed other Republican-controlled states including Indiana and Missouri, to also revise their maps to add more winnable GOP seats. Ohio Republicans were also already scheduled to revise their maps to make them more partisan.\n“Republicans are not finished in the United States,” Abbott said.\nRedistricting typically occurs once a decade, immediately after a census. While some states have their own limitations, there is no national impediment to a state trying to redraw districts in the middle of the decade.\nThe U.S. Supreme Court has said the Constitution does not outlaw partisan gerrymandering, only using race to redraw district lines.\n‘Fight fire with fire’\nMore Democratic-run states have commission systems like California’s or other redistricting limits than Republican ones do, leaving the GOP with a freer hand to swiftly redraw maps. New York, for example, cannot draw new maps until 2028, and even then only with voter approval.\nRepublicans and some Democrats championed a 2008 ballot measure that established California’s nonpartisan redistricting commission, along with a 2010 one that extended its role to drawing congressional maps.\nBoth sides have shown concern over what the redistricting war could lead to.\nCalifornia Assemblyman James Gallagher, the Republican minority leader, said Trump was “wrong” to push for new Republican seats elsewhere. But he warned that Newsom’s approach, which the governor has dubbed “fight fire with fire,” is dangerous.\n“You move forward fighting fire with fire, and what happens?” Gallagher asked. “You burn it all down.”\n___\nCappelletti reported from Washington and Golden from Seattle."
    },
    {
      "news_title": "Texas Senate approves GOP congressional map, sending plan to Abbott’s…",
      "news_link": "https://www.texastribune.org/2025/08/22/texas-congressional-redistricting-map-senate-governor-desk/",
      "bias": "Lean Left",
      "text": "Texas Senate approves GOP congressional map, sending plan to Abbott’s desk\nSign up for The Brief, The Texas Tribune’s daily newsletter that keeps readers up to speed on the most essential Texas news.\nThe Texas Senate early Saturday morning approved a new congressional map gerrymandered to maximize Republican representation, sending the plan to the governor’s desk after weeks of intense partisan clashing.\nRepublican lawmakers pushed the plan through over fierce Democratic opposition, launching a national redistricting war from Albany to Sacramento while positioning the GOP to net up to five additional seats in Texas.\nThe Senate adopted the new lines on a party-line vote, 18 to 11, just after 12:30 a.m. Saturday following more than eight hours of at times tense debate.\nSen. Carol Alvarado, D-Houston, had planned to filibuster the map well into Saturday as a last stand against the effort, but a rare procedural motion by Senate Republicans just after midnight ended the debate and killed the filibuster, moving the chamber straight on to the final vote. Some observers in the gallery were removed for shouting “shame,” and “fascist,” shortly after the vote.\nThe map, demanded by President Donald Trump to fortify the GOP’s U.S. House majority in next year’s midterm election, hands up to five additional U.S. House seats to Republicans by dismantling Democratic bastions around Austin, Dallas and Houston, and by making two Democrat-held seats in South Texas redder. The new lines also keep all 25 seats already held by Republicans safely red.\nThe plan “meets the critically important goals of legality, of political performance for Republicans and of improved compactness,” said Sen. Phil King, R-Weatherford and House Bill 4’s sponsor, while repeatedly insisting under questioning from Democrats that he did not consider racial population data in his role shepherding the map through the upper chamber.\nThe pickups are meant to help the GOP hold onto its razor-thin congressional majority in a midterm election year that is expected to favor Democrats — potentially making the difference between a continued Republican trifecta in Washington, or a divided government with one chamber intent on investigating Trump and bottlenecking his agenda.\nThat has put Texas lawmakers at the front lines of an issue with national stakes. Republicans earned kudos from Trump for pushing the new boundaries through the state House, while Democrats won support from national party figures, including former President Barack Obama, Democratic National Committee Chair Ken Martin and U.S. House Minority Leader Hakeem Jeffries of New York.\nThis site is protected by reCAPTCHA and the Google Privacy Policy and Terms of Service apply.\nIn his closing statement, King made clear that the case for the map rested purely on maintaining Republican control of the federal government — and that if Texas did not push the gerrymander through, the GOP would likely lose control of the U.S. House in next year’s midterm election.\nThe “amazing progress that’s been made in just eight months — all of this will end if the Republicans lose the Congress,” King said after citing a list of policy achievements he attributed to a Republican trifecta. “I’m convinced that if Texas does not take this action, there is an extreme risk that that Republican majority will be lost. If it does, the next two years after the midterm, there will be nothing but inquisitions and impeachments and humiliation for our country.”\nThough congressional lines are typically redrawn once every 10 years following the decennial census, Republicans justified the aggressive and unusual move to do so in the middle of the decade by saying it was legal to craft new boundaries at any point and for purely partisan gain. They also pointed to the party’s margins of victory in 2024 and the need to counter blue-state gerrymandering to further support their push.\nSupport independent Texas news\nThe Tribune needs your help to keep trusted journalists in the Capitol. Donate now.\nChoose an amount or learn more about membership.\nThe U.S. Supreme Court ruled in 2019 that states can draw electoral maps on partisan grounds. But under Section 2 of the Voting Rights Act, the lines cannot diminish people’s voting power based on race.\nDemocrats argued that the new map increased Republicans’ advantage by unconstitutionally suppressing the vote of Black and Latino Texans. They framed the push as a power grab by Trump meant to stack the deck in next year’s election.\n“Today, the majority will prevail, but the rights of minorities were ignored, outnumbered, outvoted and outgunned,” said Sen. Judith Zaffirini, D-Laredo and dean of the Senate. “Democrats will go down fighting, having used every available legislative tool. My prayer is that the pendulum will swing sooner rather than later, and that when it does, Democrats will respect all minorities, including political.”\nTexas’ approval of the map has set off a tit-for-tat redistricting push in California, where Gov. Gavin Newsom has proposed a map voters would have to approve that could yield five new Democratic-leaning seats, effectively offsetting GOP gains in Texas. Other blue-state governors and national Democratic leaders are backing retaliatory gerrymandering as the Trump administration also pushes GOP-controlled Florida, Indiana, Missouri and Ohio to draw more red seats.\nAlvarado, with assistance from other Senate Democrats, had planned to filibuster the map Friday, donning sneakers and receiving a catheter in preparation. Sen. Sarah Eckhardt, D-Austin, had compiled over 12 hours of testimony from constituents on the map to read from during the marathon speech.\nBut after a three-hour dinner break called by Lt. Gov. Dan Patrick and objected to by Democrats, Republicans returned late Friday night with a procedural motion up their sleeves. Sen. Charles Perry, R-Lubbock, moved to cut off debate early. He cited a campaign email Alvarado sent out promoting the filibuster Friday afternoon, calling it “potentially unlawful,” and “at least unethical,” for ostensibly using state resources, such as staff and Capitol facilities, for fundraising purposes.\n“It’s disrespectful. It violates the decorum of the Senate, and personally, I’m offended by it,” Perry said. All Republicans signed onto the motion.\nDemocrats condemned the explanation as an excuse to kill the filibuster and move the vote along, noting that senators routinely drew from their legislative work in their fundraising campaigns and that lawmakers were not under a fundraising moratorium as they are during the regular session.\n“When they do it, it seems to be fair game, and when other people do it, then it’s a gotcha,” Alvarado said after the vote. “It was a mechanism to shut down the discussion, the debate on this issue.”\nThe filibuster would have delayed the map’s passage, but almost certainly would not have blocked it. Alvarado would have to had to sustain the filibuster for three weeks straight to run out the clock on the Legislature’s special session.\nThe new Texas map cleared its biggest hurdle Wednesday when, after more than eight hours of tense debate, the state House adopted the plan along party lines.\nLacking the votes to stop the map in the GOP-dominated Texas Legislature, more than 50 House Democrats staged a two-week walkout earlier this month, grinding the lower chamber to a halt by denying the quorum needed to conduct business.\nRepublicans unleashed an unprecedented response to drag them back to Texas, issuing civil arrest warrants, asking a court to extradite them from Illinois, seeking to declare over a dozen Democrats’ seats vacant and clamoring for legislative punishments upon their return.\nAfter most Democratic lawmakers returned to Austin Monday, Republican Speaker Dustin Burrows, seeking to maintain a quorum, required each of them to agree to a police escort to leave the Capitol building. Rep. Nicole Collier, D-Fort Worth, refused and was confined to the Capitol for the next 54 hours, prompting a national media frenzy.\nDemocrats portrayed the walkout as a victory for sparking a national movement in support of retaliatory redistricting, and as just the first part of a longer fight against the map. In the House on Wednesday, Democratic lawmakers pressed their Republican colleagues on the plan’s impact on voters of color, working to establish a record they could use in a legal challenge seeking to kill the lines before next year’s election.\n“This fight is far from over,” Rep. Gene Wu of Houston, chair of the House Democratic Caucus, said after the map’s passage in the lower chamber. “Our best shot is in the courts. This part of the fight is over, but it is merely the first chapter.”\nMore all-star speakers confirmed for The Texas Tribune Festival, Nov. 13–15! This year’s lineup just got even more exciting with the addition of State Rep. Caroline Fairly, R-Amarillo; former United States Attorney General Eric Holder; Abby Phillip, anchor of “CNN NewsNight”; Aaron Reitz, 2026 Republican candidate for Texas Attorney General; and State Rep. James Talarico, D-Austin. Get your tickets today!\nTribFest 2025 is presented by JPMorganChase.\nAyden Runnels contributed to this report.\nInformation about the authors\nContributors\nLearn about The Texas Tribune’s policies, including our partnership with The Trust Project to increase transparency in news."
    },
    {
      "news_title": "Texas GOP passes the House gerrymander Trump asked for - Finnoexpert",
      "news_link": "https://finnoexpert.com/texas-gop-passes-the-house-gerrymander-trump-asked-for/",
      "bias": "unknown",
      "text": "Texas Republicans approved a new, aggressively gerrymandered congressional map early Saturday morning, moving forward with a power grab pushed by President Donald Trump.\nThe GOP-controlled state Senate approved the map on a party-line vote after hours of debate that began Friday morning. Republicans used a procedural move to block a Democratic senator’s plans to filibuster the bill, forcing it to a vote — one final show of force from GOP leadership after weeks of partisan fighting.\nThe map could ultimately help flip as many as five seats for the GOP starting with next year’s midterms. Republican Gov. Greg Abbott is set to quickly sign the legislation, capping off a turbulent few weeks in Texas over Republicans’ now-successful effort to further skew the maps in the GOP’s favor ahead of the 2030 census.\nUnder the new map, Republicans in Texas are aiming to earn 30 House seats — up from their current 25 — as they attempt to hold onto control of the chamber in what could be an unfavorable environment for them next year. Republicans currently have just a three-seat majority in the House, so the new Texas map alone will significantly affect their chances.\nThe unusual offcycle redistricting effort in Texas has set off a contentious national tit-for-tat. California formally launched its preemptive retaliation on Thursday, with lawmakers approving a ballot measure redrawing the state’s map to create five new Democratic seats to offset Texas. That measure —which would temporarily circumvent the state’s independent redistricting commission — now goes to voters on the November ballot, a gerrymander Democratic Gov. Gavin Newsom has cast as necessary to preserve democracy."
    },
    {
      "news_title": "Texas Legislature sends Trump-backed congressional redistricting plan to Gov. Abbott’s desk",
      "news_link": "https://www.kut.org/politics/2025-08-23/texas-senate-redistricting-gerrmyandering-california-congressional-maps-passed-debate-governor",
      "bias": "unknown",
      "text": "The Texas Senate gave final approval early Saturday to House Bill 4, the controversial redistricting bill that shifts the state’s congressional districts in Republican’s favor. The new map could give the GOP as many as five new seats in Congress after the 2026 midterm election.\nThe bill now heads to Gov. Greg Abbott’s desk for his signature.\nThe governor has been a fierce supporter of the unconventional mid-decade redistricting plan and directed state lawmakers to take it on last month when he officially announced Texas’ first special session.\nAbbott’s move came at the request of President Donald Trump and the Department of Justice.\nThe Senate’s Friday vote on HB 4 marks the end to a contentious month in Texas politics filled with protests, arrest threats and legislative deadlock — plus a persistent war of words and finger pointing between the state’s Republicans and Democrats.\nThe redistricting effort has drawn national attention, especially after a quorum-breaking walkout earlier this month by Texas House Democrats which left the chamber at a standstill.\nIt also sparked a reactive redistricting push from Democratic-led California, which passed its own new map this week designed to cancel out any Republican gains in Texas. California Gov. Gavin Newsom labeled his state’s effort a “fight to save democracy.” Voters there get a chance to approve those maps in a November election.\nTexas House Democrats returned to Austin on Monday. With a quorum back intact, the chamber quickly moved to take up redistricting legislation. House Bill 4 passed on Wednesday after eight hours of extensive debate in the House.\nThe state Senate's debate on Friday lasted 14 hours from start to finish, and could've gone longer if Sen. Carol Alvarado (D-Houston) was able to carry out her plan to filibuster. Despite those efforts to stall final passage, the Senate passed HB 4 on a 18 - 8 vote around 12:40 am on Saturday.\nA key debate point for Texas Senators: Is this map legal?\nThroughout the state’s redistricting battle, Texas Democrats have called Republicans’ effort to redraw district lines an opportunistic power grab. Republicans supporting the redistricting push have openly said their aim is to give their party an advantage in the U.S. House of Representatives ahead of next year’s election — but have also consistently stressed that their actions are legal.\nThose talking points were on full display again Friday on the Senate floor as the chamber debated the new map.\nState Sen. Phil King (R-Weatherford) carried the bill in the chamber and said that, while he had nothing to do with the way the map was drawn, he backed the legislation’s redistricting objectives.\n“I believe HB 4 meets the critically important goals of legality, of political performance for Republicans, and of improved compactness,” King said.\nSenate Democrats leaned heavily into his first point: legality. Throughout the day, they argued the new congressional map wouldn’t stand up to legal scrutiny because the way they’re drawn would negatively impact and dilute the votes of Black and Hispanic Texans, especially in Houston.\nThat’s where Democratic Congressman Al Green’s district is located. Under the current maps he represents Texas’ 9th Congressional District, a seat the Houstonian’s held since 2005. But the new districts outlined in HB 4 have drawn Green out, moving him into District 18.\nOn the Senate floor Friday, Sen. Borris Miles (D-Houston) asked King if that was done in retaliation for Rep. Green’s criticism of Trump, which included filing letters of impeachment against the president.\n“Was the dismantling of CD 9 retribution for Congressman Green's fighting for civil rights for his constituents,” Miles asked King.\n“No, of course not,” King said, reiterating that he had nothing to do with how the maps are drawn. “It met with the goals that I had set for legislation. And I was also assured that it was legal in all regards.”\nSen. Miles didn’t buy it. He said he believes the maps are both illegal and designed with racial bias.\n“I want you to know, I thoroughly disagree with you, because Congressional District 18 is more than packed,” Miles said. “Senate District 9 was cracked.”\nSen. Judith Zaffirini of Laredo, the chamber’s longest-tenured Democrat, told lawmakers there are multiple reasons they oppose the maps.\n“It disregards the growth and diversity of our state,” Zaffirini said. “It further erodes the strength of minority districts, diminishing our ability to elect candidates of our choice and silencing voices that deserve to be heard.”\nNext steps for the Texas Democratic Party\nAlthough the redistricting legislation has passed the Texas Legislature, the Texas Democratic Party said it isn't done fighting.\n“The sooner we can get to court the better,” Zaffirini said during the Senate debate.\nAt this point, that’s the one defense that Democrats in the state have put forth in an attempt to stop the maps from taking effect.\nIf legal challenges are unsuccessful and Texas’ maps do take effect ahead of the 2026 midterm election, Democrats nationally will be looking to California. If those maps are approved by voters, it'll give Democrats a chance to flip as many as five seats in the midterms.\nWhether or not Texas and California will be the only states to follow through with mid-decade congressional redistricting is unclear.\nThe idea has also been floated in Missouri, Ohio and Florida, among other states."
    }
  ]
}