{
  "story_id": "GN_20250823_220231_9d81e7b1",
  "metadata": {
    "title": "Dutch foreign minister resigns after failing to secure sanctions against Israel",
    "timestamp": "2025-08-23T22:02:31.337859",
    "url": "https://ground.news/article/dutch-foreign-minister-resigns-after-failing-to-secure-sanctions-against-israel_8a9eeb"
  },
  "bias_distribution": {
    "total_sources": "113",
    "leaning_left": "22",
    "center": "22",
    "leaning_right": "15"
  },
  "perspective_summaries": {
    "left": [
      "Dutch Foreign Minister Caspar Veldkamp resigned after he could not gain support for new sanctions against Israel regarding the Gaza conflict.",
      "Following Veldkamp's resignation, members of his party also quit, causing disarray in the Dutch government.",
      "Opposition politicians expressed frustration and called for a no-confidence vote due to perceived inaction against Israel.",
      "Veldkamp expressed his inability to implement necessary policies, stating, 'I feel I was unable to implement policy myself and chart the course I deem necessary."
    ],
    "center": [
      "On August 22, 2025, Caspar Veldkamp stepped down from his role as the Netherlands' foreign minister following a cabinet impasse over proposed sanctions on Israel.",
      "His resignation followed unresolved cabinet debates over stronger measures amid internal government disagreement on Israel's Gaza war response.",
      "Veldkamp advocated for sanctions and restrictions on goods from settlements but encountered opposition within the cabinet, leading him to express that he faced resistance to taking further action.",
      "He expressed that he encountered resistance within the cabinet regarding further actions and acknowledged his inability to implement significant new measures.",
      "His resignation increased political tensions as his New Social Contract Party withdrew from the coalition, complicating the October 29 election campaign."
    ],
    "right": [
      "Dutch Foreign Minister Caspar Veldkamp resigned after his colleagues blocked his proposals for tougher measures against Israel, citing a lack of consensus within the government as a key reason for his departure.",
      "The Netherlands was one of 21 countries that condemned Israel's West Bank settlement project as 'unacceptable and contrary to international law.'",
      "Following government deadlock, Veldkamp acknowledged he could not act effectively regarding the situation in Gaza City and the West Bank.",
      "Veldkamp expressed frustration over internal divisions that prevented meaningful action concerning Israel policy."
    ]
  },
  "sources": [
    {
      "news_title": "Dutch MPs vote against Palestinian state recognition amid government fallout over Israel",
      "news_link": "https://dnyuz.com/2025/08/23/dutch-mps-vote-against-palestinian-state-recognition-amid-government-fallout-over-israel/",
      "bias": "Lean Right",
      "text": "Dutch lawmakers on Saturday rejected a motion to recognize an independent Palestinian state, and also voted against punitive measures against Israel, as political deadlock over Israel continued to weaken the Netherlands’ caretaker government.\nThe proposed measures included boycotting products coming from illegally occupied territories in the West Bank, as well as a ban on the purchase of weapons from Israel.\nThe votes follow the sudden resignation of Dutch Foreign Minister Caspar Veldkamp late Friday in protest against the government’s reluctance to impose tougher sanctions against Israel over the humanitarian crisis in Gaza.\nVeldkamp’s colleagues from the centrist New Social Contract (NSC) party also resigned on Friday. Their departure put additional pressure on the already weak Dutch government, which collapsed in June after Geert Wilders’ far-right Party for Freedom (PVV) left the coalition over a dispute about the country’s migration policy.\nA majority of MPs backed a call on the Israeli government to let international and national journalists into Gaza. MPs also agreed on putting “maximum pressure” on countries that “condone” Hamas leaders, according to local media reports.\nSome 61,000 Palestinians have been killed since Israel launched its assault on the Gaza Strip immediately following Hamas’ attack on Israel in October 2023, according to the Hamas-run health ministry. The United Nations recently declared a famine in Gaza.\nThe post Dutch MPs vote against Palestinian state recognition amid government fallout over Israel appeared first on Politico."
    },
    {
      "news_title": "Dutch foreign minister resigns over Gaza",
      "news_link": "https://www.middleeasteye.net/news/dutch-foreign-minister-resigns-over-gaza",
      "bias": "Left",
      "text": "Dutch foreign minister resigns over Gaza\nDutch Foreign Minister Caspar Veldkamp, part of a caretaker government, resigned on Friday after a cabinet meeting failed to reach consensus on new sanctions against Israel.\nFollowing his resignation, the centre-right New Social Contract party, to which Veldkamp belongs, withdrew from the governing coalition, deepening the political crisis in the Netherlands.\nThe Dutch government collapsed on 3 June, and the caretaker minority administration is expected to remain in office until a new coalition is formed following October’s elections, a process that could take several months.\nVeldkamp, a former ambassador to Israel, called for fresh measures against Israel on Thursday in response to its war on Gaza and its plans for the occupied West Bank.\nEarlier this week, Israel approved an illegal and highly controversial project to build more than 3,400 settlements in the West Bank, which would effectively split the territory in half.\nNew MEE newsletter: Jerusalem Dispatch\nSign up to get the latest insights and analysis on Israel-Palestine, alongside Turkey Unpacked and other MEE newsletters\nLast month, the Netherlands declared far-right Israeli ministers Itamar Ben Gvir and Bezalel Smotrich persona non grata. It also joined 20 other countries in signing a joint declaration condemning Israel’s West Bank settlement project as “unacceptable and contrary to international law”.\nHowever, the cabinet reached a deadlock on Friday over potential new steps to pressure Israel.\nVeldkamp told Dutch news agency ANP that he felt “insufficiently able to take meaningful additional measures” and that he was constrained in pursuing the course he deemed necessary as foreign minister.\nHe added that the measures he had proposed were “seriously discussed” but repeatedly met with resistance in cabinet meetings.\nLast month, Amsterdam named Israel as a foreign threat to its national security for the first time, citing disinformation campaigns endangering the lives of Dutch citizens.\nThe Dutch government has faced mounting pressure from public protests over Israel’s war. Demonstrations in The Hague drew between 100,000 and 150,000 people - the largest in the country in two decades. Protesters demanded sanctions on Israel and humanitarian access for civilians in Gaza.\nOn Friday, the United Nations officially declared a famine in the enclave, citing “systematic obstruction” of aid by Israel.\nMeanwhile, EU foreign ministers have repeatedly failed to agree on collective sanctions against Israel, despite lobbying from several member states.\nMiddle East Eye delivers independent and unrivalled coverage and analysis of the Middle East, North Africa and beyond. To learn more about republishing this content and the associated fees, please fill out this form. More about MEE can be found here."
    },
    {
      "news_title": "Dutch foreign minister steps down after failed push for sanctions against Israel",
      "news_link": "https://presstv.ir/Detail/2025/08/23/753592/Dutch-Foreign-Minister-resigns-after-failing-to-impose-sanctions-on-Israel",
      "bias": "Right",
      "text": "Dutch Foreign Minister Caspar Veldkamp resigned on Friday, after he failed to secure cabinet support for new sanctions against the Israeli regime over its ongoing genocide in Gaza.\nVeldkamp, a member of the centre-right New Social Contract party, had informed the country’s Parliament he intended to bring in new measures in response to Israel’s plans to escalate attacks on Gaza City and other heavily populated areas in the besieged territory.\nBut he said on Friday that he could not achieve agreement on “meaningful measures” and had repeatedly faced resistance from colleagues over sanctions already in place.\nAmong his proposals was a ban on imports from Israeli settlements in the occupied Palestinian territories.\nVeldkamp also revoked three export permits for navy ship components, warning of “deteriorating conditions” in Gaza and the “risk of undesirable end use.”\n“I also see what is happening on the ground in Gaza, the attack on Gaza City, and what is happening in the West Bank, the building decision for the disputed settlement E1, and East Jerusalem,” Veldkamp told reporters.\nHis efforts also included imposing entry bans on hawkish Israeli ministers, Bezalel Smotrich and Itamar Ben-Gvir, citing their role in inciting settler violence against Palestinians.\nHis departure leaves the Netherlands without a foreign minister.\nFollowing his resignation, all New Social Contract ministers and state secretaries confirmed their support for Veldkamp and resigned from the caretaker government in solidarity, prompting a political upheaval.\n“In short, we are done with it,” party leader Eddy Van Hijum declared, calling Israel’s actions “diametrically opposed to international treaties.”\nThe Netherlands’ Parliament had repeatedly delayed a debate on sanctions against Israel, a discussion that was already postponed from Thursday, as the Friday afternoon Cabinet meeting dragged on.\n“There is a famine, ethnic cleansing, and genocide going on,” said Kati Piri of the merged Green Left/Labor parties. “And our cabinet has been deliberating for hours about whether to take any action at all, shameful.”\nOpposition lawmakers had already expressed frustration at the inaction against Israel, with some calling for a no-confidence vote for the minister.\nThe political crisis comes against the backdrop of an already unstable government. The ruling coalition had collapsed in June when anti-Islam lawmaker Geert Wilders withdrew his support over an immigration dispute.\nSince then, the three remaining parties have continued in a caretaker capacity until elections scheduled for October.\nHumanitarian conditions in Gaza have sharply deteriorated. The Integrated Food Security Phase Classification (IPC) reported on Friday that “the Famine Review Committee (FRC) has determined that Famine (IPC Phase 5) is currently occurring in Gaza Governorate.”\nThe FRC further projected that famine thresholds “will be crossed in Deir al-Balah and Khan Younis Governorates in the coming weeks.”\nSince October 7, 2023, when the Israeli regime began its genocidal assault on Gaza, at least 271 people have died from hunger-related causes, including 112 children, the Gaza health ministry reports."
    },
    {
      "news_title": "Trump says less than 20 hostages alive in Gaza, Former IDF official Aharon Haliva slams Netanyahu",
      "news_link": "https://www.jpost.com/israel-news/defense-news/2025-08-23/live-updates-865051",
      "bias": "Center",
      "text": "Gantz to deliver press statement, IDF reportedly strikes Hezbollah in Lebanon\nNetanyahu ignored warnings before October 7, former IDF intel. chief Aharon Haliva recorded saying • 'Tailor-made for Hamas': Israel slams IPC report declaring famine in Gaza\nLeader of the Blue and White Party MK Benny Gantz leads a faction meeting at the Knesset, the Israeli parliament in Jerusalem, on June 30, 2025. (photo credit: Chaim Goldberg/Flash90)\nGantz to hold press conference in Ramat Gan amid coalition rumors\nByAVI SOLOMON\nICYMI: IDF intercepts Houthi missile fired on Friday, fragments fall in central Israeli backyard\nByJERUSALEM POST STAFFThe scene where fragments of a ballistic missile fired from Yemen hit an open area in Moshav Ginaton, central Israel, August 23, 2025(photo credit: YOSSI ALONI/FLASH90)Go to the full article > >\nIsraeli infant seriously injured after falling in Haifa\nLiberman said that \"time after time,\" Netanyahu prevented targeted strikes against Hamas leaders, which he claimed eventually led to his departure from the government.\nIDF officials estimate fighting in Gaza may continue for several months, with the military preparing by sending call-ups to some 60,000 reservists earlier this week.\nByAVI ASHKENAZI Prime Minister Benjamin Netanyahu seen at the opening ceremony of the new Knesset museum, in Jerusalem, August 11, 2025(photo credit: YONATAN SINDEL/FLASH90)Go to the full article > >\n14 wounded in traffic accidents across Israel from Friday night to Saturday morning\nHalf of those wounded came on Highway 675 near the village of Kfar Yehezkel in the Jezreel Valley, which saw the collision of two cars.\nFormer IDF official Aharon Haliva: 'Netanyahu uninterested in intel. briefings before Oct. 7'\n\"In intelligence systems, it's not for the head of the Intelligence Directorate to decide whether he would meet with the prime minister,\" the report quoted Haliva in the recordings.\nByJERUSALEM POST STAFFOutgoing commander of the IDF Military Intelligence Aharon Haliva speaks during a replacing ceremony held at the IDF Intelligence Command headquarters in Glilot, August 21, 2024.(photo credit: TOMER NEUBERG/FLASH90)Go to the full article > >\nJews commemorating hostages splattered with red paint in Frankfurt\nWhile placing photos of the 50 hostages on posts at the park, masked attackers reportedly sprayed the people attending the event with red paint.\nByJERUSALEM POST STAFFProtesters take part in a demonstration in support of Palestinians in Gaza, as the conflict between Israel and Palestinian Islamist group Hamas continues, in Frankfurt, Germany, October 21, 2023. (photo credit: REUTERS/KAI PFAFFENBACH)Go to the full article > >Israel at war: What you need to know\nHamas launched a massive attack on October 7, with thousands of terrorists infiltrating from the Gaza border and taking some 240 hostages into Gaza.\nOver 1,200 Israelis and foreign nationals were murdered, including over 350 at the Supernova music festival and hundreds of Israeli civilians across the Gaza border communities.\n50 hostages remain in Gaza, while 49 hostages in total have been killed in captivity.\nThe IDF launched large-scale attacks on Iranian nuclear facilities on June 13, 2025.\nIsrael struck key nuclear sites and killed senior Iranian military and IRGC officials.\n28 Israelis killed, over 1,300 wounded, including several IDF soldiers, in Iranian attacks."
    },
    {
      "news_title": "Dutch Foreign Minister resigns after failing to impose sanctions on Israel",
      "news_link": "https://www.israelnationalnews.com/news/413722",
      "bias": "Lean Right",
      "text": null
    },
    {
      "news_title": "Dutch Foreign Minister Quits Over Government’s Gaza Policy - Quds News Network",
      "news_link": "https://qudsnen.co/dutch-foreign-minister-quits-over-governments-gaza-policy/",
      "bias": "Lean Left",
      "text": "Dutch Foreign Minister Quits Over Government’s Gaza Policy\nThe Hague (Quds News Network)- Dutch Foreign Minister Caspar Veldkamp resigned on Friday. He said he could not continue in a government that refused stronger action against Israel’s genocide in Gaza and its settlement plans in the West Bank.\nVeldkamp, part of the caretaker cabinet, told reporters that his decision came after weeks of frustration. “I have felt pushback in the cabinet for additional measures,” he said. He will formally submit his resignation.\nThe Dutch government collapsed on June 3. Since then, a caretaker minority has been running the country until elections in October. Analysts say it could take months before a new coalition is formed.\nVeldkamp’s departure highlights growing splits in Europe over Israel’s crimes. He wanted tougher measures. But the rest of the cabinet opposed them. The government declined to support new sanctions or diplomatic moves.\nIsrael launched its latest offensive in Gaza with the stated aim of seizing Gaza City, forcing over one million civilians south.\nEarlier on Friday, a global hunger monitor declared that famine is now present in Gaza City and surrounding areas. The report said starvation has reached critical levels after months of blockade and bombardment.\nAt the same time, Israel approved a major new settlement in the occupied West Bank. The project would cut across the territory and divide Palestinian villages. Experts warn it would make a future Palestinian state impossible.\nVeldkamp’s resignation leaves the caretaker government weaker. With elections still months away, the Netherlands faces political uncertainty at home while navigating a growing international crisis abroad."
    },
    {
      "news_title": "Dutch foreign minister quits caretaker government over Gaza",
      "news_link": "https://www.channelnewsasia.com/world/dutch-foreign-minister-quits-caretaker-government-over-gaza-5309981",
      "bias": "Center",
      "text": "Dutch foreign minister quits caretaker government over Gaza\nTHE HAGUE: Dutch Foreign Minister Caspar Veldkamp, part of a caretaker government, quit his cabinet post on Friday (Aug 22) ahead of schedule over the government's position on Israel's war in Gaza, he told reporters.\nHe said the government did not support additional measures against Israel over Gaza and plans for the occupied West Bank.\n\"I have felt pushback in the cabinet for additional measures,\" he said, adding he would formally tender his resignation.\nThe Dutch government collapsed on June 3, and the caretaker minority government is expected to stay in place until a coalition government is formed after October elections, which may take months.\nIsrael has launched a military offensive aimed at seizing control of Gaza City, relocating civilians to the south, dismantling Hamas and creating pressure for hostage releases.\nEarlier on Friday a global hunger monitor determined people in Gaza City and its surroundings were officially suffering from famine. Israel has dismissed the findings as false and biased.\nIsrael this week gave final approval to plans to construct a settlement that would bisect the occupied West Bank and fragment territory Palestinians seek for an independent state."
    },
    {
      "news_title": "Dutch foreign minister resigns over Israel sanctions deadlock",
      "news_link": "https://www.aljazeera.com/news/2025/8/22/dutch-foreign-minister-resigns-over-israel-sanctions-deadlock",
      "bias": "Lean Left",
      "text": "Dutch foreign minister resigns over Israel sanctions deadlock\nCaspar Veldkamp and other ministers step down after cabinet rejects sanctions against Israel, prompting broader political upheaval.\nDutch Foreign Minister Caspar Veldkamp has resigned after failing to secure cabinet support for additional sanctions against Israel over its military onslaught in Gaza.\nVeldkamp, a member of the centre-right New Social Contract party, said on Friday that he could not achieve agreement on “meaningful measures” and had repeatedly faced resistance from colleagues over sanctions already in place.\nRecommended Stories\nlist of 3 itemsChildren in Gaza play games with aid drop parachute\nThis is the human tragedy caused by Israel’s famine in Gaza\nHis efforts included imposing entry bans on far-right Israeli ministers, Bezalel Smotrich and Itamar Ben-Gvir, citing their role in inciting settler violence against Palestinians.\nVeldkamp also revoked three export permits for navy ship components, warning of “deteriorating conditions” in Gaza and the “risk of undesirable end use”.\n“I also see what is happening on the ground in Gaza, the attack on Gaza City, and what is happening in the West Bank, the building decision for the disputed settlement E1, and East Jerusalem,” Veldkamp told reporters.\nHis departure leaves the Netherlands without a foreign minister as the European Union navigates security guarantees for Ukraine and continues talks with the United States over tariffs.\nFollowing his resignation, all New Social Contract ministers and state secretaries confirmed their support for Veldkamp and resigned from the caretaker government in solidarity.\nAl Jazeera’s Step Vaessen, reporting from Berlin on developments in the Netherlands, said Veldkamp was “under increasing pressure from lawmakers in parliament, especially from the opposition who have been requesting stricter sanctions against Israel”.\nWhile Veldkamp had announced travel bans for two Israeli ministers a few weeks ago, Vaessen said the foreign minister was facing growing demands after Israel’s attacks on Gaza City and the “increasing aggression” that the Dutch government “should be doing more”.\n“Veldkamp has also been pushing for a suspension of the trade agreement that the EU has with Israel,” Vaessen added, noting that the Dutch foreign minister had “increasingly become frustrated because Germany was blocking that. So there was also this push from the Dutch parliament that the Netherlands shouldn’t wait anymore for any European sanctions but should put sanctions on Israel alone.”\nEurope-Israel relations\nDespite limited Dutch sanctions on Israel, the country continues to support the supply chain of Israel’s F-35 fighter jet.\nResearch from the Palestinian Youth Movement shared with Al Jazeera in June shows that ships carrying F-35 components frequently dock at the port of Rotterdam, operated by Danish shipping company Maersk.\nThe F-35 jets have been used by Israel in air strikes on Gaza, which have left much of the Strip in ruins and contributed to the deaths of more than 62,000 people since October 2023.\nEarlier this week, the Netherlands joined 20 other nations in condemning Israel’s approval of a large West Bank settlement expansion, calling it “unacceptable and contrary to international law”.\nMeanwhile, Israel’s military attacks on Gaza continue, forcing civilians from Gaza City southwards amid mounting famine. A global hunger monitor confirmed on Friday that residents of Gaza City and surrounding areas are officially facing famine conditions.\nNo successor to Veldkamp has been announced. The caretaker Dutch government, which has been in place since the collapse of the previous coalition on June 3, is expected to remain until a new coalition is formed following elections in October, a process that could take months."
    },
    {
      "news_title": "Dutch foreign minister resigns over Israel sanctions showdown",
      "news_link": "https://www.kake.com/dutch-foreign-minister-resigns-over-israel-sanctions-showdown/article_d1c17638-e7b7-5616-83f2-80b460c1a405.html",
      "bias": "Center",
      "text": "Dutch Foreign Minister Caspar Veldkamp resigned on Friday after a cabinet meeting failed to agree to sanctions against Israel.\nThe centre-right New Social Contract Party, of which Veldkamp is a member, withdrew from the governing coalition after the resignation, adding to growing political chaos in the country.\nVeldkamp had said on Thursday that he wanted new measures against Israel over its iron-fisted tactics in the Gaza war against Hamas.\nLast month the Netherlands declared far-right Israeli ministers Itamar Ben-Gvir and Bezalel Smotrich persona non grata. It was also among 21 countries that signed a joint declaration on Thursday condemning Israel's approval of a major West Bank settlement project as \"unacceptable and contrary to international law\".\nBut after the cabinet became deadlocked Friday over possible new measures to increase pressure on Israel, Veldkamp told ANP he was \"insufficiently able to take meaningful additional measures\".\n\"I feel constrained in setting the course I consider necessary as foreign minister,\" he added.\nVeldkamp said the further steps he had proposed against Israel were \"seriously discussed\" but that he had encountered resistance in successive cabinet meetings.\nThe government has been under pressure from protests against Israel's military campaign since the October 7, 2023 Hamas attacks on Israel unleased the war.\nDemonstrations in The Hague drew between 100,000 and 150,000 people -- the largest in the Netherlands in two decades.\nProtesters demanded sanctions on Israel and humanitarian access for civilians in Gaza, where on Friday the United Nations officially declared a famine and blamed \"systematic obstruction\" of aid by Israel.\n- No EU consensus -\nEU foreign ministers have repeatedly failed to reach an agreement on collective sanctions against Israel, despite pressure from several member states.\nProposals under discussion have included suspending Israel's participation in a 900-million-euro ($1 billion) EU science and technology programme, trade restrictions and visa bans for specific Israeli officials.\nIn the Netherlands, Veldkamp told parliament in a letter released at the time that Ben Gvir and Smotrich \"repeatedly incited settler violence against Palestinians, promoted illegal settlement expansion, and called for ethnic cleansing in Gaza\".\nSmotrich in response accused European leaders of surrendering to \"the lies of radical Islam\" and \"rising antisemitism\". Ben-Gvir said he would continue to act for Israel, even if banned from \"all of Europe\".\nVeldkamp said the further steps he had proposed against Israel were \"seriously discussed\" but that he had encountered resistance in successive cabinet meetings.\nHamas's October 2023 attack resulted in the deaths of 1,219 people, mostly civilians, according to an AFP tally based on official figures.\nIsrael's offensive has killed at least 62,192 Palestinians, most of them civilians, according to figures from the health ministry in Hamas-run Gaza that the United Nations considers reliable.\nThe Dutch government had already called new elections for October 29 following the withdrawal of Gert Wilders' far-right Freedom Party (PVV) from the coalition in June.\nPrime Minister Dick Schoof told the Dutch parliament that he regretted the resignation of Veldkamp and the withdrawal of his party, the fourth biggest in the chamber, as the fragile government heads into the election campaign.\nSchoof acknowledged that events in Gaza were \"worsening\" and \"dramatic\". \"Everyone is aware of that,\" he told deputies."
    },
    {
      "news_title": "Dutch foreign minister resigns after failing to secure sanctions against Israel",
      "news_link": "https://apnews.com/article/netherlands-government-veldkamp-dutch-israel-0cb5b9b3c0fab86d39a4202d2231f091",
      "bias": "Lean Left",
      "text": "Dutch foreign minister resigns after failing to secure sanctions against Israel\nAMSTERDAM (AP) — Dutch Foreign Minister Caspar Veldkamp resigned Friday evening, after he failed to secure new sanctions against Israel over the war in Gaza.\nVeldkamp had informed the country’s Parliament he intended to bring in new measures in response to Israel’s planned offensive in Gaza City and other heavily populated areas but was unable to secure the support of his coalition partners.\nThe 61-year-old former ambassador to Israel told reporters he felt he was unable “to implement policy myself and chart the course I deem necessary.”\nFollowing Veldkamp’s resignation, the remaining Cabinet members of his center-right New Social Contract party also quit, leaving the Dutch government in disarray.\n“In short we are done with it,” party leader Eddy Van Hijum said, calling the Israeli government’s actions “diametrically opposed to international treaties.”\nThe Dutch government already collapsed in June when anti-Islam lawmaker Geert Wilders pulled out of the country’s four-party coalition over a fight about immigration.\nThe three remaining parties stayed on in a caretaker government until elections could be held in October.\nPrime Minister Dick Schoof was set to address Parliament later Friday evening over the crisis.\nThe world’s leading authority on food crises said earlier on Friday the Gaza Strip’s largest city is gripped by famine, and that it’s likely to spread across the territory without a ceasefire and an end to restrictions on humanitarian aid.\nThe Netherlands’ Parliament had repeatedly delayed a debate on sanctions against Israel, a discussion that was already postponed from Thursday, as the Friday afternoon Cabinet meeting dragged on.\n“There’s a famine, ethnic cleansing, and genocide going on,” Kati Piri of the merged Green Left/Labor parties told Parliament, “And our cabinet has been deliberating for hours about whether to take any action at all. Shameful.”\nVeldkamp had proposed a ban on imports from Israeli settlements in the occupied Palestinian territories in response to the planned military escalation.\nOpposition politicians had called for a no-confidence vote for the minister, frustrated at what they saw as a lack of action against Israel."
    },
    {
      "news_title": "Dutch foreign minister resigns over Israel sanctions: report",
      "news_link": "https://www.ctvnews.ca/world/israel-hamas-war/article/dutch-foreign-minister-resigns-over-israel-sanctions-report/",
      "bias": "Center",
      "text": "ADVERTISEMENT\nDutch foreign minister resigns over Israel sanctions: report\nPublished:\n20 Useful Amazon Canada Finds That Ring In Under $15\nOur Guide To The Best Electric Coolers In Canada In 2025 (And Where To Get Them)\n10 Calendars And Planners To Order Before Heading Into The New School Year\nLittle Luxuries Are Important, So Let Me Introduce You To A Few Of Our Favourite Hair Oils From Canadian Brands\nThe Absolute Best False Eyelashes You Can Get In Canada Right Now\n15 Essential Toiletries And Shower Supplies For Anyone Moving Into A Dorm\n10 Of The Best Back-To-School Deals And Discounts You'll Find On Amazon Canada Right Now\nFYI: This Brightening Moisturizer From Laneige Is 22% Off Today\nThis Wearable Fan Will Keep You Cool On The Hottest Of Days, And It’s Over 40% Off Right Now\nThe Best Kids’ Water Bottles For Back To School 2025\nThe Shopping Trends team is independent of the journalists at CTV News. We may earn a commission when you use our links to shop. Read about us."
    },
    {
      "news_title": "Top Dutch diplomat steps down after measures against Israel blocked",
      "news_link": "https://www.dailysabah.com/world/europe/top-dutch-diplomat-steps-down-after-measures-against-israel-blocked",
      "bias": "Right",
      "text": "Dutch Foreign Minister Caspar Veldkamp resigned after coalition partners blocked his push for tougher measures against Israel, saying he felt compelled to do more over the crises in Gaza City and the West Bank.\nVeldkamp said the government had already taken significant steps, but he felt pressure to act further regarding the situation in Gaza City and the West Bank.\nWith parties VVD and BBB opposing any new measures, he said he no longer trusted that he could implement his plans and decided to step down.\n\"I see that I am insufficiently able to take meaningful additional measures to increase pressure on Israel,\" Veldkamp told ANP after a cabinet debate on possible sanctions against Israel was deadlocked.\nLast month Veldkamp declared far-right Israeli ministers Itamar Ben-Gvir and Bezalel Smotrich unwelcome in the Netherlands.\nOn Thursday, he said he wanted to take further steps against Israel, but later acknowledged he lacked confidence he could act effectively in the coming weeks or months.\nThe minister said the steps he had proposed were \"seriously discussed\" but encountered resistance in successive cabinet meetings.\n\"I feel constrained in setting the course I consider necessary as foreign minister,\" he said.\nThe Netherlands was among 21 countries that signed a joint declaration on Thursday condemning Israel's approval of a major West Bank settlement project as \"unacceptable and contrary to international law\".\nThe U.N. agency for Palestinian refugees confirmed on Friday that famine in Gaza was deliberately caused by the Israeli government, following a formal confirmation by the U.N.-backed global hunger monitoring system IPC.\nIsrael has killed nearly 62,300 Palestinians in Gaza since October 2023. The military campaign has devastated the enclave, which is facing famine.\nLast November, the International Criminal Court issued arrest warrants for Israeli Prime Minister Benjamin Netanyahu and his former Defense Minister Yoav Gallant for war crimes and crimes against humanity in Gaza.\nIsrael also faces a genocide case at the International Court of Justice for its war on the enclave."
    },
    {
      "news_title": "Dutch Foreign Minister Quits as Israel Sanctions Split Cabinet",
      "news_link": "https://www.bloomberg.com/news/articles/2025-08-22/dutch-foreign-minister-quits-as-israel-sanctions-split-cabinet",
      "bias": "Lean Left",
      "text": null
    },
    {
      "news_title": "Dutch foreign minister resigns over Israel sanctions",
      "news_link": "https://timesofmalta.com/article/dutch-foreign-minister-resigns-israel-sanctions.1115084",
      "bias": "Center",
      "text": "Dutch Foreign Minister Caspar Veldkamp resigned on Friday after a cabinet meeting failed to agree sanctions against Israel.\n\"I see that I am insufficiently able to take meaningful additional measures to increase pressure on Israel,\" Veldkamp told ANP after a cabinet debate on possible sanctions against Israel was deadlocked.\nLast month Veldkamp declared far-right Israeli ministers Itamar Ben-Gvir and Bezalel Smotrich unwelcome in the Netherlands.\nOn Thursday he said he wanted to take further steps against Israel, but later acknowledged he lacked confidence he could act effectively in the coming weeks or months.\nThe minister said the steps he had proposed were \"seriously discussed\" but encountered resistance in successive cabinet meetings.\n\"I feel constrained in setting the course I consider necessary as foreign minister,\" he said.\nThe Netherlands was among 21 countries that signed a joint declaration on Thursday condemning Israel's approval of a major West Bank settlement project as \"unacceptable and contrary to international law\"."
    },
    {
      "news_title": "Dutch foreign minister resigns after measures against Israel blocked",
      "news_link": "https://www.aa.com.tr/en/europe/dutch-foreign-minister-resigns-after-measures-against-israel-blocked/3666781",
      "bias": "Right",
      "text": "Dutch foreign minister resigns after measures against Israel blocked\nCaspar Veldkamp says government had already taken significant steps, but he felt pressure to act further regarding situation in Gaza City and West Bank\nLONDON\nDutch Foreign Minister Caspar Veldkamp has resigned after his proposals for additional measures against Israel were blocked by coalition partners.\nAccording to local reports, Veldkamp said the government had already taken significant steps, but he felt pressure to act further regarding the situation in Gaza City and the West Bank.\nWith parties VVD and BBB opposing any new measures, he said he no longer trusted that he could implement his plans and decided to step down.\nThe resignation follows a promise Veldkamp made to the Dutch Parliament to introduce what he called “necessary” measures against Israel, a move he had not coordinated with his coalition partners.\n'Line must be drawn'\nAfter Veldkamp's resignation over blocked measures against Israel, Dutch political party NSC withdrew all its ministers and state secretaries from the caretaker government.\nNSC leader and Deputy Prime Minister Eddy van Hijum said the party could no longer credibly remain in government, saying: \"The Israeli government’s actions violate international treaties. A line must be drawn.”\nThe resignations leave key ministries, including Interior, Education, and Health, without leadership, adding to uncertainty in the already fragile caretaker cabinet of Prime Minister Dick Schoof.\nVVD and BBB criticized NSC’s decision, calling it \"irresponsible.\"\nThe UN agency for Palestinian refugees confirmed on Friday that famine in Gaza was deliberately caused by the Israeli government, following a formal confirmation by the UN-backed global hunger monitoring system IPC.\nIsrael has killed nearly 62,300 Palestinians in Gaza since October 2023. The military campaign has devastated the enclave, which is facing famine.\nLast November, the International Criminal Court issued arrest warrants for Israeli Prime Minister Benjamin Netanyahu and his former Defense Minister Yoav Gallant for war crimes and crimes against humanity in Gaza.\nIsrael also faces a genocide case at the International Court of Justice for its war on the enclave.\nAnadolu Agency website contains only a portion of the news stories offered to subscribers in the AA News Broadcasting System (HAS), and in summarized form. Please contact us for subscription options."
    },
    {
      "news_title": "'I am insufficiently able to...': Dutch foreign minister resigns over cabinet deadlock on Israel sanctions",
      "news_link": "https://www.firstpost.com/world/i-am-insufficiently-able-to-dutch-foreign-minister-resigns-over-cabinet-deadlock-on-israel-sanctions-13927251.html",
      "bias": "Lean Right",
      "text": "Dutch Foreign Minister Caspar Veldkamp on Friday resigned following an unresolved cabinet debate on whether to impose sanctions on Israel, Dutch news agency ANP reported.\nIn a statement to ANP after the meeting, Veldkamp said the lack of consensus within the government had left him unable to take meaningful action.\n“I see that I am insufficiently able to take meaningful additional measures to increase pressure on Israel,” he said.\nThe cabinet had reportedly been divided over the next steps in response to Israel’s ongoing military operations, with growing domestic and international calls for accountability.\nVeldkamp had been pushing for stronger measures, including potential sanctions, but failed to gain the backing of his colleagues.\nHis resignation adds further strain to Prime Minister Mark Rutte’s coalition government, which has faced internal rifts over its Middle East policy.\nLast month, Veldkamp declared far-right Israeli ministers Itamar Ben-Gvir and Bezalel Smotrich persona non grata in the Netherlands.\nOn Thursday, Veldkamp signaled his intention to push for further action against Israel, but later conceded he lacked the confidence to implement meaningful measures in the coming weeks or months.\nWhile the proposals he put forward were “seriously discussed,” they faced resistance within successive cabinet meetings.\n“I feel constrained in setting the course I consider necessary as foreign minister,” he said, citing the lack of internal consensus as a key reason for his resignation.\nImpact Shorts\nView AllThe Netherlands was also one of 21 countries that signed a joint statement on Thursday condemning Israel’s recent approval of a major West Bank settlement project, calling it “unacceptable and contrary to international law.”\nWith inputs from agencies"
    },
    {
      "news_title": "Dutch foreign minister resigns over govt’s Gaza policy – Pakistan Times Today",
      "news_link": "https://pakistantimestoday.com/dutch-foreign-minister-resigns-over-govts-gaza-policy/",
      "bias": "unknown",
      "text": "Dutch Foreign Minister Caspar Veldkamp, part of a caretaker government, quit his cabinet post on Friday ahead of schedule over the government’s position on Israel’s war in Gaza, he told reporters. He said the government did not support additional measures against Israel over Gaza and plans for the occupied West Bank. “I have felt pushback in the cabinet for additional measures,” he said, adding he would formally tender his resignation.\nYou May Also Like\nArmenian PM’s helicopter makes emergency landing in bad weather\nArmenian Prime Minister Nikol Pashinyan said that his helicopter made an emergency…\n- Hafsa Mustafa\n- May 25, 2024\nEarly elections expected after Lira turnaround\nIstanbul: On Dec 29, political experts speculate that Turkey’s President Tayyip Erdogan…\n- Alina Hashmi\n- December 29, 2021\nSaudi Arabia extends its ‘Makkah Route Initiative’ to Türkiye\nSaudi Arabia has extended its initiative to Türkiye to streamline pilgrims’ travel,…\n- Hafsa Mustafa\n- May 31, 2023\nPoland aspires to buy U.S. Reaper drones\nOn March 16, it emerged that Poland wanted to buy several MQ-9…\n- Alina Hashmi\n- March 16, 2022"
    },
    {
      "news_title": "Netherlands government shaken after ministers resign in protest of Israel's war crimes",
      "news_link": "https://easternherald.com/2025/08/23/dutch-ministers-resign-israel-sanctions-deadlock/",
      "bias": "unknown",
      "text": null
    },
    {
      "news_title": "Dutch foreign minister, Caspar Veldkamp quits caretaker government over Gaza",
      "news_link": "https://www.tvcnews.tv/dutch-foreign-minister-caspar-veldkamp-quits-caretaker-government-over-gaza/",
      "bias": "unknown",
      "text": "Dutch Foreign Minister Caspar Veldkamp, who is part of a caretaker administration, resigned from his cabinet role on Friday ahead of schedule due to the government’s position on Israel’s attack in Gaza, he told reporters.\nAccording to sources, he stated that the administration does not support any more measures against Israel over Gaza or plans for the occupied West Bank.\nThe Dutch government dissolved on June 3, and the caretaker minority administration is expected to remain in place until a coalition government is established following the October elections, which might take several months.\nRead Also\n- Famine officially confirmed in Gaza as global hunger monitor calls for immediate response\n- Slovenia becomes first EU member state to ban weapons trade with Israel over Gaza\n- Dutch govt bars two Israeli ministers from entering country over comments on Gaza\n- Keir Starmer says UK will aidrop aid in Gaza as warnings of starvation intensify\nIsrael has initiated a military attack aimed at gaining control of Gaza City, moving residents to the south, weakening Hamas, and increasing pressure for hostage release.\nA global hunger monitor declared earlier Friday that famine was officially affecting residents in Gaza City and the surrounding area. Israel has rejected the results as biased and untrue.\nPlans to build a settlement that will divide the occupied West Bank and split the land Palestinians want for an independent state were approved by Israel this week."
    },
    {
      "news_title": "Dutch foreign minister quits over failure to secure sanctions against Israel",
      "news_link": "https://www.einnews.com/article_detail/842465795/u1ZUkL-rPd0dYgqo?ref=rss&lcode=aqXaJgwF01GHZU7P9Wq2bQ%3D%3D",
      "bias": "unknown",
      "text": null
    },
    {
      "news_title": "Dutch FM Resigns Over Israel Sanctions Dispute",
      "news_link": "https://time.news/dutch-fm-resigns-over-israel-sanctions-dispute/",
      "bias": "unknown",
      "text": "Dutch Goverment Collapses Amidst Sanctions Dispute Over Gaza Conflict\nThe Dutch government plunged into crisis Friday evening with the resignation of Foreign Minister Caspar Veldkamp, triggered by his failure to garner support for new sanctions against Israel in response to the ongoing war with Hamas in Gaza.\nVeldkamp had informed the Dutch parliament of his intention to introduce measures targeting Israel, specifically in response to the planned military offensive in Gaza City and other densely populated areas.However, he was unable to secure the backing of his coalition partners to move forward with these proposals.\nthe 61-year-old former ambassador to Israel explained to reporters that he felt constrained in his ability to “implement policy myself and chart the course I deem necessary.”\nFollowing veldkamp’s departure, the remaining members of his center-right New Social Contract party also resigned, leaving the Dutch government in a state of disarray. “In short we are done with it,” stated party leader Eddy Van Hijum, who characterized the Israeli government’s actions as “diametrically opposed to international treaties.”\nThis latest political upheaval comes after the Dutch government initially collapsed in June when anti-Islam lawmaker Geert Wilders withdrew from the four-party coalition due to disagreements over immigration policy.The remaining parties continued as a caretaker government, pending elections scheduled for October.\nPrime Minister Dick Schoof addressed parliament later Friday, expressing regret over Veldkamp’s resignation and the withdrawal of his party. Schoof acknowledged that events in Gaza were “worsening” and “dramatic,” stating, “Everyone is aware of that.”\nThe crisis unfolds as international concern grows over the humanitarian situation in Gaza. Earlier Friday, the UN’s hunger monitor reported that Gaza’s largest city is experiencing famine, with the potential for it to spread across the territory without a ceasefire and increased humanitarian aid. Israel vehemently rejected these reports, labeling them “lies” and “modern blood libel,” while the United States appeared to dismiss the famine declaration as part of a “false narrative of intentional mass starvation” originating from Hamas, which initiated the conflict with its October 7, 2023, terror attacks in southern Israel.\nThe Dutch parliament had repeatedly postponed a debate on potential sanctions against Israel,most recently delaying discussions from thursday until a lengthy cabinet meeting on Friday afternoon. “There’s a famine, ethnic cleansing, and genocide going on,” Kati Piri of the merged Green Left/Labor parties told Parliament, “And our cabinet has been deliberating for hours about whether to take any action at all. Shameful.”\nVeldkamp had specifically proposed a ban on imports from israeli settlements as a response to the planned military offensive. Opposition politicians had also threatened a vote of no confidence in the minister, frustrated by what they perceived as inaction.\nHere’s a substantive news report answering the “why, Who, What, and How” questions:\nWhy: The Dutch government collapsed due to a basic disagreement over how to respond to the ongoing war between Israel and Hamas in Gaza. Foreign Minister Caspar Veldkamp sought to impose sanctions on Israel,particularly a ban on imports from Israeli settlements,in response to the planned military offensive in Gaza City and other densely populated areas. This stance clashed with his coalition partners,who did not support the measures.\nWho: Key figures involved include Foreign Minister Caspar Veldkamp, who resigned after failing to secure support for his proposed sanctions; Prime Minister Dick Schoof, who expressed regret over the situation; Eddy Van Hijum, leader of the"
    },
    {
      "news_title": "Dutch FM Quits over Blocked “Israel” Sanctions",
      "news_link": "https://www.islamtimes.com/en/news/1228606/dutch-fm-quits-over-blocked-israel-sanctions",
      "bias": "unknown",
      "text": "In his resignation statement, Veldkamp noted that the government had \"already taken significant steps,\" but added: \"I felt resistance within the government against taking additional actions in response to what is happening in Gaza City and the occupied West Bank at this moment.\"\nHe concluded that he had lost hope of shifting this stance: \"This is something that will not change in the coming months and years, and if my room for maneuver is this limited, I will go home and write my resignation letter,\" according to Dutch News.\nVeldkamp resigned after a tense five-hour debate revealed deep Cabinet divisions, with BBB and VVD rejecting tougher action. Current Dutch measures only ban entry for extremist \"Israeli\" ministers Ben Gvir and Smotrich.\nVeldkamp’s resignation sparked a wider split, with four ministers and four state secretaries from his NSC party also stepping down, shaking the caretaker coalition’s stability.\nEric van der Burg of the VVD said he was \"shocked by the resignation,\" while left-wing opposition parties expressed disappointment, accusing Veldkamp of failing to rally sufficient support to push his proposals through.\nThe Hague has grown more confrontational toward \"Israel”, condemning West Bank settlements as illegal and, for the first time, listing \"Israel\" as a national security threat.\nBeyond the EU, The Hague has hosted major \"Red Line\" pro-Palestinian protests, the largest in decades, signaling rising public demand for a tougher stance on “Israeli” aggression in Gaza.\nVeldkamp resigned amid 23 months of relentless war on Gaza, with over 62,000 martyrs and 157,000 wounded, according to Gaza’s Health Ministry."
    },
    {
      "news_title": "Dutch gov't crisis deepens as NSC ministers step down",
      "news_link": "https://www.dailyfinland.fi/europe/44822/Dutch-govt-crisis-deepens-as-NSC-ministers-step-down",
      "bias": "unknown",
      "text": "Dutch gov't crisis deepens as NSC ministers step down\nPublished : 23 Aug 2025, 02:42\nThe political crisis in the Netherlands escalated on Friday after all ministers from the New Social Contract (NSC) party resigned from the caretaker government, following the departure of Foreign Minister Caspar Veldkamp earlier in the day, reported Xinhua.\nVeldkamp announced his resignation in The Hague, citing frustration over restrictions on measures against Israel. \"I see that I cannot take sufficiently meaningful additional measures to increase pressure on Israel,\" he told reporters after a Council of Ministers meeting.\nHis departure triggered a collective exit by fellow NSC ministers -- Eddy van Hijum (Social Affairs), Eppo Bruins (Education), Judith Uitermark (Interior), Danielle Jansen (Health) -- as well as four state secretaries. The move further destabilizes the fragile coalition.\nAccording to NSC, coalition partners the People's Party for Freedom and Democracy (VVD) and the Farmer-Citizen Movement (BBB) refused to back tougher measures against Israel.\nThe Dutch cabinet has been in a caretaker state since June 3, when the far-right Party for Freedom (PVV) withdrew over asylum policy. With NSC's exit, only VVD and BBB remain in government. Snap elections are scheduled for October 29.\nPrime Minister Dick Schoof said he \"deeply regretted\" the NSC decision. \"Further deliberation on the political situation is now necessary,\" he said.\nOn Gaza, Schoof added: \"We all want the humanitarian situation to improve. Unfortunately, that has not led to a common conclusion.\""
    },
    {
      "news_title": "Top Dutch diplomat resigns over Israeli sanctions fail",
      "news_link": "https://www.perthnow.com.au/news/politics/top-dutch-diplomat-resigns-over-israeli-sanctions-fail-c-19775315",
      "bias": "unknown",
      "text": "Top Dutch diplomat resigns over Israeli sanctions fail\nDutch Foreign Minister Caspar Veldkamp has resigned after he failed to secure new sanctions against Israel over the war in Gaza, a move that has left the Dutch government in disarray.\nVeldkamp had informed the country's Parliament he intended to bring in new measures in response to Israel's planned offensive in Gaza City and other heavily populated areas.\nBut he was unable to secure the support of his coalition partners.\nThe 61-year-old former ambassador to Israel told reporters he felt he was unable \"to implement policy myself and chart the course I deem necessary\".\nFollowing Veldkamp's resignation, the remaining Cabinet members of his centre-right New Social Contract party also quit, leaving the Dutch government in disarray.\n\"In short we are done with it,\" party leader Eddy Van Hijum said, calling the Israeli government's actions \"diametrically opposed to international treaties\".\nThe Dutch government already collapsed in June when anti-Islam lawmaker Geert Wilders pulled out of the country's four-party coalition over a fight about immigration.\nThe three remaining parties stayed on in a caretaker government until elections could be held in October.\nPrime Minister Dick Schoof was set to address parliament later on Friday evening over the crisis.\nThe world's leading authority on food crises said earlier on Friday that the Gaza Strip's largest city is gripped by famine, and that it's likely to spread across the territory without a ceasefire and an end to restrictions on humanitarian aid.\nThe Netherlands' parliament had repeatedly delayed a debate on sanctions against Israel, a discussion that was already postponed from Thursday, as the Friday afternoon Cabinet meeting dragged on.\n\"There's a famine, ethnic cleansing, and genocide going on,\" Kati Piri of the merged Green Left/Labor parties told parliament.\n\"And our cabinet has been deliberating for hours about whether to take any action at all. Shameful.\"\nVeldkamp had proposed a ban on imports from Israeli settlements in the occupied Palestinian territories in response to the planned military escalation.\nOpposition politicians had called for a no-confidence vote for the minister, frustrated at what they saw as a lack of action against Israel."
    }
  ]
}