{
  "story_id": "GN_20250823_203302_371d0879",
  "metadata": {
    "title": "Trump's tariffs could reduce US deficit by $4 trillion, CBO estimates",
    "timestamp": "2025-08-23T20:33:02.377807",
    "url": "https://ground.news/article/trumps-tariffs-could-reduce-us-deficit-by-4-trillion-cbo-estimates"
  },
  "bias_distribution": {
    "total_sources": "29",
    "leaning_left": "2",
    "center": "5",
    "leaning_right": "12"
  },
  "perspective_summaries": {
    "left": [
      "President Donald J. Trump's tariffs will reduce total deficits by $4 trillion over the next decade, according to a new analysis from the Congressional Budget Office.",
      "The Congressional Budget Office projected that President Donald Trump's tariff agenda would decrease total deficits by up to $4 trillion over the next decade.",
      "The effective tariff rate for goods imported into the United States increased by 18 percentage points from last year, according to the Congressional Budget Office.",
      "The Congressional Budget Office reported that primary deficits would fall by $3.3 trillion, resulting in $700 billion less spending on interest."
    ],
    "center": [
      "President Donald J. Trump's tariffs will reduce total deficits by $4 trillion over the next decade, according to a new analysis from the Congressional Budget Office.",
      "The Congressional Budget Office projected that President Donald Trump's tariff agenda would decrease total deficits by up to $4 trillion over the next decade.",
      "The effective tariff rate for goods imported into the United States increased by 18 percentage points from last year, according to the Congressional Budget Office.",
      "The Congressional Budget Office reported that primary deficits would fall by $3.3 trillion, resulting in $700 billion less spending on interest."
    ],
    "right": [
      "President Donald J. Trump's tariffs will reduce total deficits by $4 trillion over the next decade, according to a new analysis from the Congressional Budget Office.",
      "The Congressional Budget Office projected that President Donald Trump's tariff agenda would decrease total deficits by up to $4 trillion over the next decade.",
      "The effective tariff rate for goods imported into the United States increased by 18 percentage points from last year, according to the Congressional Budget Office.",
      "The Congressional Budget Office reported that primary deficits would fall by $3.3 trillion, resulting in $700 billion less spending on interest."
    ]
  },
  "sources": [
    {
      "news_title": "Trump’s tariffs could reduce US deficit by $4 trillion, CBO estimates",
      "news_link": "https://www.investing.com/news/economy-news/trumps-tariffs-could-reduce-us-deficitby-4-trillion-cbo-estimates-4207307",
      "bias": "Center",
      "text": null
    },
    {
      "news_title": "CBO: Tariffs Will Reduce Deficit By $4 Trillion By 2035 – Trump Responds",
      "news_link": "https://headlines.americanlookout.com/cbo-tariffs-will-reduce-deficit-by-4-trillion-by-2035-trump-responds/",
      "bias": "Far Right",
      "text": "CBO: Tariffs Will Reduce Deficit By $4 Trillion By 2035 – Trump Responds\nThe American Lookout Headlines homepage has 60 new headlines every 24 hours - click here to see it.\nThe CBO is now projecting that tariffs will reduce the deficit by $4 trillion over the next 10 years.\nThis is $1 trillion more than what was projected in June.\nBy the numbers: CBO director Phillip Swagel, in a blog post, said tariff revenue would reduce primary deficits by $3.3 trillion, and cut the need for interest payments on borrowings by $700 billion, for a total $4 trillion reduction through 2035.\nIn June, the CBO projected a total reduction of $3 trillion over the next 10 years; the scope and scale of tariffs have only increased since then.\nThe big picture: Tariffs have generated so much revenue, so quickly, that even skeptics concede it may now be hard to move away from them without finding another source of income.\n“Although there are many legitimate concerns over the tariffs – including their impact on the economy and the level of uncertainty they are creating – policymakers should not repeal them without an adequate replacement for the revenue loss,” the Committee for a Responsible Federal Budget wrote earlier this month.\nDonald Trump responded to the news by saying, “I am pleased to announce that the Radical Left Representatives working at the Congressional Budget Office (CBO) have now admitted how incredible my Tariff strategy has been, saying that, Trump’s Tariffs reduce the deficit by $4 Trillion Dollars.”\nI am pleased to announce that the Radical Left Representatives working at the Congressional Budget Office (CBO) have now admitted how incredible my Tariff strategy has been, saying that, “Trump’s Tariffs reduce the deficit by $4 Trillion Dollars.” When I began my Tariff policy suggestions, they refused to acknowledge the potential SUCCESS that would be derived. Deficits are DOWN, Taxes are DOWN, Energy is DOWN, Prices generally are DOWN, the only things that are UP are, Take Home Pay, the Stock Market, and our Country, which is the “HOTTEST” anywhere in the World. Thank you for your attention to this matter!\nTrump’s tariff strategy is working!"
    },
    {
      "news_title": "Trump Tariffs Projected to Cut Deficit by $4 Trillion.",
      "news_link": "https://thenationalpulse.com/2025/08/22/trump-tariffs-projected-to-cut-deficit-by-4-trillion/",
      "bias": "Right",
      "text": "❓WHAT HAPPENED: The Congressional Budget Office (CBO) projected that tariffs implemented by President Donald J. Trump could reduce total deficits by $4 trillion over the next decade.\n👤WHO WAS INVOLVED: President Trump and the Congressional Budget Office (CBO).\n📍WHEN & WHERE: The updated projections were released by the CBO on Friday.\n💬KEY QUOTE: CBO Director Phillip Swagel wrote: “If there are no further changes in tariff rates, we project that customs duties from new and existing tariffs will total about $200 billion this fiscal year.”\n🎯IMPACT: The analysis suggests that maintaining Trump’s tariffs would reduce federal borrowing and interest costs, leading to significant deficit reductions.\nA new Congressional Budget Office (CBO) analysis projects that President Donald J. Trump’s tariff policies could slash federal deficits by $4 trillion over the next decade. The CBO, Congress’s impartial fiscal analyst, shared these updated projections on Friday.\nIf President Trump’s tariff policies persist for the next 10 years, the CBO estimates a $3.3 trillion reduction in primary deficits. Furthermore, the increased tariff revenue would decrease the need for federal borrowing, cutting interest payments by $700 billion, collectively driving the total deficit reduction to $4 trillion.\nThese findings highlight the potential of Trump’s tariff strategy to significantly lower federal deficits and reduce dependence on borrowing, in addition to its primary goal of making American products more competitive against cheap, foreign goods produced in low-wage economies, encouraging the “reshoring” of jobs to the United States.\n“If there are no further changes in tariff rates, we project that customs duties from new and existing tariffs will total about $200 billion this fiscal year,” noted CBO Director Phillip Swagel.\nJoin Pulse+ to comment below, and receive exclusive e-mail analyses."
    },
    {
      "news_title": "Trump's Tariffs Will Reduce Deficits By $4 Trillion Over Next Decade, Says CBO Report",
      "news_link": "https://www.zerohedge.com/political/trumps-tariffs-will-reduce-deficits-4-trillion-over-next-decade-says-cbo-report",
      "bias": "Right",
      "text": null
    },
    {
      "news_title": "CBO: Trump’s tariffs will reduce deficits by $4T over next decade",
      "news_link": "https://signalscv.com/2025/08/cbo-trumps-tariffs-will-reduce-deficits-by-4t-over-next-decade/",
      "bias": "Lean Right",
      "text": "By Jack Phillips\nContributing Writer\nA report released on Friday by the Congressional Budget Office predicted that President Donald Trump’s tariffs will reduce federal deficits by around $4 trillion over the next decade.\nIf Trump’s global tariff hikes continue, increased revenue could shrink primary deficits by $3.3 trillion and cut federal interest payments by $0.7 trillion over the next decade, the CBO said. The current top tariff rates may not hold as negotiations with trading partners and international legal challenges are ongoing.\n“We estimate that the effective tariff rate for goods imported into the United States has increased by about 18 percentage points when measured against 2024 trade flows,” the budget office said in its report, adding that Trump’s tariffs would reduce “the need for federal borrowing.”\nThe CBO also said it “projects further increases in tariff revenues in the coming months” and that “if there are no further changes in tariff rates, we project that customs duties from new and existing tariffs will total about $200 billion this fiscal year.”\nBut the office cautioned that revenues often lag several months behind the implementation of tariff policies, noting that once the rates are in effect, they don’t get applied to goods that are already in transit to the United States.\n“In addition, importers have the option to delay payments by up to six weeks by participating in Customs and Border Protection’s Periodic Monthly Statement program,” added the CBO, which is a federal agency within the legislative branch that provides budget and economic information to both houses of Congress.\nIn July, Congress passed the GOP-backed One Big Beautiful Bill Act that contained several major Trump priorities on energy, the border, spending and tax cuts. The CBO has said that it would add around $3.4 trillion to the national deficit over the coming decade, although the White House has disputed those figures.\nThe Trump administration has also said that the tariffs and policies initiated under the One Big Beautiful Bill Act, which Trump backed and signed into law, would bring forth economic growth over the coming years that would offset any additions to the national deficit.\n“It was the largest tax cut for middle- and working-class families in our nation’s history, and the president wants to see this country get our fiscal house in order. That’s why this was a fiscally responsible bill,” White House press secretary Karoline Leavitt told reporters on July 21 in response to the CBO report on the bill.\nIn a statement on Thursday, the White House again touted the bill by posting excerpts from a series of recent newspaper articles that praised the measure. Earlier this month, the administration also said that Americans would see an average tax cut of $3,752 under the bill, citing a report from nonprofit organization the Tax Foundation.\nFriday’s report from the CBO comes as Canadian Prime Minister Mark Carney announced that Canada would scrap some of its retaliatory tariffs against the United States. Trump imposed tariffs on Canada and Mexico earlier this year, saying those measures were necessary to curb illegal immigration and fentanyl trafficking into the country.\n“We have the best deal of anyone in the world right now,” Carney told reporters in Ottawa. “Today, the government of Canada is harmonizing its tariffs with the U.S.”\nReuters contributed to this report."
    },
    {
      "news_title": "CBO says tariffs will cut $4 trillion from budget deficits by 2035",
      "news_link": "https://insidetrade.com/trade/cbo-says-tariffs-will-cut-4-trillion-budget-deficits-2035",
      "bias": "Center",
      "text": "August 23, 2025\nCBO says tariffs will cut $4 trillion from budget deficits by 2035\nThe Congressional Budget Office has updated its estimate of the budgetary impacts that will stem from President Trump’s wave of new tariffs, concluding that if maintained over 10 years they will reduce federal budget deficits by a total of $4 billion -- a finding that Trump is touting as a vindication of his trade policy. CBO Director Phillip Swagel on Thursday posted a CBO blog entry titled “An Update About CBO's Projections of the Budgetary Effects of Tariffs,” revising calculations...\nNot a subscriber?\nRequest 30 days free access to exclusive, behind-the-scenes reporting on trade policy in the Trump era."
    },
    {
      "news_title": "ICYMI: Tariffs Will Reduce Deficit by $4 Trillion",
      "news_link": "https://www.whitehouse.gov/articles/2025/08/icymi-tariffs-will-reduce-deficit-by-4-trillion/",
      "bias": "Right",
      "text": "ICYMI: Tariffs Will Reduce Deficit by $4 Trillion\nPresident Donald J. Trump’s tariffs will reduce total deficits by $4 trillion over the next decade, according to a new analysis from the Congressional Budget Office.\n“The Congressional Budget Office projected that President Donald Trump’s tariff agenda, if maintained, would decrease total deficits by up to $4 trillion over the next decade.\nThe CBO, Congress’s nonpartisan scorekeeper, released the updated projections on Friday. The CBO found that the effective tariff rate for goods imported into the United States has increased by a notable 18 percentage points from last year.\nIf the stance is maintained for the next 10 years, primary deficits would fall by $3.3 trillion, the CBO said. The tariff revenue would also minimize the need for federal borrowing, and would result in $700 billion less spending on interest, driving total deficits down by $4 trillion.”"
    },
    {
      "news_title": "Congressional Budget Office says Trump tariffs will reduce deficits by $4 trillion over next decade",
      "news_link": "https://justthenews.com/politics-policy/finance/congressional-budget-office-says-trump-tariffs-will-reduce-deficits-4",
      "bias": "Lean Right",
      "text": "Congressional Budget Office says Trump tariffs will reduce deficits by $4 trillion over next decade\nThe number is an increase from the budget office's previous prediction in June, which found that it would reduce federal deficits by $2.8 trillion over the next decade.\nThe Congressional Budget Office (CBO) on Friday adjusted its projection on the impact that President Donald Trump's tariffs will have on the United States budget, finding that it will likely reduce U.S. deficits by $4 trillion over the next decade.\nThe number is an increase from the budget office's previous prediction in June, which found that it would reduce federal deficits by $2.8 trillion over the next decade.\nThe CBO found that the effective tariff rate for goods imported into the United States has increased by 18% compared to 2024. If the higher tariff rates remain the same from 2025 through 2035, then primary deficits would fall by $3.3 trillion, which would also lower the need for borrowing and save the government $700 billion in interest.\n“CBO projects further increases in tariff revenues in the coming months,” the office wrote. “If there are no further changes in tariff rates, we project that customs duties from new and existing tariffs will total about $200 billion this fiscal year.”\nThe update is part of the CBO's short-term economic forecast, which spans from 2025 to 2028. The full short-term forecast will be released on Sept. 12.\nMisty Severi is a news reporter for Just The News. You can follow her on X for more coverage."
    },
    {
      "news_title": "Congressional Budget Office: Trump's tariffs can cut deficits by $4 TRILLION! * WorldNetDaily * by Bob Unruh",
      "news_link": "https://www.wnd.com/2025/08/congressional-budget-office-trumps-tariffs-can-cut-deficits/",
      "bias": "Far Right",
      "text": "President Donald Trump’s agenda to use tariffs to push for fair trade deals, raise revenue for America and support U.S.-based business and industry sparked the first monthly trade surplus in years. In happened when the surplus was reported at $27 billion, just weeks ago.\nAnd the longer term impact appears to be even brighter.\nA report at the Washington Examiner detailed a new projection from the Congressional Budget Office, the nonpartisan organization that keeps its thumb on America’s wallet.\nThat group is predicting Trump’s tariff agenda, if maintained, would “decrease total deficits by up to $4 trillion over the next decade.”\n“CBO projects further increases in tariff revenues in the coming months,” director Phillip Swagel wrote. “If there are no further changes in tariff rates, we project that customs duties from new and existing tariffs will total about $200 billion this fiscal year.”\nThe nation has a total debt now of about $37 trillion, with each citizen’s share more than $108,000.\nThe forecasts come in light of the adoption over the summer of Trump’s One Big Beautiful Bill that established a secure future for the Trump tax cuts of his first term. It also addresses a long list of other government actions, including massive cuts in spend in several areas.\nIt calls for an elimination of tax funding to the abortion industry giant Planned Parenthood, which has gone to court claiming it can, through the courts, force taxpayers to deliver cash to its accounts even though Congress and the president have determined that should not be spent.\nOddly, there are now entry-level court judges who have agreed with this concept of a constitutional right for abortionists to tax money.\nThe CBO estimates the OBBBA will represent a $4.5 trillion decrease in tax revenues and a $1.1 trillion cut in spending through 2034.\nBut White House officials are counting on economic growth as well as hundreds of billions in new tariff revenue to help the nation.\nThe Council of Economic Advisers earlier suggested the legislation that came to be the OBBBA would produce a deficit reduction of up to $2.3 trillion over a decade, from growth."
    },
    {
      "news_title": "Trump tariffs will lower deficits by $4 trillion over a decade ...",
      "news_link": "https://www.axios.com/2025/08/22/trump-tariffs-deficits",
      "bias": "Lean Left",
      "text": null
    },
    {
      "news_title": "Trump's tariffs could reduce US deficit by $4 trillion, CBO estimates",
      "news_link": "https://money.usnews.com/investing/news/articles/2025-08-22/trumps-tariffs-could-reduce-us-deficit-by-4-trillion-cbo-estimates",
      "bias": "Lean Left",
      "text": null
    },
    {
      "news_title": "Trump’s Tariffs Will Reduce Deficits by $4 Trillion Over Next Decade, Says CBO Report",
      "news_link": "https://www.theepochtimes.com/us/trumps-tariffs-will-reduce-deficits-by-4-trillion-over-next-decade-says-cbo-report-5904874",
      "bias": "Lean Right",
      "text": "A report released on Friday by the Congressional Budget Office (CBO) predicted that President Donald Trump’s tariffs will reduce federal deficits by around $4 trillion over the next decade.\nIf Trump’s global tariff hikes continue, increased revenue could shrink primary deficits by $3.3 trillion and cut federal interest payments by $0.7 trillion over the next decade, the CBO said. The current top tariff rates may not hold as negotiations with trading partners and international legal challenges are ongoing."
    },
    {
      "news_title": "CBO Vindicates Trump, Admits Tariffs Will Reduce Deficit By Trillions",
      "news_link": "https://trendingpoliticsnews.com/cbo-vindicates-trump-admits-tariffs-will-reduce-deficit-by-trillions-micca/",
      "bias": "Right",
      "text": "Politics\nCBO Vindicates Trump, Admits Tariffs Will Reduce Deficit By Trillions\nA new report released by the Congressional Budget Office, which regularly releases information to Congress concerning the impact of tariffs, has finally admitted that President Donald Trump’s tariffs are going to reduce the deficit.\nThe report revealed that as of Aug. 19, the current tariff rate on goods brought into the U.S. has risen about 18 percentage points when measured against figures from 2024. CBO officials say this increase will help draw down primary deficits by a whopping $3.3 trillion if the higher tariff rate continues for the period of 2025-2035.\nOne of the reasons for the drop, according to the CBO, is that the tariffs reduce the need for federal borrowing. The money collected from the tariffs will reduce federal outlays for interest by another $0.7 trillion. The total reduction in deficits will reach $4 trillion.\nThe numbers are higher than those proposed back in June. The data used to come up with these estimates is gleaned from the Census Bureau, Customs and Border Protection, and the Treasury Department.\n“The methods account for a diversion of trade from countries facing high tariff rates to other countries facing lower tariff rates. The estimates are subject to significant uncertainty, largely owing to questions about timing, possible exceptions, and a lack of precedents,” the CBO wrote.\nWhile this is good news, not everything the CBO stated in its latest report was positive. In fact, according to The Hill, the report claims that the president’s “One Big, Beautiful Bill” is fueling economic inequality, a claim that Vice President JD Vance ripped to shreds.\n“First of all, the Congressional Budget Office, sometimes they put out reports that are absolutely atrocious, and I think this is a good example of a very atrocious report,” he remarked during an address, leading to loud applause from the audience.\n“The CBO report, which was done at the request of Democrats, found that the top 10 percent of earners in the country will see an average boost of $13,600 per year over the next decade as a direct result of provisions in the law, while the bottom 10 percent will see an average annual decrease of $1,200,” The Hill said.\n“The most important thing for people who are living at the bottom of the income ladder is that they not pay taxes on their income sources,” the vice president added.\nHe then said, “So, if you’re working hard and you’re working overtime, you’re going to get a big fat tax cut. If you’re working at a restaurant or some other business where you’re earning your wages primarily through tips, you’re going to get a big fat tax cut. And most importantly, the president’s economic policies are going to prevent your job from being shipped off to Asia or to Mexico. That is the very best thing for people at the bottom of the income ladder.”"
    },
    {
      "news_title": "More Winning: Stock Market Reacts to Powell's Big Hint About Rates, Huge News About Tariffs",
      "news_link": "https://redstate.com/nick-arama/2025/08/22/finally-jerome-powell-gives-a-big-hint-and-watch-what-just-happened-to-the-market-n2193115",
      "bias": "Right",
      "text": "President Donald Trump's frustration with Federal Reserve Chair Jerome Powell has been ongoing and completely justifiable. He's taken to calling Powell \"Too Late\" because of his reluctance to cut interest rates.\nBut, now, finally, Powell has dropped some broad hints that a rate cut may be on the horizon, as my colleague Streiff reported earlier.\nREAD MORE: Fed Chairman Hints at Coming Interest Rate Cut and Swears He's Not Doing It Because of Trump\nPowell said at the annual conference hosted by the Reserve Bank of Kansas City in Jackson Hole, Wyoming, “The baseline outlook and the shifting balance of risks may warrant adjusting our policy stance.”\nPowell added that “the balance of risks appear to be shifting” between the Fed’s dual mandate of full employment and stable prices. He cited “sweeping changes” in tax, trade and immigration policies.\nThe reaction from the stock market was great, as the Dow Jones soared to its highest point ever.\nThe Dow Jones Industrial Average rallied to an all-time high Friday after Federal Reserve Chair Jerome Powell signaled the central bank could begin easing monetary policy next month.\nThe Dow Jones Industrial Average climbed higher by 918 points, or 2%, reaching a fresh high. The S&P 500 climbed 1.6%, while the Nasdaq Composite gained 2%.\nShares of megacap technology stocks soared on Powell’s comments. Nvidia added 1.3%, while Meta, Alphabet and Amazon each climbed more than 2%. Tesla shares jumped about 5%.\nBut that wasn't the only good news that might be setting the market off.\nPresident Donald Trump's increased tariffs on U.S. imports from foreign countries could reduce the national deficit by $4 trillion over the next decade, the Congressional Budget Office estimated on Friday.If Trump's global tariff hikes continue, increased revenue could shrink primary deficits by $3.3 trillion and cut federal interest payments by $0.7 trillion over the next decade, CBO, Congress’ nonpartisan analyst, said.\nThat's astonishing, and President Donald Trump made sure he trumpeted it during his remarks from the White House on Friday.\n.@POTUS: I was very happy to see that even the left-wing CBO admits tariffs will reduce the deficit by $4 TRILLION over the next decade. pic.twitter.com/L7J8lxVRe0\n— Rapid Response 47 (@RapidResponse47) August 22, 2025\nTrump noted how the stock market had gone up as well.\nIt shows once again, with that Congressional Budget Office (CBO) estimate, that Trump was right about the tariffs reducing the deficit, assuming the tariffs hold in place. The CBO number is probably a low-ball estimate, too.\nSo what will the Democrats say now that even the CBO concedes this? Watch the scrambling that will ensue. But if they had won, none of this would have been possible, and we'd be in economic doldrums.\nREAD MORE: Mic Drop: Scott Bessent Delivers Glorious Four-Word Response to Reporter When Asked About Investing\nThat's looking like a lot of winning, with even more on the horizon when the economy gets going even more.\nhttps://t.co/K5tzamn659 pic.twitter.com/ktqN4GPCch\n— Rep. Mike Rulli (@RepMichaelRulli) August 22, 2025\nEditor’s Note: Thanks to President Trump’s leadership and bold policies, America’s economy is back on track.\nHelp us continue to report on the president’s economic successes and combat the lies of the Democrats. Join RedState VIP and use promo code FIGHT to get 60% off your membership.\nJoin the conversation as a VIP Member"
    },
    {
      "news_title": "Trump’s Tariffs Could Reduce U.S. Deficit By $4 Trillion, CBO Estimates",
      "news_link": "https://www.dailywire.com/news/trumps-tariffs-could-reduce-u-s-deficit-by-4-trillion-cbo-estimates",
      "bias": "Right",
      "text": "President Donald Trump’s increased tariffs on U.S. imports from foreign countries could reduce the national deficit by $4 trillion over the next decade, the Congressional Budget Office estimated on Friday.\nIf Trump’s global tariff hikes continue, increased revenue could shrink primary deficits by $3.3 trillion and cut federal interest payments by $0.7 trillion over the next decade, CBO, Congress’ nonpartisan analyst, said.\nThe current top tariff rates may not hold as negotiations with trading partners and international legal challenges are ongoing.\nBut the additional tariff revenue could help offset the deficit increases triggered by the Republicans’ tax-cut and spending bill passed this year. CBO estimated this would widen the deficit by $3.4 trillion over the next decade.\nThe U.S. federal debt is $37.18 trillion, according to the Treasury Department. It has continued to grow under Republican and Democratic administrations as the U.S. Congress continues to authorize the federal government to spend more money than it takes in.\nLawmakers face a government funding deadline at the end of September or risk a shutdown if spending bills are not passed.\nThe latest CBO estimate marks an increase from June, when it forecast a $2.5 trillion reduction in primary deficits and a $500 billion cut in interest outlays.\nU.S. tariff rates across countries and products averaged 16.7% in August, up from 15.1% in June, according to Oxford Economics. More than $26 billion in duties have been assessed by U.S. Customs and Border Protection this fiscal year, far surpassing the hundreds of millions recorded in the previous year, according to the analysis.\n(Reporting by Bo Erickson; editing by Scott Malone and Clelia Oziel)"
    },
    {
      "news_title": "Trump's tariffs could reduce US deficit by $4 trillion, CBO estimates",
      "news_link": "https://www.reuters.com/world/us/trumps-tariffs-could-reduce-us-deficit-by-4-trillion-cbo-estimates-2025-08-22/",
      "bias": "Center",
      "text": null
    },
    {
      "news_title": "Trump’s Tariffs Will Reduce Deficits By $4 Trillion Over Next Decade, Says CBO Report – altnews.org",
      "news_link": "https://altnews.org/2025/08/23/trumps-tariffs-will-reduce-deficits-by-4-trillion-over-next-decade-says-cbo-report/",
      "bias": "unknown",
      "text": "Trump’s Tariffs Will Reduce Deficits By $4 Trillion Over Next Decade, Says CBO Report\nTrump’s Tariffs Will Reduce Deficits By $4 Trillion Over Next Decade, Says CBO Report\nAuthored by Jack Phillips via The Epoch Times,\nA report released on Friday by the Congressional Budget Office (CBO) predicted that President Donald Trump’s tariffs will reduce federal deficits by around $4 trillion over the next decade.\nIf Trump’s global tariff hikes continue, increased revenue could shrink primary deficits by $3.3 trillion and cut federal interest payments by $0.7 trillion over the next decade, the CBO said. The current top tariff rates may not hold as negotiations with trading partners and international legal challenges are ongoing.\n“We estimate that the effective tariff rate for goods imported into the United States has increased by about 18 percentage points when measured against 2024 trade flows,” the budget office said in its report, adding that Trump’s tariffs would reduce “the need for federal borrowing.”\nThe CBO also said it “projects further increases in tariff revenues in the coming months” and that “if there are no further changes in tariff rates, we project that customs duties from new and existing tariffs will total about $200 billion this fiscal year.”\nBut the office cautioned that revenues often lag several months behind the implementation of tariff policies, noting that once the rates are in effect, they don’t get applied to goods that are already in transit to the United States.\n“In addition, importers have the option to delay payments by up to six weeks by participating in Customs and Border Protection’s Periodic Monthly Statement program,” added the CBO, which is a federal agency within the legislative branch that provides budget and economic information to both houses of Congress.\nIn July, Congress passed the GOP-backed One Big Beautiful Bill Act that contained several major Trump priorities on energy, the border, spending, and tax cuts. The CBO has said that it would add around $3.4 trillion to the national deficit over the coming decade, although the White House has disputed those figures.\nThe Trump administration has also said that the tariffs and policies initiated under the One Big Beautiful Bill Act, which Trump backed and signed into law, would bring forth economic growth over the coming years that would offset any additions to the national deficit.\n“It was the largest tax cut for middle and working class families in our nation’s history, and the president wants to see this country get our fiscal house in order. That’s why this was a fiscally responsible bill,” White House press secretary Karoline Leavitt told reporters on July 21 in response to the CBO report on the bill.\nIn a statement on Thursday, the White House again touted the bill by posting excerpts from a series of recent newspaper articles that praised the measure. Earlier this month, the administration also said that Americans would see an average tax cut of $3,752 under the bill, citing a report from nonprofit organization the Tax Foundation.\nFriday’s report from the CBO comes as Canadian Prime Minister Mark Carney announced that Canada would scrap some of its retaliatory tariffs against the United States. Trump imposed tariffs on Canada and Mexico earlier this year, saying those measures were necessary to curb illegal immigration and fentanyl trafficking into the country.\n“We have the best deal of anyone in the world right now,” Carney told reporters in Ottawa. “Today, the Government of Canada is harmonizing its tariffs with the U.S.”\nTyler Durden\nFri, 08/22/2025 – 18:25\nRead further at ZeroHedge"
    },
    {
      "news_title": "Trump’s tariffs could reduce US deficit by US$4 trillion",
      "news_link": "https://www.freemalaysiatoday.com/category/highlight/2025/08/23/trumps-tariffs-could-reduce-us-deficit-by-us4-trillion",
      "bias": "unknown",
      "text": "If Trump’s global tariff hikes continue, increased revenue could shrink primary deficits by US$3.3 trillion and cut federal interest payments by US$0.7 trillion over the next decade, CBO, Congress’ nonpartisan analyst, said.\nThe current top tariff rates may not hold as negotiations with trading partners and international legal challenges are ongoing.\nBut the additional tariff revenue could help offset the deficit increases triggered by the Republicans’ tax-cut and spending bill passed this year. CBO estimated this would widen the deficit by US$3.4 trillion over the next decade.\nThe US federal debt is US$37.18 trillion, according to the treasury department. It has continued to grow under Republican and Democratic administrations as the US Congress continues to authorise the federal government to spend more money than it takes in.\nLawmakers face a government funding deadline at the end of September or risk a shutdown if spending bills are not passed.\nThe latest CBO estimate marks an increase from June when it forecast a US$2.5 trillion reduction in primary deficits and a US$500 billion cut in interest outlays.\nUS tariff rates across countries and products averaged 16.7% in August, up from 15.1% in June, according to Oxford Economics.\nMore than US$26 billion in duties have been assessed by US Customs and Border Protection this fiscal year, far surpassing the hundreds of millions recorded in the previous year, according to the analysis."
    },
    {
      "news_title": "CBO says tariffs could slash deficit by $4 trillion over next decade",
      "news_link": "https://sjvsun.com/u-s/cbo-says-tariffs-could-slash-deficit-by-4-trillion-over-next-decade/",
      "bias": "unknown",
      "text": "President Donald Trump’s increased tariffs on U.S. imports could reduce the national deficit by $4 trillion over the next 10 years, according to the Congressional Budget Office (CBO).\nThe CBO estimates that tariff-related revenue could shrink primary deficits by $3.3 trillion and reduce federal interest payments by $0.7 trillion.\nThe big picture: These projections assume continuation of tariff hikes globally, though current top tariff rates may fluctuate due to ongoing negotiations and legal challenges.\n- The additional revenue from tariffs may help offset an estimated $3.4 trillion increase in the deficit caused by the Republicans’ recently passed tax-cut and spending bill.\n- The U.S. federal debt currently stands at $37.18 trillion and has grown under both Republican and Democratic administrations amid continual government spending exceeding revenue.\nWhat we’re watching: A government funding deadline looms at the end of September, raising the risk of a shutdown if spending bills are not passed.\nDriving the news: The CBO’s latest forecast has increased compared to June, when deficit reductions were estimated at $2.5 trillion for primary deficits and $0.5 trillion for interest payments.\n- U.S. average tariff rates rose from 15.1% in June to 16.7% in August, with over $26 billion in duties collected this fiscal year, sharply up from the previous year’s hundreds of millions."
    }
  ]
}