{
  "story_id": "GN_20250823_201732_98288cbb",
  "metadata": {
    "title": "Trump administration halts offshore wind project in Rhode Island",
    "timestamp": "2025-08-23T20:17:32.549672",
    "url": "https://ground.news/article/trump-administration-halts-offshore-wind-project-in-rhode-island"
  },
  "bias_distribution": {
    "total_sources": "82",
    "leaning_left": "12",
    "center": "20",
    "leaning_right": "13"
  },
  "perspective_summaries": {
    "left": [
      "The Department of the Interior announced that all wind and solar projects must undergo elevated review from Secretary Doug Burgum's office.",
      "On August 1, the Department of the Interior issued an order evaluating energy projects by their capacity density, increasing scrutiny on wind and solar.",
      "Experts claim that these actions serve to hinder renewable energy while favoring fossil fuels, as indicated by Erik Schlenker-Goodrich."
    ],
    "center": [
      "The Trump administration ordered a halt to all activities on the Revolution Wind offshore project off Rhode Island on Friday, 2025-08-23.",
      "This stoppage follows the Department of Interior's recent secretarial order demanding elevated review of all wind and solar projects and concerns about national security and environmental impacts.",
      "The Danish firm Orsted, which has installed 45 of 65 turbines and completed 80% of construction since last year, said it is evaluating all options, including legal avenues, to resume the 704-megawatt project expected to power 350,000 homes.",
      "President Trump stated in Washington, 'wind doesn't work' and pledged to favor fossil fuels, claiming unverified environmental harms while critics argue the administration misuses environmental laws to restrict renewables.",
      "The order and elevated reviews could effectively block renewable energy development on federal lands, signaling a significant challenge for US wind power amid increasing international green energy adoption."
    ],
    "right": [
      "The Department of the Interior has halted all activity on the Revolution Wind project off Rhode Island, aligning with President Donald Trump's energy goals to lower costs for Americans and enhance reliable energy resources.",
      "The Bureau of Ocean Energy Management announced a stop-work order for the Revolution Wind project, which was expected to be operational in 2026 and aimed to generate power for Rhode Island and Connecticut.",
      "Concerns over national security interests and interference with economic zones were highlighted by the Bureau of Ocean Energy Management in relation to the project halt.",
      "Orsted stated that they are complying with the order to ensure worker and environmental safety during the stoppage of offshore activities."
    ]
  },
  "sources": [
    {
      "news_title": "Trump Administration Halts Offshore Wind Farm off Rhode Island - Big Win for Whales and the Environment - Newport Buzz",
      "news_link": "https://www.thenewportbuzz.com/trump-halts-rhode-island-offshore-wind-farm/57052",
      "bias": "Lean Left",
      "text": "The Trump administration dropped the hammer Friday on Ørsted’s controversial Revolution Wind project, ordering an immediate stop to all construction just 15 miles south of Rhode Island.\nThe massive 704-megawatt wind farm — already 80% built with 45 of 65 turbines standing in the Atlantic — was supposed to power 350,000 homes by 2026. Now it’s dead in the water.\nIn a letter to the Danish energy giant, the Bureau of Ocean Energy Management (BOEM) said work must stop while the Department of the Interior reviews “national security” and “environmental” concerns. Acting BOEM Director Matthew Giacona made clear the feds aren’t budging until those issues are resolved.\nThe decision marks a stunning reversal for the Biden-approved project, long slammed by fishermen, coastal communities, and environmentalists who warned the turbines would devastate marine life. The site sits near Cox Ledge — prime cod habitat — and critics have blamed offshore wind construction for a surge in dead whales along the East Coast. NOAA has even declared an “Unusual Mortality Event” for humpbacks.\nLocal fishermen celebrated the pause, saying the project threatened their livelihoods. Coastal advocates hailed the move as a huge victory in protecting waters, wildlife, and Rhode Island’s iconic shoreline.\nØrsted, reeling from financial losses and a $9.4 billion bailout plan, said it is “evaluating all options,” including possible legal action.\nFor now, the turbines are frozen in place — and so are the dreams of Big Wind.\nLike Newport Buzz? We depend on the generosity of readers like you who support us, to help with our mission to keep you informed and entertained with local, independent news and content. We truly appreciate your trust and support!"
    },
    {
      "news_title": "Trump Admin Kills Massive Offshore Wind Project",
      "news_link": "https://wattsupwiththat.com/2025/08/22/trump-admin-kills-massive-offshore-wind-project/?utm_source=rss&utm_medium=rss&utm_campaign=trump-admin-kills-massive-offshore-wind-project",
      "bias": "Right",
      "text": "Audrey Streb\nDCNF Energy Reporter\nThe Daily Caller News Foundation learned on Friday that the Department of the Interior (DOI) is immediately halting all activity on a massive offshore wind project.\nThe Bureau of Ocean Energy Management (BOEM) under the DOI is halting activity on the “Revolution Wind” project off the coast of Rhode Island and Connecticut in line with President Donald Trump’s energy goals to boost reliable energy resources and lower costs for Americans, the agency told the DCNF. The Trump administration has dealt a series of recent blows to the wind industry, with the DOI ending “preferential treatment” for what it considers to be foreign-controlled and unreliable energy sources and moving to terminate the massive Lava Ridge Wind Project in southern Idaho that the Biden administration approved just weeks before Trump’s return to office.\n“Americans deserve energy that is affordable, reliable, and built to last — not experimental and expensive wind projects that are proven failures,” DOI deputy press secretary Aubrie Spady told the DCNF. “In line with President Donald Trump’s Energy Dominance Agenda, Interior is putting an immediate stop to these costly failures to deliver a stronger energy future and lower costs for American families. Like President Trump said, ‘the days of stupidity are over in the USA!’” (RELATED: EXCLUSIVE: Trump Admin Unveils Massive Oil And Gas Lease Expansion Biden Tried To Squash)\nThe Biden administration approved the construction plan for Revolution Wind in 2023, which is located on the federally-owned Outer Continental Shelf. While former President Joe Biden pushed for wind and solar technology throughout his term by greenlighting billions in subsidies, loans and grants, the Trump administration has shifted its focus to conventional and reliable energy sources and taken action to crackdown on federal support for the green energy technology the Biden administration favored.\nTrump signed an executive order directing the DOI to “revise any identified regulations, guidance, policies, and practices as appropriate and consistent with applicable law to eliminate any such preferences for wind and solar facilities” on July 7. Trump campaigned against Biden’s push for green energy and has continued to rail against Biden’s climate agenda, writing on Truth Social Wednesday that “any State that has built and relied on WINDMILLS and SOLAR for power are seeing RECORD BREAKING INCREASES IN ELECTRICITY AND ENERGY COSTS. THE SCAM OF THE CENTURY! We will not approve wind or farmer destroying Solar. The days of stupidity are over in the USA!!! MAGA.”\nThe agency introduced an additional permitting roadblock for green energy projects on public lands on Aug. 1., and a few days later, Interior Secretary Doug Burgum wrote on X that wind projects “are known to kill eagles” and that his agency would enforce the Bald and Golden Eagle Protection Act to protect eagles. The Trump administration also pulled a permit for a massive pending New Jersey offshore wind project in March.\nThe wind industry has come under fire in recent years, as multiple beaches closed in 2024 after a broken wind turbine shed debris into the ocean off the coast of Nantucket and protests surged due to concerns about high-voltage cables running through neighborhoods in 2023. Environmentalists also raised concerns over the energy technology after dolphins washed up along the East Coast in 2023.\nSome fishermen have also voiced opposition to offshore wind projects, arguing that their industry cannot survive alongside offshore wind farms.\nAll content created by the Daily Caller News Foundation, an independent and nonpartisan newswire service, is available without charge to any legitimate news publisher that can provide a large audience. All republished articles must include our logo, our reporter’s byline and their DCNF affiliation. For any questions about our guidelines or partnering with us, please contact licensing@dailycallernewsfoundation.org.\nDiscover more from Watts Up With That?\nSubscribe to get the latest posts sent to your email."
    },
    {
      "news_title": "US tells Orsted to halt work on offshore wind project off Rhode Island",
      "news_link": "https://www.reuters.com/legal/litigation/us-tells-orsted-halt-work-offshore-wind-project-off-rhode-island-2025-08-22/",
      "bias": "Center",
      "text": null
    },
    {
      "news_title": "Interior Department Halts $1.5 Billion Offshore Wind Project Off Rhode Island",
      "news_link": "https://www.theepochtimes.com/us/danish-company-orsted-ordered-to-halt-work-on-rhode-island-offshore-wind-project-5905097",
      "bias": "Lean Right",
      "text": "The U.S. Department of the Interior on Aug. 22 directed Danish company Orsted to halt all construction on Revolution Wind, the offshore wind farm off Rhode Island that is nearing completion.\nIn a letter, Bureau of Ocean Energy Management (BOEM) acting Director Matthew Giacona ordered Orsted to suspend all activities on the project while officials conduct a review to address “concerns related to the protection of national security interests.”"
    },
    {
      "news_title": "Trump administration orders work halted on wind farm that is nearly built - The Boston Globe",
      "news_link": "https://www.bostonglobe.com/2025/08/22/nation/trump-order-wind-farm/",
      "bias": "Lean Left",
      "text": "The Trump administration on Friday ordered that all construction stop on Revolution Wind, a $4 billion wind farm off the coast of Rhode Island that is mostly built.\nThe 65-turbine project had obtained all necessary permits from the Biden administration, and nearly 70% of the turbines have been installed. The developers behind the project had said it was on track to produce enough electricity for more than 350,000 homes in Rhode Island and Connecticut by next spring.\nMatthew Giacona, the acting director of the Bureau of Ocean Energy Management, issued a letter Friday to Orsted, the Danish company building the wind farm, ordering it to “halt all ongoing activities” because of unspecified issues.\n“In particular, BOEM is seeking to address concerns related to the protection of national security interests in the United States,” Giacona wrote, adding that Orsted “may not resume activities” until the agency has completed a review of the project.\nThe decision was first reported by The Daily Caller. The Interior Department declined to comment on the order to stop work on Revolution Wind.\nAdvertisement\nIn a statement, Orsted said that it was “evaluating all options to resolve the matter expeditiously,” including “potential legal proceedings.” The company said it still aimed to complete the project by next year.\nLast week, Orsted said that it needed to raise an additional $9.4 billion to shore up its finances as it attempted to complete both Revolution Wind and Sunrise Wind, another large offshore wind project near Long Island in New York while contending with an industry downturn that has been exacerbated by President Donald Trump’s opposition to wind farms.\nAdvertisement\n“Orsted and our industry are in an extraordinary situation with the adverse market development in the U.S.,” said Rasmus Errboe, the company’s CEO.\nConnecticut Attorney General William Tong, a Democrat, said the state was “evaluating all legal options to protect Connecticut’s interests.”\n“Trump wants to mothball billions of dollars in investment and cancel one of the best new sources of American-made, renewable energy,” Tong said. “Trump and his enablers will own the resulting cost increases for ratepayers.”\nThe Trump administration’s move against Revolution Wind is the latest in a series of its escalating attacks against the wind industry.\nOn Thursday, the Commerce Department opened a trade investigation into imported wind turbines and their components. The probe could result in further tariffs on the wind industry that could increase costs for offshore projects that are already underway.\nTwo weeks ago, the administration said it was reversing a Biden administration decision to approve the Lava Ridge Wind Project, a giant wind farm planned for southern Idaho. The administration said it had discovered “legal deficiencies” in the original approval but did not provide details.\nThe Interior Department had signaled last month that it would consider revoking federal permits for wind projects that opponents have sued over, even if those projects were under construction.\nIn April, the Trump administration ordered a halt to work at Empire Wind, a $5 billion wind farm off the coast of Long Island that was under construction, without publicly providing a justification. After a month of negotiations with New York Gov. Kathy Hochul, a Democrat, the administration let Empire Wind move forward, but administration officials suggested that they had done so only after Hochul agreed to approve new gas pipelines in the state. Hochul has denied that any such deal was made.\nAdvertisement\nEquinor, the developer behind Empire Wind, recently said that those delays and other regulatory changes affecting U.S. offshore wind projects had cost the company nearly $1 billion.\nThis article originally appeared in The New York Times."
    },
    {
      "news_title": "Trump administration halts offshore wind project in Rhode Island",
      "news_link": "https://thehill.com/policy/energy-environment/5467000-trump-halts-rhode-island-wind-energy-project/",
      "bias": "Center",
      "text": null
    },
    {
      "news_title": "US halts work on huge, nearly complete offshore wind farm",
      "news_link": "https://www.kake.com/us-halts-work-on-huge-nearly-complete-offshore-wind-farm/article_359c280f-4b4b-53b7-b8db-6efd6eccdf83.html",
      "bias": "Center",
      "text": "The US federal government on Friday ordered all construction be halted on a massive wind farm off the coast of Rhode Island that is 80 percent complete.\nIt was the latest in a series of orders blocking climate-friendly wind power from the administration of US President Donald Trump, who said on Thursday that \"wind doesn't work.\"\nThe Revolution Wind project, which started construction last year after receiving all the necessary permits, is intended to power more than 350,000 homes in the US state of Rhode Island, according to its builder, Danish renewables firm Orsted.\nMatthew Giacona, acting director of the Bureau of Ocean Energy Management (BOEM), issued a letter on Friday ordering the project to \"halt all ongoing activities\" to allow time for a review.\n\"In particular, BOEM is seeking to address concerns related to the protection of national security interests in the United States,\" the letter read, without elaborating.\n\"You may not resume activities until BOEM\" has completed the review, it added.\nOrsted said in a statement it is \"evaluating all options to resolve the matter expeditiously,\" including engaging in \"potential legal proceedings.\"\nThe wind farm is 80 percent complete, with 45 of its planned 65 wind turbines installed, the company said, adding it hopes to finish the project by late next year.\nThe entire wind power sector has faced a major challenge in the US since Trump replaced renewables-friendly Joe Biden in the White House in January.\nTrump has frozen federal permitting and loans for all offshore and onshore wind projects -- and repeatedly expressed his distaste for wind power.\n\"It destroys everything, it looks terrible, it's a very expensive form of energy -- and we're not doing the wind, we're going back to fossil fuel,\" Trump said in Washington on Thursday.\nAs the United States has been blocking and stalling wind power, China and Europe have been breaking records in their embrace of the green energy.\nOrsted, once considered a success story, said last week it is planning to raise $9.4 billion by selling shares after the US setbacks.\nEmpire Wind, another massive wind power project off New York being constructed by Norway's Equinor, was also temporarily halted by the Trump administration in April."
    },
    {
      "news_title": "Trump administration halts work on New England offshore wind project",
      "news_link": "https://www.axios.com/2025/08/22/trump-halts-offshore-wind-orsted",
      "bias": "Lean Left",
      "text": null
    },
    {
      "news_title": "LCV Statement on Trump Administration Stopping Work on Offshore Wind Project",
      "news_link": "https://www.lcv.org/media-center/lcv-statement-on-trump-administration-stopping-work-on-offshore-wind-project/",
      "bias": "Left",
      "text": "Washington, D.C. — In response to today’s announcement from the Bureau of Ocean Energy Management to issue a stop work order on the Revolution Wind offshore wind project, the League of Conservation Voters issued the following statement from Local Clean Energy Deployment Director Kathleen Meil:\n“Donald Trump and his administration are doing everything they can to raise energy prices for hardworking families and kill clean energy jobs. Energy prices are already going up as communities across the country continue to experience climate-fueled extreme weather and energy demand is rising — it makes absolutely no sense to be taking affordable clean energy offline. The administration just tried this with another offshore wind project, and when they were called on it, they redacted an entire 27 page study rather than admit the truth: Donald Trump wants to kill affordable clean energy because he cares more about Big Polluters than families’ pocketbooks, what’s best for communities, and our kids’ future.”\n###"
    },
    {
      "news_title": "Revolution Wind project halted by Trump administration",
      "news_link": "https://www.abc6.com/revolution-wind-project-halted-by-trump-administration/",
      "bias": "Center",
      "text": "Revolution Wind project halted by Trump administration\nPROVIDENCE, R.I. (WLNE) — The U.S. Department of the Interior ordered any ongoing activity related to the Revolution Wind Project to stop Friday.\nIn a letter to leadership at Orsted, the acting director of the Bureau of Ocean Energy Management said the Department of Interior wants concerns addressed before any work can resume.\nActing Director Matthew Giacona said these concerns have been identified as part of a review of offshore wind projects mandated by the president.\nSpecific concerns include protection of the environment and national security interests, Giacona said.\nOrsted completed installation of the project’s first offshore wind turbine in September 2024.\nAt the time, the company hailed it as a “historic moment for Rhode Island and Connecticut’s first large-scale offshore wind farm.”\nGov. Dan McKee celebrated it as a “monumental moment” for Rhode Island at the time.\nOrsted said the 704-megawatt offshore wind farm was set to generate enough energy to power 350,000 homes in Rhode Island and Connecticut.\nThe project site is 15 miles south of Rhode Island’s coast.\nThe project was expected to be operational in 2026, according to Orsted’s website.\nIn a statement sent to ABC6 Friday, Orsted said it is complying with the order.\nThe company noted that the project is already 80 percent complete, with 45 of 65 wind turbines installed.\nThe company is considering legal proceedings in the matter, the statement said."
    },
    {
      "news_title": "Controversy Clouds Orsted's Revolution Wind Project",
      "news_link": "https://www.devdiscourse.com/article/science-environment/3591244-controversy-clouds-orsteds-revolution-wind-project",
      "bias": "Center",
      "text": "Controversy Clouds Orsted's Revolution Wind Project\nThe Trump administration has ordered Orsted to stop all activities related to the Revolution Wind project off Rhode Island, due to concerns arising from a review of offshore wind projects.\nThe Trump administration, in a move clouded with controversy, has directed Orsted, a leading Danish energy firm, to cease its activities on the Revolution Wind project.\nThis directive was issued through a letter from the Bureau of Ocean Energy Management (BOEM), highlighting unspecified concerns emanating from a broader review of offshore wind initiatives in federal waters.\nThe halt, ordered by acting Director Matthew Giacona, places the future of this significant renewable energy undertaking in uncertainty, drawing attention to the administration's evolving stance on wind energy projects.\n(With inputs from agencies.)\nAdvertisement"
    },
    {
      "news_title": "Trump Halts Orsted Wind Project in Another Blow to Industry",
      "news_link": "https://www.bloomberg.com/news/articles/2025-08-22/trump-halts-orsted-wind-project-in-another-blow-to-industry",
      "bias": "Lean Left",
      "text": null
    },
    {
      "news_title": "Trump administration orders Revolution Wind to halt work on offshore wind project",
      "news_link": "https://turnto10.com/news/local/trump-administration-orders-revolution-wind-to-halt-wok-on-offshore-wind-project-turbines-rhode-island-coast-connecticut-construction-boem-auugust-22-2025",
      "bias": "Lean Right",
      "text": "(WJAR) — The Bureau of Ocean Energy Management announced it is issuing a stop-work order to the Revolution Wind project.\nThe Revolution Wind project was putting wind turbines about 15 miles off the Rhode Island coast and was expected to be operational in 2026.\nIt aimed to create an offshore wind farm that is expected to generate power for Rhode Island and Connecticut.\nAccording to federal officials, the stoppage is to take time and address concerns that arose during the review of a presidential memorandum issued in January.\n“In particular, BOEM is seeking to address concerns related to the protection of national security interest of the United States and prevention of interference with reasonable uses of the exclusive economic zone, the high seas and the territorial seas,” the Acting Director of BOEM Matthew Giacona wrote in a letter to Revolution Wind.\nOrsted said the offshore construction of the project is 80% complete with all foundation installed and 45 of 65 wind turbines installed. Revolution Wind is a subsidiary of Orsted.\n“Revolution Wind is complying with the order and is taking appropriate steps to stop offshore activities, ensuring the safety of workers and the environment,” an Orsted spokesperson said in a statement. “Ørsted is evaluating all options to resolve the matter expeditiously. This includes engagement with relevant permitting agencies for any necessary clarification or resolution as well as through potential legal proceedings, with the aim being to proceed with continued project construction towards COD in the second half of 2026.”\nThe project received final federal approval from BOEM over a year ago."
    },
    {
      "news_title": "EXCLUSIVE: Trump Admin Kills Massive Offshore Wind Project",
      "news_link": "https://dailycaller.com/2025/08/22/exclusive-trump-admin-kills-massive-offshore-wind-project/",
      "bias": "Right",
      "text": "The Daily Caller News Foundation learned on Friday that the Department of the Interior (DOI) is immediately halting all activity on a massive offshore wind project.\nThe Bureau of Ocean Energy Management (BOEM) under the DOI is halting activity on the “Revolution Wind” project off the coast of Rhode Island and Connecticut in line with President Donald Trump’s energy goals to boost reliable energy resources and lower costs for Americans, the agency told the DCNF. The Trump administration has dealt a series of recent blows to the wind industry, with the DOI ending “preferential treatment” for what it considers to be foreign-controlled and unreliable energy sources and moving to terminate the massive Lava Ridge Wind Project in southern Idaho that the Biden administration approved just weeks before Trump’s return to office.\n“Americans deserve energy that is affordable, reliable, and built to last — not experimental and expensive wind projects that are proven failures,” DOI deputy press secretary Aubrie Spady told the DCNF. “In line with President Donald Trump’s Energy Dominance Agenda, Interior is putting an immediate stop to these costly failures to deliver a stronger energy future and lower costs for American families. Like President Trump said, ‘the days of stupidity are over in the USA!'” (RELATED: EXCLUSIVE: Trump Admin Unveils Massive Oil And Gas Lease Expansion Biden Tried To Squash)\nThe Biden administration approved the construction plan for Revolution Wind in 2023, which is located on the federally-owned Outer Continental Shelf. While former President Joe Biden pushed for wind and solar technology throughout his term by greenlighting billions in subsidies, loans and grants, the Trump administration has shifted its focus to conventional and reliable energy sources and taken action to crackdown on federal support for the green energy technology the Biden administration favored.\nTrump signed an executive order directing the DOI to “revise any identified regulations, guidance, policies, and practices as appropriate and consistent with applicable law to eliminate any such preferences for wind and solar facilities” on July 7. Trump campaigned against Biden’s push for green energy and has continued to rail against Biden’s climate agenda, writing on Truth Social Wednesday that “any State that has built and relied on WINDMILLS and SOLAR for power are seeing RECORD BREAKING INCREASES IN ELECTRICITY AND ENERGY COSTS. THE SCAM OF THE CENTURY! We will not approve wind or farmer destroying Solar. The days of stupidity are over in the USA!!! MAGA.”\nThe agency introduced an additional permitting roadblock for green energy projects on public lands on Aug. 1., and a few days later, Interior Secretary Doug Burgum wrote on X that wind projects “are known to kill eagles” and that his agency would enforce the Bald and Golden Eagle Protection Act to protect eagles. The Trump administration also pulled a permit for a massive pending New Jersey offshore wind project in March.\nThe wind industry has come under fire in recent years, as multiple beaches closed in 2024 after a broken wind turbine shed debris into the ocean off the coast of Nantucket and protests surged due to concerns about high-voltage cables running through neighborhoods in 2023. Environmentalists also raised concerns over the energy technology after dolphins washed up along the East Coast in 2023.\nSome fishermen have also voiced opposition to offshore wind projects, arguing that their industry cannot survive alongside offshore wind farms.\nAll content created by the Daily Caller News Foundation, an independent and nonpartisan newswire service, is available without charge to any legitimate news publisher that can provide a large audience. All republished articles must include our logo, our reporter’s byline and their DCNF affiliation. For any questions about our guidelines or partnering with us, please contact licensing@dailycallernewsfoundation.org."
    },
    {
      "news_title": "Trump Admin Is Using Environmental Protections to Throttle Renewable Energy",
      "news_link": "https://truthout.org/articles/trump-admin-is-using-environmental-protections-to-throttle-renewable-energy/",
      "bias": "Left",
      "text": "The Department of the Interior, or DOI, has such a wide-ranging set of duties that it’s sometimes referred to in Washington, D.C., as “the department of everything else” — public lands, natural resources, wildlife regulations, and the Bureau of Indian Affairs all fall under its auspices. It is now also the tip of the spear in the Trump administration’s war on renewables.\nOn July 17, the DOI announced that all wind and solar projects would have to undergo “elevated review” from department Secretary Doug Burgum’s office. On July 29, Burgum ordered an end to “preferential treatment” for “unreliable, foreign controlled energy sources,” specifically wind and solar. The next day, the Bureau of Ocean Energy Management, which sits within the DOI, rescinded all designated Wind Energy Areas along the continental shelf. Two days later, on August 1, the DOI released a secretarial order that mandates all energy projects based on federal land be evaluated on their “capacity density,” or how much energy they are able to produce per square acre. The following week, the agency ordered the cancellation of the already-approved Lava Ridge Wind Project, a proposed wind farm in Idaho, arguing that it would “harm rural communities, livelihoods and the land.” And on August 4, Bergum called for the use of the Bald and Golden Eagle Protection Act to request numbers of eagle deaths from wind developers.\nFollowing these moves, President Donald Trump took to Truth Social to vow that the administration “will not approve wind or farmer destroying Solar. The days of stupidity are over in the USA!!!”\nUncompromised, uncompromising news\nGet reliable, independent news and commentary delivered to your inbox every day.\nWhat Trump and the Interior Department are doing, experts say, is using environmentalists’ legal playbook against them to throttle renewable energy. Laws meant to protect and safeguard wildlife and public lands from mining, drilling, and habitat degradation — such as the Federal Land Policy and Management Act’s prohibition against “unnecessary or undue degradation” — are instead being wielded as a cudgel against wind and solar.\n“They are effectively trying to co-opt arguments that we have used for years to push back on fossil fuels,” said Erik Schlenker-Goodrich, the executive director at the Western Environmental Law Center, a public interest firm.“But I think it should go without saying that they are abusing those laws.”\nSchlenker-Goodrich pointed to the DOI’s recent capacity density order as a particularly troubling example. Secretarial orders are meant to function as internal guidance to agencies. “They are not intended to put in place substantive rules that dictate outcomes,” he said, in this case “a de facto prohibition against the siting and permitting of renewables on federal public lands.”\nSolar and wind farms will never technically be able to produce as much energy per acre as an oil and gas facility — but that is also not the best measure of impact. Wind turbines are only a handful of feet wide at the base — the land or water that surrounds them remains unaffected and can easily be used for farming or agriculture. Solar panels can be placed on brownfields or integrated on agricultural land. When a wind or solar farm is decommissioned, the equipment is removed, the ground is decompacted, and vegetation is replanted. Within a year or two, you can barely tell anything was there, and the land can immediately be reused — the possibilities are limited only by zoning laws.\nIn contrast, when a refinery or a fossil fuel plant shuts down, the ground is poisoned. Cancer-causing chemicals like benzene saturate the soil and remediation can take years, assuming it happens at all. And that doesn’t even account for the massive amount of energy spent producing and transporting fossil fuels to power plants.\n“The DOI is fixating on this one metric, capacity density, to the exclusion of a holistic understanding of costs and benefits of a particular energy technology,” said Schlenker-Goodrich.\nRefineries, gas plants, and nuclear plants also aren’t typically built on public land, nor are they likely to be. Private industry has little interest in dealing with even more federal regulations, according to Josh Axelrod, senior policy advocate at the National Resources Defense Council, an environmental nonprofit.\n“The [DOI is] trying to come up with the facade of a rational reason to stop doing anything related to renewables, but this one especially is really mind-boggling,” said Axelrod. “Everything it compares wind and solar to — none of those types of facilities are built on federal land … There’s no comparison.”\nThe Interior Department’s order that all wind and solar projects on federal land undergo “elevated review” is another misuse of environmental law, experts said. Routine procedures that would have previously been handled by a DOI bureaucrat will now need the secretary’s personal sign-off. And the restrictions will impact projects on private land just as much as on public land. A recent analysis from The American Clean Power Association found that 27 of the new procedures requiring Bergum’s sign-off — such as needing consultations around harm to wildlife and endangered species — will allow the DOI to effectively end development of renewable energy projects nationwide. The goal, it seems, is to create an impossible backlog that bleeds projects of funding before they can get off the ground.\nAll of this is in service of propping up dying industries, such as coal, said Alex Klass, an environmental law professor at the University of Michigan. “[The administration] can talk about energy dominance and talk about the need for new energy,” he said, “but before there was always an argument [that] you shouldn’t try to prop up an industry that can’t make it on its own. That’s basically what they’re doing.”\nAnd it is being done with little concern for the environmental consequences.\nBergum cited concerns about migratory bird populations when he moved to cancel offshore areas for wind energy development. But on Tuesday, the DOI announced that it plans to hold 30 oil and gas lease auctions over the next 15 years — also offshore. Although the administration has declared an “energy emergency,” it’s clear that actual energy development is being approached from a position of political theater, rather than practicality.\nTrump has claimed that offshore wind turbines “are causing whales to die in numbers never seen before,” but there is no evidence of that. Upon taking office, the administration almost immediately moved to fire scientists at the National Oceanic and Atmospheric Administration whose research centered around ensuring offshore wind was safe for whales. Offshore drilling, on the other hand, is proven to be enormously harmful to marine environments. Seismic blasting can result in hearing loss — affecting whales’ ability to breed and communicate — and animals are often killed by vessel strikes. When something goes wrong on a drill rig, it’s apocalyptic for the nearby environment. The Deepwater Horizon spill remains the worst environmental disaster in United States history.\nInterior officials have also worked to roll back environmental regulations around mining, eliminate Biden-era regulations that provided protection for public lands, and fast-track mining despite local concerns of water scarcity. Given the administration’s aggressive antipathy for environmental regulations, experts say it’s impossible to believe that the Interior Department’s sudden conservationist concerns around solar and wind impacts are being made in good faith.\n“It’s not like the Biden administration stopped permitting oil and gas development. There’s lots of oil and gas development,” said Klass. “They just also tried to prioritize wind and solar. Here they’re saying, ‘Not only are we not going to prioritize [wind and solar], we’re going to try to shut it down entirely.’”\nAn urgent appeal for your support\nTruthout relies on reader support to publish independent journalism, free from political and corporate influence.\nUnfortunately, donations are down. At a moment when our journalism is most necessary, we are struggling to meet our operational costs due to worsening political censorship.\nTruthout may end this month in the red without additional help, so we’ve launched a fundraiser. We have 5 days to hit our $35,000 goal. Please make a tax-deductible gift to Truthout at this critical time!"
    },
    {
      "news_title": "Department of government efficiency - Lawyers, Guns & Money",
      "news_link": "https://www.lawyersgunsmoneyblog.com/2025/08/department-of-government-efficiency",
      "bias": "unknown",
      "text": "Department of government efficiency\nWasting money and raising energy prices because of a combination of being in political hock to fossil fuel interests and having seen a mediocre stand-up routine about wind power on Jay Leno or something:\nThe Trump administration on Friday ordered that all construction stop on Revolution Wind, a $4 billion wind farm off the coast of Rhode Island that is already mostly built.\nThe 65-turbine project had obtained all necessary permits from the Biden administration, and nearly 70 percent of the turbines have been installed. The developers behind the project had said it was on track to produce enough electricity for more than 350,000 homes in Rhode Island and Connecticut by next spring.\nMatthew Giacona, the acting director of the Bureau of Ocean Energy Management, issued a letter on Friday to Orsted, the Danish company building the wind farm, ordering it to “halt all ongoing activities” because of unspecified issues.\n“In particular, BOEM is seeking to address concerns related to the protection of national security interests in the United States,” Mr. Giacona wrote, adding that Orsted “may not resume activities” until the agency has completed a review of the project.\nWe’re living in a perpetual Anne Gorsuch revenge fantasy."
    },
    {
      "news_title": "Trump halts Orsted’s US Revolution Wind",
      "news_link": "https://www.rechargenews.com/policy/trump-halts-orsted-s-us-revolution-wind/2-1-1861582",
      "bias": "unknown",
      "text": "Trump halts Orsted’s US Revolution Wind\nAdministration issues stop-work order against array already 80% complete to address ‘national security concerns’\nAdministration issues stop-work order against array already 80% complete to address ‘national security concerns’"
    }
  ]
}