{
  "story_id": "GN_20250823_184455_6c4a7bea",
  "metadata": {
    "title": "Thai court clears ex-PM Thaksin Shinawatra in royal insult case, lawyer says",
    "timestamp": "2025-08-23T18:44:55.191224",
    "url": "https://ground.news/article/thai-court-clears-ex-pm-thaksin-shinawatra-in-royal-insult-case-lawyer-says_f8c282"
  },
  "bias_distribution": {
    "total_sources": "102",
    "leaning_left": "32",
    "center": "23",
    "leaning_right": "13"
  },
  "perspective_summaries": {
    "left": [
      "Thailand's former Prime Minister Thaksin Shinawatra was acquitted of a royal defamation charge that could have led to a 15-year prison sentence.",
      "His lawyer, Winyat Chatmontree, confirmed the court's acquittal verdict, which was disclosed in a news release by the Bangkok Criminal Court.",
      "The court found the evidence too weak to support a conviction and noted that the prosecution's interview account lacked context.",
      "Thaksin has maintained that the charges against him are politically motivated and he has not spent any time in prison since leaving office."
    ],
    "center": [
      "On August 22, 2025, a Bangkok court cleared Thaksin Shinawatra, Thailand’s former prime minister, of charges related to alleged royal defamation due to a lack of sufficient evidence.",
      "The case originated from a 2015 interview Thaksin gave while in exile and was initiated by the royalist military forces responsible for removing him from power in the 2006 coup.",
      "Thaksin, aged 76, appeared at court smiling, wore a yellow necktie symbolizing monarchy, denied wrongdoing, and told reporters the case was \"dismissed\".",
      "He faced up to 15 years in prison under lese-majeste laws, but upon arrival, he was given an eight-year term on graft and misuse of power charges, which the king later reduced to one year before he was released early in February 2024.",
      "The verdict eased legal pressure on Thaksin, who remains politically active though without government role, while a separate court will soon rule on his daughter's political future."
    ],
    "right": [
      "Thaksin Shinawatra was acquitted of royal defamation charges by the Criminal Court, as confirmed by his lawyer, but no reason was provided for the dismissal.",
      "This ruling marks a significant moment for the Shinawatra family, who have faced declining popularity in Thai politics after two decades of influence.",
      "Prosecutions under Thailand's lese-majeste law have sharply increased since 2020, with rights groups stating that over 280 individuals have been prosecuted for violating this law in the last five years.",
      "The case stems from Thaksin's 2015 comments during an interview with foreign media while in exile."
    ]
  },
  "sources": [
    {
      "news_title": "Former Thai Prime Minister Cleared of Insulting Thailand’s Former King",
      "news_link": "https://www.theepochtimes.com/world/former-thai-prime-minister-cleared-of-insulting-thailands-former-king-5904714",
      "bias": "Lean Right",
      "text": "Former Thai Prime Minister Thaksin Shinawatra was acquitted of defaming the country’s former king in an interview in 2015, by a court in Bangkok on Friday.\nShinawatra, 76, and his aides wore yellow ties—a color associated with the former king, Bhumibol Adulyadej, and the monarchy in general—at the hearing at the Bangkok Criminal Court, and afterward, he left without responding to questions from journalists."
    },
    {
      "news_title": "Former Thai leader Thaksin Shinawatra acquitted of insulting the monarchy",
      "news_link": "https://www.upi.com/Top_News/World-News/2025/08/22/Thailand-Thaksin-Shinawatra-charge-royal-defamation-dismissed-former-prime-minister/2661755865291/",
      "bias": "Center",
      "text": "Aug. 22 (UPI) -- Former Thai Prime Minister Thaksin Shinawatra avoided a likely prison term Friday after his royal defamation case was dismissed.\nShinawatra was indicted last year on charges he defied the country's lese majeste law, which prohibits anyone from insulting the Thai monarchy.\nHe was accused by a general from the military regime that took power in 2014, in a coup that deposed the prime minister at that time, his sister Yingluck Shinawatra.\nShinawatra allegedly disrespected the monarchy in an interview he gave in 2015 to a South Korean newspaper in which he said people connected to the \"palace\" helped overthrow Yingluck.\nRelated\nShinawatra was living in Dubai at the time in a self-imposed exile, and out of reach for prosecution. The 76-year-old could have seen as many as 15 years in prison if found guilty.\nThe charges against Shinawatra, who was elected prime minister in 2001 but removed himself in a 2006 coup, were widely believed to be politicized due to his hold on power despite being absent.\nEven while he remained outside Thailand's borders, political parties tied to Shinawatra won national elections until 2023.\nIt was then he returned and was indicted over the defamation charges in June of 2024. He was also charged with violating Thailand's Computer Crime Act because the interview in question ran online, but that was also dismissed Friday.\nAcquittals in Thai lese majeste cases are rare, as 87% lead to convictions.\nShinawatra will next face a judge in September, as he was hospitalized upon returning to Thailand and is accused of using that stay to avoid being imprisoned."
    },
    {
      "news_title": "Thai court acquits former PM Thaksin of royal insult",
      "news_link": "https://www.chinadaily.com.cn/a/202508/22/WS68a823c1a310851ffdb4f9ce.html",
      "bias": "Lean Left",
      "text": "Thai court acquits former PM Thaksin of royal insult\nBANGKOK - Thailand's criminal court on Friday acquitted former prime minister Thaksin Shinawatra on royal defamation charges over his remarks to foreign media a decade ago.\nThaksin has been found not guilty due to insufficient evidence to prove his wrongdoing, the court said in a statement.\n\"The case was dismissed,\" Thaksin said to reporters upon leaving the courthouse.\nThe prosecution's evidence presented failed to meet the burden of proof required for the indictment, said Thaksin's lawyer Winyat Chatmontree.\nThaksin thanked his legal team after the verdict was read out, stating that he could now fully dedicate himself to working for the nation's benefit, Winyat told reporters following the ruling.\nThe Office of the Attorney General indicted Thaksin last year, accusing him of defaming the monarchy during a 2015 interview with a South Korean media outlet, which violated lese majeste and computer crime laws.\nThe lese-majeste law, or Section 112 of the Criminal Code, stipulates that whoever defames, insults, or threatens the king, queen, heir apparent, or regent shall be punished with imprisonment of three to 15 years.\nIn a separate case, the Supreme Court is scheduled to rule in September on whether Thaksin's extended hospital stay prior to his release on parole in 2024 constitutes an incomplete serving of his prison term for previous convictions.\nThe 76-year-old returned to Thailand from self-exile two years ago. He served as the Southeast Asian country's prime minister from 2001 to 2006 and had been in self-exile abroad since 2008."
    },
    {
      "news_title": "Thaksin cleared of royal insult charges, but Thai politics remain tense",
      "news_link": "https://www.scmp.com/news/asia/southeast-asia/article/3322797/thai-ex-pm-thaksin-cleared-royal-insult-charges-political-dynastys-future-uncertain",
      "bias": "Center",
      "text": "Advertisement\nThai ex-PM Thaksin cleared of royal insult charges, but political dynasty’s future uncertain\nThe acquittal offers relief, but uncertainty surrounds Thaksin’s political dynasty as his daughter, Paetongtarn, faces legal challenges\nReading Time:3 minutes\nWhy you can trust SCMP\nFormer Thai prime minister Thaksin Shinawatra was cleared on Friday of royal defamation charges, relieving one of the threats to his embattled dynasty, which has dominated Thai politics for two decades.\nAdvertisement\nThaksin’s family has long jousted with the nation’s pro-military, pro-monarchy elite, who view their populist movement as a threat to Thailand’s traditional social order.\nTheir tenure as a defining force in Thai politics has unfolded in a saga of coups, street protests and court cases as they have grappled for the kingdom’s levers of power.\nThe 76-year-old Thaksin had faced up to 15 years in prison under laws criminalising criticism of King Maha Vajiralongkorn and his family, but was cleared after a trial that unfolded over two months.\n“The court dismissed the charges against Thaksin, ruling that the evidence presented was insufficient,” his lawyer Winyat Chatmontree told reporters at Thailand’s Criminal Court in Bangkok.\nBut his dynasty remains on the ropes, with his daughter Paetongtarn Shinawatra currently suspended as prime minister and facing her own reckoning next week, with a court decision due that could see her thrown out of office.\nAdvertisement\nSelect Voice\nChoose your listening speed\nGet through articles 2x faster\n1.25x\n250 WPM\nSlow\nAverage\nFast\n1.25x"
    },
    {
      "news_title": "Thailand: Former PM Thaksin Shinawatra acquitted of royal defamation charges",
      "news_link": "https://www.lemonde.fr/en/asia-and-pacific/article/2025/08/22/thailand-former-pm-thaksin-shinawatra-acquitted-of-royal-defamation-charges_6744606_153.html",
      "bias": "Lean Left",
      "text": "Thailand's former prime minister Thaksin Shinawatra was cleared on Friday, August 22, of royal defamation charges, relieving one of the threats to his embattled dynasty, which has dominated Thai politics for two decades. Thaksin's family has long jousted with the nation's pro-military, pro-monarchy elite who view their populist movement as a threat to Thailand's traditional social order. Their tenure as a defining force in Thai politics has unfolded in a saga of coups, street protests and court cases as they have grappled for the kingdom's levers of power.\nThe 76-year-old Thaksin had faced up to 15 years in prison under laws criminalizing criticism of King Maha Vajiralongkorn and his family, but was cleared after a trial that unfolded over two months. \"The court dismissed the charges against Thaksin, ruling that the evidence presented was insufficient,\" his lawyer Winyat Chatmontree told reporters at Thailand's Criminal Court in Bangkok.\nBut his dynasty remains on the ropes, with his daughter Paetongtarn Shinawatra currently suspended as prime minister and facing her own reckoning next week with a court decision due, which could see her thrown out of office. Thaksin left court ahead of his lawyer, smiling and telling the press his case was \"dismissed\" without providing any further comment.\n\"The court has done its job properly, but I don't think we can relax yet,\" said 66-year-old food vendor Kamol Orahanta, among around 150 Thaksin supporters gathered outside the court. \"I believe there are still some haters who will try to topple him by other means,\" he told Agence France-Presse (AFP).\nThe case stemmed from decade-old remarks Thaksin made in South Korean media relating to the 2014 military coup that overthrew his sister Yingluck. Even after he has been cleared, AFP is not able to report the comments in detail because the lese-majeste law is so strict that doing so could in itself trigger criminal charges.\nYears of tussle\nTwice elected prime minister in the early 2000s, Thaksin fled Thailand and lived in self-imposed exile for 15 years after being ousted in a military coup, finally returning to the kingdom in August 2023. He landed in Bangkok on the same day his family's Pheu Thai party took office at the head of a coalition government backed by their conservative former enemies, fuelling suspicions a backroom deal had been struck. On arrival, Thaksin was immediately sentenced to eight years in prison on graft and abuse of power charges dating back to his time in office.\nBut instead of going to jail, he was whisked to a private room at a police hospital because of health problems. Days later, the king cut his sentence to one year, and in February 2024, he was freed as part of an early release scheme for elderly prisoners. His handling has led to another legal case, set to conclude on September 9, arguing that because he never served time in a jail cell, he was not eligible for early release.\nProsecutions for lese-majeste, known as 112 in Thailand for its section in the criminal code, have increased sharply since anti-government protests in 2020, some of which openly criticised the monarchy. Thai Lawyers for Human Rights, a group providing legal services in many of the cases, says that more than 280 people have been prosecuted under section 112 in the last five years.\nThe law says anyone who \"defames, insults or threatens\" the king, queen, heir or regent can face up to 15 years in prison. Rights groups and critics say the law is now interpreted so broadly as to stifle dissent and legitimate debate."
    },
    {
      "news_title": "Thai court acquits ex-Prime Minister Thaksin Shinawatra of royal defamation charge",
      "news_link": "https://www.npr.org/2025/08/22/nx-s1-5511111/thailand-thaksin-court-acquits-royal-defamation",
      "bias": "Lean Left",
      "text": "Thai court acquits ex-Prime Minister Thaksin Shinawatra of royal defamation charge\nBANGKOK — Thailand's former Prime Minister Thaksin Shinawatra was acquitted of a royal defamation charge by a court on Friday, in a case that could have sent him to prison for up to 15 years.\nThe 76-year-old Thaksin, smiling as he walked away from the courtroom, was the first to reveal the verdict, responding to journalists' questions with the single word: \"Dismissal.\"\nHis lawyer, Winyat Chatmontree, also confirmed the acquittal verdict, as did the Bangkok Criminal Court later in a news release.\nThe law on defaming the monarchy, an offense known as lese majeste, is punishable by three to 15 years in prison. It is among the harshest such laws globally and increasingly has been used in Thailand to punish government critics.\nThe legal aid group Thai Lawyers for Human Rights has said that since early 2020, more than 270 people — many of them student activists — have been charged with violating the law.\nThe court's news release said it had found the witnesses and evidence were too weak to support conviction.\nThaksin was originally charged in 2016 over remarks he made a year earlier to journalists in South Korea. The case was not pursued at that time because he was in exile and the necessary legal procedures could not be completed.\nThe news release said the court determined that the account of the interview presented by the prosecution was incomplete and lacked context, and a key point did not clearly refer specifically to then-King Bhumibol Adulyadej.\nIt also said the court thought that witnesses in the case against Thaksin might have been motivated by political bias, because they have participated in political protests against him, leaving open the possibility they may have unfairly interpreted his words.\nThaksin's opponents, who were generally staunch royalists, accused him of corruption, abuse of power and disrespecting then-King Bhumibol, who died in 2016. Thaksin has always asserted that the cases against him were politically motivated.\nWhen he was indicted last year, Thaksin's freedom on bail was approved with the condition that he could not travel out of Thailand unless approved by court. His passport was confiscated.\nDespite facing various prosecutions since leaving office, Thaksin has spent no time in prison. He was abroad in 2006 when a military coupousted him. He briefly returned in 2008, only to return quickly to exile to avoid a possible prison term.\nHe returned to Thailand in 2023 when the Pheu Thai political party that he is closely associated with came to power. He was sent to serve an eight-year prison term on charges related to corruption and abuse of power but was transferred immediately to a hospital on medical grounds. After six months in a hospital suite, he was granted a pardon and parole and set free.\nThe decision to send him to a hospital instead of prison was widely questioned as to whether he was granted a special, undeserved privilege. The Supreme Court's Criminal Division for Political Office Holders will rule next month in another case that puts him in jeopardy of imprisonment.\nSince his return, Thaksin has maintained a high profile, traveling the country making public appearances and political observations that could upset the powerful conservative establishment that was behind his 2006 ouster.\nHis daughter, Paetongtarn Shinawatra, who became prime minister last year, is also in hot water. She stands accused of failing to handle in an ethical manner a June 15 call with Cambodian Senate President Hun Senin which they discussed tensions over territory claimed by both nations. The Constitutional Court suspended her from her duties on July 1 and next week will rule whether she will lose her prime minister position for breaching ethics laws.\nThais have long been accustomed to sudden changes of government due to military coups, numbering more than a dozen since the 1930s. But in the past two decades, they have increasingly seen such changes imposed by the courts, which have ousted four prime ministers and dissolved three election-winning political parties, often on narrow technical grounds.\nIn most cases, the targets were viewed as challengers to the traditional royalist establishment, whose most powerful defenders are the army and the courts."
    },
    {
      "news_title": "Bangkok court acquits Thaksin in lese-majeste case, but Shinawatra dynasty still under fire as daughter’s fate looms",
      "news_link": "https://www.malaymail.com/news/world/2025/08/22/bangkok-court-acquits-thaksin-in-lese-majeste-case-but-shinawatra-dynasty-still-under-fire-as-daughters-fate-looms/188542",
      "bias": "Lean Right",
      "text": "BANGKOK, Aug 22 — Thailand’s former prime minister Thaksin Shinawatra was cleared Friday of royal defamation charges, relieving a threat to his embattled political dynasty which has dominated Thai politics for two decades.\nThe 76-year-old had faced up to 15 years in prison, but a Bangkok court found him not guilty of breaching the kingdom’s strict lese-majeste laws criminalising criticism of King Maha Vajiralongkorn and his family.\n“The court dismissed the charges against Thaksin, ruling that the evidence presented was insufficient,” his lawyer Winyat Chatmontree told reporters.\nThaksin left court ahead of his lawyer, smiling and telling the press the case was “dismissed”, without making any further comment.\nBut his dynasty remains on the ropes, with his daughter Prime Minister Paetongtarn Shinawatra facing her own reckoning next week with a court decision due which may see her thrown out of office.\nThaksin’s royal insult case stemmed from decade-old remarks he made in South Korean media relating to the 2014 military coup that overthrew his sister Yingluck.\nAFP is not able to report the comments in detail because the lese-majeste law is so strict that doing so could in itself trigger criminal charges.\nYears of tussle\nThailand has been roiled by a succession of coups, street protests and court orders as Thaksin and his followers tussled for power with the traditional pro-royalist, pro-military elite that sees him as corrupt, nepotistic and a threat to the traditional social order.\nTwice elected prime minister in the early 2000s, Thaksin fled Thailand and lived in self-imposed exile for 15 years after he was ousted in a military coup, finally returning to the kingdom in August 2023.\nHe landed in Bangkok on the same day his family’s Pheu Thai party took office at the head of a coalition government backed by their conservative former enemies, fuelling suspicions a backroom deal had been struck.\nOn arrival, Thaksin was immediately sentenced to eight years in prison on graft and abuse of power charges dating back to his time in office.\nBut instead of going to jail, he was whisked to a private room at a police hospital because of health problems.\nDays later, the king cut his sentence to one year, and in February 2024, he was freed as part of an early release scheme for elderly prisoners.\nHis handling has led to another legal case, set to conclude on September 9, arguing that because he never served time in a jail cell, he was not eligible for early release.\nProsecutions for lese-majeste, known as 112 in Thailand for its section in the criminal code, have increased sharply since anti-government protests in 2020, some of which openly criticised the monarchy.\nThai Lawyers for Human Rights, a group providing legal services in many of the cases, says that more than 280 people have been prosecuted under section 112 in the last five years.\nThe law says anyone who “defames, insults or threatens” the king, queen, heir or regent can face up to 15 years in prison.\nRights groups and critics say the law is now interpreted so broadly as to stifle dissent and legitimate debate. — AFP"
    },
    {
      "news_title": "Thai ex-PM Thaksin Shinawatra says his royal insult case has been dismissed",
      "news_link": "https://www.investing.com/news/world-news/thai-court-to-deliver-ruling-in-expm-thaksin-shinawatras-royal-insult-case-4205832",
      "bias": "Center",
      "text": null
    },
    {
      "news_title": "Thai court confirms Thaksin's royal insult case dismissed due to insufficient evidence",
      "news_link": "https://www.reuters.com/world/asia-pacific/thai-court-confirms-thaksins-royal-insult-case-dismissed-due-insufficient-2025-08-22/",
      "bias": "Center",
      "text": null
    },
    {
      "news_title": "Former Thai Prime Minister Thaksin Shinawatra says he has been acquitted of royal defamation",
      "news_link": "https://apnews.com/article/thaksin-shinawatra-thailand-royal-defamation-1a83b8ad795eaf58eee72afe69f6641d",
      "bias": "Lean Left",
      "text": "Thai court acquits former Prime Minister Thaksin Shinawatra of royal defamation charge\nThai court acquits former Prime Minister Thaksin Shinawatra of royal defamation charge\nBANGKOK (AP) — Thailand’s former Prime Minister Thaksin Shinawatra was acquitted of a royal defamation charge by a court on Friday, in a case that could have sent him to prison for up to 15 years.\nThe 76-year-old Thaksin, smiling as he walked away from the courtroom, was the first to reveal the verdict, responding to journalists’ questions with the single word: “Dismissal.”\nHis lawyer, Winyat Chatmontree, also confirmed the acquittal verdict, as did the Bangkok Criminal Court later in a news release.\nThe law on defaming the monarchy, an offense known as lese majeste, is punishable by three to 15 years in prison. It is among the harshest such laws globally and increasingly has been used in Thailand to punish government critics.\nThe legal aid group Thai Lawyers for Human Rights has said that since early 2020, more than 270 people — many of them student activists — have been charged with violating the law.\nThe court’s news release said it had found the witnesses and evidence were too weak to support conviction.\nThaksin was originally charged in 2016 over remarks he made a year earlier to journalists in South Korea. The case was not pursued at that time because he was in exile and the necessary legal procedures could not be completed.\nThe news release said the court determined that the account of the interview presented by the prosecution was incomplete and lacked context, and a key point did not clearly refer specifically to then-King Bhumibol Adulyadej.\nIt also said the court thought that witnesses in the case against Thaksin might have been motivated by political bias, because they have participated in political protests against him, leaving open the possibility they may have unfairly interpreted his words.\nThaksin’s opponents, who were generally staunch royalists, accused him of corruption, abuse of power and disrespecting then-King Bhumibol, who died in 2016. Thaksin has always asserted that the cases against him were politically motivated.\nWhen he was indicted last year, Thaksin’s freedom on bail was approved with the condition that he could not travel out of Thailand unless approved by court. His passport was confiscated.\nDespite facing various prosecutions since leaving office, Thaksin has spent no time in prison. He was abroad in 2006 when a military coup ousted him. He briefly returned in 2008, only to return quickly to exile to avoid a possible prison term.\nHe r eturned to Thailand in 2023 when the Pheu Thai political party that he is closely associated with came to power. He was sent to serve an eight-year prison term on charges related to corruption and abuse of power but was transferred immediately to a hospital on medical grounds. After six months in a hospital suite, he was granted a pardon and parole and set free.\nThe decision to send him to a hospital instead of prison was widely questioned as to whether he was granted a special, undeserved privilege. The Supreme Court’s Criminal Division for Political Office Holders will rule next month in another case that puts him in jeopardy of imprisonment.\nSince his return, Thaksin has maintained a high profile, traveling the country making public appearances and political observations that could upset the powerful conservative establishment that was behind his 2006 ouster.\nHis daughter, Paetongtarn Shinawatra, who became prime minister last year, is also in hot water. She stands accused of failing to handle in an ethical manner a June 15 call with Cambodian Senate President Hun Sen in which they discussed tensions over territory claimed by both nations. The Constitutional Court suspended her from her duties on July 1 and next week will rule whether she will lose her prime minister position for breaching ethics laws.\nThais have long been accustomed to sudden changes of government due to military coups, numbering more than a dozen since the 1930s. But in the past two decades, they have increasingly seen such changes imposed by the courts, which have ousted four prime ministers and dissolved three election-winning political parties, often on narrow technical grounds.\nIn most cases, the targets were viewed as challengers to the traditional royalist establishment, whose most powerful defenders are the army and the courts."
    },
    {
      "news_title": "Thailand: Court acquits Thaksin Shinawatra in royal insult case",
      "news_link": "https://www.bbc.com/news/articles/ckgyx62gk5wo",
      "bias": "Center",
      "text": "Former Thai PM Thaksin acquitted in royal insult case\nA Bangkok court has acquitted controversial billionaire and former Thai prime minister Thaksin Shinawatra, who was accused of insulting the monarchy.\nThe charge related to an interview he gave to a South Korean newspaper ten years ago. He would have faced up to 15 years in jail if convicted.\nThailand's lese majeste law forbids insulting its monarchy. But critics say it is often used to target activists and political opponents.\nThe verdict came as Thaksin's daughter, suspended PM Paetongtarn , faces a Constitutional Court decision on whether or not she should be removed from office. These cases pose a threat to the Shinawatra clan, which has been a dominant force in Thai politics for decades.\nFriday's verdict has brought some relief to the family and their supporters.\nWinyat Charmontree, a lawyer acting for Thaksin, told reporters that after the verdict was read out in court, his client had smiled and thanked his lawyers. He had also said he was now able to work for the country's benefit.\nThe charge against Thaksin was originally filed under the then-military government in 2016, when he was in exile, and re-activated last year after his return to Thailand.\nAt first glance the case against him seemed weak.\nIn the South Korean newspaper interview, the former prime minister said he believed the 2014 military coup which deposed the elected government of his sister Yingluck - just as he had been deposed by a previous coup in 2006 - had been instigated by \"some people in the palace\" and members of the privy council, the 19-member body which advises the Thai king.\nTechnically the privy council is not covered by the lese majeste law, which states that it is an offence to defame only the king, queen, heir to the throne or anyone acting as regent.\nHowever, in recent years the law has been invoked to criminalise any action or statement which might reflect negatively on the monarchy as an institution.\nIn the past people have been prosecuted for making unfavourable comments about the late King Bhumibol's dog and about a Thai king from the 16th Century.\nMore recently, a young woman was sentenced to five years in prison for placing a banner criticising the budget to help those affected by Covid close to a portrait of King Vajiralongkorn.\nThe interpretation of the law has become so broad that human rights groups view it as a political tool, which can be used to intimidate and silence those who challenge the status quo.\nMany believed this was what was happening to Thaksin.\nHowever, the judges chose to interpret the wording of the law literally, and said that as the defendant had not named names, he should be acquitted.\nThis verdict comes exactly two years after the former prime minister's dramatic return from 15 years of exile.\nAt the time it was assumed there had been a grand bargain struck between Thaksin and his long-time conservative adversaries, so that his party Pheu Thai, which in the 2023 election had been relegated to second place from its usual number one spot, could form a coalition government and keep the young reformists who had actually won the election out of power.\nThe terms of that bargain have never been made public –Thaksin has always insisted there was no deal - but it is likely they included an agreement that he would keep a low profile and stay out of politics.\nBut a low profile is something completely alien to the flamboyant, wealthy and ambitious tycoon.\nHe is still believed to be the largest funder of Pheu Thai and makes all of the main decisions for the party.\nWhen his first choice of prime minister, businessman Srettha Thavisin, was disqualified by the persistently interventionist Constitutional Court a year ago, Thaksin's inexperienced daughter Paetongtarn Shinawatra took the helm, becoming Thailand's youngest ever prime minister.\nA self-described \"daddy's girl\", she said she would happily take his advice. As she took office Mr Thaksin announced his \"Vision for Thailand\", including a controversial proposal to legalise casinos; much of that subsequently became official policy.\nThe parliamentary opposition has accused the Shinawatra family of running a \"dual leadership\". Thaksin's business ties to the Cambodian strongman Hun Sen also raised concerns over how firmly his government would defend Thailand over the border dispute between the two countries.\nThis came to a head in the private phone conversation leaked by Hun Sen in which Paetongtarn was heard referring to him as \"uncle\", and criticising her own army commander on the border, for which she has now been suspended by the Constitutional Court, which will decide whether she is dismissed in a week's time.\nLosing another prime minister after just a year, at a time of great global uncertainty, might be judged as too risky. It is not clear who would replace Paetongtarn.\nThaksin faces another court case next month, over his transfer to a hospital to serve a previous jail sentence. The price for him being allowed to stay out of jail may be that his party has to call an early election, at a time when its poor performance in government could result in it losing many of its seats in parliament."
    },
    {
      "news_title": "Thailand: Former PM Thaksin cleared of lese majeste charges",
      "news_link": "https://www.dw.com/en/thailand-former-pm-thaksin-cleared-of-lese-majeste-charges/a-73726856",
      "bias": "Center",
      "text": "Thailand: Former PM Thaksin cleared of lese majeste charges\nAugust 22, 2025A Bangkok court on Friday cleared Thailand's former prime minister Thaksin Shinawatra of royal defamation charges that saw him facing jail time.\nThe 76-year-old faced up to 15 years in prison, but judges found him not guilty, easing a serious legal threat to his family's political movement.\nWhat were the charges against Thaksin?\nProsecutors accused Thaksin of breaching Thailand's lese majeste law, which criminalizes criticism of King Maha Vajiralongkorn and his family.\nThe law, among the world's harshest, carries penalties of three to 15 years in prison for each offense. The charges stemmed from remarks made in a 2015 interview with South Korean media.\nHe had commented on the 2014 coup that removed his sister Yingluck Shinawatra from power. Prosecutors argued that the remarks amounted to defamation of the monarchy.\nThaksin's legal team rejected the allegations, saying his comments had been misinterpreted. The Bangkok Criminal Court ruled that the evidence was insufficient to convict.\nWhy does the verdict matter?\nThe ruling is considered unusual, as acquittals in lese majeste cases are rare in Thailand. Prosecutors have not yet said whether they will appeal.\nThaksin appeared briefly outside the court after the ruling, smiling and telling reporters the case was \"dismissed\" but offered no further comment.\nThe verdict relieves one of the most serious legal threats facing Thaksin, who remains a central figure in Thai politics. His political dynasty has shaped Thailand's modern political landscape for more than 20 years.\nThaksin's daughter Paetongtarn Shinawatra, who leads the Pheu Thai party, became prime minister last year.\nHowever, the Shinawatras' political star has since waned, with opinion polls showing declining public support.\nWhat is Thailand's lese majeste law?\nThe country's lese majeste law is contained in Section 112 of Thailand's Criminal Code.\nThe provision makes it a crime to defame, insult or threaten the king, queen, heir-apparent or regent. The law prescribes prison terms of three to 15 years for each offense.\nUnlike in many countries, even indirect criticism of the monarchy can trigger charges. Courts often apply the law strictly, leading to long sentences. Human rights groups have long criticized its broad application and lengthy prison tariffs.\nEdited by Louis Oelofse"
    },
    {
      "news_title": "Thai Court Clears Thaksin Shinawatra of Royal Insult Charges",
      "news_link": "https://www.devdiscourse.com/article/law-order/3560021-thai-court-clears-thaksin-shinawatra-of-royal-insult-charges",
      "bias": "Center",
      "text": null
    },
    {
      "news_title": "Thai ex-PM Thaksin acquitted of royal insult charges",
      "news_link": "https://www.arabnews.com/node/2612626/world",
      "bias": "Lean Right",
      "text": "WASHINGTON: Empathy is usually regarded as a virtue, a key to human decency and kindness. And yet, with increasing momentum, voices on the Christian right are preaching that it has become a vice.\nFor them, empathy is a cudgel for the left: It can manipulate caring people into accepting all manner of sins according to a conservative Christian perspective, including abortion access, LGBTQ+ rights, illegal immigration and certain views on social and racial justice.\n“Empathy becomes toxic when it encourages you to affirm sin, validate lies or support destructive policies,” said Allie Beth Stuckey, author of “Toxic Empathy: How Progressives Exploit Christian Compassion.”\nStuckey, host of the popular podcast “Relatable,” is one of two evangelicals who published books within the past year making Christian arguments against some forms of empathy.\nThe other is Joe Rigney, a professor and pastor who wrote “The Sin of Empathy: Compassion and its Counterfeits.” It was published by Canon Press, an affiliate of Rigney’s conservative denomination, which counts Defense Secretary Pete Hegseth among its members.\nThese anti-empathy arguments gained traction in the early months of President Donald Trump’s second term, with his flurry of executive orders that critics denounced as lacking empathy.\nAs foreign aid stopped and more deportations began, Trump’s then-adviser Elon Musk told podcaster Joe Rogan: “The fundamental weakness of Western civilization is empathy.”\nEven Vice President JD Vance, a Catholic convert, framed the idea in his own religious terms, invoking the concept of ordo amoris, or order of love. Within concentric circles of importance, he argued the immediate family comes first and the wider world last — an interpretation that then-Pope Francis rejected.\nWhile their anti-empathy arguments have differences, Stuckey and Rigney have audiences that are firmly among Trump’s Christian base.\n“Could someone use my arguments to justify callous indifference to human suffering? Of course,” Rigney said, countering that he still supports measured Christ-like compassion. “I think I’ve put enough qualifications.”\nHistorian Susan Lanzoni traced a century of empathy’s uses and definitions in her 2018 book “Empathy: A History.” Though it’s had its critics, she has never seen the aspirational term so derided as it is now.\nIt’s been particularly jarring to watch Christians take down empathy, said Lanzoni, a graduate of Harvard Divinity School.\n“That’s the whole message of Jesus, right?”\nArguing empathy can be good — and bad\nThe word empathy appeared in English for the first time in 1908, taken from a German word, meaning “in-feeling.”\nThough the word is relatively new to English, the impulse behind it — to feel for or with another — is much older. It forms a core precept across many religions. “Do unto others as you would have them do unto you,” reads a common version of the Golden Rule.\nStuckey admits Jesus is an empathetic figure. In her book, the Southern Baptist from Texas writes, “In a way, Jesus embodied empathy when he took on flesh, suffered the human experience, and bore the burden of our sins by enduring a gruesome death.”\nShe’s clear that empathy can be good. But she writes it has been co-opted “to convince people that the progressive position is exclusively the one of kindness and morality.”\n“If you really care about women, you’ll support their right to choose,” she writes of this progressive line of thinking. “If you really respect people, you’ll use preferred pronouns. … If you’re really compassionate, you’ll welcome the immigrant.”\nRigney doesn’t think empathy is inherently wrong, either. He finds fault with excessive or “untethered empathy” that’s not tied to conservative biblical interpretations.\nHe has been talking publicly about these ideas since at least 2018, when he discussed the sin of empathy on camera with conservative Pastor Doug Wilson. Since 2023, Rigney has worked at Wilson’s Idaho church and seminary, affiliated with the Communion of Reformed Evangelical Churches.\nRigney said initially he experienced pushback from “certain corners of evangelicalism, that at the time were very dialed into questions of the #MeToo movement and abuse or critical race theory, social justice kind of stuff.”\nThis debate over empathy often devolves into arguments over word choices or semantics. Rigney prefers older terms like compassion, sympathy or even pity.\nThe Rev. Albert Mohler leads the flagship seminary of the Southern Baptist Convention, the largest US Protestant denomination. He featured Rigney and Stuckey on his podcast this year and agrees with their empathy critiques.\nMohler prefers the word sympathy over empathy.\n“There’s no market so far as I know for empathy cards,” he said. “There is a long-standing market for sympathy cards.”\nThe role of race and gender in anti-empathy arguments\nIn 2014, Mohler did encourage his audience to have empathy. His words came after a white police officer killed Michael Brown, a Black teenager in Ferguson, Missouri.\n“I look back at that statement now, and I would say it’s nowhere near as morally significant as I intended it to be at the time,” Mohler said. Though expressing empathy for hurting people appeared to be “close to the right thing to do,” he sees it as less helpful now.\nStuckey traces her own anti-empathy awakening to the summer of 2020, when racial justice protests roiled the nation. She saw other Christians posting about racism out of an empathy she found misguided.\n“I reject the idea that America is a systemically racist country,” she said.\nWhen she said as much in the months after George Floyd’s murder, her audience grew.\nRigney echoes this critique of systemic racism but reserves most of his ire for feminism, which he blames for many of empathy’s ills. Because women are the more empathetic sex, he argues, they often take empathy too far.\nHe found an encapsulation of this theory at Trump’s inaugural prayer service, where a woman preached from the pulpit. During a sermon that went viral, Episcopal Bishop Mariann Budde pleaded with the Republican president to “have mercy” on immigrants and LGBTQ+ people, prompting a conservative backlash.\n“Budde’s attempt to ‘speak truth to power’ is a reminder that feminism is a cancer that enables the politics of empathetic manipulation,” Rigney wrote for the evangelical World magazine.\nProgressive Christian leaders respond\n“Empathy is not toxic. Nor is it a sin,” said the Rev. Canon Dana Colley Corsello in a sermon at Washington National Cathedral, two months after Budde’s plea from that sanctuary.\n“The arguments about toxic empathy are finding open ears because far-right-wing, white evangelicals are looking for a moral framework around which they can justify President Trump’s executive orders and policies,” Corsello preached.\n“Empathy is at the heart of Jesus’ life and ministry,” Corsello wrote in a recent email exchange about the sermon.\nShe added, “It’s so troubling that this is even up for debate.”\nIn New York, the Rev. Micah Bucey first noticed Christian anti-empathy messages after Budde’s sermon. In response, he proposed changing the outdoor sign at Judson Memorial Church, the historic congregation he serves in Manhattan.\n“If empathy is a sin, sin boldly,” he proposed it say, a catchphrase that borrows its last clause from the Protestant reformer Martin Luther.\nA photo of the resulting church sign was shared thousands of times on social media.\n“Our entire spirituality and theology at Judson are built around curiosity and empathy,” Bucey said. “We’ve always considered that our superpower.”"
    },
    {
      "news_title": "Former Thai prime minister Thaksin Shinawatra cleared of royal insult charges",
      "news_link": "https://www.abc.net.au/news/2025-08-22/former-thai-pm-thaksin-shinawatra-verdict-cleared-royal-insult/105685474",
      "bias": "Lean Left",
      "text": "Former Thai leader Thaksin Shinawatra cleared of royal insult charges as his PM daughter awaits her fate\nBillionaire and former Thai prime minister Thaksin Shinawatra has been cleared of charges of violating the country's strict law on royal insults.\n\"The case was dismissed,\" Thaksin told reporters with a smile as he left the court house.\nBangkok's criminal court said the evidence was not sufficient to show Thaksin was guilty of the charges, which stemmed from a 2015 interview.\nThaksin, who had denied wrongdoing, appeared at the court with a yellow necktie — the colour associated with Thailand's monarchy.\nHe has repeatedly pledged allegiance to the king, who is enshrined in the Thai constitution as being in a position of \"revered worship\", with the palace seen by royalists as sacrosanct.\nThaksin's case was the highest-profile among more than 280 prosecutions in recent years under the controversial lèse-majesté law, which activists say has been abused by conservatives to silence dissent and sideline political rivals.\nRoyalists say the law is necessary to protect the crown.\nThose convicted under the law face up to 15 years in jail.\nThaksin was deposed in a military coup in 2006, but has remained politically active.\nThe 76-year-old tycoon is widely seen as the power behind the ruling Pheu Thai party, which is losing popularity and hanging on by a thread over the conflict with neighbouring Cambodia and a stuttering economy.\nThaksin returned to Thailand in 2023 after 15 years abroad in self-imposed exile to serve an eight-year sentence for abuse of power and conflicts of interest, which was reduced to one year by King Maha Vajiralongkorn.\nHe did not spend a single night in jail, however, and was transferred to the luxury wing of a police hospital on medical grounds, where he remained for six months before being released on parole.\nPolitical dynasty before the courts\nFriday's ruling was the first in a series of high-stakes court actions involving the powerful Shinawatra dynasty.\nThaksin's daughter Paetongtarn Shinawatra has been suspended from duty as Prime Minister.\nNext week, the Constitutional Court is expected to rule on whether she will be dismissed from office for an alleged violation of ethics over a leaked telephone conversation with Cambodia's former leader Hun Sen, in what she said was an attempt to defuse a diplomatic crisis that later spiralled into five days of armed conflict.\nThaksin also faces another key legal test next month.\nThe Supreme Court is due to decide whether his six-month stint in hospital detention prior to his release on parole in 2024 should count as time served in a jail term for abuse of power and conflicts of interest.\nHe could potentially be made to serve the time in prison.\nABC/Reuters"
    },
    {
      "news_title": "Court clears Thailand’s ex-PM Thaksin Shinawatra in royal insult case",
      "news_link": "https://www.aljazeera.com/news/2025/8/22/court-clears-thailands-ex-pm-thaksin-shinawatra-over-royal-insult-case",
      "bias": "Lean Left",
      "text": "Court clears Thailand’s ex-PM Thaksin Shinawatra in royal insult case\nRetired politician and billionaire businessman was accused of violating Thailand’s strict laws on insults to Thai royalty.\nA court in Thailand has dismissed a high-profile case against the country’s former Prime Minister Thaksin Shinawatra over allegations he violated the country’s strict laws on royal defamation, the billionaire and his lawyer said.\n“The case was dismissed,” Thaksin, 76, told reporters with a smile as he left the court following the verdict on Friday.\nRecommended Stories\nlist of 3 itemsWhat we know about clashes on the Thai-Cambodian border\nThai ex-PM Thaksin could face 15 years in prison in royal defamation case\n“The court dismissed the charges against Thaksin, ruling that the evidence presented was insufficient,” his lawyer Winyat Chatmontree said.\nThe criminal court in Bangkok later confirmed it had dismissed the case due to a lack of evidence.\nOutside the court, Thaksin’s supporters erupted in cheers after hearing the verdict. Many wore red shirts, the campaign colour of the political party founded by Thaksin.\n“The court has done its job properly, but I don’t think we can relax yet,” said 66-year-old food vendor Kamol Orahanta, who was among some 150 supporters gathered outside the court.\n“I believe there are still some haters who will try to topple him by other means,” Kamol told the AFP news agency.\nIn an interview with reporters, Thailand’s interim Prime Minister Phumtham Wechayachai welcomed the court’s decision but said it will have no political impact, as it was an independent judicial process.\nPhumtham said his ruling Pheu Thai Party, which was founded by Thaksin, continues to have “high morale” despite the legal hurdles faced by the Shinawatra family.\nWhile the court dismissal on Friday will be a relief for Thaksin, the Shinawatra family’s political dynasty remains on the ropes, with Thaksin’s daughter and Thailand’s current Prime Minister, Paetongtarn Shinawatra, facing her own legal reckoning next week with a court decision due that may see her thrown out of office.\nPaetongtarn, 39, was suspended as prime minister and faces the prospect of dismissal from her position by the constitutional court for an alleged violation of ethics over a telephone conversation with Cambodia’s former leader Hun Sen, which was leaked by the former Cambodian premier to embarrass the Thai leader.\nThaksin also faces another key legal test in September, when the Supreme Court will decide whether his six-month stint in hospital detention prior to his release on parole in 2024 – over abuse of power and conflict of interest charges while in office – should count as time served in jail.\nIf the case goes against him, Thaksin could potentially be made to serve the time again in prison.\nThe defamation case, which was dismissed on Friday, had alleged that Thaksin violated Thailand’s strict lese-majeste law during a 2015 interview with foreign media when he commented on a 2014 military coup that overthrew his sister, Yingluck Shinawatra, as prime minister.\nThaksin had always denied wrongdoing and repeatedly pledged allegiance to the king, who is enshrined in the Thai constitution as being in a position of “revered worship”, with the palace viewing support for the monarchy as sacrosanct.\nThaksin’s case was the highest-profile among more than 280 prosecutions in recent years under the controversial lese-majeste laws, which activists say have been abused by conservatives to silence dissent and sideline political rivals.\nThailand’s royalists say such laws are necessary to protect the crown.\nThough retired from formal politics, Thaksin remains a major force in Thai public life even after spending 15 years in self-imposed exile before his return to the country in 2023."
    },
    {
      "news_title": "Thaksin says his royal insult case has been dismissed",
      "news_link": "https://www.bangkokpost.com/thailand/politics/3091197/thaksin-says-his-royal-insult-case-has-been-dismissed",
      "bias": "Lean Right",
      "text": "The Criminal Court on Friday dismissed a royal insult case against influential former premier Thaksin Shinawatra, the first in a series of high-stakes rulings involving the powerful Shinawatra dynasty.\n“The case was dismissed,” Thaksin told reporters with a smile as he left the courthouse in Bangkok.\nThe court said the case, brought by the military and stemming from an interview Thaksin gave to a South Korean media outlet in 2015, lacked sufficient evidence to prove he had insulted the monarchy, an offence punishable by up to 15 years in prison.\nThe court ruled that the video clip submitted as evidence contained only excerpts of the interview, with limited wording, while it believed the full interview had more content.\nSince the prosecution could not prove whether the clip had been edited or not, and because Thaksin’s statements were not specifically directed at the then-reigning King Bhumibol Adulyadej, the court extended the benefit of the doubt to Thaksin.\nThe court also observed that testimony given by some prosecution witnesses indicated that they had a political bias against the defendant.\nIn the interview, Thaksin made some critical remarks about what he saw as manoeuvring by certain forces that led to the downfall of the government led by his sister Yingluck in 2014.\n“Evidence from the plaintiff showed the interview by the defendant did not defame, insult or threaten the king, therefore the defendant is not guilty,” the court said.\nThaksin, who appeared at the court with a yellow necktie, the colour associated with the monarchy, had denied wrongdoing.\nHe has repeatedly pledged allegiance to the king, who is enshrined in the constitution as being in a position of “revered worship”, with the palace seen by royalists as sacrosanct.\nThe divisive billionaire remains a major force in Thai politics despite being retired and having previously spent 15 years in self-imposed exile before his return to the country in 2023.\nAlthough he has no official role in government, Thaksin remains politically active and is widely seen as the power behind the ruling Pheu Thai Party nominally led by his daughter Paetongtarn Shinawatra, which is losing popularity and hanging on by a thread over a conflict with Cambodia and a weak economy.\nThaksin’s case was the highest-profile among more than 280 prosecutions in recent years under Section 112 of the Criminal Code, which activists say has been weaponised by conservatives to silence dissent and sideline political rivals. Royalists say the law is necessary to protect the crown.\nMore rulings ahead\nThe judgement came a week ahead of another key ruling involving Ms Paetongtarn who has been in power for only a year. Ms Paetongtarn, 39, faces the prospect of dismissal by the Constitutional Court for an alleged violation of ethics over a leaked telephone conversation with Cambodia's former leader Hun Sen, in what she said was an attempt to defuse a diplomatic crisis that later spiralled into five days of armed conflict.\nThaksin also faces another key legal test in September, where the Supreme Court will decide whether his six-month stint in hospital detention prior to his release on parole in 2024 should count as time served in a jail term for abuse of power and conflicts of interest. He could potentially be made to serve the time in prison.\nSupporters outside the court expressed relief at Friday’s decision, saying Thaksin was committed to helping the people.\n“I’m glad,” said Khemanut Thauntong, 62. “He is a good and honest person who is loyal to the nation.”"
    },
    {
      "news_title": "Thai court dismisses royal insult case against ex-PM Thaksin",
      "news_link": "https://www.channelnewsasia.com/asia/thai-ex-pm-thaksin-verdict-lese-majeste-5308251",
      "bias": "Center",
      "text": "Thai court dismisses royal insult case against ex-PM Thaksin\nThe influential tycoon had denied wrongdoing in the case brought by the royalist military stemming from a 2015 media interview.\nBANGKOK: A Thai court has dismissed a royal insult case against former Prime Minister Thaksin Shinawatra, citing insufficient evidence to prove any wrongdoing.\nThe case stemmed from a 2015 media interview Thakisin gave during his long stint in self-imposed exile. It was brought by the country's royalist military that ousted both Thaksin and his sister Yingluck Shinawatra from power in coups in 2006 and 2014, respectively.\nThaksin, 76, had faced a jail term of up to 15 years over accusations that he had breached the country's strict lese majeste laws shielding the royal family from abuse and criticism.\nThe tycoon, who appeared at the court with a yellow necktie, the colour associated with Thailand's monarchy, had denied wrongdoing. He has repeatedly pledged allegiance to the king, who is enshrined in the Thai constitution as being in a position of \"revered worship\", with the palace seen by royalists as sacrosanct.\nAlthough he has no official role in government, Thaksin remains politically active and is widely seen as the power behind the ruling Pheu Thai party, which is losing popularity and hanging on by a thread over the conflict with neighbouring Cambodia and a stuttering economy.\nThaksin returned to Thailand in 2023 after 15 years abroad to serve an eight-year sentence for abuse of power and conflicts of interest, which was reduced to one year by King Maha Vajiralongkorn.\nHe returned the day his family's Pheu Thai party took office at the head of a coalition government backed by their conservative former enemies, fuelling suspicions a backroom deal had been struck.\nHe did not spend a single night in jail, however, and was transferred to the luxury wing of a police hospital on medical grounds, where he remained for six months before being released on parole.\nAnother court will decide 18 days later if the tycoon's 2023 detention in a VIP hospital wing, instead of jail, means his prison sentence for abuse of power and conflicts of interest was not fully served.\nThaksin's is the highest-profile case among the more than 280 prosecutions in recent years under the controversial law, which activists say has been abused by conservatives to silence dissent and sideline political rivals. Royalists say the law is necessary to protect the crown.\nThe ruling on Thaksin's case is the first in a series of upcoming rulings involving the powerful Shinawatra dynasty.\nHis daughter, Paetongtarn Shinawatra, was suspended as Thai prime minister in July by the Constitutional Court pending an ethics probe into her conduct during a leaked diplomatic phone call discussing a deadly border clash between Thailand and neighbouring Cambodia.\nIn the call, Paetongtarn referred to Cambodian ex-leader Hun Sen as \"uncle\" and described a Thai military commander as an \"opponent\" – sparking backlash for seeming to kowtow to a foreign statesman and undermine her own country's military.\nThailand's Constitutional Court announced last week that it would give its verdict on Paetongtarn's case at 3pm local time on Aug 29.\nThe verdicts come at a critical moment for Southeast Asia's second-largest economy, which is struggling with weak growth, high household debt, slowing tourism and investor concern over policy continuity."
    },
    {
      "news_title": "Thai Ex-PM Thaksin Acquitted Of Royal Insult Charges",
      "news_link": "https://www.ibtimes.com/thai-ex-pm-thaksin-acquitted-royal-insult-charges-3781426",
      "bias": "Center",
      "text": "Thai Ex-PM Thaksin Acquitted Of Royal Insult Charges\nThailand's former prime minister Thaksin Shinawatra was cleared Friday of royal defamation charges, relieving a threat to his embattled political dynasty which has dominated Thai politics for two decades.\nThe 76-year-old had faced up to 15 years in prison, but a Bangkok court found him not guilty of breaching the kingdom's strict lese-majeste laws criminalising criticism of King Maha Vajiralongkorn and his family.\n\"The court dismissed the charges against Thaksin, ruling that the evidence presented was insufficient,\" his lawyer Winyat Chatmontree told reporters.\nThaksin left court ahead of his lawyer, smiling and telling the press the case was \"dismissed\", without making any further comment.\nBut his dynasty remains on the ropes, with his daughter Prime Minister Paetongtarn Shinawatra facing her own reckoning next week with a court decision due which may see her thrown out of office.\nThaksin's royal insult case stemmed from decade-old remarks he made in South Korean media relating to the 2014 military coup that overthrew his sister Yingluck.\nAFP is not able to report the comments in detail because the lese-majeste law is so strict that doing so could in itself trigger criminal charges.\nThailand has been roiled by a succession of coups, street protests and court orders as Thaksin and his followers tussled for power with the traditional pro-royalist, pro-military elite that sees him as corrupt, nepotistic and a threat to the traditional social order.\nTwice elected prime minister in the early 2000s, Thaksin fled Thailand and lived in self-imposed exile for 15 years after he was ousted in a military coup, finally returning to the kingdom in August 2023.\nHe landed in Bangkok on the same day his family's Pheu Thai party took office at the head of a coalition government backed by their conservative former enemies, fuelling suspicions a backroom deal had been struck.\nOn arrival, Thaksin was immediately sentenced to eight years in prison on graft and abuse of power charges dating back to his time in office.\nBut instead of going to jail, he was whisked to a private room at a police hospital because of health problems.\nDays later, the king cut his sentence to one year, and in February 2024, he was freed as part of an early release scheme for elderly prisoners.\nHis handling has led to another legal case, set to conclude on September 9, arguing that because he never served time in a jail cell, he was not eligible for early release.\nProsecutions for lese-majeste, known as 112 in Thailand for its section in the criminal code, have increased sharply since anti-government protests in 2020, some of which openly criticised the monarchy.\nThai Lawyers for Human Rights, a group providing legal services in many of the cases, says that more than 280 people have been prosecuted under section 112 in the last five years.\nThe law says anyone who \"defames, insults or threatens\" the king, queen, heir or regent can face up to 15 years in prison.\nRights groups and critics say the law is now interpreted so broadly as to stifle dissent and legitimate debate.\n© Copyright AFP {{Year}}. All rights reserved."
    },
    {
      "news_title": "Judgement day for former Thai PM Thaksin Shinawatra in royal defamation case",
      "news_link": "https://dnyuz.com/2025/08/21/judgement-day-for-former-thai-pm-thaksin-shinawatra-in-royal-defamation-case/",
      "bias": "Lean Right",
      "text": "Bangkok, Thailand – A court is poised to decide whether Thailand’s most consequential and controversial political figure of the past 25 years, Thaksin Shinawatra, insulted the country’s revered monarchy, a crime that can land a culprit in jail for up to 15 years.\nThe charge, under Thailand’s strict “lese-majeste” royal defamation law, stems from an interview the 76-year-old business tycoon and former prime minister gave to a South Korean newspaper in 2015 regarding a military coup that toppled his sister and then-Prime Minister Yingluck Shinawatra in 2014.\nThough holding no official role in government, Thaksin remains a towering figure bearing over Thailand’s stormy politics, and the verdict on Friday will test the state of his long-fraught relationship with the country’s powerful royalist establishment.\n“The prosecution is of great political significance,” said Verapat Pariyawong, a Thai law and politics scholar at the School of Oriental and African Studies (SOAS) University of London.\n“If found innocent, Mr Thaksin would rely on the verdict as proof that he has always been a loyalist, contrary to the accusations by his political opponents which inflamed conflicts over the past two decades,” Verapat told Al Jazeera.\nA guilty verdict, on the other hand, could “trigger a new round of political conflicts”, he said.\n“Some would see it as a breakdown of the so-called grand compromise that paved the way for Mr Thaksin’s return to Thailand, and undoubtedly many will link the guilty verdict to other pending major court decisions not just against Mr Thaksin but also his daughter and suspended Prime Minister Paetongtarn Shinawatra,” he added.\nAfter 15 years in self-imposed exile, Thaksin returned to Thailand in 2023.\nThat lengthy absence from Thailand helped him to avoid a prison sentence on a prior corruption charge, though he was still forced to complete a commuted term in custody on his return home.\nHis latest tribulations stem from a royal defamation charge in June 2024, and he is also on trial for allegedly faking ill health in order to serve his sentence for corruption outside of jail.\nThaksin’s daughter and currently the country’s suspended prime minister, Paetongtarn, is being prosecuted for an alleged breach of ethics over a leaked phone call with Cambodia’s former prime minister and strongman Hun Sen.\nA court suspended Paetongtarn from her duties as premier on ethical grounds last month after Hun Sen leaked their phone conversation, in which the Thai prime minister spoke reverentially to the Cambodian leader.\nDuring the call, Paetongtarn referred to Hun Sen as “uncle” and criticised a Thai army commander.\nHer political adversaries and other people said it was unbecoming of a Thai premier to have addressed a foreign leader so deferentially, and criticising the military is also a red line in a country where the politically powerful armed forces are held in high esteem.\nA court is due to rule in Paetongtarn’s case on August 29, a verdict which could see her removed from office permanently.\nPower player\nThaksin’s path to the pinnacle of Thai politics started modestly, with a stretch in the national police force beginning in the early 1970s.\nWith the help of a government scholarship, he earned a master’s degree and then a doctorate in criminal justice in the United States before returning to public service in Thailand and resigning from the police force as a lieutenant colonel in 1987.\nLeveraging his professional contacts, Thaksin tried his hand at a number of business ventures before striking gold in telecommunications, founding and, in time, building his Shin Corp into an industry leader.\nIt also launched Thaksin onto Thailand’s richest list.\nLast month, Forbes ranked Thaksin 11th among the country’s wealthiest families or people, with a personal net worth of $2.1bn.\nIn the 1990s, Thaksin started parlaying his business success into a political career, founding his first of many parties by the end of the decade.\nOn the back of a populist platform that promised affordable healthcare and debt relief, he landed in the prime minister’s office with a resounding general election win in 2001 and another in 2005.\nBut mounting scandals cut his second four-year term short.\nAmid accusations of corruption over the $1.9bn sale of Shin Corp and an unrelated land deal that prompted mass protests, the Thai military removed Thaksin and his government in a 2006 coup.\nA Thai court convicted him over the land deal the next year. To avoid jail, he fled into self-imposed exile in 2008.\nWanwichit Boonprong, a Rangsit University lecturer, says Thaksin had made powerful enemies within the country’s military – a force that has grown accustomed to managing its internal affairs largely independent of the government – by trying to steer the appointment and transfer of high-ranking officers.\nBy seeming to meddle in the military’s work, Wanwichit told Al Jazeera, Thaksin raised fears that he was bent on both “undermining the military and weakening the monarchy”.\nThe military has long prided itself as the ultimate protector of the Thai monarchy, a touchstone of the country’s influential conservative movement.\nThaksin also pulled off the rare feat in 2005 of winning enough seats in the House of Representatives to form a government without the need for any coalition partners, making him uncommonly potent as a political force.\nThat popularity scared his critics, says Khemthong Tonsakulrungruang, an assistant professor at Chulalongkorn University.\n“That popularity, combined with his quick and outspoken manner, raised a lot of people’s suspicion that he might want to or he might try to compete with King Bhumibol [Adulyadej],” he said.\nWhile there was little, if any, proof to back that up, Khemthong said, “it became a very convenient tool to mobilise people” against Thaksin.\n‘Super active’\nBut even in exile overseas, Thaksin continued to dominate Thai politics.\nParties tied to the Shinawatra family kept winning elections and forming governments, only to be thwarted by the military or the courts each time.\nWith a prison sentence hanging over him, the tech mogul stayed abroad for 15 years, until returning to Bangkok to cheering crowds on August 22, 2023.\nBefore leaving the airport, Thaksin ostentatiously prostrated himself before a portrait of the country’s new king, Maha Vajiralongkorn, son of the late King Bhumibol.\nThe very same day, the Shinawatras’s latest party, Pheu Thai, secured the premiership for its candidate, Srettha Thavisin, by backing out of a planned coalition with the more progressive Move Forward party, which had won that year’s general election.\nPheu Thai rejected speculation that it had struck a “grand bargain” with the conservative establishment by pulling away from Move Forward, which had campaigned on reining in the military and the monarchy’s powers, in exchange for Thaksin’s safe return.\nHowever, only nine days later, King Vajiralongkorn commuted Thaksin’s prison sentence from eight years to one, and he was out on parole within months. He had also spent his entire six months in custody in a private room in the luxury wing of a state hospital.\nNow, with Thaksin on the brink of another conviction that could again send him to jail, the “grand bargain” is seen to be fraying.\n“A lot of people understand that when Thaksin came back he would lay low, that he was allowed to come back but he wasn’t allowed to be politically active, he should stay at home, be quiet. But instead of that he was super active,” said Chulalongkorn University’s Khemthong.\nDespite having no official role in the Pheu Thai party or the government it now leads, Thaksin has spent little time out of the spotlight since returning home less than two years ago – proposing grand policy prescriptions at public fora, touring constituencies with reporters in tow, conferring with domestic and international leaders alike.\n“So, a lot of people speculate that the [defamation] charge was to put more control over him, to control his behaviour, his political activism,” Khemthong said.\nThaksin’s continued high-profile lifestyle has also led to the popular belief that he, not his daughter, is still the real power behind the party, and by extension the government.\n“Everyone knows that Thaksin is the spiritual leader and the real owner of the Pheu Thai Party,” said Rangsit University’s Wanwichit.\n“Using this [defamation] case is akin to trying to keep Thaksin in check in the conservative power play,” and amounts to insisting that “he must obey the conservatives’ established guidelines,” Wanwichit added.\n‘Court battle’\nCritics of Thailand’s royal defamation law, or of how the courts use it, say it has long been swung like a cudgel against threats – real or imagined – to the conservative establishment’s political power and privilege.\nThe law, under Section 112 of the Criminal Code, prescribes up to 15 years in jail for anyone who “defames, insults or threatens” the king, queen, heir apparent or regent.\nBut Verapat, of SOAS, says many have “fallen victim” to the courts’ “expansive interpretation” of the law.\nIn January 2024, the country’s Constitutional Court ruled that the Move Forward party had breached the law by promoting a bill that proposed limits on how it could be used.\nThe panel of judges accused the party of harbouring a hidden agenda to undermine the country’s constitutional monarchy and ordered Move Forward to disband as a political movement.\nWhen thousands of protesters took to the streets of Bangkok through much of 2020, calling on the military-aligned government at the time to step down, their list of demands grew to include reforms meant to rein in the monarchy’s alleged influence over politics in the military’s favour.\nSince then, more than 280 people have been charged under Section 112, according to Thai Lawyers for Human Rights, a local advocacy group.\nAmong the most prominent of the 2020 protesters was lawyer Arnon Nampa, who has been sentenced to a cumulative 27 years and eight months following his 10th conviction on a royal defamation charge in July.\nThai Lawyers for Human Rights has called the use of the law “a form of violence against those who exercise their right to freedom of expression”.\nThe defamation case against Thaksin, which is based on a 10-year-old interview in which he criticised no one strictly covered by Section 112, fits into that same, expansive “modus operandi”, Chulalongkorn University’s Khemthong said.\nWhichever way the verdict goes on Friday, analysts say the fallout for Thaksin and the Shinawatra family is unlikely to be immediately known, as either side can and probably will appeal.\nKhemthong said the case against Thaksin could continue to drag out for months, if not a year or more.\nRangsit University’s Wanwichit concurred.\n“The appeals court battle will likely continue regardless of the verdict,” he said.\nThe post Judgement day for former Thai PM Thaksin Shinawatra in royal defamation case appeared first on Al Jazeera."
    },
    {
      "news_title": "Verdict due for Thailand’s ex-PM Thaksin Shinawatra in royal insult case",
      "news_link": "https://rocketnews.com/2025/08/verdict-due-for-thailands-ex-pm-thaksin-shinawatra-in-royal-insult-case/",
      "bias": "Lean Left",
      "text": "Bangkok, Thailand – A court is poised to decide whether Thailand’s most consequential and controversial political figure of the past 25 years, Thaksin Shinawatra, insulted the country’s revered monarchy, a crime that can land a culprit in jail for up to 15 years.The charge, under Thailand’s strict “lese-majeste” royal defamation law, stems from an interview the 76-year-old business tycoon and former prime minister gave to a South Korean newspaper in 2015 regarding a military coup that toppled his sister and then-Prime Minister Yingluck Shinawatra in 2014.Though holding no official role in government, Thaksin remains a towering figure bearing over Thailand’s stormy politics, and the verdict on Friday will test the state of his long-fraught relationship with the country’s powerful royalist establishment.“The prosecution is of great political significance,” said Verapat Pariyawong, a Thai law and politics scholar at the School of Oriental and African Studies (SOAS) University of London.“If found innocent, Mr Thaksin would rely on the verdict as proof that he has always been a loyalist, contrary to the accusations by his political opponents which inflamed conflicts over the past two decades,” Verapat told Al Jazeera.A guilty verdict, on the other hand, could “trigger a new round of political conflicts”, he said.“Some would see it as a breakdown of the so-called grand compromise that paved the way for Mr Thaksin’s return to Thailand, and undoubtedly many w …"
    },
    {
      "news_title": "Thailand’s ex-PM Thaksin faces verdict in royal insult case",
      "news_link": "https://www.straitstimes.com/asia/se-asia/thailands-ex-pm-thaksin-faces-verdict-in-royal-insult-case",
      "bias": "Lean Right",
      "text": "Thailand’s ex-PM Thaksin faces verdict in royal insult case\nSign up now: Get ST's newsletters delivered to your inbox\nFollow topic:\nBANGKOK – Thailand’s former prime minister Thaksin Shinawatra will learn his fate on Aug 22 in a royal insult case that could see him jailed, as the political dynasty he founded falters after two decades of dominating Thai politics.\nThe 76-year-old faces up to 15 years in prison if the Bangkok court finds him guilty of breaching Thailand’s strict lese-majeste laws that criminalise almost any criticism of King Maha Vajiralongkorn and his family.\nThe verdict, expected from 10am (11am Singapore time), comes a week before another court rules whether Thaksin’s daughter, Ms Paetongtarn Shinawatra, will be thrown out of office as prime minister.\nIf both verdicts go against them, it would be a watershed for Thai politics, spelling the end of the family’s time in high office after a 20-year period that has seen three Shinawatra prime ministers.\nThaksin’s royal defamation case stems from remarks he made in an interview with the South Korean media in 2015, relating to the 2014 military coup that overthrew his sister Yingluck.\nAFP is not able to report Thaksin’s comments in detail because the lese-majeste law is so strict that doing so could in itself constitute a criminal offence.\nYears of tussle\nThaksin, who testified in his own defence in July, has been the defining figure of Thai politics for a quarter of a century.\nThe country has been roiled by a succession of coups, street protests and court orders as Thaksin and his followers tussled for power with the traditional pro-royalist, pro-military elite that sees him as corrupt, nepotistic and a threat to Thailand’s traditional social order.\nTwice elected prime minister in the early 2000s, Thaksin fled Thailand and lived in self-imposed exile for 15 years after he was ousted in a military coup, finally returning to the kingdom\nHe landed in Bangkok on the same day his family’s Pheu Thai party took office at the head of a coalition government backed by their conservative former enemies, fuelling suspicions a backroom deal had been struck.\nOn arrival, Thaksin was immediately sentenced to eight years in prison on graft and abuse-of-power charges dating back to his time in office.\nBut instead of going to jail, he was whisked to a private room at a police hospital\nDays later, the King cut his sentence to one year, and in February 2024, he was freed as part of an early release scheme for elderly prisoners.\nHis handling has led to another legal case, set to conclude on Sept 9, arguing that because he never served time in a jail cell, he was not eligible for early release.\nRise in prosecutions\nProsecutions for lese-majeste, known as 112 in Thailand for its section in the criminal code, have increased sharply since anti-government protests in 2020, some of which openly criticised the monarchy.\nThai Lawyers for Human Rights, a group providing legal services in many of the cases, says that more than 280 people have been prosecuted under Section 112 in the last five years.\nThe law says anyone who “defames, insults or threatens” the King, Queen, heir or regent can face up to 15 years in prison.\nRights groups and critics say the law is now interpreted so broadly as to stifle dissent and legitimate debate. AFP"
    },
    {
      "news_title": "Thailand's ex-PM Thaksin faces verdict in royal insult case",
      "news_link": "https://www.nst.com.my/world/region/2025/08/1263794/thailands-ex-pm-thaksin-faces-verdict-royal-insult-case",
      "bias": "Center",
      "text": "News\nRegional\nNorthern\nEast Coast\nSouthern\nBorneo\nCentral\nBusiness Times\nLife & Times\nSports\nWorld\nHeard The News?\n180 Years\n1Klassifieds\nNST TV\nOpinion\nGallery\nVouchers\nNST Podcast\nMore\nCOVID-19 Vaccine\nNews\nNST Viral\nCrime & Courts\nNation\nGovernment / Public Policy\nPolitics\nNST Special\nRegional\nVIEW ALL NEWS\nBusiness\nBusiness\nProperty\nCars Bikes Trucks\nLife & Times\nBots\nHeal\nFlair\nJom!\nGroove\nSunday Vibes\nVIEW ALL LIFE & TIMES\nSports\nFootball\nBadminton\nRacquet Sports\nCycling\nGolf\nMotor Sports\nCricket\nHockey\neSports\nOthers\nVIEW ALL SPORTS\nWorld\nWorld\nAsean\nVIEW ALL WORLD\nNST Podcast\nNST TV\nOpinion\nLeader\nLetters\nColumnists\nVIEW ALL OPINION\nVouchers\nGallery\nPhotos\nInfographics\nContact Us\nGet Mobile App\nNews\nCrime & Courts\nGovt / Public Policy\nNation\nPolitics\nBusiness\nBusiness Times\nProperty\nCars Bikes Trucks\nLife & Times\nSunday Vibes\nBots\nHeal\nFlair\nJom!\nGroove\nSports\nFootball\nBadminton\nTennis\nCycling\nGolf\nMMA\nMotorSport\nCricket\nOthers\nWorld\nWorld\nRegion\nRadio\nGet Audio+\nHot FM\nBuletin FM\nFly FM\nEight FM\nMolek FM\nOpinion\nColumnists\nLetters\nLeader\nGallery\nPhotos\nInfographics\nNST Podcast\nNST TV\nEducation\nVoucher"
    },
    {
      "news_title": "Former Thai Leader Thaksin Cleared of Royal Insult Charges",
      "news_link": "https://www.bloomberg.com/news/articles/2025-08-21/thai-royal-insult-verdict-against-thaksin-tests-shinawatra-clan-s-grip-on-power",
      "bias": "Lean Left",
      "text": null
    },
    {
      "news_title": "Thailand's Ex-PM Thaksin Faces Verdict In Royal Insult Case",
      "news_link": "https://www.barrons.com/news/thailand-s-ex-pm-thaksin-faces-verdict-in-royal-insult-case-f99d7799",
      "bias": "Center",
      "text": "Thailand's Ex-PM Thaksin Faces Verdict In Royal Insult Case\nThailand's former prime minister Thaksin Shinawatra will learn his fate on Friday in a royal insult case that could see him jailed, as the political dynasty he founded falters after two decades of dominating Thai politics.\nThe Barron's news department was not involved in the creation of the content above. This article was produced by AFP. For more information go to AFP.com.\n© Agence France-Presse\nContinue reading this article with a Barron’s subscription\nSUBSCRIBE NOW"
    },
    {
      "news_title": "Thai Court Clears Ex-PM Thaksin Shinawatra in Royal Insult Case, Lawyer Says",
      "news_link": "https://www.usnews.com/news/world/articles/2025-08-21/thai-court-clears-ex-pm-thaksin-shinawatra-in-royal-insult-case-lawyer-says",
      "bias": "Lean Left",
      "text": null
    },
    {
      "news_title": "Thailand’s former leader acquitted in royal insult case, but the list of those ensnared by lese majeste laws keeps growing",
      "news_link": "https://www.cnn.com/2025/08/20/asia/thailand-lese-majeste-thaksin-explainer-intl-hnk-dst",
      "bias": "Lean Left",
      "text": "Arnon Nampa’s youngest child runs toward the sound of shackles.\nThe 3-year-old’s only memories of his father, a prominent human right lawyer and activist, are from seeing him in a courtroom – not from his work defending others, but from the numerous lese majeste cases against him, Thailand’s notoriously strict royal insult law.\n“He remembers Arnon with his closely shaved hair, leg shackles, and prison uniform,” Arnon’s wife Pathomporn told CNN. “Every time we drive past the court, he says ‘We are going to see Dad’.”\nArnon has been sentenced to a combined 29 years in prison under lese majeste charges, and his struggle has made him a household name in Thailand where unquestioning reverence to the kingdom’s monarchy is both expected and enforced.\nWith four outstanding cases against him, the father of two could face more than 60 years behind bars for making speeches that called for reforms to the country’s powerful monarchy.\n“Our eldest child keeps asking every day when we will be together again. It is always a sad and uneasy atmosphere because we cannot give the children clear answers,” said Pathomporn, who requested to use only her first name.\nArnon is one of 281 people charged with lese majeste in Thailand since 2020, according to the Thai Lawyers for Human Rights (TLHR) legal rights group. Among them are ordinary citizens, activists, an American scholar, and even children.\nOn Friday, Thailand’s billionaire former prime minister Thaksin Shinawatra, who remains one of the country’s most influential and divisive political figures, was acquitted in his own lese majeste trial, which was held behind closed doors.\nAs he left court, Thaksin smiled to his supporters and said “dismiss” several times. Thaksin was wearing a yellow necktie, the color of Thailand’s monarchy.\nHere’s what to know:\nWhat is lese majeste?\nThe crime of insulting the royal family is a law enforced by some monarchies around the world. But few are stricter than in Thailand.\nThose found guilty of criticizing, insulting, defaming or threatening the king, queen, or heir apparent can be jailed for between three and 15 years for each count, with some sentences stretching to 50 years.\nEven talking about the royal family is fraught with risk, as complaints can be filed by anyone, from officials to members of the public, and police are obliged to investigate cases.\nSupporters of the law say it is as required to protect the monarchy from threats or harm, to maintain the institution’s place at the center of Thai society, and for public order.\n“It is a law protecting the head of state,” said Tul Sitthisomwong, a medical doctor and pro-royalist activist, comparing it to laws in other nations that protect the state.\nBut human rights organizations and free speech campaigners have long said the law has been used as a political tool to stifle debate and silence critics of the Thai government and shield the monarchy from both scrutiny and reform. In recent times, lese majeste prosecutions have increased during times of anti-government unrest.\nEven visitors to Thailand, one of the world’s most popular tourist destinations, need to careful about what they say and write.\n“The risk of being prosecuted or charged under lese majeste is always constant if you are in Thailand,” said Akarachai Chaimaneekarakate, advocacy lead at TLHR.\nSkyrocketing cases since 2020\nLese majeste cases have sharply increased under King Maha Vajiralongkorn who ascended the throne in 2016 following the death of his father Bhumibol Adulyadej, a figure whose reign lasted more than 70 years.\nOn August 3, 2020, Arnon Nampa was one of several people who gave a speech at a “Harry Potter”-themed pro-democracy protest in Bangkok on monarchy reform.\nIt was the first time that discussion of reforming the monarchy had gone public, and the speech helped spark nationwide youth-led protests, with millions of people demanding constitutional, military and democratic reforms, including reforms to the powerful monarchy.\n“That’s the speech that really shattered the ceiling on what can or cannot be said about the monarchy, (it) really broke the taboo,” said Akarachai.\nFor that speech alone, Arnon was charged with violating Section 112 of Thailand’s Criminal Code – lese majeste – and initially sentenced to four years in prison, before it was reduced to two years and eight months.\nBut Thailand’s youth were invigorated and their protests, which were ultimately put down by authorities, ignited a progressive political movement that led to unprecedented electoral gains at the ballot box three years later.\nSince those protests – and because of them – however, lese majeste case have skyrocketed.\nBetween 2014 - when TLHR was formed - and 2019, 65 people were charged with lese majeste, according to the group. Since 2020, that number has risen to 281 people, with almost 2,000 prosecuted for political protest or expression, it said.\nEven Tul, who has been a leading and vocal proponent of lese majeste — and has himself filed a case against protesters — acknowledged that the law has been misused as a political tool.\n“The law is already good by itself, but the problem lies with those who use the law,” he said.\nWhat do those in prison face?\nConviction rates for lese majeste stand at around 80%, and prosecutors indict around 99% of the time — a huge percentage given the law is vaguely worded and what constitutes lese majeste is not even legally defined, TLHR said.\nHearings and cases are increasingly being shrouded in secrecy, Akarachai’s group has found.\nThose charged with lese majeste can face months or even years in pre-trial detention, contending with the cramped and harsh environment of Thai prison life before even receiving a verdict.\n“Arnon has lost about 10 kilograms since entering prison. His hands are cracked and rough. All he has for bedding is a mattress about one inch thick and a thin blanket. He lives in a cell with nearly 30 other inmates. The cell has a toilet, but no door,” said Pathomporn.\nCNN has reached out to the Department of Corrections for comment.\nOther Thai pro-democracy activists have described to CNN the toll that being charged with lese majeste has had on their physical and mental health, the difficulty of holding down jobs as they are required to attend hearings every week, and strained family relations. The threat of long prison terms has led some young people to flee the country, leaving their families and lives behind.\nSome lese majeste activists have gone on hunger strike while in prison.\nIn May 2024, Netiporn “Bung” Sanesangkhom, 28, died after suffering a “sudden cardiac arrest” authorities said, following a 65-day hunger strike while awaiting trial in jail, in a case that sparked calls for judicial reform.\nSeeing a need to help those charged with political crimes, Pathomporn set up Freedom Bridge, an organization that provides financial assistance and other support to political prisoners and their families in Thailand.\nHer organization buys food, medicine and other supplies for inmates, and helps their families with the increased financial burden.\n“For families whose head of household has been imprisoned, the experience is extremely difficult both emotionally and physically,” she said.\n“Most of these families are not well-off. They live hand to mouth… On top of that, those on the outside often end up taking on additional debt.”\n‘Chilling’ effect on freedoms\nIn April, prominent American academic Paul Chambers was arrested at his home in northern Thailand, charged with lese majeste and denied bail.\nA political science lecturer at Naresuan University in the northern province of Phitsanulok, Chambers had spent decades writing about Thai civil-military relations but provoked the ire of a regional army commander.\n“I thought it was possible that it could come, but I never expected it really seriously, because I never did write or publish anything about the king,” Chambers told CNN.\nChambers described the case as “very flimsy” and that “clearly, somebody had an agenda, and they abused this law to go after me.”\n“That’s happened to many, many people,” he said.\nChambers was kept in the prison’s general population for two days before his release on bail.\n“I was very much afraid,” he said. “I also had prisoners continually ask me why I was in prison… They would look at each other and say, ‘what, you were insulting my king?’ And so it became scarier.”\nThe charges, which included one count of lese majeste and one count under the Computer Crimes Act, were later dropped.\nBut Chambers was still sacked from his university job, his visa was revoked, and he was effectively deported – leaving his wife and a life built over 30 years in Thailand.\nChambers believes his case was clearly political, and an example of lese majeste being used to silence critics not just of the monarchy, but the entire Thai establishment.\n“There are different dimensions of elites in Thailand, but all of these elites oscillate around the institution of monarchy and the military is one dimension of these elites,” said Chambers, who remains a visiting fellow at the Institute of Southeast Asian Studies.\nThe military, he said, is increasingly using the courts to go after perceived enemies.\n“When a powerful institution becomes afraid that its interests are being attacked, like, for example, I was saying things about the economic empire of the army, when you feel that your interests are being attacked, then those institutions begin to bring charges,” said Chambers.\nAlongside lese majeste, other laws such as sedition, defamation, and computer crimes are often used to silence a wider net of state criticism, critics say.\nPush to reform the law\nIn January, United Nations experts urged Thailand to repeal its lese majeste law, saying such laws “have no place in a democratic country.”\nThere have been recent but unsuccessful attempts to amend the law and plenty of Thais support reform, despite the risks.\nThe progressive Move Forward Party, which was forged in the ashes of the 2020 protests, won the most seats in the 2023 general elections on a platform of widespread institutional reforms. Part of their popular campaign was to amend lese majeste.\nDespite winning the most seats in parliament, the party was prevented from forming a government after conservative lawmakers took issue with the party’s royal reform agenda.\nThailand’s Constitutional Court ordered the party to end its lese majeste campaign, and accused its leaders of seeking to overthrow the constitutional monarchy. The same court later ordered the party to disband.\nThe rulings were a major blow to Thailand’s progressive movement, and effectively ensured that no party or person would legally be able to push for amendments to lese majeste without violating the constitution.\nAn Amnesty Bill, currently working its way through parliament, has offered fresh hope to those imprisoned on political charges, but lese majeste is unlikely to be included.\nFor Thaksin, the 76-year-old former premier and ex owner of Manchester City Football Club who was ousted in a 2006 coup, his lese majeste charge revolved around comments he gave to a South Korean media outlet a decade ago.\nThe Bangkok Criminal Court on Friday dismissed the case, stating that there was insufficient evidence Thaksin committed lese majeste, but it’s the first in a series of legal challenges against one of the country’s most powerful families and could lead to another shakeup of the Thai government.\nHis acquittal was a relief to many of his supporters, known as the “red shirts.”\n“I believe that Mr. Thaksin is really loyal to the king and he didn’t insult the king,” said Pakbhumi Wiengnak, 42, from Bangkok. “I believe in his innocence.”\nThaksin built a famed political dynasty that has dominated Thai politics in some form for the past 20 years, boasting four prime ministers. But his populist policies were loathed by the country’s rich elites and conservatives, and he was dogged by corruption allegations he long denied.\nThaksin’s daughter Paetongtarn Shinawatra was recently suspended as prime minister and the Constitutional Court will decide her fate next week.\n“The conservative forces can always keep these cases up their sleeve, like playing a game of cards, and they could hold these pieces always ready to use them, and make them happen in a heartbeat if they want,” said Chambers."
    },
    {
      "news_title": "Thaksin dodges jail, lawyer eyes travel comeback",
      "news_link": "https://thethaiger.com/hot-news/politics/thaksin-dodges-jail-lawyer-eyes-travel-comeback",
      "bias": "unknown",
      "text": "Thaksin dodges jail, lawyer eyes travel comeback\nLawyer claims ruling exposes flaws in political prosecutions, urges society not to pressure for appeals\nFormer Prime Minister Thaksin Shinawatra has walked free from a Section 112 trial, and his lawyer now wants his travel ban lifted.\nLawyer Winyat Chartmontri announced plans to formally request the revocation of Thaksin’s travel ban following the former premier’s acquittal in a controversial lese majeste case.\nThe Criminal Court cleared Thaksin yesterday, August 22, of charges under Section 112 of the Penal Code and the Computer Crimes Act. Emerging from the courthouse smiling, the 74-year-old tycoon bowed in front of a royal portrait before briefly telling reporters, “Acquitted, acquitted,” and departing in a waiting car.\nWinyat explained that the court ruled in Thaksin’s favour due to multiple factors, including insufficient evidence from the prosecution.\n“The plaintiff’s burden of proof was not met.”\nThe lawyer pointed out that the video clip at the heart of the case, an interview conducted while Thaksin was in South Korea, was incomplete and potentially taken out of context.\nWhile the court acknowledged the interview occurred, it concluded the video did not clearly reference anyone protected under Section 112.\n“The court even referred to grammatical analysis and foreign dictionaries to interpret the terms used.”\nWinyat said that certain prosecution witnesses were dismissed as unreliable due to political bias, while expert witnesses from the defence were accepted as credible.\nAs for the likelihood of an appeal, Winyat dismissed it:\n“Appeals should not be made just for the sake of it; they must focus on important legal matters.”\nHe warned against public pressure influencing legal decisions, especially in politically sensitive cases.\n“I’ve handled many political cases. Not every one results in an appeal. The courts should not be used as a battleground for political conflicts.”\nWinyat confirmed that Thaksin would attend his next court hearing on September 9, which concerns his controversial hospital stay while in custody, reported The Nation.\nHe rejected speculation that Thaksin might flee the country.\n“He has consistently fought the case and has not fled.”\nRegarding Section 112, Winyat acknowledged its controversial role in Thai politics but stressed the importance of legal interpretation over emotion.\n“I don’t mean everyone charged should be pitied, but we must view each case individually, within the bounds of law and justice.”\nLatest Thailand News\nFollow The Thaiger on Google News:"
    },
    {
      "news_title": "Thaksin Shinawatra Cleared of Royal Insult Charges in Landmark Ruling",
      "news_link": "https://www.thailandnews.co/2025/08/thaksin-shinawatra-cleared-of-royal-insult-charges-in-landmark-ruling/",
      "bias": "unknown",
      "text": "Thaksin Shinawatra Cleared of Royal Insult Charges in Landmark Ruling\nBANGKOK — Thailand’s Criminal Court on Friday acquitted former Prime Minister Thaksin Shinawatra of lese-majeste charges, marking a significant legal victory for the influential billionaire and his powerful political dynasty. The case, stemming from a 2015 media interview given during his exile, was dismissed without the court immediately providing a public explanation.\nAugust 22: Judgement day for Thaksin’s royal defamation case\nThaksin, 76, smiled as he told reporters, “The case was dismissed,” after leaving the courtroom wearing a yellow tie—a color symbolizing loyalty to the monarchy. His lawyer confirmed the outcome to Reuters but declined to elaborate on the grounds for dismissal.\nThe charges were originally filed by the military, which accused Thaksin of violating Thailand’s strict royal defamation law during an interview with foreign media. Thaksin had consistently denied the allegations and reaffirmed his allegiance to the monarchy.\nDespite holding no official government role, Thaksin remains a dominant figure in Thai politics. His daughter, Paetongtarn Shinawatra, leads the ruling Pheu Thai Party, which currently governs amid declining popularity and mounting challenges including border tensions with Cambodia and economic struggles.\n#BREAKING Thaksin Shinawatra acquitted of lese majeste charges – leaves Criminal Court pic.twitter.com/HgJNqpBP5m\n— Tommy Walker (@tommywalkerco) August 22, 2025\nThe acquittal is the first in a series of high-stakes legal decisions involving the Shinawatra family. Next week, the Constitutional Court will rule on whether to remove Paetongtarn from office over allegations of ethical violations related to a leaked phone call with former Cambodian leader Hun Sen.\nThaksin also faces a separate Supreme Court ruling in September regarding whether his six-month hospital detention should count as time served in an earlier abuse-of-power case. If rejected, he could be ordered back to prison.\nFriday’s verdict is seen as a pivotal moment in Thai politics, where lese-majeste laws have been used in over 280 cases in recent years. Critics argue the law suppresses dissent, while royalists insist it is essential to protect the institution of the monarchy.\nFormer Thai PM Thaksin Formally Indicted in Royal Defamation Case\nThe court has yet to issue an official written statement detailing its reasoning.\n-Thailand News (TN)"
    },
    {
      "news_title": "Thaksin, Ex-Premier of Thailand, Is Cleared of Insulting Monarchy",
      "news_link": "https://breakingone.com/partners/nytns/thaksin-ex-premier-of-thailand-is-cleared-of-insulting-monarchy/article_a2c7c35e-1647-50fa-b16d-87397e0a580e.html",
      "bias": "unknown",
      "text": null
    },
    {
      "news_title": "Thailand Court Dismisses Royal Insult Case Against Ex-PM Thaksin",
      "news_link": "https://stratnewsglobal.com/world-news/thailand-court-dismisses-royal-insult-case-against-ex-pm-thaksin/",
      "bias": "unknown",
      "text": "A court in Thailand on Friday threw out a royal insult case against former Prime Minister Thaksin Shinawatra, marking the first key verdict in a string of high-stakes rulings tied to the influential Shinawatra political family.\nCase Linked To 2015 Interview\nThe court said the case, brought by the royalist military stemming from a 2015 Thaksin interview with foreign media, lacked sufficient evidence to prove he had insulted the powerful monarchy, an offence punishable by up to 15 years in prison.\n“Evidence from the plaintiff showed the interview by the defendant did not defame, insult or threaten the king, therefore the defendant is not guilty,” the criminal court in Bangkok said.\nWearing a yellow necktie, the colour associated with the palace, a smiling Thaksin had earlier announced the decision to reporters as he left the courthouse, outside of which about 150 of his red-shirted supporters had gathered.\nEnduring Political Influence\nThe divisive 76-year-old tycoon remains a major force in Thai politics despite being retired and having previously spent 15 years in self-imposed exile before his return in 2023.\nThe billionaire has repeatedly pledged allegiance to the king, who is enshrined in the Thai constitution as being in a position of “revered worship”, with the palace seen by royalists as sacrosanct.\nThaksin’s case was the highest-profile among more than 280 prosecutions in recent years under the controversial lese-majeste law, which activists say has been abused by conservatives to silence dissent and sideline political rivals. Royalists say the law is necessary to protect the crown.\nLegal Hurdles Ahead\nAlthough he has no official role in government, Thaksin remains politically active and is widely seen as the power behind the ruling Pheu Thai party-led coalition, which is losing popularity and hanging by a thread.\nThe ruling came a week ahead of another key verdict involving his daughter, Prime Minister Paetongtarn Shinawatra, who faces dismissal by the Constitutional Court for an alleged ethics violation over a leaked telephone conversation with Cambodia’s former leader about a border row that later spiraled into five days of armed conflict.\nThaksin also faces another legal test in September when the Supreme Court will decide if his six-month stint in hospital detention, prior to his release on parole in 2024, counts as time served in jail for an abuse of power and conflicts of interest conviction. He could potentially be made to serve that time in prison.\nThaksin had been sentenced to eight years in prison, reduced to one year by King Maha Vajiralongkorn, but did not spend a single night in jail and was transferred to the VIP wing of a police hospital on medical grounds.\nPopulist Legacy, Polarising Role\nA former policeman who built a business empire worth billions, Thaksin was a Mould-breaking premier who won the hearts and votes of millions of working-class Thais with populist giveaways like cash handouts, village loans and universal healthcare.\nThat made his political parties unstoppable, but his influence and brash character riled Thailand’s old guard of conservatives and royalist generals in a long-running battle that has seen the fall of multiple Shinawatra-backed governments via coups or court rulings.\nSupporters outside the court expressed relief at Friday’s decision, saying Thaksin was committed to helping the people.\n“I’m glad,” said Khemanut Thauntong, 62. “He is a good and honest person who is loyal to the nation.”\n(With inputs from Reuters)"
    },
    {
      "news_title": "Former Thai PM Thaksin acquitted in royal insult case - Kahawatungu",
      "news_link": "https://kahawatungu.com/former-thai-pm-thaksin-acquitted-in-royal-insult-case/",
      "bias": "unknown",
      "text": "A Bangkok court Friday acquitted controversial billionaire and former Thai prime minister Thaksin Shinawatra, who was accused of insulting the monarchy.\nThe charge related to an interview he gave to a South Korean newspaper ten years ago. He would have faced up to 15 years in jail if convicted.\nThailand’s lese majeste law forbids insulting its monarchy. But critics say it is often used to target activists and political opponents.\nThe verdict came as Thaksin’s daughter, suspended PM Paetongtarn , faces a Constitutional Court decision on whether or not she should be removed from office. These cases pose a threat to the Shinawatra clan, which has been a dominant force in Thai politics for decades.\nFriday’s verdict has brought some relief to the family and their supporters.\nWinyat Charmontree, a lawyer acting for Thaksin, told reporters that after the verdict was read out in court, his client had smiled and thanked his lawyers. He had also said he was now able to work for the country’s benefit.\nThe charge against Thaksin was originally filed under the then-military government in 2016, when he was in exile, and re-activated last year after his return to Thailand.\nAt first glance the case against him seemed weak.\nIn the South Korean newspaper interview, the former prime minister said he believed the 2014 military coup which deposed the elected government of his sister Yingluck – just as he had been deposed by a previous coup in 2006 – had been instigated by “some people in the palace” and members of the privy council, the 19-member body which advises the Thai king.\nTechnically the privy council is not covered by the lese majeste law, which states that it is an offence to defame only the king, queen, heir to the throne or anyone acting as regent.\nHowever, in recent years the law has been invoked to criminalise any action or statement which might reflect negatively on the monarchy as an institution.\nIn the past people have been prosecuted for making unfavourable comments about the late King Bhumibol’s dog and about a Thai king from the 16th Century.\nMore recently, a young woman was sentenced to five years in prison for placing a banner criticising the budget to help those affected by Covid close to a portrait of King Vajiralongkorn.\nThe interpretation of the law has become so broad that human rights groups view it as a political tool, which can be used to intimidate and silence those who challenge the status quo.\nMany believed this was what was happening to Thaksin.\nHowever, the judges chose to interpret the wording of the law literally, and said that as the defendant had not named names, he should be acquitted.\nThis verdict comes exactly two years after the former prime minister’s dramatic return from 15 years of exile.\nAt the time it was assumed there had been a grand bargain struck between Thaksin and his long-time conservative adversaries, so that his party Pheu Thai, which in the 2023 election had been relegated to second place from its usual number one spot, could form a coalition government and keep the young reformists who had actually won the election out of power.\nThe terms of that bargain have never been made public –Thaksin has always insisted there was no deal – but it is likely they included an agreement that he would keep a low profile and stay out of politics.\nBut a low profile is something completely alien to the flamboyant, wealthy and ambitious tycoon.\nHe is still believed to be the largest funder of Pheu Thai and makes all of the main decisions for the party.\nWhen his first choice of prime minister, businessman Srettha Thavisin, was disqualified by the persistently interventionist Constitutional Court a year ago, Thaksin’s inexperienced daughter Paetongtarn Shinawatra took the helm, becoming Thailand’s youngest ever prime minister.\nA self-described “daddy’s girl”, she said she would happily take his advice. As she took office Mr Thaksin announced his “Vision for Thailand”, including a controversial proposal to legalise casinos; much of that subsequently became official policy.\nThe parliamentary opposition has accused the Shinawatra family of running a “dual leadership”. Thaksin’s business ties to the Cambodian strongman Hun Sen also raised concerns over how firmly his government would defend Thailand over the border dispute between the two countries.\nThis came to a head in the private phone conversation leaked by Hun Sen in which Paetongtarn was heard referring to him as “uncle”, and criticising her own army commander on the border, for which she has now been suspended by the Constitutional Court, which will decide whether she is dismissed in a week’s time.\nLosing another prime minister after just a year, at a time of great global uncertainty, might be judged as too risky. It is not clear who would replace Paetongtarn.\nThaksin faces another court case next month, over his transfer to a hospital to serve a previous jail sentence. The price for him being allowed to stay out of jail may be that his party has to call an early election, at a time when its poor performance in government could result in it losing many of its seats in parliament.\nBy BBC News\nEmail your news TIPS to Editor@Kahawatungu.com — this is our only official communication channel"
    },
    {
      "news_title": "Thaksin Wins Case: Jubilant Scenes Outside Court",
      "news_link": "https://aseannow.com/topic/1370612-thaksin-wins-case-jubilant-scenes-outside-court/",
      "bias": "unknown",
      "text": "Politics Thaksin Wins Case: Jubilant Scenes Outside Court\n-\nRecently Browsing 0 members\n- No registered users viewing this page.\n-\nTopics\n-\n-\nPopular Contributors\n-\n-\nLatest posts...\n-\n105\nReport Thailand Post Suspends US Parcels as Trump Axes Tax Exemption\nFirst the banking and now this. Trump will make executive order that SS can only be spent in USA. -\n43\nCanada Surrenders\nSean Connery cheated all the time. Elvis Presley cheated all the time. JFK cheated all the time. -\n5\nUkraine Russia Rejects EU Troops in Ukraine Amid Trump’s Veiled Threats\nCall Putin's bluff. Suggest that the Baltic will be closed to Russian ships, due to security concerns. Could also sell a couple of submarines to Ukraine, to use in the black sea against Russian ships. -\n105\nReport Thailand Post Suspends US Parcels as Trump Axes Tax Exemption\nYou don’t need to be leftist to know Trump is a dangerously incompetent moron. Ask Bolton. -\n6\nWill US policy and distrust allow BRICS to become more powerful?\nIIRC Russia invaded Ukraine. That country did not invade Russia. Please don't let that fact get in the way of your conspiracy theory. -\n15\nUSA Trump's Visa Hunt: Over 55 Million Under Scrutiny\nBecause President Trump uses a black Sharpie marker to sign the orders. and it drives the left insane !\n-\n-\nPopular in The Pub\nRecommended Posts\nCreate an account or sign in to comment\nYou need to be a member in order to leave a comment\nCreate an account\nSign up for a new account in our community. It's easy!\nRegister a new accountSign in\nAlready have an account? Sign in here.\nSign In Now"
    },
    {
      "news_title": "Thaksin Shinawatra Acquitted in Lese Majeste Case - The Phuket Express",
      "news_link": "https://thephuketexpress.com/2025/08/22/thaksin-shinawatra-acquitted-in-lese-majeste-case/",
      "bias": "unknown",
      "text": "Thailand-\nOn August 22nd, 2025, Thailand’s former Prime Minister Thaksin Shinawatra was cleared of royal defamation charges in a high-profile lese majeste case, marking a big victory for the influential political leader and his family’s enduring dynasty.\nThe Bangkok Criminal Court dismissed the charges, ruling that the evidence presented was insufficient to prove Thaksin violated Thailand’s strict lese majeste laws. The 76-year-old, who faced up to 15 years in prison, left the court smiling, briefly telling reporters the case was “dismissed” without further comment.\nThe case stemmed from a 2015 interview with South Korean media outlet Chosun Ilbo, where Thaksin, who was on a self imposed exile at the time and living overseas, allegedly made remarks implicating privy councillors in the 2014 military coup that ousted his sister Yingluck Shinawatra’s government. Although the privy council is technically not covered under Section 112 of Thailand’s Penal Code, the lese majeste law has been broadly interpreted in recent years to encompass actions perceived as tarnishing the monarchy’s image.\nThaksin’s legal team, led by lawyer Winyat Chatmontree, challenged the credibility of the evidence, including a video of the interview, which they suspected was doctored, although the court disagreed on this. The defense presented 14 witnesses, including a Thai-speaking Korean interpreter, to affirm Thaksin’s loyalty to the monarchy.\nOne key point leading to Thaksin being aqquited was that the court also pointed out that multiple witnesses against the plaintiff had all participated in political protests against the defendant which raised questions about their impartiality and caused the court to proceed with caution. This also led to overall concerns about the charges being politically inclined and personal and not being brought forward to protect the nation and monarchy.\nThaksin, a polarizing figure who dominated Thai politics for over two decades, returned to Thailand in August of 2023 after 15 years of self-imposed exile following a 2006 military coup. His return coincided with his family’s Pheu Thai party forming a coalition government with former conservative rivals, fueling speculation of a backroom deal.\nUpon arrival, Thaksin was sentenced to eight years for graft and abuse of power but served no jail time, instead receiving medical treatment in a police hospital. His sentence was later reduced to one year by royal decree, and he was paroled in February of 2024. The handling of his return and legal cases has drawn criticism from opponents who view it as preferential treatment.\nWhile Thaksin’s acquittal relieves immediate pressure, the Shinawatra family remains under scrutiny. His daughter, suspended Prime Minister Paetongtarn Shinawatra, faces a Constitutional Court ruling on August 29th, 2025, that could remove her from office over an ethics case tied to a leaked phone call with Cambodian leader Hun Sen. Additionally, Thaksin faces another legal challenge on September 9, 2025, regarding his eligibility for early release from his prior sentence tied into serving his sentence in a hospital and not a prison.\nThaksin’s acquittal may improve his family’s position, but with Paetongtarn’s fate hanging in the balance, the Shinawatra clan’s political future remains uncertain.\nFor the original version of this article, please visit The Pattaya News."
    },
    {
      "news_title": "Thaksin Shinawatra Acquitted in Lese Majeste Case",
      "news_link": "https://thepattayanews.com/2025/08/22/thaksin-shinawatra-acquitted-in-lese-majeste-case/",
      "bias": "unknown",
      "text": "Thailand-\nOn August 22nd, 2025, Thailand’s former Prime Minister Thaksin Shinawatra was cleared of royal defamation charges in a high-profile lese majeste case, marking a big victory for the influential political leader and his family’s enduring dynasty.\nThe Bangkok Criminal Court dismissed the charges, ruling that the evidence presented was insufficient to prove Thaksin violated Thailand’s strict lese majeste laws. The 76-year-old, who faced up to 15 years in prison, left the court smiling, briefly telling reporters the case was “dismissed” without further comment.\nThe case stemmed from a 2015 interview with South Korean media outlet Chosun Ilbo, where Thaksin, who was on a self imposed exile at the time and living overseas, allegedly made remarks implicating privy councillors in the 2014 military coup that ousted his sister Yingluck Shinawatra’s government. Although the privy council is technically not covered under Section 112 of Thailand’s Penal Code, the lese majeste law has been broadly interpreted in recent years to encompass actions perceived as tarnishing the monarchy’s image.\nThaksin’s legal team, led by lawyer Winyat Chatmontree, challenged the credibility of the evidence, including a video of the interview, which they suspected was doctored, although the court disagreed on this. The defense presented 14 witnesses, including a Thai-speaking Korean interpreter, to affirm Thaksin’s loyalty to the monarchy.\nOne key point leading to Thaksin being acquitted was that the court also pointed out that multiple witnesses for the plaintiff had all participated in political protests against the defendant which raised questions about their impartiality and caused the court to proceed with caution. This also led to overall concerns about the charges being politically inclined and personal and not being brought forward to truly protect the nation and monarchy.\nThaksin, a polarizing figure who dominated Thai politics for over two decades, returned to Thailand in August of 2023 after 15 years of self-imposed exile following a 2006 military coup. His return coincided with his family’s Pheu Thai party forming a coalition government with former conservative rivals, fueling speculation of a backroom deal.\nUpon arrival, Thaksin was sentenced to eight years for graft and abuse of power but served no jail time, instead receiving medical treatment in a police hospital. His sentence was later reduced to one year by royal decree, and he was paroled in February of 2024. The handling of his return and legal cases has drawn criticism from opponents who view it as preferential treatment.\nWhile Thaksin’s acquittal relieves immediate pressure, the Shinawatra family remains under scrutiny. His daughter, suspended Prime Minister Paetongtarn Shinawatra, faces a Constitutional Court ruling on August 29th, 2025, that could remove her from office over an ethics case tied to a leaked phone call with Cambodian leader Hun Sen. Additionally, Thaksin faces another legal challenge on September 9, 2025, regarding his eligibility for early release from his prior sentence tied into serving his sentence in a hospital and not a prison.\nThaksin’s acquittal may improve his family’s position, but with Paetongtarn’s fate hanging in the balance, the Shinawatra clan’s political future remains uncertain."
    },
    {
      "news_title": "Thaksin acquitted of lèse-majesté by the Criminal Court in Bangkok. Outcome expected but still sweet  - Thai Examiner",
      "news_link": "https://www.thaiexaminer.com/thai-news-foreigners/2025/08/22/thaksin-acquitted-of-lese-majeste-by-the-criminal-court-in-bangkok-outcome-expected-but-still-sweet/",
      "bias": "unknown",
      "text": "Thaksin Shinawatra acquitted by Bangkok court of lèse-majesté and Computer Crimes Act charges from 2016, ending a decade-long legal battle and giving the former prime minister a rare legal victory while he awaits his daughter’s Constitutional Court hearing.\nFormer Prime Minister Thaksin Shinawatra scored a major victory on Thursday as Bangkok’s Criminal Court acquitted him of lèse-majesté and Computer Crimes Act charges dating back to 2016, a ruling that could ease international criticism of Thailand’s controversial law. Facing up to 15 years in prison if convicted, Thaksin had been blindsided when the case was served after his brokered return to Thailand on August 22, 2023. Now, he can shift focus to his daughter, Prime Minister Paetongtarn Shinawatra, whose Constitutional Court judgement is set for August 29, while also awaiting the Supreme Court’s verdict on his own controversial incarceration on September 19. For today, however, the acquittal offers Thaksin a rare moment to relax and savour a hard-won victory, one that, though expected, still marks a decisive chapter in his turbulent political saga.\nFormer Prime Minister Thaksin Shinawatra was acquitted on Thursday of charges under Section 112 of the Criminal Code and the 2007 Computer Crimes Act. Consequently, the Criminal Court dismissed the case stemming from a 2015 interview with South Korean media, in which prosecutors claimed he insulted the monarchy. Thaksin consistently denied the allegations and was released on bail throughout the trial.\nEarlier in the morning, reporters gathered outside the Criminal Court on Ratchadaphisek Road, where heightened security had already been established. Moreover, court police and officers from Phahonyothin Police Station erected steel barriers, blocking entrances and exits. Therefore, media were confined to designated zones and required to wear temporary press credentials. Journalists were prohibited from entering the courtroom or observing proceedings, ensuring tight control over information. Additionally, authorities monitored crowd behaviour closely to prevent unrest.\nTight security and media restrictions kept journalists outside as crowds gathered near Criminal Court\nAt 9:30 a.m., Thaksin arrived alongside former Prime Minister Somchai Wongsawat and his lawyer, Winyat Chatimatri. Furthermore, supporters, including prominent politicians and family members, stood nearby, offering encouragement. Security forces maintained tight control, anticipating potential demonstrations from Red Shirt supporters. Indeed, authorities had warned of possible disruptions along Ratchadaphisek Road.\nThe charges against Thaksin originate from a May 2015 interview with Chosun Ilbo. Prosecutors alleged he made statements insulting the monarchy. Consequently, he faced prosecution under Section 112 and the Computer Crimes Act. If convicted, he could have faced up to 15 years in prison. Moreover, additional penalties under the cybercrime law could have extended the sentence further. Importantly, legal experts warned the case could have broad political consequences.\nSignificantly, the case traces back to Thailand’s 2014 military coup. Following the coup, the National Council for Peace and Order, or NCPO, directed the Department of Justice to file formal complaints. Subsequently, the Technology Crime Suppression Division investigated. However, since the interview occurred outside Thailand, the case was brought under the Attorney-General’s jurisdiction.\nCharges against Thaksin originated from the 2015 interview and the 2014 military coup actions\nIn September 2016, Attorney General Pongniwat Yutthaphanborihan ruled to indict Thaksin. However, he was abroad, and authorities could not enforce the arrest. Therefore, the case remained unresolved until his return to Thailand in August 2023. Upon arrival, he was immediately confronted with the lèse-majesté charge. Subsequently, his legal team argued the case was a misunderstanding, but the court rejected the petition.\nIn January 2024, Attorney General Amnat Jetjaroenrak formally presented the charges to Thaksin at Police General Hospital. He denied all allegations and requested further investigation. Nevertheless, prosecutors reaffirmed the indictment. The charges included Section 112, Section 83 of the Criminal Code, and violations of the 2007 Computer Crime Act. Furthermore, the indictment included potential penalties under multiple laws.\nThe trial progressed rapidly under strict conditions. From July 1–3, prosecutors presented witnesses. On July 16, the defence called three witnesses: Thaksin himself, former Deputy Prime Minister Wissanu Krea-ngam, and Thongthong Chandrangsu, former Permanent Secretary of the Ministry of Justice. Importantly, all hearings were held behind closed doors, ensuring confidentiality. No outsiders were permitted, maintaining strict courtroom secrecy. Additionally, security prevented any unauthorised communication with the public.\nThaksin’s trial continued under closed-door conditions, with witnesses and security closely monitored\nThaksin’s bail was set at ฿500,000, with restrictions preventing international travel without court permission. Despite these conditions, the trial continued smoothly. The verdict was scheduled for August 22, exactly two years after Thaksin returned from exile. Therefore, this timing held symbolic significance for the former prime minister and his supporters.\nAt 10:00 a.m., Courtroom 902 opened for the final hearing. Nevertheless, media and public attention remained intense. International journalists and Thai reporters closely followed developments from their designated zones. Photographers submitted requests for permission and were limited to taking pictures only from specified areas. Consequently, coverage remained controlled and orderly. In addition, court officials reiterated all rules to prevent violations.\nThe court ultimately ruled that Thaksin was not guilty of Section 112 and the Computer Crimes Act. Therefore, the judges concluded that his 2015 interview did not constitute lèse-majesté. Consequently, he faced no criminal penalties, marking a major legal victory. Supporters erupted outside the courthouse, celebrating the decision enthusiastically. Furthermore, analysts noted the verdict could influence future high-profile cases.\nCourt acquits Thaksin of lèse-majesté and computer crimes acts, marking a major legal victory\nThe political implications are immense. Thaksin is recognised as a central figure behind the Pheu Thai Party. Moreover, his daughter, Prime Minister Paetongtarn Shinawatra, remains in power. Therefore, the verdict reinforces the family’s influence over Thai politics. Conversely, opponents expressed disappointment, warning that the ruling may embolden Thaksin’s supporters. Additionally, the decision highlights tensions between the conservative establishment and populist groups.\nAnalysts emphasise that Section 112 has historically been controversial. Critics argue it is used to suppress dissent. Yet, supporters insist it protects the monarchy. Moreover, this case illustrates the tension between Thailand’s conservative factions and populist political movements. International observers also noted that secretive hearings and restrictions on the media raised concerns about transparency and democratic norms.\nAdditionally, the timing of the case fueled speculation. Many believe that reviving a 2015 interview upon Thaksin’s return was politically motivated. Indeed, the trial coincided with Thaksin’s daughter appearing before the Constitutional Court in a separate case regarding her qualifications. National Security Council Secretary-General Chatchai Bangchuad also testified in that hearing.\nVerdict highlights Thaksin’s influence and raises questions on political tensions and lèse-majesté law\nObservers noted that Paetongtarn performed with poise and composure. Nevertheless, analysts cautioned that her testimony did not fully align with constitutional interpretations.\nYet, the focus on the Criminal Court overshadowed the parallel proceedings. Both cases, therefore, reflect ongoing legal scrutiny of the Shinawatra family. Additionally, political observers warned of potential long-term implications.\nMeanwhile, political analysts warned of potential unrest. Large crowds of Red Shirt supporters gathered near the courthouse, demonstrating strong loyalty to Thaksin. Authorities remained on high alert, ready to contain any disorder. Furthermore, they emphasised the importance of separating political demonstrations from court proceedings.\nThe acquittal again highlights the fragility of Thailand’s political balance. While Thaksin avoids immediate legal jeopardy, his role as a political kingmaker persists. Additionally, the Pheu Thai Party continues to navigate a deeply polarised environment.\nCritics predict that the ruling may intensify friction between the conservative establishment and grassroots supporters. Moreover, the decision could shape future political strategy in the country.\nFurthermore, the verdict could affect future lèse-majesté cases. Legal experts argue that the decision may set a precedent regarding the interpretation of Section 112 and cybercrime offences. Observers, therefore, expect careful monitoring of how prosecutors handle similar cases in the future.\nAcquittal reinforces Thaksin’s political power while raising potential precedent for future lèse-majesté cases\nFor now, Thaksin remains a polarising figure. Loved by millions and opposed by powerful conservative forces, he continues to shape Thailand’s political narrative. Yet, the court’s ruling does not diminish his influence. If anything, it reinforces his position as a central political actor in the country.\nUltimately, the acquittal marks a significant moment in Thai politics. It resolves a legal battle that spanned nearly a decade. Yet, it also highlights the continuing tension between law, politics and public opinion.\nThaksin’s D-Day before Criminal Court on lèse-majesté. Thailand’s top political player faces judgment\nAs Thailand navigates these complexities, the Shinawatra family remains a key player. Therefore, the political stakes remain high, and the nation will closely watch how the family and the Pheu Thai Party fare in the coming weeks.\nJoin the Thai News forum, follow Thai Examiner on Facebook here\nReceive all our stories as they come out on Telegram here\nFollow Thai Examiner here\nFurther reading:\nPrime Minister Paetongtarn Shinawatra a no-show at cabinet and an appointment with Pheu Thai MPs"
    },
    {
      "news_title": "Thaksin cleared of royal insult charge",
      "news_link": "https://news.rthk.hk/rthk/en/component/k2/1819320-20250822.htm",
      "bias": "unknown",
      "text": "Thailand's former prime minister Thaksin Shinawatra was cleared on Friday of royal defamation charges, relieving a threat to his embattled political dynasty that has dominated Thai politics for two decades.\nThe 76-year-old had faced up to 15 years in prison, but a Bangkok court found him not guilty of breaching the kingdom's strict lese-majeste laws criminalising criticism of King Maha Vajiralongkorn and his family.\n\"The court dismissed the charges against Thaksin, ruling that the evidence presented was insufficient,\" his lawyer Winyat Chatmontree said.\nThaksin left court ahead of his lawyer, smiling and telling the press the case was \"dismissed\", without making any further comment.\nBut his dynasty remains on the ropes, with his daughter Prime Minister Paetongtarn Shinawatra facing her own reckoning next week with a court decision due which may see her thrown out of office.\nThaksin's royal insult case stemmed from decade-old remarks he made in South Korean media relating to the 2014 military coup that overthrew his sister Yingluck.\nThailand has been roiled by a succession of coups, street protests and court orders as Thaksin and his followers tussled for power with the traditional pro-royalist, pro-military elite that sees him as corrupt, nepotistic and a threat to the traditional social order.\nTwice elected prime minister in the early 2000s, Thaksin fled Thailand and lived in self-imposed exile for 15 years after he was ousted in a military coup, finally returning to the kingdom in August 2023.\nHe landed in Bangkok on the same day his family's Pheu Thai party took office at the head of a coalition government backed by their conservative former enemies, fuelling suspicions a backroom deal had been struck.\nOn arrival, Thaksin was immediately sentenced to eight years in prison on graft and abuse of power charges dating back to his time in office.\nBut instead of going to jail, he was whisked to a private room at a police hospital because of health problems.\nDays later, the king cut his sentence to one year, and in February 2024, he was freed as part of an early release scheme for elderly prisoners.\nHis handling has led to another legal case, set to conclude on September 9, arguing that because he never served time in a jail cell, he was not eligible for early release. (AFP)"
    },
    {
      "news_title": "Thaksin acquitted of violating lese majeste law - Thai Newsroom",
      "news_link": "https://thainewsroom.com/2025/08/22/thaksin-acquitted-of-violating-lese-majeste-law/",
      "bias": "unknown",
      "text": "By Thai Rath and Naewna newspapers plus Thai Newsroom Reporters\nTHE RATCHA Criminal Court this morning (Aug. 22) dismissed charges of violating Section 112 of the Criminal Code, better known as the lese majeste law, and Computer Crimes Act of 2017 against de facto Pheu Thai boss Thaksin Shinawatra.\nThe court had earlier cross-examined both defence and plaintiff witnesses in this case with Thaksin’s lawyer, Mr. Winyat Chatimatri, have brought three to testify. Aside for Thaksin who testified on his own behalf the other two were former deputy prime minister Wissanu Krea-ngam and former permanent secretary of the Justice Ministry Thongthong Chandrangsu.\nUpon arriving at Ratchada Criminal Court as scheduled this morning Thaksin waved to the media and Red Shirt supporters while hugging his daughter Ms. Pintongta Shinawatra-Kunakornwong without giving any comment.\nThaksin had reportedly mentioned the monarchy for alleged involvement in the 2014 coup staged by former army chief-turned-prime minister Prayut Chan-o-cha to depose his sister/fugitive prime minister Yingluck Shinawatra from power during an interview with a news agency in Seoul in the following year.\nThose found guilty by court of lese majeste charges may be sentenced to a range of three to 15 years in jail.\nThaksin who had been ousted in the 2006 coup categorically dismissed the lese majeste charges, saying he had never mentioned the monarchy though he had reportedly used the words “palace circle” in relation to the coup during his interview with Chosun Media in the South Korean capital.\nCAPTION:\nDe facto Pheu Thai boss Thaksin Shinawatra arriving at Ratchada Criminal Court this morning, Aug. 22, 2025. All photos: Naewna\nAlso read:\nPaetongtarn urged to keep distance from dad to make decision on her own\nPaetongtarn in court: Body language shows pressure\nPaetongtarn advised to admit making mistake during chitchat with Hun Sen\nPaetongtarn’s refusal to step down means predicted survival in court: Academic\nPaetongtarn urged to step down due to Pheu Thai-led govt’s instability\nThaksin anticipates Paetongtarn’s survival over impeachment bid\nPaetongtarn arrives at Constitutional Court to testify in impeachment case\nPublic urged not to panic after Myanmar quake shakes Bangkok buildings\nProtest in front of Parliament to press for scrapping MOUs 43 and 44"
    },
    {
      "news_title": "Thai court to rule on former PM Thaksin's royal insult case",
      "news_link": "https://alkhaleejtoday.co/international/5855421/Thai-court-to-rule-on-former-PM-Thaksins-royal-insult-case.html",
      "bias": "unknown",
      "text": "We show you our most important and recent visitors news details Thai court to rule on former PM Thaksin's royal insult case in the following article\nHind Al Soulia - Riyadh - BANGKOK – A court in Bangkok is due to rule on a case of lese majeste involving controversial billionaire and former Thai prime minister Thaksin Shinawatra.\nIf found guilty, Thaksin could face up to 15 years in jail. The charge relates to an interview he gave to a South Korean newspaper ten years ago.\nThailand's lese majeste law forbids insulting its monarchy. But critics say it is often used to target activists and political opponents.\nThe verdict comes as Thaksin's daughter, suspended PM Paetongtarn Shinawatra, faces a court case that may see her removed from office. The legal cases have been seen as a big blow to the Shinawatra clan, which has dominated Thai politics for decades.\nThaksin's charge was originally filed by the then-military government in 2016, when he was in exile, and re-activated last year after his return to Thailand.\nAt first glance the case against him seems weak.\nIn the South Korean newspaper interview, the former prime minister said he believed the 2014 military coup which deposed the elected government of his sister Yingluck - just as he had been deposed by a previous coup in 2006 - had been instigated by \"some people in the palace\" and members of the privy council, the 19-member body which advises the Thai king.\nTechnically the privy council is not covered by the lese majeste law, which states that it is an offence to defame only the king, queen, heir to the throne or anyone acting as regent.\nHowever, in recent years the law has been invoked to criminalise any action or statement which might reflect negatively on the monarchy as an institution.\nIn the past people have been prosecuted for making unfavourable comments about the late King Bhumibol's dog and about a Thai king from the 16th Century.\nMore recently, a young woman was sentenced to five years in prison for placing a banner criticising the budget to help those affected by Covid close to a portrait of King Vajiralongkorn.\nThe interpretation of the law has become so broad that human rights groups now view it as a political tool, which can be used to intimidate and silence those who challenge the status quo.\nMany believe this is what is happening to Thaksin.\nThis verdict comes exactly two years after the former prime minister's dramatic return from 15 years of exile.\nAt the time it was assumed there had been a grand bargain struck between Thaksin and his long-time conservative adversaries, so that his party Pheu Thai, which in the 2023 election had been relegated to second place from its usual number one spot, could form a coalition government and keep the young reformists who had actually won the election out of power.\nThe terms of that bargain have never been made public – Thaksin has always insisted there was no deal – but it is likely they included an agreement that he would keep a low profile and stay out of politics.\nBut a low profile is something completely alien to the flamboyant, wealthy and ambitious tycoon.\nHe is still believed to be the largest funder of Pheu Thai and makes all of the main decisions for the party.\nWhen his first choice of prime minister, businessman Srettha Thavisin, was disqualified by the persistently interventionist Constitutional Court a year ago, Thaksin's inexperienced daughter Paetongtarn took the helm, becoming Thailand's youngest ever prime minister.\nA self-described \"daddy's girl\", she said she would happily take his advice. As she took office Thaksin announced his \"Vision for Thailand\", including a controversial proposal to legalise casinos; much of that subsequently became official policy.\nThe parliamentary opposition has accused the Shinawatra family of running a \"dual leadership\". Thaksin's business ties to the Cambodian strongman Hun Sen also raised concerns over how firmly his government would defend Thailand over the border dispute between the two countries.\nThis came to a head in the private phone conversation leaked by Hun Sen in which Paetongtarn was heard referring to him as \"uncle\", and criticising her own army commander on the border, for which she has now been suspended by the Constitutional Court.\nWhat happens to Thaksin in court today, and what happens to his daughter when she faces the final verdict of the Constitutional Court in a week's time, probably depends on what role Thailand's traditional power brokers, close to the palace and the military, believe they should now play.\nLosing another prime minister after just a year, at a time of great global uncertainty, might be judged too risky. Even if he is found guilty Thaksin could stay out of prison on bail while he appeals.\nBut he faces further court cases later this year. And the price for him being allowed to stay out of jail may be that his party calls an early election, at a time when its poor performance in government could result in it losing many of its seats in parliament. – BBC\nThese were the details of the news Thai court to rule on former PM Thaksin's royal insult case for this day. We hope that we have succeeded by giving you the full details and information. To follow all our news, you can subscribe to the alerts system or to one of our different systems to provide you with all that is new.\nIt is also worth noting that the original news has been published and is available at Saudi Gazette and the editorial team at AlKhaleej Today has confirmed it and it has been modified, and it may have been completely transferred or quoted from it and you can read and follow this news from its main source."
    },
    {
      "news_title": "Thailand’s Ex-PM Thaksin Faces Verdict in Royal Insult Case",
      "news_link": "https://laotiantimes.com/2025/08/22/thailands-ex-pm-thaksin-faces-verdict-in-royal-insult-case/",
      "bias": "unknown",
      "text": "AFP – Thailand’s former prime minister Thaksin Shinawatra will learn his fate on Friday in a royal insult case that could see him jailed, as the political dynasty he founded falters after two decades of dominating Thai politics.\nThe 76-year-old faces up to 15 years in prison if the Bangkok court finds him guilty of breaching Thailand’s strict lese-majeste laws that criminalize almost any criticism of King Maha Vajiralongkorn and his family.\nThe verdict, expected from 10:00 am (0300 GMT), comes a week before another court rules whether Thaksin’s daughter, Paetongtarn Shinawatra, will be thrown out of office as prime minister.\nIf both verdicts go against them, it would be a watershed for Thai politics, spelling the end of the family’s time in high office after a 20-year period that has seen three Shinawatra prime ministers.\nThaksin’s royal defamation case stems from remarks he made in an interview with South Korean media in 2015, relating to the 2014 military coup that overthrew his sister Yingluck.\nAFP is not able to report Thaksin’s comments in detail because the lese-majeste law is so strict that doing so could in itself constitute a criminal offence.\n– Years of tussle –\nThaksin, who testified in his own defense last month, has been the defining figure of Thai politics for a quarter of a century.\nThe country has been roiled by a succession of coups, street protests and court orders as Thaksin and his followers tussled for power with the traditional pro-royalist, pro-military elite that sees him as corrupt, nepotistic and a threat to Thailand’s traditional social order.\nTwice elected prime minister in the early 2000s, Thaksin fled Thailand and lived in self-imposed exile for 15 years after he was ousted in a military coup, finally returning to the kingdom in August 2023.\nHe landed in Bangkok on the same day his family’s Pheu Thai party took office at the head of a coalition government backed by their conservative former enemies, fuelling suspicions a backroom deal had been struck.\nOn arrival, Thaksin was immediately sentenced to eight years in prison on graft and abuse of power charges dating back to his time in office.\nBut instead of going to jail, he was whisked to a private room at a police hospital because of health problems.\nDays later, the king cut his sentence to one year, and in February 2024, he was freed as part of an early release scheme for elderly prisoners.\nHis handling has led to another legal case, set to conclude on September 9, arguing that because he never served time in a jail cell, he was not eligible for early release.\n– Rise in prosecutions –\nProsecutions for lese-majeste, known as 112 in Thailand for its section in the criminal code, have increased sharply since anti-government protests in 2020, some of which openly criticized the monarchy.\nThai Lawyers for Human Rights, a group providing legal services in many of the cases, says that more than 280 people have been prosecuted under section 112 in the last five years.\nThe law says anyone who “defames, insults or threatens” the king, queen, heir or regent can face up to 15 years in prison.\nRights groups and critics say the law is now interpreted so broadly as to stifle dissent and legitimate debate."
    }
  ]
}