{
  "story_id": "GN_20250825_220131_2c82092c",
  "metadata": {
    "title": "Israeli data shows 83 percent of Gaza war dead are civilians: Report",
    "timestamp": "2025-08-25T22:01:31.892116",
    "url": "https://ground.news/article/israeli-militarys-own-data-indicates-civilian-death-rate-of-83-in-gaza-war_032e49"
  },
  "bias_distribution": {
    "total_sources": "85",
    "leaning_left": "30",
    "center": "1",
    "leaning_right": "10"
  },
  "perspective_summaries": {
    "left": [
      "A classified Israeli military database shows that 83 percent of Palestinians killed in Gaza are civilians, as reported by The Guardian, +972 Magazine, and Local Call.",
      "The database indicates that military casualties have been identified as 8,900 fighters from Hamas and Palestinian Islamic Jihad, according to the same investigation.",
      "Conflict researchers state that the ratio of civilian deaths is one of the highest in modern warfare, noted in the findings.",
      "The Israeli military did not deny the existence of the intelligence database but disputed the accuracy of the reported figures when questioned."
    ],
    "center": [
      "Figures from a classified Israeli Military Intelligence Directorate database show at least 83% of Palestinians killed were civilians, with Gaza health authorities recording 53,000 deaths by May, the joint investigation found.",
      "Despite public statements asserting lower civilian losses, Israeli government and army spokespeople claimed a 1:1 or 2:1 civilian-to-combatant ratio, but the classified database reveals a much higher civilian share.",
      "Figures in the database show 8,900 named fighters dead or probably dead, with 7,330 certain and 1,570 probable, while Brik said, `They lie non-stop—both the military echelon and the political echelon`.",
      "Rights groups argue the data bolsters genocide claims, while the International Criminal Court has issued arrest warrants for Benjamin Netanyahu and Yoav Gallant over war crimes in Gaza.",
      "Experts note an 83% civilian kill rate in Gaza is exceptionally high, comparable only to Srebrenica, Rwanda, and Mariupol, rising to more than 86 percent if probable deaths are excluded; the IDF's massive ordnance has contributed to staggering civilian fatalities."
    ],
    "right": [
      "Israeli military data shows that 83% of the more than 62,100 Palestinians killed in Gaza since October 2023 are civilians, according to a report by the Guardian and others.",
      "The investigation indicates that only about 8,900 individuals identified as fighters have died, which is 17% of the total death toll.",
      "Therese Pettersson from the Uppsala Conflict Data Program stated that the high civilian death ratio is unusual for modern warfare and has drawn comparisons to notorious conflicts.",
      "An IDF spokesperson contested the report’s figures, claiming they are incorrect and do not represent IDF data."
    ]
  },
  "sources": [
    {
      "news_title": "How 3 outlets distorted Gaza casualty data",
      "news_link": "https://www.israelhayom.com/2025/08/24/how-3-outlets-distorted-gaza-casualty-data/",
      "bias": "Right",
      "text": null
    },
    {
      "news_title": "Netanyahu far outscores Putin and George W. Bush in Killing innocent Civilians, at 83% of the Dead",
      "news_link": "https://www.juancole.com/2025/08/netanyahu-outscores-civilians.html",
      "bias": "Left",
      "text": "Ann Arbor (Informed Comment) – Political Scientist and liberal Zionist Michael Walzer gave an interview early in the Israeli campaign against Gaza in which he said, “It’s not easy for me to say such a thing, but if there were almost 10,000 Hamas fighters among the 30,000 Palestinians killed, it’s not a bad ratio for such a war on urban terrain.”\nBut how about if the ratio was 8,900 to 41,100?\nWalzer had supported the aggressive Israeli war on Egypt in 1967, during which the Israelis first occupied the Palestinian territories that had escaped their grasp in 1948. A proponent of the “just war,” he has always had his thumb on the till for Israeli militarism and expansionism — as indeed have most American political scientists, for reasons I don’t understand. Walzer’s math was incorrect regarding Gaza, as was his genocide denialism.\nIsraeli investigative journalists have gained access to Israeli military records that include best guesses on the number of Hamas militants they have killed versus the number of civilians. It turns out that the civilian kill ratio is 83% to 17% combatants. The true ratio of civilians killed could be even higher, since many civilians are buried under rubble because the Israeli Air Force dropped hundreds of one-ton bombs on inhabited apartment buildings even though there was no clear military target in the vicinity.\nThat is bad, very bad.\nAccording to the UN Office of the High Commissioner for Human Rights, “Since the Russian Federation launched its full-scale invasion of Ukraine, HRMMU has documented the deaths of at least 13,883 civilians, including 726 children, and 35,548 injured, including 2,234 children.”\nAccording to the Center for Strategic and International Studies (CSIS), some 250,000 Russian troops have perished in the war. There are some lower estimates but they are based on passive information-gathering, which always produces underestimates. As for Ukrainian troops, the same report puts their deaths at between 60,000 and 100,000.\nSo let’s say 350,000 military deaths and 13,883 civilian deaths, while admitting up front that civilian casualties may be underestimated because of the fog of war. That would be a civilian ratio to military ratio of deaths of 3.9%.\nAdmittedly this civilian kill ratio is small for modern wars, but actually the Ukraine War and the Gaza campaign are fought with similar weapons — planes, drones, artillery and are contemporary with one another.\nVladimir Putin has been widely denounced by European and American politicians for the deaths he has caused in Ukraine.\nIn contrast, Israeli Prime Minister Benjamin Netanyahu is still feted in Washington and much of Europe, even though he is far more despicable when it comes to treatment of innocent noncombatants like women and children and men who are old or disabled or just not in service.\nIf Putin is a “monster,” as Sen. Amy Klobuchar (D-Minn.) said, what is Netanyahu? Klobuchar doesn’t seem to have a strong opinion on the matter.\n“Gaza 52,” Digital, Dream / Surrealism v3, 2025\nIn the Iraq War, 2003-2011, Iraq Body Count estimated, partly from Pentagon records released by Wikileaks, that US troops were directly responsible for 15,163 violent civilian deaths. They killed on the order of 23,000 Iraqi insurgents. So 65% of those killed by US and coalition troops were enemy combatants, and 35% were civilians.\nWalzer compared Gaza to the 2004 Fallujah campaign, but that was just one battle. If we look at the whole war, there isn’t a comparison.\n83% of the Iraqi dead in direct violence weren’t innocent civilians.\nOf course, tens of thousands more Iraqis died prematurely because of the bad health effects of the war — some public health researchers thought hundreds of thousands. But public health specialists also think two or three hundred thousand Palestinians in Gaza have died or will die because of disease, bad food and water, lack of medical care and so forth, which are caused by Netanyahu. Even on that score, proportionally speaking, the Israeli prime minister is the bigger monster.\nWhether it was George W. Bush, a war criminal who unilaterally invaded another country and left it a basket case till this day, or Vladimir Putin, who unilaterally invaded another country and has wreaked havoc on his victim, neither of them can hold a match to Benjamin Netanyahu. In the game of killing innocent children, women and noncombatant men, Netanyahu is the 21st century champion.\nMoreover, neither Bush nor Putin tried to starve the civilian population into submission, creating famine conditions in the countries they invaded.\nBut the UN has certified that there is now a man-made (read: Israeli-made) famine in Gaza.\nIn the stakes for worst person in the world, Netanyahu wins, hands down.\nAnd yes, it is a genocide."
    },
    {
      "news_title": "Horror: Israeli Intel Database Reveals 83% Killed In Gaza Are Civilians! - The Ron Paul Institute for Peace & Prosperity",
      "news_link": "https://ronpaulinstitute.org/horror-israeli-intel-database-reveals-83-killed-in-gaza-are-civilians/",
      "bias": "Right",
      "text": "A leaked Israeli official database reveals the horrific truth about the genocide in Gaza: Far from a war on Hamas, Israel has declared a war on civilians, killing nearly nine non-combattant for every one militant. Details were revealed in an Israeli news publication and they confirm the greatest fears of those who care about humanity. Also today: in Ukraine, Zelensky and the EU play the “security guarantees” shell game.\nAuthor\n-\nExecutive Director of the Ron Paul Institute for Peace and Prosperity and co-Producer/co-Host, Ron Paul Liberty Report. Daniel served as the foreign affairs, civil liberties, and defense/intel policy advisor to U.S. Congressman Ron Paul, MD (R-Texas) from 2001 until Dr. Paul’s retirement at the end of 2012. From 1993-1999 he worked as a journalist based in Budapest, Hungary, and traveled through the former communist bloc as a human rights monitor and election observer.\nView all posts"
    },
    {
      "news_title": "At Least 83% of Palestinians Killed in Israel’s Gaza Genocide Were Civilians: Israeli Military Data - Quds News Network",
      "news_link": "https://qudsnen.co/at-least-83-of-palestinians-killed-in-israels-gaza-genocide-were-civilians-israeli-military-data/",
      "bias": "Lean Left",
      "text": "At Least 83% of Palestinians Killed in Israel’s Gaza Genocide Were Civilians: Israeli Military Data\nGaza (Quds News Network)- At least 83 percent of Palestinians killed in Israel’s genocide in Gaza were civilians, a new investigation has revealed, citing data from an internal Israeli intelligence database.\nThe investigation by +972 Magazine, Local Call, and the Guardian show that figures obtained from the classified database backs up the findings of several studies suggesting Israel’s bombardment of Gaza has killed civilians.\nThe Israeli military confirmed the existence of the database, which is managed by the Military Intelligence Directorate (known by the Hebrew acronym “Aman”).\nThe database includes a list of 47,653 names of Palestinians in Gaza whom Aman claims to be active in the military wings of Hamas and PIJ, according to sources.\nThe database designates 34,973 of the names as members of Hamas and 12,702 as members of Islamic Jihad. According to the data, which was obtained in May of this year, the Israeli military claimed it had killed around 8,900 resistance group members since October 7.\nThe overall death tolls published daily by the Palestinian Health Ministry (which Local Call revealed last year are considered reliable even by the Israeli military) do not distinguish between civilians and fighters. But taking the fighters casualty figures obtained from the internal Israeli military database in May and lining them up against the Health Ministry’s total death toll, it is possible to calculate an approximate civilian casualty ratio for the war up until three months ago, when the death toll stood at 53,000.\nAssuming that all of the certain and probable fighters were counted in the death toll, that would mean over 83 percent of Palestinians killed in Gaza during the assault were civilians. If the probable killings are discounted and only the certain deaths included, the proportion of civilian deaths rises to more than 86 percent.\nThe Israeli army’s international spokesperson, Jonathan Conricus, told CNN that Israel had killed two civilians for every one fighter — a ratio he described as “tremendously positive.” In May 2024, with the death toll at 35,000, Prime Minister Benjamin Netanyahu asserted that the ratio was in fact closer to 1:1, a claim he repeated in September of the same year.\n+972 and Local Call recently revealed a case in which a battalion stationed in Rafah killed around 100 Palestinians and recorded them all as “terrorists,” yet an officer in the battalion testified that in all but two cases the victims had been unarmed.\n“We are reporting a lot of Hamas operatives killed, but I think most of the people we report as dead are not really Hamas operatives,” an intelligence source who accompanied forces on the ground told +972, Local Call, and the Guardian.\n“People are promoted to the rank of terrorist after their death. If I had listened to the brigade, I would have come to the conclusion that we had killed 200 percent of Hamas operatives in the area.”\nPalestinian analyst Muhammad Shehada told +972, Local Call, and the Guardian that the numbers in the intelligence database line up closely with figures quoted to him by Hamas and PIJ officials: in December 2024, they estimated that Israel had killed around 6,500 of their members, including from the political wing.\nMaj. Gen. (res.) Itzhak Brik, who served for many years as a commander in the Israeli military, said, “They created a measure [whereby] the more you killed, the more you succeeded, and as a result they lied about how many they killed,” describing the numbers presented by the Israeli military Spokesperson as “one of the most serious bluffs” in Israel’s history.\n“They lie non-stop — both the military echelon and the political echelon,” Brik added. “In every raid, the IDF Spokesperson’s announcements said: ‘Hundreds of terrorists were killed,’” he continued. “It’s true that hundreds were killed, but they weren’t terrorists. There is absolutely no connection between the numbers they announce and what is actually happening.”\nWhile speaking to soldiers whose job was to examine and identify the bodies of people the army kills in Gaza, he said they told him: “Everyone the army says it killed, most of them are [civilians]. Period.”"
    },
    {
      "news_title": "Leaked Israeli data shows that 83% of people it's killed in Gaza are civilians",
      "news_link": "https://www.thecanary.co/global/world-analysis/2025/08/22/israel-deaths-gaza/",
      "bias": "Left",
      "text": "Israeli military data suggests 83% of those killed in Gaza are civilians. And conflict data experts say the civilian death rate has only been higher on three occasions. Two of these are the genocides in Bosnia and Rwanda – among the worst crimes in the 20th Century.\nThe investigation led by +972 magazine analysed a secret Israeli intelligence database used to count militant deaths. The figures contradict official Israel claims by a “huge margin”. +972 says Israel usually claims a 1:1 or 2:1 margin of civilians deaths to combatant deaths:\nInstead, the classified data backs up the findings of several studies suggesting Israel’s bombardment of Gaza has killed civilians at a rate with few parallels in modern warfare.\nAuthoritative tally\n+972 said the Israeli military has confirmed the database exists. Insider sources have further confirmed Israeli authorities view the data as accurate:\nMultiple intelligence sources familiar with the database said the army views it as the only authoritative tally of militant casualty figures.\nOne source reportedly said: “There’s no other place to check.”\nReporting from 2023 revealed that the Israeli’s consider 100 civilians deaths an acceptable cost for the death of one senior Hamas commander, for example.\nUnusually high\nThe Uppsala Conflict Data Programme (UCDP) assesses civilian deaths from conflict. A UCDP assessment of the data suggests that 44,100 civilians were killed by Israel, while 8, 900 militant were killed.\nUCDP researcher Therese Pettersson told +972:\nThat proportion of civilians among those killed would be unusually high, particularly as it has been going on for such a long time.\nShe added that it is possible to find similar civilian casualty ratios when singling out a particular city or battle within a broader conflict, but “very rarely” when looking at a war as a whole.\nPettersson said:\nIn global conflicts tracked by UCDP since 1989, civilians made up a greater proportion of the dead only in the genocides in Srebrenica (1992-95) and Rwanda (1994) and during Russia’s three-month siege of Mariupol (2022)…\nMeanwhile, an expert body has declared famine in Gaza City – just as Israeli military is preparing from a new offensive there.\nIsrael’s famine in Gaza City\nThe Integrated Food Security Phase Classification (IPC) is a world-leading authority on food crisis. On Friday, the IPC declared Gaza City was in a state of famine. Numerous agencies have warned that famine was coming in recent months. Some argue Israel is deliberately pushing Gaza into famine.\nIsrael is currently preparing a big military operation to take and hold Gaza City.\nAccording to Associated Press, the IPC requires three specific conditions are met to declare a famine:\nAt least 20% of households have an extreme lack of food, or are essentially starving. At least 30% of children 6 months to 5 years old suffer from acute malnutrition or wasting, meaning they’re too thin for their height. And at least two people, or four children under 5, per 10,000 are dying daily due to starvation or the interaction of malnutrition and disease.\nIsraeli-imposed restrictions make accurate reporting extremely difficult. But the IPC believes the conditions have been met:\nThe data analyzed between July 1 and Aug. 15 showed clear evidence that thresholds for starvation and acute malnutrition have been reached. Gathering data for mortality has been harder, but the IPC said it is reasonable to conclude from the evidence that the necessary threshold has likely been reached.\nAs expected, the Israeli government says famine claims are Hamas propaganda.\nFeatured image via the Canary"
    },
    {
      "news_title": "Israeli military's own data reveals civilian death rate in Gaza is 83 per cent",
      "news_link": "https://www.thenational.scot/news/25410173.idfs-data-reveals-civilian-death-rate-gaza-83-per-cent/",
      "bias": "Lean Left",
      "text": "THE Israeli military’s own data has indicated that five out of six Palestinians killed in Gaza have been civilians\nThat ratio of civilians to combatants slaughtered is extremely high for modern warfare, even compared with the Syrian and Sudanese civil wars – which were known for indiscriminate killing.\nFigures from a classified Israeli database – according to an investigation by The Guardian, Israeli-Palestinian publication 972 Magazine and Israeli outlet Local Call – listed 8900 named fighters from Hamas and Palestinian Islamic Jihad as dead or “probably dead” in May.\nREAD MORE: Hundreds of Edinburgh Airport workers to take strike action\nAt that time, 53,000 Palestinians had been killed by Israeli attacks, according to health authorities in Gaza.\nThat ratio would lead to a civilian to combatant ratio of 83% to 17%.\nIn global conflicts tracked by the Uppsala Conflict Data Program since 1989, civilians made up a greater proportion of the dead only in the Srebrenica genocide, the Russian siege of Mariupol and the Rwandan genocide.\nThe Israeli military did not dispute the existence of the database or dispute the data on Hamas and PIJ deaths when approached for comment by Local Call and +972 Magazine.\nWhen the Guardian asked for comment on the same data, a spokesperson said “figures presented in the article are incorrect” and “do not reflect the data available in the IDF’s systems”.\nIt comes as the world’s leading authority on food crises has said the Gaza Strip’s largest city is gripped by famine, and that it is likely to spread across the territory without a ceasefire and an end to restrictions on humanitarian aid.\nThe Integrated Food Security Phase Classification (IPC) said famine is occurring in Gaza City, home to hundreds of thousands of Palestinians, and that it could spread south to Deir al-Balah and Khan Younis by the end of next month.\nThe IPC determination comes after months of warnings by aid groups that Israel’s restrictions of food and other aid into Gaza, and its ongoing genocide, were causing high levels of starvation among Palestinian civilians, particularly children."
    },
    {
      "news_title": "There's a shocking new report on civilian deaths in Gaza. If only it were accurate",
      "news_link": "https://forward.com/opinion/763918/gaza-civilian-deaths-guardian-report-idf-gaza/",
      "bias": "Lean Left",
      "text": "There’s a shocking new report on civilian deaths in Gaza. If only it were accurate.\nWhy bombshell claims may not tell the whole story about military versus civilian deaths\nWhen it comes to Gaza, the dead are a battlefield.\nThat’s what I took away from a bombshell joint investigation between The Guardian and +972 Magazine that dropped Thursday, beneath the headline, “Revealed: Israeli military’s own data indicates civilian death rate of 83% in Gaza war.”\nIt’s a shocking number — if it’s accurate. There is no normal standard for civilian deaths in war, especially the type of close-quarter urban war Israel has been fighting in Gaza since the Hamas attack of Oct. 7, 2023. But international humanitarian law requires armies to minimize civilian harm, something Israel has repeatedly claimed it is doing.\nIf the headlines are true, they will be claimed as a victory by the vocal anti-Israel camp. An 83% civilian death rate would put Israel’s Gaza incursion in miserable company among modern conflicts, just below the 1994 Rwandan massacre (99.4%), Russia’s 2022 decimation of Mariupol (95%) and the Serbian slaughter in Srebrenica in the early 1990s, whose civilian death rate was 92%. On the other hand, if the headlines are deceptive — unjustly accusing the Jewish state of a wanton level of human destruction far out of proportion to normal combat — pro-Israel voices will point to them as yet more evidence that the world is intolerably biased against the Jewish state.\nSo is the claim accurate? That’s highly questionable. And in the confusion lies one of the many sad facts of this conflict: Misleading, oversimplified headlines are further deepening societal divides.\nThe IDF’s own database lists the names of 8,900 Hamas fighters it has killed in the course of war — the central fact in the new investigation. From that number, the authors conclude that out of the 53,000 Gazans who, according to the Hamas-run Gaza Health Ministry, had been killed as of May, the remaining 44,100 souls must all have been innocent civilians.\nBut the IDF is not claiming those 8,900 fighters are the only fighters it’s killed. Nor is it logical to assume that the IDF has the names of every possible member of Hamas, Palestine Islamic Jihad, or other militant groups in Gaza — or that none of the dead were worthy military targets, whether they were in Hamas uniform or not.\nHow do I know that? Because +972 Magazine says so — very far down in its story. Citing an Israeli intelligence source, it says the IDF’s database does not include people “who were killed but could not be identified by name, Gazans who took part in fighting but were not officially members of Hamas or PIJ, nor political figures in Hamas such as mayors and government ministers whom Israel also considers legitimate targets (in violation of international law).”\nIn other words, there may be many more legitimate non-civilian deaths, perhaps closer to the 17,000-20,000 that Israel has claimed.\nThat’s why, when I read The Guardian’s headline a second time, one word jumped out: indicates. The data doesn’t prove anything. It merely points to a possibility.\nOf course, there could conceivably also be more civilian deaths. A review of casualty numbers by the medical journal The Lancet in January said that the death toll might be as much as 40% higher than the estimate provided by the Health Ministry. And most parties agree that many bodies remain buried under Gaza’s rubble.\nAdditionally, it may come to light that many of the dead whom Israel claimed were fighters were, in fact, not. During an investigation into the killing of civilians at aid sites in Gaza last June, a senior IDF reserve officer told Haaretz, “We are constantly told there are no noncombatants in Gaza.”\nFor its part, Hamas does not separate civilian deaths from combat deaths — a chilling reminder of what Yahya Sinwar, the late Hamas commander who led the Oct. 7 massacre, meant when he told operatives that civilian deaths were “necessary sacrifices.”\nIt’s also a reminder that neither Hamas nor the IDF are particularly reliable narrators when it comes to the facts of this conflict. To take one example, the IDF, which has not released information on how it arrived at its casualty figures, claimed in January 2025 that Hamas had up to 25,000 fighters in Gaza — the same number it said Hamas had at the start of the war. “The numbers do not come close to adding up,” wrote The Jerusalem Post.\nThe IDF has since addressed the discrepancy by claiming its initial estimate was wrong — by 100%. Sure.\nSo here’s the real truth: We don’t know the actual facts yet. And while we wait for them, consider this:\nThe horrors stacking up in Gaza predispose some people to believe the worst. And there are horrors. Ehud Olmert, Israel’s former prime minister, said his own government may be committing war crimes. When this war stops, and journalists and medical specialists enter the strip, the numbers of dead and wounded, and the human stories of pain and loss behind them, will force a moral reckoning on those uncritical of how the Israeli government has conducted the war — and those who lionize Hamas’ violent “resistance,” which started it.\nAnd let’s be clear, there are Israel supporters and apologists for whom there is no red line, no number of civilian casualties they couldn’t accept or explain. Some of them, as they themselves have made clear, sit in the prime minister’s cabinet.\nBut there are also Israel critics for whom facts simply do not matter. The historian Ilan Pappe, for example, accused Israel of genocide in Gaza in 2010, when the strip’s population was 1.5 million. It is now 2 million, with a population growth rate, at least until the war, of 2.5 times the international average. The intellectual hollowness of these critics does the truth no favor. The worse the headline, the more credence they give it.\nSomeone who cares about the lives of innocents on both sides, and who believes that both must one day find a way to thrive together on the same patch of earth, honors the dead not by manipulating their numbers, but rather by working to bring all the killing to an end."
    },
    {
      "news_title": "22 August 2025: 'Israeli data reveals 83% of Gaza war deaths are civilians' and other world headlines",
      "news_link": "https://www.thesouthafrican.com/news/newspapers-front-page-22-august-2025-israeli-data-reveals-83-of-gaza-war-deaths-are-civilians-and-other-world-headlines/",
      "bias": "Lean Left",
      "text": "22 August 2025: ‘Israeli data reveals 83% of Gaza war deaths are civilians’ and other world headlines\nHere are all the stories that made the headlines on front pages of newspapers worldwide on Friday, 22 August 2025. Have a read…\nHere are the stories that made headlines on the front pages of newspapers worldwide on Friday, 22 August 2025.\nThe New York Times’ front page reported that a New York court rejected a $500 million judgment in Trump’s fraud case.\nThe Washington Post reported that Trump’s $500 million penalty was voided.\nThe Jerusalem Post’s front page reported that Netanyahu approved the IDF’s strategy for Gaza City.\nChina Daily’s front page reported that 60 years of progress had been marked.\nThe Daily Mail’s front page reported that a record 111 000 asylum claims were filed in Labour’s first year in power – 8 000 more than the previous high, according to new data.\nThe Guardian’s front page reported that 83% of Gaza war deaths are civilians, according to Israeli data.\nREMEMBER\nIf you wish to stay up-to-date – for FREE – on the latest international and South African news, then bookmark The South African website for all that plus the latest in the world of finance, sport, lifestyle – and more.\nDid we mention it was 100% free to read …?\nIsraeli data now indicates that a staggering 83% of those killed in the Gaza war are civilians. What are your thoughts on this revelation?\nLet us know by leaving a comment below, or send a WhatsApp to 060 011 021 1\nSubscribe to The South African website’s newsletters and follow us on WhatsApp, Facebook, X and Bluesky for the latest news."
    },
    {
      "news_title": "Israeli army data reveals 83% civilian death rate in Gaza",
      "news_link": "https://english.almayadeen.net/news/politics/israeli-army-data-reveals-83--civilian-death-rate-in-gaza",
      "bias": "Left",
      "text": "Israeli army data reveals 83% civilian death rate in Gaza\nLeaked IOF database shows 83% of Palestinians killed in the Israeli war on Gaza are civilians, exposing the immense human toll of the ongoing genocide.\nOf the Palestinians killed by Israeli forces in Gaza, five out of every six have been civilians, according to leaked statistics from the Israeli occupation forces' data, revealing the extent of the slaughter perpetrated in the besieged enclave.\nA joint investigation by the Guardian, the Israeli publication +972 Magazine, and the Hebrew-language outlet Local Call has found that, as of May and 19 months into the war, Israeli intelligence officials listed 8,900 named fighters from Hamas and Palestinian Islamic Jihad as dead or “probably dead.\"\nIn May, 53,000 Palestinian civilians had been killed by \"Israel\" according to the Gaza Ministry of Health, a toll that includes both resistance fighters and civilians, meaning that the 8,900 named fighters in the IOF's databases constitute only 17% of the total death toll, while civilians cover the remaining 83%.\nThis apparent ratio of civilians to combatants among the dead is extremely high for modern warfare and remains so even when compared to conflicts notorious for indiscriminate killing, such as the Syrian war and the Sudanese civil war.\nTherése Pettersson from the Uppsala Conflict Data Program, which tracks civilian casualties worldwide stated, “That proportion of civilians among those killed would be unusually high, particularly as it has been going on for such a long time,” adding that, “If you single out a particular city or battle in another conflict, you could find similar rates, but very rarely overall.\"\nIsraeli military scrambles to respond\nWhen approached for comment by Local Call and +972 Magazine, the Israeli occupation forces did not dispute the existence of the database or the data on Hamas and PIJ deaths, and when The Guardian requested a statement on the same information, a spokesperson stated they had decided to “rephrase” their response.\nIn a brief statement sent to The Guardian, the Israeli occupation forces said that the \"figures presented in the article are incorrect\" without specifying which data was disputed and added that the numbers \"do not reflect the data available in the IOF’s systems\" without detailing which systems.\nAccording to the IOF, the database names 47,653 Palestinians counted as fighters active in both Hamas and the Palestinian Islamic Jihad, based on alleged internal documents seized in Gaza, which The Guardian could not view or verify.\nMultiple intelligence sources familiar with the database told The Guardian that the military viewed it as the only authoritative tally of fighter casualties. While Israeli politicians regularly dismiss the Gaza health ministry's numbers as propaganda, the Israeli army also considers its toll reliable, according to a report by Local Call, revealing that the former head of its military intelligence division recently appeared to cite it.\nEven though much of Gaza has been reduced to ruins and tens of thousands of people have been killed, the classified database, according to the army's assessment, lists nearly 40,000 individuals who are considered fighters and are still alive."
    },
    {
      "news_title": "Israel's Data Reveals 83% Civilian Kill Rate in Gaza Genocide - National File",
      "news_link": "https://nationalfile.com/gaza-civilian-deaths-genocide-08-21-2025/",
      "bias": "Far Right",
      "text": "The Netanyahu regime’s own classified data exposes a horrifying truth: five out of six Palestinians killed in Gaza are civilians, a genocidal death toll that shames Israel and demands global condemnation.\nThis damning evidence, uncovered in a joint investigation, unmasks the evil of Israel’s war machine, now grinding through its 19th month of relentless carnage.\nWhy it matters: The staggering civilian slaughter—83% of the dead—lays bare Israel’s defiance of international law, committing what scholars, activists, and even Israeli critics call genocide. This bloodbath, fueled by the Netanyahu government’s barbaric policies, devastates Gaza’s 2.3 million people, fuels starvation, and obliterates hope, while the world’s silence implicates us all.\nDriving the news: A classified Israeli military database, pried open by The Guardian, +972 Magazine, and Local Call, reveals only 8,900 named Hamas and Palestinian Islamic Jihad fighters were killed by May 2025, against Gaza’s health ministry count of 53,000 total deaths. This 83% civilian kill rate is a moral atrocity, dwarfing even the horrors of Syria’s civil war or Russia’s siege of Mariupol. Netanyahu’s propagandists falsely claim 20,000 militants dead or a 1:1 civilian-to-combatant ratio, but their own data betrays them, exposing a campaign that brands dead civilians as “terrorists” to justify the massacre.\n- The database, built from seized Hamas and PIJ documents, lists 47,653 active militants, with nearly 40,000 still alive, showing Israel’s war hasn’t dented resistance but excels at civilian slaughter.\n- Gaza’s health ministry toll, trusted even by Israeli intelligence, likely undercounts the dead, ignoring thousands buried under rubble from Israel’s indiscriminate bombings.\n- Since May, Israel’s bloodlust has intensified, with hundreds killed at food distribution sites and a new ground assault looming in northern Gaza, promising more civilian agony.\nCatch up quick: Sparked by Hamas’s October 7, 2023, attack killing 1,200 Israelis, Netanyahu’s genocidal response has razed Gaza, displaced over 90% of its people, and pushed the death toll past 62,000 by August 2025. Starvation, disease, and ruin define Israel’s legacy, a deliberate campaign to erase Palestinian life under the guise of “self-defense.”\nThe intrigue: Despite slaughtering tens of thousands, Israel’s own data shows nearly 40,000 militants remain active, proving Netanyahu’s war is a futile, sadistic exercise in civilian extermination, not a fight against Hamas. This chilling reality suggests Israel’s true aim is ethnic cleansing and territorial domination.\nBetween the lines: Israel’s AI-driven targeting, greenlighting strikes on low-level fighters with zero regard for civilian lives, fuels this genocide, as earlier exposés confirm. Netanyahu’s henchmen, spewing vile rhetoric about killing 50 Palestinians for every Israeli death, reveal a deliberate policy of mass murder, not collateral damage. This mirrors the “new wars” of Sudan and Yemen, where civilians are the target, and Israel’s evasive denials of its own data scream guilt in the face of global outrage.\nWhat they’re saying:\n- “Yesterday, Netanyahu said there was almost a 1-1 ratio of hamas to civillian kill ratio on the Triggernometry pod… Within 48 hours Netanyahu was debunked with his own nation’s stats. All Israel does is lie,” said Myron Gaines, in a post amplifying the report.\n- “That proportion of civilians among those killed would be unusually high, particularly as it has been going on for such a long time,” Therése Pettersson of the Uppsala Conflict Data Program told The Guardian, underscoring the depravity of Israel’s kill ratio.\n- “There is absolutely no connection between the numbers that are announced and what is actually happening. It is just one big bluff,” Itzhak Brik, a retired Israeli general who advised Netanyahu, confirmed soldiers know most victims are innocent civilians.\n- An IDF spokesperson lamely called the data “incorrect” without proof, a cowardly dodge reported by The Guardian, as Netanyahu’s regime scrambles to hide its crimes.\nThe bottom line: Israel’s own numbers confirm a genocide, strengthening cases at international courts and demanding the world—especially the US—cut ties with Netanyahu’s evil regime. As Israel prepares to unleash more death in Gaza City, we stand against this monstrous government, urging immediate ceasefires and justice to stop the annihilation of a people."
    },
    {
      "news_title": "IDF Data Shows that 83% of victims are civilians.",
      "news_link": "https://www.dailykos.com/stories/2025/8/21/2339519/-IDF-Data-Shows-that-83-of-victims-are-civilians",
      "bias": "Left",
      "text": null
    },
    {
      "news_title": "Israeli data shows 83 percent of Gaza war dead are civilians: Report",
      "news_link": "https://www.aljazeera.com/news/2025/8/21/israeli-data-shows-83-percent-of-gaza-war-dead-are-civilians-report",
      "bias": "Lean Left",
      "text": "Israeli data shows 83 percent of Gaza war dead are civilians: Report\nLeaked Israeli intelligence confirms one of the highest civilian tolls in modern conflicts.\nA classified Israeli military database shows the vast majority of Palestinians killed in Gaza are civilians, according to a joint investigation by The Guardian, +972 Magazine, and Local Call.\nFigures reviewed by the outlets revealed on Thursday indicate that, as of May 2025 – 19 months into Israel’s war on Gaza – Israeli military intelligence had listed 8,900 fighters from Hamas and Palestinian Islamic Jihad (PIJ) as confirmed or “probably” dead.\nRecommended Stories\nlist of 3 itemsWhat happens in Gaza is “an issue for every business, everywhere”\nWhat’s behind Israel’s ground push into Gaza City?\nOver the same period, Gaza’s health authorities recorded at least 53,000 deaths from Israeli attacks, meaning that named fighters accounted for just 17 percent of those killed, with civilians at about about 83 percent of the total death toll.\nConflict researchers say that ratio is almost unparalleled in modern warfare. Only the Rwandan genocide, the 1995 Srebrenica massacre, and Russia’s 2022 siege of Mariupol recorded a higher civilian death rate, the authors noted.\nRights groups and genocide scholars argue the findings further support claims that Israel is committing genocide in Gaza, pointing to mass civilian deaths alongside deliberate starvation.\nWhen asked to comment by The Guardian, +972 Magazine, and Local Call, the Israeli military did not deny the existence of the intelligence database or the listed figures for Hamas and PIJ casualties.\nInstead, a spokesperson said “figures presented in the article are incorrect”, but did not clarify which numbers were disputed. The statement also claimed the data does “not reflect the data available in the [Israeli military’s] systems”, without explaining what those systems contained.\nIsraeli politicians and military leaders have long inflated fighter death tolls, at times claiming as many as 20,000 fighters killed or insisting on a civilian-to-combatant ratio of 1:1 – figures that the report notes they do not believe in private.\nMeanwhile, Israeli rhetoric has increasingly mirrored genocidal language.\nIn leaked audio recordings aired on Israel’s Channel 12, Aharon Haliva, the former head of military intelligence, claimed, “The fact that there are already 50,000 dead in Gaza is necessary and required for future generations.”\nHe went further, saying: “For each [victim] on 7 October, 50 Palestinians have to die … There’s no choice, they need a Nakba every now and then to feel the consequences.” The Nakba, or “catastrophe”, refers to the killing and ethnic cleansing of Palestinians in 1948 to make way for the creation of Israel.\nBy March, Gaza’s death toll had reached 50,000; it has since risen to beyond 62,000, according to the enclave’s health ministry. The total number of wounded has now exceeded 157,000.\nThe International Criminal Court has issued arrest warrants for Israeli Prime Minister Benjamin Netanyahu and his former Defence Minister Yoav Gallant, accusing them of war crimes and crimes against humanity committed between October 2023 and May 2024."
    },
    {
      "news_title": "Gaza civilian death toll could be as high as 83%: Israeli data",
      "news_link": "https://www.arabnews.com/node/2612591/middle-east",
      "bias": "Lean Right",
      "text": "LONDON: As many as 83 percent of Palestinian casualties in Gaza could be civilians, classified Israeli data suggests.\nA joint investigation by The Guardian, Hebrew-language Local Call and the Israeli-Palestinian +972 Magazine found that Israeli officials had been able to name 8,900 people killed or “probably dead” in Gaza as members of Hamas and Islamic Jihad as of May this year.\nAt the time, the total death toll from the war was believed to be at least 53,000 people according to local authorities, meaning that just 17 percent of those identified were combatants.\nThe database used to assess combatant casualty figures is based on documents seized by the Israeli military in Gaza.\nIn total, 47,653 Palestinians are identified as being members of Hamas or Islamic Jihad, meaning that a little under 40,000 are believed to be still alive\nThe Israeli military also believes Gaza’s health authorities’ data on casualties to be reliable, Local Call reported, though these figures are likely to be an underestimate as thousands of people remain buried under rubble, and only bodies positively identified are counted.\nTherese Pettersson of the Uppsala Conflict Data Program told The Guardian: “That proportion of civilians among those killed would be unusually high, particularly as it has been going on for such a long time.\n“If you single out a particular city or battle in another conflict, you could find similar rates, but very rarely overall.”\nShe added that since 1989, UCDP had only identified the siege of Srebrenica, the Rwandan genocide and the 2022 siege of Mariupol as conflicts that saw civilian casualties outnumber combatants.\nPreviously, Israeli politicians have cited a far more balanced casualty rate, with some suggesting it could even be equal between combatants and civilians. Others have suggested in the past that 20,000 people killed in Gaza were militants.\nThis could be on account of collating members of the enclave’s civilian infrastructure or people with loose ties to fighters — such as police and politicians — with membership of militant groups, but it is also believed that civilians without ties to Islamic Jihad or Hamas are included in those tallies.\nOne source who spent time with the Israeli military in Gaza told The Guardian that “people are promoted to the rank of terrorist after their death,” adding: “If I had listened to the brigade, I would have come to the conclusion that we had killed 200 percent of Hamas operatives in the area.”\nRetired Gen. Itzhak Brik, a former commander of Israel’s military colleges, told The Guardian that he had been told by former colleagues the numbers were inflated.\n“There is absolutely no connection between the numbers that are announced and what is actually happening,” he said. “It is just one big bluff.”\nPalestinian analyst Muhammad Shehada told the newspaper that by last December, the number of dead Hamas and Islamic Jihad members from their own data was around 6,500.\n“Israel expands the boundaries so they can define every single person in Gaza as Hamas,” he said. “All of it is killing in the moment for tactical purposes that have nothing to do with extinguishing a threat.”\nMoreover, the number of dead, and the disparity between civilian and combatant deaths, may have increased since May, with hunger now believed to be widespread due to a lack of food in Gaza, and an increase in the number of civilian deaths at aid distribution sites in the enclave.\nThe impending Israeli ground offensive in the north of Gaza will likely further widen this gap. So far, in excess of 62,000 people are believed to have been killed in the enclave.\nMary Kaldor, professor of global governance at the London School of Economics, said the nature of the Gaza conflict is also causing a disproportionate number of civilian casualties.\n“In Gaza we are talking about a campaign of targeted assassinations, really, rather than battles, and they are carried out with no concern for civilians,” she added.\nComparing Gaza to recent conflicts in Syria, Yemen and Sudan, she said: “These are wars where the armed groups tend to avoid battle. They don’t want to fight each other, they want to control territory and they do that by killing civilians.\n“Maybe that is the same with Israel, and this is a model of war (in Gaza) that is about dominating a population and controlling land. Maybe the objective always was forced displacement.”\nNeta Crawford, professor of international relations at Oxford University, said tactics used by Israel mark a “worrisome” departure from previously established norms to protect civilians.\n“They say they’re using the same kinds of procedures for civilian casualty estimation and mitigation as states like the United States. But if you look at these casualty rates, and their practices with the bombing and the destruction of civilian infrastructure, it is clear that they are not,” she said.\nIn a statement to The Guardian, the Israeli military said the figures published in the investigation “are incorrect.”"
    },
    {
      "news_title": "Classified Israeli military data reveals 83% civilian death rate in Gaza",
      "news_link": "https://www.middleeastmonitor.com/20250821-classified-israeli-military-data-reveals-83-civilian-death-rate-in-gaza/",
      "bias": "Left",
      "text": null
    },
    {
      "news_title": "Classified IDF Intel Reveals 83% of Palestinians Killed in Gaza Are Civilians",
      "news_link": "https://www.commondreams.org/news/civilian-deaths-in-gaza-2673907835",
      "bias": "Left",
      "text": "An investigation published Thursday belied Israeli government claims of a historically low civilian-to-combatant kill ratio in Gaza, as classified Israel Defense Forces intelligence data revealed that 5 in 6 Palestinians killed by the IDF through the first 19 months of the US-backed war were, in fact, civilians.\nA joint investigation by Israeli journalist and filmmaker Yuval Abraham of +972 Magazine and Local Call and Guardian senior international affairs correspondent Emma Graham-Harrison revealed that, as of May, the Military Intelligence Directorate identified by name 8,900 fighters from Hamas—which led the October 7, 2023 attack—and Palestinian Islamic Jihad as \"dead\" or \"probably dead.\"\nAt that time, the official Palestinian death toll in Gaza stood at 52,928, with the Gaza Health Ministry not differentiating between civilians and militants. Israeli officials and independent peer-reviewed studies have either concurred with the ministry's figures or called them an undercount.\nThe classified IDF data obtained by Abraham and Graham-Harrison show that at least 83% of Palestinians killed by Israeli forces through May were civilians, what Graham-Harrison called \"an extreme rate of slaughter rarely matched in recent decades of warfare... even compared with conflicts notorious for indiscriminate killing, including the Syrian and Sudanese civil wars.\"\nAccording to the Uppsala Conflict Data Program at Uppsala University in Sweden, the 83% civilian kill rate in Gaza is far higher than in Bosnia in 1992-95 (57%), the Syrian civil war of 2012-24 (29-34%), the ongoing Russian invasion of Ukraine (10-22%), or the US-led war in Afghanistan of 2001-21 (8-12%).\nOne unnamed intelligence source who was in Gaza told Abraham and Graham-Harrison: \"People are promoted to the rank of terrorist after their death. If I had listened to the brigade, I would have come to the conclusion that we had killed 200% of Hamas operatives in the area.\"\nIn one case, +972 Magazine and Local Call revealed how one IDF battalion stationed in Rafah killed around 100 Palestinians and labeled them all as \"terrorists.\" However, an officer from the unit later testified that all but two of the victims were unarmed.\nThe new investigation adds to the body of research showing that Israel's assault and siege on Gaza—which is the subject of an ongoing International Court of Justice (ICJ) genocide case filed by South Africa—has, as Abraham put it, \"killed civilians at a rate with few parallels in modern warfare.\"\nThese studies destroy claims by Israeli Prime Minister Benjamin Netanyahu—who is wanted by the International Criminal Court for alleged crimes against humanity and war crimes including murder and forced starvation—and members of his government of historically low civilian death rates in Gaza.\n\"Israel is setting the new gold standard for urban warfare with what appears to be the lowest civilian-to-combatant casualty ratio in history,\" Israeli government spokesperson Avi Hyman claimed in May 2024.\nIsrael's supporters around the world have parroted this false claim. John Spencer, chair of urban warfare studies at the US Military Academy at West Point, said in January that \"Israel's civilian-to-combatant ratio is still historically low,\" and that \"Israel has done more and implemented more measures to prevent civilian harm than any military in the history of urban warfare.\"\nHowever, the facts show a very different reality. Retired IDF Gen. Itzhak Brik told Abraham and Graham-Harrison that \"there is absolutely no connection between the numbers that are announced and what is actually happening. It is just one big bluff.\"\n\"They lie non-stop—both the military echelon and the political echelon,\" Brik said. \"In every raid, the IDF spokesperson's announcements said: 'Hundreds of terrorists were killed.' It's true that hundreds were killed, but they weren't terrorists.\"\nFollowing the October 7 attack, the IDF dramatically loosened its rules of engagement, effectively allowing an unlimited number of civilians to be killed when targeting a single Hamas member, no matter how low-ranking. Numerous massacres ensued, including the October 31, 2023 killing of more than 120 civilians in a single IDF bombing targeting one Hamas member in the Jabalia refugee camp.\nThe IDF's use of massive ordnance, including US-supplied 1,000- and 2,000-pound \"bunker buster\" bombs capable of leveling entire city blocks,w and utilization of artificial intelligence to select targets has resulted in staggering numbers of civilian deaths. United Nations human rights officials have said that Israel's use of 2,000-pound bombs likely violates international law by deliberately targeting civilians in disproportionate attacks.\nThe indiscriminate slaughter is also taking place on the ground, where volunteer American surgeons have described treating—or sending to morgues—young children who appeared to be deliberately shot in the chest and head by IDF snipers. More recently, IDF whistleblowers said they were ordered to shoot or launch artillery shells into crowds of starving Palestinian civilians at aid distribution points run by the US-based Gaza Humanitarian Foundation.\nResponding to the new investigation, the IDF confirmed the existence of the Military Intelligence Directorate database, but claimed that \"figures presented in the article are incorrect,\" without further explanation.\nHowever, in a recording published last week, Aharon Haliva—a former IDF general who was in charge of intelligence operations on and after the October 7 attack—is heard approvingly accepting the official Gaza Health Ministry death toll at the time.\n\"The fact that there are already 50,000 dead in Gaza is necessary and required for future generations,\" Haliva said. \"It doesn't matter now if they are children.\"\nSimilar statements by Israeli officials are a key component of South Africa's ICJ case, where applicants must prove intent to commit genocide under Article II of the Genocide Convention.\nThe most recent Gaza Health Ministry figures show that Israel's 685-day assault and siege on Gaza have left at least 62,122 Palestinians dead—most of them women and children—and more than 156,700 others wounded, with thousands more missing and presumed dead and buried beneath rubble. At least 271 Palestinians, including 112 children, have starved to death.\nThe dire situation for civilians in Gaza could be about to deteriorate even further as Israel intensifies Operation Gideon's Chariots II, which aims to conquer, occupy, and ethnically cleanse Palestinians in numbers exceeding even the Nakba, or \"catastrophe,\" during which more than 750,000 Arabs were forcibly expelled, sometimes via massacre and death march, during the establishment of Israel in 1948.\nIsraeli officials have repeatedly indicated that they would approve of such an annihilation, with Haliva asserted that Palestinians \"need a Nakba every now and then to feel the price\" of resisting more than a century of dispossession and displacement."
    },
    {
      "news_title": "83% of those killed in Gaza civilians: Classified Israeli military data",
      "news_link": "https://www.dailysabah.com/world/mid-east/83-of-those-killed-in-gaza-civilians-classified-israeli-military-data",
      "bias": "Right",
      "text": "Five out of six Palestinians killed by Israeli forces in Gaza – about 83% – are civilians, according to new classified data by the Israeli military.\nFigures from a classified Israeli army database listed some 8,900 named fighters as dead or probably dead as of May this year, with the overall death toll since October 2023 reaching 53,000 at that time, a joint investigation by the Guardian, Israeli-Palestinian publication +972 Magazine, and the Hebrew-language outlet Local Call has found.\nThe data showed fighters named in the Israeli military intelligence database accounted for just 17% of the total, which indicates that 83% of the dead were civilians.\nThe investigation indicated that the apparent ratio of civilians to combatants among the dead is \"extremely high for modern warfare,\" even compared with conflicts notorious for indiscriminate killing, including the Syrian and Sudanese civil wars.\n\"That proportion of civilians among those killed would be unusually high, particularly as it has been going on for such a long time,” said Therese Pettersson from the Uppsala Conflict Data Program (UCDP), which tracks civilian casualties worldwide.\n\"If you single out a particular city or battle in another conflict, you could find similar rates, but very rarely overall,\" she said.\nIn global conflicts tracked by UCDP since 1989, civilians made up a greater proportion of the dead only in Srebrenica, the Rwandan genocide, and during the Russian siege of Mariupol in 2022, according to Pettersson.\nThe Israeli military did not dispute the existence of the database or dispute the data on Hamas and Islamic Jihad deaths when approached for comment by Local Call and +972 Magazine.\nWhen the Guardian asked for comment on the same data, a spokesperson said they had decided to \"rephrase\" their response.\nThe Guardian reported that a brief statement sent to them did not directly address questions about the military intelligence database.\nIt said \"figures presented in the article are incorrect,\" without specifying which data the Israeli military disputed.\nThe statement also said the numbers \"do not reflect the data available in the IDF’s (Israel Defense Forces) systems,\" without detailing which systems.\nAccording to an intelligence source who accompanied forces on the ground, \"people are promoted to the rank of terrorist after their death.\"\n\"If I had listened to the brigade, I would have come to the conclusion that we had killed 200% of Hamas operatives in the area,\" said the source.\nMeanwhile, Itzhak Brik, a retired general, said serving Israeli soldiers were aware that politicians exaggerated the death of Hamas members.\nBrik advised Prime Minister Benjamin Netanyahu at the start of the war and is now among his most strident critics.\n\"There is absolutely no connection between the numbers that are announced and what is actually happening. It is just one big bluff,\" he said.\nIsrael has killed more than 62,100 Palestinians in Gaza since October 2023. The genocidal attacks have devastated the blockaded Palestinian enclave, which is facing famine.\nLast November, the International Criminal Court issued arrest warrants for Netanyahu and his former Defense Minister Yoav Gallant for war crimes and crimes against humanity in Gaza.\nIsrael also faces a genocide case at the International Court of Justice for its war on the enclave."
    },
    {
      "news_title": "Leaked Israeli data shows civilians make up 83 percent of Palestinians killed in Gaza",
      "news_link": "https://thecradle.co/articles-id/32690",
      "bias": "Left",
      "text": null
    },
    {
      "news_title": "Israeli military’s own data suggests 83 percent of Gaza killings are of civilians",
      "news_link": "https://www.middleeasteye.net/news/israeli-militarys-own-data-suggests-83-percent-gaza-killings-are-civilians",
      "bias": "Left",
      "text": "Israeli military’s own data suggests 83 percent of Gaza killings are of civilians\nIsraeli military intelligence data indicates that five out of six Palestinians killed by Israel's army are civilians, according to a joint investigation.\nA report published by +972 Magazine, its Hebrew-language sister outlet Local Call and the Guardian found that as of May this year, a classified Israeli military intelligence database listed 8,900 named Hamas and Palestinian Islamic Jihad (PIJ) fighters as dead or “probably dead”.\nAt that time, the number of Palestinians killed by Israeli forces was around 53,000, according to the Gaza health ministry.\nThat would indicate that 17 percent of the total deaths were of fighters, while the other 83 percent were civilian deaths.\nWhen asked about these figures by +972 Magazine and Local Call, the Israeli military did not dispute the existence of such a database, or the number of Hamas and PIJ deaths.\nNew MEE newsletter: Jerusalem Dispatch\nSign up to get the latest insights and analysis on Israel-Palestine, alongside Turkey Unpacked and other MEE newsletters\nHowever, when later approached by the Guardian on the same data, a spokesperson said the military had opted to “rephrase” its response.\nThe spokesperson said “figures presented in the article are incorrect”, without stating what data it disputed. They added that the numbers “do not reflect the data available” in the military’s “systems”.\nThe military did not respond to why it gave different responses to different publications about the same data.\nThe data named 47,653 Palestinians who Israeli intelligence officials considered to be active members of the armed wings of Hamas and PIJ. The information is based on alleged internal documents seized from these groups in Gaza, not seen or verified by the Guardian, +972 Magazine or Local Call.\nIt lists 34,973 names of Hamas operatives, and 12,702 PIJ operatives.\nOf the 8,900 killed figure, it considered 7,330 to be certain, while 1,570 were “probably dead”.\nThe majority of these names were junior figures, while between 100-300 senior operatives were suspected of being killed, from a total of 750 senior names in the dataset.\nCivilian death toll higher\nLocal Call has previously reported that the Israeli military considers the death toll from the Palestinian health ministry in Gaza to be reliable. A former head of military intelligence appeared to cite the toll recently.\nThe investigation notes that the percentage of civilian deaths may in fact be higher.\n'People are promoted to the rank of terrorist after their death'\n- Israeli intelligence source\nThis is partly due to the fact that the health ministry death toll likely underestimates the number of those killed by attacks, as it does not include thousands buried under the rubble.\nIn addition, it is probable that Israeli intelligence officials may have included civilians with alleged connections to Hamas in their figures for combatants. This includes police officers or people involved in administrative positions in Gaza - who under international law are considered non-combatants.\nIsraeli officials may also have included Palestinians with no Hamas or PIJ connection at all, the report stated.\nOne example given is that Israel’s southern command allows soldiers to report deaths as militant casualties with no verification.\n“People are promoted to the rank of terrorist after their death,” one intelligence source who accompanied Israeli forces on the ground said.\n“If I had listened to the brigade, I would have come to the conclusion that we had killed 200 percent of Hamas operatives in the area.”\nIn addition, the ratio of civilian deaths is likely to have increased since the May figures, given that was the month that the Israel- and US-backed Gaza Humanitarian Foundation began operating in place of international aid groups.\nClose to 2,000 Palestinians have been killed while waiting to collect aid since then, according to Gaza health officials.\nThe 83 percent rate of civilian death is extremely high for modern warfare, the report states, even compared to conflicts in which indiscriminate killings took place such as recent civil wars in Syria and Sudan.\nAccording to research by the Guardian, using information from the Uppsala Conflict Data Program since 1989, only the genocide in Srebrenica, the Rwandan genocide and the Russian siege of Mariupol in Ukraine saw higher proportions of civilian deaths.\nLeading human rights organisations have reached the conclusion that Israel is committing genocide in Gaza.\nIn December 2024, Amnesty International became the first major organisation to conclude that Israel had committed genocide during its war on Gaza, followed by New York-based Human Rights Watch and Israel's B'Tselem.\nFrancesca Albanese, the UN's top expert on Palestine, authored two reports last year suggesting that genocide was taking place in Gaza.\nLast month, renowned professor of Holocaust and genocide studies Omer Bartov called Israel's war on Gaza an \"inescapable\" case of genocide, joining a chorus of prominent Israeli and Jewish scholars coming to the same conclusion.\nMiddle East Eye delivers independent and unrivalled coverage and analysis of the Middle East, North Africa and beyond. To learn more about republishing this content and the associated fees, please fill out this form. More about MEE can be found here."
    },
    {
      "news_title": "IDF database suggests 83% of Gaza dead were civilians",
      "news_link": "https://www.972mag.com/israeli-intelligence-database-83-percent-civilians-militants/",
      "bias": "Lean Left",
      "text": "Data from an internal Israeli intelligence database indicates that at least 83 percent of Palestinians killed in Israel’s onslaught on Gaza were civilians, an investigation by +972 Magazine, Local Call, and the Guardian can reveal.\nFigures obtained from the classified database — which records the deaths of militants from Hamas and Palestinian Islamic Jihad (PIJ) — contradict by a huge margin the public statements of Israeli army and government officials throughout the war, which have generally claimed a 1:1 or 2:1 ratio of civilian to militant casualties. Instead, the classified data backs up the findings of several studies suggesting Israel’s bombardment of Gaza has killed civilians at a rate with few parallels in modern warfare.\nThe Israeli army confirmed the existence of the database, which is managed by the Military Intelligence Directorate (known by the Hebrew acronym “Aman”). Multiple intelligence sources familiar with the database said the army views it as the only authoritative tally of militant casualty figures. In the words of one of them: “There’s no other place to check.”\nThe database includes a list of 47,653 names of Palestinians in Gaza whom Aman considers to be active in the military wings of Hamas and PIJ; according to the sources, the list is based on the groups’ own internal documents acquired by the army (which +972, Local Call, and the Guardian were unable to verify). The database designates 34,973 of the names as operatives of Hamas and 12,702 as operatives of Islamic Jihad (a small number are listed as active with both groups, but these are counted only once in the overall total).\nAccording to the data, which was obtained in May of this year, the Israeli army believed it had killed around 8,900 operatives since October 7 — the deaths of 7,330 of whom were considered certain and 1,570 recorded as “probably dead.” The vast majority of them were junior, with the army suspecting it had killed 100-300 senior Hamas operatives out of a total of 750 named in the database.\nA source familiar with the database explained that a specific piece of intelligence is attached to the name of every operative on the list whom the army is sure it killed, justifying that designation. +972, Local Call, and the Guardian obtained the numerical data from the database without the names or additional intelligence reports.\nThe overall death tolls published daily by the Gaza Health Ministry (which Local Call revealed last year are considered reliable even by the Israeli military) do not distinguish between civilians and militants. But taking the militant casualty figures obtained from the internal Israeli army database in May and lining them up against the Health Ministry’s total death toll, it is possible to calculate an approximate civilian casualty ratio for the war up until three months ago, when the death toll stood at 53,000.\nAssuming that all of the certain and probable militant deaths were counted in the death toll, that would mean over 83 percent of Gaza’s dead were civilians. If the probable deaths are discounted and only the certain deaths included, the proportion of civilian deaths rises to more than 86 percent.\nThe intelligence sources explained that the total number of militants killed is likely higher than the number recorded in the internal database, since it does not include Hamas or PIJ operatives who were killed but could not be identified by name, Gazans who took part in fighting but were not officially members of Hamas or PIJ, nor political figures in Hamas such as mayors and government ministers whom Israel also considers legitimate targets (in violation of international law).\nHowever, that does not necessarily mean the ratio of civilian casualties is lower than calculated above; in fact, it could be even higher. Recent studies have suggested the Health Ministry’s death toll — which currently stands at around 62,000 — is also likely a significant undercount of the total number of casualties from Israel’s onslaught, possibly by as many as several tens of thousands.\nFudging the numbers\nSince early on in the war, Israeli officials have sought to dismiss accusations of wanton killing in Gaza as the Palestinian death toll rapidly stacked up. In December 2023, with the death toll already at 16,000, the Israeli army’s international spokesperson, Jonathan Conricus, told CNN that Israel had killed two civilians for every one militant — a ratio he described as “tremendously positive.” In May 2024, with the death toll at 35,000, Prime Minister Benjamin Netanyahu asserted that the ratio was in fact closer to 1:1, a claim he repeated in September of the same year.\nThe specific number of militants Israel claims to have killed since October 7 has fluctuated seemingly without any logic. In November 2023, a senior security official implied to Israel’s Ynet news site that Israel had already killed over 10,000 militants. In an official military assessment presented to the government the following month, this number dropped to 7,860.\nMysterious jumps and drops in militant casualty numbers continued into 2024. In February of that year, the IDF Spokesperson claimed that Israel had killed 13,000 Hamas operatives, but a week later, the army reported a lower figure of 12,000. By August 2024, the army declared that it had killed 17,000 Hamas and PIJ operatives — a number that shrank again two months later to 14,000 killed “with high probability.” In November 2024, Netanyahu put the number “close to 20,000.”\nIn his retirement speech in January of this year, outgoing Chief of Staff Herzi Halevi reiterated that Israel had killed 20,000 militants in Gaza since October 7. And in June, the right-wing Begin-Sadat Center for Strategic Studies at Bar-Ilan University cited military sources claiming that the number of militant casualties in Gaza stood at 23,000.\nIntelligence sources told +972, Local Call, and the Guardian that some of these claims likely arose from an older, inaccurate database maintained by the army’s Southern Command which estimated late last year — without a list of names — that around 17,000 militants had been killed. “Those numbers are tall tales of the Southern Command,” one intelligence source said.\nThe Southern Command’s exaggerated reports were likely based on statements from commanders in the field whose subordinates regularly misreported civilian casualties as militants.\nFor example, +972 and Local Call recently revealed a case in which a battalion stationed in Rafah killed around 100 Palestinians and recorded them all as “terrorists,” yet an officer in the battalion testified that in all but two cases the victims had been unarmed. An investigation by Haaretz last year similarly found that only 10 out of 200 “terrorists” the IDF Spokesperson stated that the 252nd Division had killed in the Netzarim Corridor could be verified as Hamas operatives.\nIn April 2024, the right-wing daily Israel Hayom reported that several members of the Knesset’s Foreign Affairs and Defense Committee had questioned the reliability of the militant casualty figures presented to them by the army. After examining the army’s own data, the committee members found that the real number was much lower, and that the army had inflated the number of militant casualties “in order to create a 2:1 ratio” between civilian and militant deaths.\n“We are reporting a lot of Hamas operatives killed, but I think most of the people we report as dead are not really Hamas operatives,” an intelligence source who accompanied forces on the ground told +972, Local Call, and the Guardian. “People are promoted to the rank of terrorist after their death. If I had listened to the brigade, I would have come to the conclusion that we had killed 200 percent of Hamas operatives in the area.”\nAn official security source confirmed that before the intelligence database was in use, the army’s militant casualty figures — such as the number 17,000 — were just an “estimate” largely based on officer testimonies. “The method of counting changed,” the source said. “At the start of the war, [we relied] on commanders saying ‘I killed five terrorists.’”\nThe intelligence database, in contrast, is based on a person-by-person analysis and is the only number the army can “commit to” with a high degree of certainty, the source explained — even while assuming that it could be an undercount. The source added that the numbers political leaders say publicly are not coordinated with the available intelligence data.\nPalestinian analyst Muhammad Shehada told +972, Local Call, and the Guardian that the numbers in the intelligence database line up closely with figures quoted to him by Hamas and PIJ officials: in December 2024, they estimated that Israel had killed around 6,500 of their members, including from the political wing.\n‘They lie non-stop’\nSoon after October 7, Yossi Sariel, then-commander of the army’s elite signals intelligence squad, Unit 8200, began sharing a daily update with his subordinates showing the number of Hamas and PIJ operatives killed in Gaza. The graph, according to three sources familiar with it, was called the “war dashboard” and was presented by Sariel as a measure of the army’s success.\n“He put a lot of emphasis on ‘data, data, data,’” one of Sariel’s subordinates explained. “[There was a] need to measure everything in quantitative terms. To show efficiency. To try to make everything smarter and more technological.” Another source said it was like “a football game, officers sitting around watching the numbers go up on the dashboard.” (Yossi Sariel declined our request for comment, referring us to the IDF Spokesperson.)\nMaj. Gen. (res.) Itzhak Brik, who served for many years as a commander in the Israeli army and later as Ombudsman for Soldiers’ Complaints, explained how this outlook fueled a culture of lying. “They created a measure [whereby] the more you killed, the more you succeeded, and as a result they lied about how many they killed,” he said, describing the numbers presented by the IDF Spokesperson as “one of the most serious bluffs” in Israel’s history.\n“They lie non-stop — both the military echelon and the political echelon,” Brik added. “In every raid, the IDF Spokesperson’s announcements said: ‘Hundreds of terrorists were killed,’” he continued. “It’s true that hundreds were killed, but they weren’t terrorists. There is absolutely no connection between the numbers they announce and what is actually happening.”\nWhile speaking to soldiers whose job was to examine and identify the bodies of people the army kills in Gaza, he said they told him: “Everyone the army says it killed, most of them are [civilians]. Period.”\nBoth Hamas and PIJ have been severely weakened by Israel’s offensive over the past two years, which has killed most of the groups’ senior command and significantly damaged their military infrastructure. Still, the data obtained from the intelligence database shows that Israel has killed only one-fifth of those it considers to be militants. American intelligence estimates suggest Hamas has recruited 15,000 operatives during the war — twice as many as Israel killed.\nBut widespread genocidal rhetoric from Israel’s leadership and senior military command since the very beginning of the war suggests an intention to harm all Palestinians in Gaza, not just militants. On the morning of October 7, then-Chief of Staff Herzi Halevi told his wife, “Gaza will be destroyed,” she revealed on a recent podcast. And in a leaked recording from recent months aired last week on Israel’s Channel 12, the then-director of Aman, Aharon Haliva, said “50 Palestinians must die” for every Israeli killed on October 7, adding, “it doesn’t matter now if they are children.”\nInternational law does not assert what constitutes an “acceptable” civilian casualty ratio, but rather examines each attack according to the principle of “proportionality.” In this regard, as early as November 2023, +972 and Local Call revealed that the Israeli army had significantly loosened restrictions on civilian casualties after October 7, authorizing the killing of more than 100 Palestinian civilians when attempting to assassinate one senior Hamas commander, and up to 20 for junior operatives.\nThe result of this firing policy and the broader culture of revenge following October 7 is a civilian casualty ratio in Gaza that is extremely high for modern warfare, experts say, even compared with conflicts notorious for indiscriminate killing such as the Syrian and Sudanese civil wars.\n“That proportion of civilians among those killed would be unusually high, particularly as it has been going on for such a long time,” said Therese Pettersson from the Uppsala Conflict Data Programme (UCDP), which collects data on civilian casualties worldwide. She added that it is possible to find similar civilian casualty ratios when singling out a particular city or battle within a broader conflict, but “very rarely” when looking at a war as a whole.\nIn global conflicts tracked by UCDP since 1989, civilians made up a greater proportion of the dead only in the genocides in Srebrenica (1992-95) and Rwanda (1994) and during Russia’s three-month siege of Mariupol (2022), Pettersson said.\nOnly when there is a ceasefire will it be possible to precisely calculate the number of civilian and militant casualties in Gaza. But the intelligence database indicates that the civilian casualty ratio is vastly higher than the figures Israel has presented to the world for almost two years.\nMost read on +972\n+972 and Local Call initially approached the IDF Spokesperson for comment at the end of July, and received a statement that did not dispute our findings: “Throughout the war, comprehensive intelligence assessments were conducted on the number of terrorists eliminated in the Gaza Strip. The count is a complex intelligence process that is based on the situation of the forces on the ground and intelligence information, while cross-referencing a wide range of intelligence sources.”\nThree weeks later, after the Guardian’s request for comment on the same data, the army said it wanted to “rephrase” its response and rejected our findings without further explanation: “The figures presented in the article are incorrect and do not reflect the data available in the IDF’s systems. Throughout the war, continuous intelligence assessments are conducted regarding the number of terrorists eliminated in the Gaza Strip, based on BDA [bomb damage assessment] methodologies and cross-checking efforts from various sources … [including] documents originating from terrorist organizations in the Strip.”\nA spokesperson did not immediately respond when asked why the military had given different responses to questions about a single set of data.\nEmma Graham-Harrison of the Guardian contributed to this report."
    },
    {
      "news_title": "Leaked IDF Intelligence Reveals ‘Extreme Rate of Slaughter’ of Gaza Civilians",
      "news_link": "https://www.mediaite.com/media/news/leaked-idf-intelligence-reveals-extreme-rate-of-slaughter-of-gaza-civilians/",
      "bias": "Lean Left",
      "text": "Leaked IDF Intelligence Reveals ‘Extreme Rate of Slaughter’ of Gaza Civilians\nFigures leaked from a classified Israeli database revealed that the number of combatants confirmed to have been killed in Gaza is far lower than previously claimed.\nA joint investigation by the Guardian and Israeli-Palestinian outlet +972 Magazine found that the internal intelligence database used by the Israeli Defense Forces to record the deaths of militants from Hamas and Palestinian Islamic Jihad (PIJ) deemed 7,330 militants have been confirmed killed while 1,570 were recorded as “probably dead.”\nAccording to the +972 report, intelligence sources said the database is considered by the IDF to be “the only authoritative tally of militant casualty figures.”\nThe Gaza Health Ministry death toll numbers — which have been questioned publicly by Israel, but according to reports are are considered reliable by the IDF internally — do not differentiate between militant and civilian deaths. But by comparing both the health ministry numbers and the data obtained from the Israeli intelligence database, an approximate civilian casualty ratio for the war can be calculated.\nIf all deaths recorded in the internal database are the total for militant deaths, then more than 83 percent of deaths in Gaza have been non-combatant civilians. This number spikes even higher to 86 percent civilian death rate if you discount “probably dead” militants.\nThese figures sharply contradict previous statements made by army officials about the ratio of militant to civilian deaths.\nPrime Minister Benjamin Netanyahu claimed last year that the IDF has achieved the “lowest ratio of civilian to combatant deaths in the history of modern urban warfare.”\nMedia figures have also pushed the claim that the war in Gaza, launched by Israel in response to the Oct. 7 massacre by Hamas that killed more than 1,200 people, most of them civilians, is being carried out in an exceedingly cautious way. Commentator Douglas Murray argued to Joe Rogan in April that “one innocent Gazan has been killed for every one terrorist.” Alan Dershowitz defended Israel’s actions in a recent opinion piece in part by claiming that “the ratio of civilian to combatant deaths, [which] is lower for Israel than for any army facing comparable enemies.”\nYet this new leaked Israeli intelligence yields a civilian death rate described in the report as “an extreme rate of slaughter rarely matched in recent decades of warfare.”\nIndeed, when compared to other conflicts, the civilian death rate would put Gaza above other particularly brutal campaigns — including conflicts in Aleppo, Bosnia, and Syria.\nIntelligence sources explained to +972 that the total number of Hamas and Palestinian Islamic Jihad operatives killed would likely be higher than the Israeli intelligence data shows. This is due to the fact that the database itself does not include any operatives killed who could not be identified by name, nor does it record those in Gazans who took part in the fighting but were not officially members of either militant group.\nThat said, +972 points out that estimates of the true death toll in Gaza is considerably higher than the one reported by the health ministry. Studies, including one by The Lancet, have suggested the death toll in Gaza is considerably higher than the tally — which currently stands at more than 62,000 dead — provided by the health ministry."
    },
    {
      "news_title": "Israeli military’s own data indicates civilian death rate of 83% in Gaza war",
      "news_link": "https://www.irishexaminer.com/world/arid-41691396.html",
      "bias": "Lean Left",
      "text": "Revealed: Israeli military’s own data indicates civilian death rate of 83% in Gaza war\nFigures from a classified Israeli military intelligence database indicate five out of six Palestinians killed by Israeli forces in Gaza have been civilians, an extreme rate of slaughter rarely matched in recent decades of warfare.\nAs of May, 19 months into the war, Israeli intelligence officials listed 8,900 named fighters from Hamas and Palestinian Islamic Jihad as dead or “probably dead”, a joint investigation by the\n, the Israeli-Palestinian publication +972 Magazine and the Hebrew-language outlet Local Call has found.At that time 53,000 Palestinians had been killed by Israeli attacks, according to health authorities in Gaza, a toll that included combatants and civilians. Fighters named in the Israeli military intelligence database accounted for just 17% of the total, which indicates that 83% of the dead were civilians.\nThat apparent ratio of civilians to combatants among the dead is extremely high for modern warfare, even compared with conflicts notorious for indiscriminate killing, including the Syrian and Sudanese civil wars.\n“That proportion of civilians among those killed would be unusually high, particularly as it has been going on for such a long time,” said Therése Pettersson from the Uppsala Conflict Data Program, which tracks civilian casualties worldwide. “If you single out a particular city or battle in another conflict, you could find similar rates, but very rarely overall.”\nIn global conflicts tracked by UCDP since 1989, civilians made up a greater proportion of the dead only in Srebenica – although not the Bosnian war overall – in the Rwandan genocide, and during the Russian siege of Mariupol in 2022, Pettersson said.\nMany genocide scholars, lawyers and human rights activists, including Israeli academics and campaign groups, say Israel is committing genocide in Gaza, citing the mass killing of civilians and imposed starvation.\nThe Israeli military did not dispute the existence of the database or dispute the data on Hamas and PIJ deaths when approached for comment by Local Call and +972 Magazine. When the\nasked for comment on the same data, a spokesperson said they had decided to “rephrase” their response.A brief statement sent to the\ndid not directly address questions about the military intelligence database.It said “figures presented in the article are incorrect”, without specifying which data the Israeli military disputed. It also said the numbers “do not reflect the data available in the IDF’s systems”, without detailing which systems.\nA spokesperson did not immediately respond when asked why the military had given different responses to questions about a single set of data.\nThe database names 47,653 Palestinians considered active in the military wings of Hamas and PIJ. It is based on apparent internal documents from the groups seized in Gaza, which have not been viewed or verified by the\n.Multiple intelligence sources familiar with the database said the military viewed it as the only authoritative tally of militant casualties.\nThe military also considers the Gaza health ministry toll reliable, Local Call has reported, and the former head of military intelligence appeared to cite it recently, even though Israeli politicians regularly dismiss the numbers as propaganda.\nBoth databases may underestimate casualty numbers. The Gaza ministry of health lists only people whose bodies have been recovered, not the thousands buried under rubble. Israeli military intelligence are not aware of all militant deaths or all new recruits. But the databases are the ones used by Israeli officers for war planning.\nIsraeli politicians and generals have variously put the number of militants killed as high as 20,000, or claimed a civilian-to-combatant ratio as low as 1:1.\nThe higher totals cited by Israeli officials may include civilians with Hamas links, such as government administrators and police, even though international law prohibits targeting people not engaged in combat.\nThey probably also include Palestinians with no Hamas connections. Israel’s southern command allowed soldiers to report people killed in Gaza as militant casualties without identification or verification.\n“People are promoted to the rank of terrorist after their death,” said one intelligence source who accompanied forces on the ground. “If I had listened to the brigade, I would have come to the conclusion that we had killed 200% of Hamas operatives in the area.”\nItzhak Brik, a retired general, said serving Israeli soldiers were aware that politicians exaggerated the Hamas toll. Brik advised the prime minister, Benjamin Netanyahu, at the start of the war and is now among his most strident critics. “There is absolutely no connection between the numbers that are announced and what is actually happening. It is just one big bluff,” he said.\nBrik commanded Israel’s military colleges, and said he kept in touch with serving officers. He described meeting soldiers from a unit identifying Palestinians killed in Gaza, who told him “most of them” were civilians.\nEven though much of Gaza has been reduced to ruins and tens of thousands of people killed, the classified database lists nearly 40,000 people considered by the army to be militants and still alive.\nCasualty estimates from Hamas and PIJ members also indicated Israeli officials were inflating the militant toll in public statements, said Muhammad Shehada, a Palestinian analyst.\nBy December 2024 an estimated 6,500 people from the military and political wings of both groups had been killed, members told him. “Israel expands the boundaries so they can define every single person in Gaza as Hamas,” he said. “All of it is killing in the moment for tactical purposes that have nothing to do with extinguishing a threat.”\nThe ratio of civilian casualties among the dead may have increased further since May, when Israel tried to replace UN and humanitarian organisations that had fed Palestinians throughout the war. Israeli forces have killed hundreds of people trying to get food from distribution centres in military exclusion zones.\nNow starving survivors, already forced into just 20% of the territory, have been ordered to leave the north as Israel prepares for another ground operation that is likely to have catastrophic consequences for civilians.\nThe scale of the killing was partly owing to the nature of the conflict, said Mary Kaldor, professor emeritus at the LSE, director of the Conflict Research Programme and author of New Wars, an influential book about warfare in the post-cold-war era.\nInternational humanitarian law was developed to protect civilians in conventional wars, in which states deploy troops to face each other on the battlefield. This is still largely the model for Russia’s war in Ukraine.\nIn Gaza Israel is fighting Hamas militants in densely populated cities, and has set rules of engagement that allow its forces to kill large numbers of civilians in strikes on even low-ranking militants. “In Gaza we are talking about a campaign of targeted assassinations, really, rather than battles, and they are carried out with no concern for civilians,” Kaldor said.\nThe ratio of civilians among the dead in Gaza was more comparable to recent wars in Sudan, Yemen, Uganda and Syria, where much of the violence had been directed against civilians, she said. “These are wars where the armed groups tend to avoid battle. They don’t want to fight each other, they want to control territory and they do that by killing civilians,.\n“Maybe that is the same with Israel, and this is a model of war [in Gaza] that is about dominating a population and controlling land. Maybe the objective always was forced displacement.”\nIsrael’s government says the war is one of self-defence after the Hamas-led attacks on 7 October 2023, which killed 1,200 people.\nBut political and military leaders regularly use genocidal rhetoric. The general who led military intelligence when the war began has said 50 Palestinians must die for every person killed that day, adding that “it does not matter now if they are children”. Aharon Haliva, who stepped down in April 2024, said mass killing in Gaza was “necessary” as a “message to future generations” of Palestinians, in recordings broadcast on Israeli TV this month.\nMany Israeli soldiers have testified that all Palestinians are treated as targets in Gaza. One stationed in Rafah this year said his unit had created an “imaginary line” in the sand and fired at anyone who crossed it, including twice at children and once at a woman. They shot to kill, not to warn, he said. “Nobody aimed for their legs”.\nNeta Crawford, a professor of international relations at Oxford University and co-founder of the Costs of War project, said Israeli tactics marked a “worrisome” abandonment of decades of practices developed to protect civilians.\nIn the 1970s public revulsion about American massacres in Vietnam forced western militaries to shift how they fought. New policies were imperfectly implemented but reflected a focus on limiting harm to civilians that no longer appeared to be part of Israel’s military calculus, she said.\n“They say they’re using the same kinds of procedures for civilian casualty estimation and mitigation as states like the United States. But if you look at these casualty rates, and their practices with the bombing and the destruction of civilian infrastructure, it is clear that they are not.”"
    },
    {
      "news_title": "IDF’s Own Database Confirms Majority Civilian Casualties in Gaza",
      "news_link": "https://newrepublic.com/post/199411/idf-israel-database-palestinian-civilian-casualties-gaza",
      "bias": "Left",
      "text": "IDF’s Own Database Confirms Majority Civilian Casualties in Gaza\nAnd Israeli Prime Minister Benjamin Netanyahu seems intent on expanding his assault.\nThe Israeli Defense Force’s own database has confirmed what has been obvious for almost two years now: The overwhelming majority of Palestinians killed in Israel’s war on Gaza are civilians, not Hamas fighters, as Israel has claimed.\nOn Thursday, +972 Magazine reported that recently declassified documents reveal five in six people killed in the genocide in Gaza were noncombatant civilians—around 83 percent. Israel has stated that it killed or “probably killed” 8,900 Hamas and Palestinian Islamic Jihad fighters.\nThe total reported death toll in Gaza is around 62,000, although the true number is thought to be much higher.\nWhile the IDF did not object to +972’s report when it came out, it told The Guardian that “figures presented in the article are incorrect.”\nThese numbers, though, appear to accurately reflect the indiscriminate killing campaign that Israeli Prime Minister Benjamin Netanyahu launched on Gaza after the attacks of October 7, 2023. Israel had occupied Gaza and subjected Palestinians to violence for many decades before the war began.\nEven the IDF’s own soldiers admit to exaggerating the number of Hamas deaths in the war.\n“People are promoted to the rank of terrorist after their death,” one source on the ground told The Guardian. “If I had listened to the brigade, I would have come to the conclusion that we had killed 200% of Hamas operatives in the area.”\nIsrael has always claimed it was killing militants in order to justify the bombings, aid-drop assassinations, targeted killings of more than 250 journalists, and a brutal famine.\nIt’s worth noting that nearly 20,000 of the Palestinians killed in Gaza have been children.\nItzhak Brik, a retired Israeli general, said serving Israeli soldiers were aware that politicians exaggerated the Hamas toll.\nBrik advised Prime Minister Netanyahu at the start of the war, and is now among his most strident critics. “There is absolutely no connection between the numbers that are announced and what is actually happening,” Brik told The Guardian. “It is just one big bluff.”"
    },
    {
      "news_title": "Guardian \"83%\" civilian death toll claim is farcical",
      "news_link": "https://camera-uk.org/2025/08/24/guardian-83-civilian-death-toll-claim-is-farcical/",
      "bias": "unknown",
      "text": "A Guardian cover story promoted a claim so clearly false that even those of us who are rarely shocked anymore by what’s published at the anti-Zionist project are scratching our heads over the failure of editors to do the most basic fact-checking.\nThe Aug. 21 report, which is described as a “joint investigation by the Guardian, the Israeli-Palestinian publication +972 Magazine and the Hebrew-language outlet Local Call”, was written by Emma Graham-Harrison, the Guardian’s chief Middle East correspondent, and Yuval Abraham from +972.\nThe claim in the headline, which was used as the cover story both in the print and online versions, alleges that Israeli data shows that “83% of Gaza war dead are civilians“, which is based on the text in the opening paragraphs:\nFigures from a classified Israeli military intelligence database indicate five out of six Palestinians killed by Israeli forces in Gaza have been civilians, an extreme rate of slaughter rarely matched in recent decades of warfare.\nAs of May, 19 months into the war, Israeli intelligence officials listed 8,900 named fighters from Hamas and Palestinian Islamic Jihad as dead or “probably dead”\nAt that time 53,000 Palestinians had been killed by Israeli attacks, according to health authorities in Gaza, a toll that included combatants and civilians. Fighters named in the Israeli military intelligence database accounted for just 17% of the total, which indicates that 83% of the dead were civilians.\nThat apparent ratio of civilians to combatants among the dead is extremely high for modern warfare, even compared with conflicts notorious for indiscriminate killing, including the Syrian and Sudanese civil wars.\nThe investigation, replete with charts and other visuals purportedly illustrating that “the apparent ratio of civilians to combatants among the dead” is one of “the worst in modern warfare”, is based on a truly absurd calculation: asserting that the 8,900 listed names of terrorists killed necessarily represent every terrorist death. So, by subtracting 8,900 from the Hamas ministry’s tally in May, which was 53,000, the article insists, we learn that the ratio of civilians killed by Israel is at 83%.\nThe 8,900 figure, however, based on the language used in their own report, narrowly represents the terrorists whose names are known to the IDF – not, crucially, the total number of terrorists killed since Oct. 7, 2023. In other words, their logic depends upon the bizarre premise that if a Palestinian killed in Gaza is not marked as dead on a particular IDF list of named terrorists killed, they are necessarily a civilian. The Guardian ignores the fact that thousands of other fighters from Hamas, PIJ and other armed groups of largely lower ranks who have NOT been named by the IDF have also been killed.\nTellingly, the Guardian omits a key paragraph from +972’s version of the story, which conveys this very point:\nThe intelligence sources explained that the total number of militants killed is likely higher than the number recorded in the internal database, since it does not include Hamas or PIJ operatives who were killed but could not be identified by name, Gazans who took part in fighting but were not officially members of Hamas or PIJ, nor political figures in Hamas such as mayors and government ministers whom Israel also considers legitimate targets (in violation of international law).\nThe Guardian version, by contrast, published a truncated version of that key information, writing that “Israeli military intelligence are not aware of all militant deaths or all new recruits”. However, even those fourteen words reveal a self-evident and intuitive admission which undermines the entire premise of their article.\nAs Eylon Levy observed, it’s amazing that the IDF can name nearly 9,000 combatants it’s killed during the war, before expressing his skepticism that anyone in the media ever asked members of the international coalition fighting ISIS if they knew the names of thousands of dead jihadists.\nHowever, the Guardian doesn’t stop with the 83% civilian to combatant lie. They go further, writing that “the Gaza ministry of health lists only people whose bodies have been recovered, not the thousands buried under rubble.”. The accusation, which the Guardian presents as a fact, that thousands of Palestinians killed during the war are still “buried beneath the rubble”, promoted by Hamas and the UN, has been bandied around for well over a year – a claim bereft of evidence.\nThe outlet also omits publicly available information which would contradict their desired take-away, such as an IDF statement, which was reported a day before the Guardian article, that roughly 22,000 Gaza terrorists have been killed thus far. So, given that the Hamas-run Gaza health ministry (MOH) puts the total death toll at 62,000, that puts the civilian to combatant death ratio at roughly 2 to 1. According to John Spencer, Executive Director of the Urban Warfare Institute, this ratio would represent an unprecedentedly low civilian casualty rate for such dense, urban fighting – particularly in light of Hamas’s human shield strategy.\nIndeed, as even Hamas’s (MOH) detailed casualty figures show, most of those killed have been combat-aged males.\n“Rather than the hack approach taken by +972, a credible civilian/combatant ratio”, the HJS’s Andrew Fox wrote on his Substack site, “would (1) publish definitions of “combatant” up front (police, auxiliaries, political cadres), (2) triangulate the denominator (MoH rolls plus grave/morgue records and missing‑under‑rubble estimates) with intervals, (3) build a fighter numerator that goes beyond named lists such as unit after‑action reports, group obituaries, detainee interrogations, and probabilistic matching to capture unnamed militants, and (4) publish a replication scaffold so others can audit the pipeline.”\nThat, he observes, “is the difference between scholarship and activism”.\nIndeed, a real media outlet whose journalists possessed professional integrity would at least have mentioned the alternative civilian to combatant death toll ratios we cited. Once again, however, the outlet, whose coverage of the war, we’ve repeatedly demonstrated, has been effectively pro-Hamas, decided instead on another propagandistic tale of Israeli villainy – normal standards of Western journalism be damned."
    },
    {
      "news_title": "Never Forget The Lies They Told About Gaza. Never Forgive Them.",
      "news_link": "https://www.caitlinjohnst.one/p/never-forget-the-lies-they-told-about",
      "bias": "unknown",
      "text": "Notes From The Edge Of The Narrative Matrix\nListen to a reading of this article (reading by Tim Foley):\nA joint investigation by The Guardian and +972 Magazine found that the IDF’s own records show that civilians make up at least 83 percent of those killed in Israeli attacks on Gaza. The report notes that the real number is likely significantly higher, since the number given doesn’t include the thousands upon thousands of dead civilians who are still unaccounted for in Gaza because they are trapped under the rubble, or those killed by indirect means such as starvation or disease.\nThe pro-Israel spin machine frantically tried to discredit this report as soon as it came out, but their arguments have been soundly debunked.\nThey claimed that Israel has a phenomenally low civilian-to-combatant casualty ratio, then Israel’s own data proved that civilians comprise the vast majority of those killed by the IDF.\nThey denied that Israel is starving Gaza, then the IPC came out with a report saying that Israel is starving Gaza.\nThey tried to claim that the skeletal children we’re seeing in Gaza looked that way because of pre-existing conditions, then the Israeli press published an extensive report showing that children with no pre-existing conditions are being starved.\nThey tried to deny that Israeli soldiers were massacring civilians at aid sites, then the Israeli soldiers themselves told the Israeli press that they were being ordered to massacre civilians at aid sites.\nNever forget all the monsters who tried to gaslight you and convince you that you are crazy and hateful for saying these things are happening. Never, ever forgive them.\n❖\nThe IDF has admitted to uprooting thousands of olive trees in the West Bank on Thursday. The routine destruction of Palestinian olive trees is not the most shocking or evil thing that Israel does to the Palestinians, but it does speak to what its true intentions are in a unique way.\nSimilar to the way white people killed off all the bison to help eliminate the American Indians, killing olive trees deprives Palestinians of an important means of earning a living, and strikes at an important aspect of Palestinian identity and culture.\nOlive trees can live for thousands of years; people with a strong attachment to the land treasure and protect them, while the Israelis who claim to be “indigenous” to the area are destroying them and replacing them with highly flammable foreign plants. You can tell who the actual indigenous population is by watching their behavior.\n❖\nNormal person: Genocide is bad\nCrazy person: Woah hey, let’s not get political\n❖\nRight wingers are like “No no you don’t understand, Israel is protecting western civilization. If we don’t help Israel genocide the Palestinians and starve their children and burn their babies and bomb their hospitals and demolish their cities, one day we could wind up ruled by evil murderous savages.”\n❖\nNormal person: Oh no those people over there are committing genocide!\nCrazy person: Okay but what religion are they?\n❖\nThe way Zionists talk about Palestinian hatred of Jews you’d think the Palestinians immigrated to Israel from somewhere else in 1948 in order to attack Jewish people.\n❖\nIn 1937, Winston Churchill stated the following while arguing in favor of allowing Jews to settle in Palestine:\n“I do not admit that the dog in the manger has the final right to the manger, even though he may have lain there for a very long time. I do not admit that right. I do not admit, for instance, that a great wrong has been done to the Red Indians of America, or the black people of Australia. I do not admit that a wrong has been done to those people by the fact that a stronger race, a higher-grade race, or, at any rate, a more worldly-wise race, to put it that way, has come in and taken their place. I do not admit it. I do not think the Red Indians had any right to say, The American Continent belongs to us and we are not going to have any of these European settlers coming in here. They had not the right, nor had they the power.”\nChurchill knew exactly what he was looking at in the Zionist agenda to colonize Palestine. There was no confusion whatsoever. It wasn’t until much later that history was revised through propaganda to spin this as something other than the western settler-colonialist project that it has always been.\n❖\nThe other day I wrote the following in a rant about religious Zionists:\n“Someone like Mike Huckabee is never telling the truth or saying what he really thinks is going on when it comes to Israel and the Palestinians, he’s just making whatever mouth noises he needs to make to help fulfill a Biblical prophecy and secure his eternal reward. Such people have no place in the conversation. They should be completely excluded from the debate, because they are not actually participating in it. They’re just lying and manipulating for reasons that have nothing to do with truth or morality.”\nThe very next day, Antiwar published an article titled “Mike Huckabee Claims Israeli Settlements in the Occupied West Bank Are Not Illegal Under International Law”.\nLike I said. Huckabee does not believe this obvious falsehood, he’s just saying whatever words he needs to say to help advance the agendas of his weird Christian cult. These freaks consider themselves so pious and righteous, but in reality they are some of the most conniving, unethical deceivers our world has ever seen.\n❖\nIt just occurred to me that at some point in the future they’re going to try to demand that we condemn whatever radicalized groups and militias wind up emerging as a result of the Gaza genocide.\nThat’s gonna be cute.\n__________________\nThe best way to make sure you see everything I write is to get on my free mailing list. My work is entirely reader-supported, so if you enjoyed this piece here are some options where you can toss some money into my tip jar if you want to. Click here for links for my social media, books, merch, and audio/video versions of each article. All my work is free to bootleg and use in any way, shape or form; republish it, translate it, use it on merchandise; whatever you want. All works co-authored with my husband Tim Foley.\nBitcoin donations: 1Ac7PCQXoQoLA9Sh8fhAgiU3PHA2EX5Zm2\nOh those \"Red Indians\", Winston. They understood more about life -- real life in its relationship to human life -- than you'd ever appreciate should someone threaten to reverse one of those fat (lighted) cigars down your pie hole. Another lump of undeservedly worshiped historical rubbish, with the likes of Harry Truman, US Cavalry and Confederate Generals, and all the other \"Heroes\" that keep Western societies firmly on the path of perpetual imperialist genocidal wars.\nNever forgive Israel. It must be canceled and the Entity and supporters arrested as War Criminals. One State Palestine."
    },
    {
      "news_title": "Gaza Live Updates: Conflict, News & Humanitarian Crisis – Archyde",
      "news_link": "https://www.archyde.com/gaza-live-updates-conflict-news-humanitarian-crisis/",
      "bias": "unknown",
      "text": "The Unprecedented Civilian Toll in Gaza: Forecasting a New Era of Urban Warfare Accountability\nEighty-three percent. That’s the estimated proportion of casualties in Gaza identified by the Israeli army as civilians – a figure described as “unprecedented in modern wars” by international observers. While conflict invariably claims innocent lives, this statistic isn’t just a tragic number; it’s a potential inflection point. It signals a looming shift in how urban warfare is perceived, investigated, and potentially prosecuted, demanding a re-evaluation of the laws of war and the responsibility of armed forces operating in densely populated areas. This article explores the implications of this unprecedented civilian mortality rate, forecasting future trends in international law, military strategy, and the role of data in conflict accountability.\nThe Data Speaks: A Shift in the Calculus of Conflict\nThe figures emerging from Gaza, corroborated by reports from organizations like EuroNews and Le Monde, are stark. The sheer scale of civilian deaths, even accounting for the complexities of urban combat, raises critical questions about proportionality and the precautions taken to minimize harm. This isn’t simply about a higher body count; it’s about a civilian mortality rate that dwarfs those seen in recent conflicts like Mosul, Raqqa, or even previous iterations of the Israeli-Palestinian conflict. According to analysis by Bfmtv, the “unprecedented rhythm” of civilian casualties suggests a systemic issue, not isolated incidents.\n“Did you know?” box: The laws of war, codified in the Geneva Conventions, require combatants to distinguish between military objectives and civilians, and to take all feasible precautions to avoid or minimize civilian harm. The principle of proportionality dictates that even legitimate military targets cannot be attacked if the expected civilian casualties are excessive in relation to the concrete and direct military advantage anticipated.\nFuture Trends: Accountability and the Rise of Data-Driven Investigations\nThe Gaza conflict is likely to accelerate several key trends. First, we can expect increased scrutiny of military operations in urban environments. International organizations, human rights groups, and potentially the International Criminal Court (ICC) will likely prioritize investigations into alleged violations of the laws of war. However, traditional investigative methods – relying on eyewitness testimony and limited access – are often hampered by security concerns and political obstacles.\nThis is where data becomes crucial. The Israeli army’s own data, while controversial, provides a starting point for independent analysis. Future conflicts will likely see a greater reliance on open-source intelligence (OSINT), satellite imagery, and advanced data analytics to reconstruct events, assess casualty figures, and identify potential war crimes. The ability to independently verify claims and counter disinformation will be paramount.\nThe Role of Artificial Intelligence in Conflict Analysis\nAI and machine learning will play an increasingly significant role in analyzing conflict data. Algorithms can be used to identify patterns of attacks, assess the proportionality of force, and even predict potential civilian harm. However, the use of AI also raises ethical concerns about bias, transparency, and accountability. Ensuring that these tools are used responsibly and ethically will be a major challenge.\n“Expert Insight:” Dr. Anya Sharma, a specialist in international humanitarian law at the University of Oxford, notes: “The Gaza situation highlights the urgent need for standardized data collection and analysis protocols in conflict zones. Without reliable data, it’s impossible to hold perpetrators accountable or to learn from past mistakes.”\nImplications for Military Strategy: Adapting to the Age of Transparency\nThe heightened scrutiny and potential for legal repercussions will force militaries to adapt their strategies. We can expect to see a greater emphasis on minimizing civilian harm, even if it means accepting greater risks to military personnel. This could involve:\n- Increased use of precision-guided munitions.\n- More robust target vetting processes.\n- Greater investment in non-lethal weapons and tactics.\n- Enhanced training on the laws of war and civilian protection.\nHowever, these changes will not be easy. Urban warfare is inherently complex and dangerous, and even the most sophisticated technologies and tactics cannot eliminate the risk of civilian casualties entirely. The challenge will be to strike a balance between military necessity and the imperative to protect innocent lives.\nThe Rise of “Human Shield” Concerns and Legal Ambiguity\nThe presence of civilians in or near military objectives – whether voluntary or coerced – presents a significant legal and ethical dilemma. While deliberately using civilians as shields is a war crime, the legal status of civilians who are present in a combat zone without being actively used as shields remains ambiguous. This ambiguity will likely be a focus of future legal debates and investigations.\n“Pro Tip:” For organizations operating in conflict zones, documenting civilian harm and preserving evidence is crucial. This includes collecting photographs, videos, and witness statements, and securely storing this information for potential use in legal proceedings.\nThe Future of Urban Warfare: A Paradigm Shift?\nThe events in Gaza are not an isolated incident. As populations continue to concentrate in urban areas, future conflicts will inevitably take place in densely populated environments. The unprecedented civilian mortality rate in Gaza serves as a warning – a stark reminder of the human cost of modern warfare and the urgent need for a new approach. This approach must prioritize civilian protection, embrace data-driven accountability, and adapt military strategies to the age of transparency.\nFrequently Asked Questions\nQ: What is the International Criminal Court’s (ICC) role in investigating potential war crimes in Gaza?\nA: The ICC has jurisdiction over alleged war crimes committed in the Palestinian territories, but its investigations are often hampered by political obstacles and limited access. The current situation may prompt renewed calls for a full investigation.\nQ: How can open-source intelligence (OSINT) be used to investigate conflict-related incidents?\nA: OSINT involves collecting and analyzing publicly available information, such as social media posts, satellite imagery, and news reports, to reconstruct events and assess casualty figures. It can provide valuable insights, but requires careful verification to avoid misinformation.\nQ: What are the key challenges in holding individuals accountable for war crimes?\nA: Challenges include gathering sufficient evidence, overcoming political obstacles, ensuring fair trials, and enforcing judgments. International cooperation and a commitment to the rule of law are essential.\nQ: What steps can militaries take to minimize civilian harm in urban warfare?\nA: Militaries can prioritize precision targeting, conduct thorough target vetting, invest in non-lethal weapons, and provide enhanced training on the laws of war and civilian protection.\nWhat are your predictions for the future of accountability in urban warfare? Share your thoughts in the comments below!"
    },
    {
      "news_title": "Israeli Data Reveals 83 Percent Of Gaza War Dead Are Civilians - Iran Front Page",
      "news_link": "https://ifpnews.com/israeli-data-reveals-83-percent-of-gaza-war-dead-are-civilians/",
      "bias": "unknown",
      "text": "Figures reviewed by the outlets indicate that, as of May 2025 – 19 months into Israel’s war on Gaza – Israeli military intelligence had listed 8,900 fighters from Hamas and Palestinian Islamic Jihad (PIJ) as confirmed or “probably” dead.\nOver the same period, Gaza’s health authorities recorded at least 53,000 deaths from Israeli attacks, meaning that named fighters accounted for just 17 percent of those killed, with civilians at about about 83 percent of the total death toll.\nConflict researchers say that ratio is almost unparalleled in modern warfare. Only the Rwandan genocide, the 1995 Srebrenica massacre, and Russia’s 2022 siege of Mariupol recorded a higher civilian death rate, the authors noted.\nRights groups and genocide scholars argue the findings further support claims that Israel is committing genocide in Gaza, pointing to mass civilian deaths alongside deliberate starvation.\nWhen asked to comment by The Guardian, +972 Magazine, and Local Call, the Israeli military did not deny the existence of the intelligence database or the listed figures for Hamas and PIJ casualties.\nIsraeli politicians and military leaders have long inflated fighter death tolls, at times claiming as many as 20,000 fighters killed or insisting on a civilian-to-combatant ratio of 1:1 – figures that the report notes they do not believe in private.\nBy March, Gaza’s death toll had reached 50,000; it has since risen to beyond 62,000, according to the enclave’s health ministry. The total number of wounded has now exceeded 157,000.\nThe International Criminal Court has issued arrest warrants for Israeli Prime Minister Benjamin Netanyahu and his former Defence Minister Yoav Gallant, accusing them of war crimes and crimes against humanity committed between October 2023 and May 2024."
    },
    {
      "news_title": "New evidence Israel’s butchery of civilians unmatched in the modern age",
      "news_link": "https://thedailyblog.co.nz/2025/08/23/new-evidence-israels-butchery-of-civilians-unmatched-in-the-modern-age/",
      "bias": "unknown",
      "text": "Jesus wept…\nRevealed: Israeli military’s own data indicates civilian death rate of 83% in Gaza war\nFigures from a classified Israeli military intelligence database indicate five out of six Palestinians killed by Israeli forces in Gaza have been civilians, an extreme rate of slaughter rarely matched in recent decades of warfare.\nAs of May, 19 months into the war, Israeli intelligence officials listed 8,900 named fighters from Hamas and Palestinian Islamic Jihad as dead or “probably dead”, a joint investigation by the Guardian, the Israeli-Palestinian publication +972 Magazine and the Hebrew-language outlet Local Call has found.\nAt that time 53,000 Palestinians had been killed by Israeli attacks, according to health authorities in Gaza, a toll that included combatants and civilians. Fighters named in the Israeli military intelligence database accounted for just 17% of the total, which indicates that 83% of the dead were civilians.\nThat apparent ratio of civilians to combatants among the dead is extremely high for modern warfare, even compared with conflicts notorious for indiscriminate killing, including the Syrian and Sudanese civil wars.\n“That proportion of civilians among those killed would be unusually high, particularly as it has been going on for such a long time,” said Therése Pettersson from the Uppsala Conflict Data Program, which tracks civilian casualties worldwide. “If you single out a particular city or battle in another conflict, you could find similar rates, but very rarely overall.”\n…the true horror is that these numbers, despite the ghoulish evidence of genocide by Israel, is only a fraction of the real picture.\nTo appreciate the full enormity of Israel’s genocide, we need to include to those 60000+ deaths the estimated 15 000 still trapped under rubble plus the estimated 230 000 who have died from all the secondary impacts of famine, destroying all sanitation, destroying all hospitals.\nWe are knocking on over 300000 dead, the vast majority innocent civilians.\nThis is beyond measure, this is horror and it is being perpetrated by supposed allies.\nWhat is the point of being a Democracy if we enable genocide with our silence?\nAllies don’t let Allies commit war crimes.\nThis stopped being a response to October 7th a long time ago.\nIf you are still defending Israel, you are the war criminal too.\nIncreasingly having independent opinion in a mainstream media environment which mostly echo one another has become more important than ever, so if you value having an independent voice – please donate here.\nPretty sure the US killed far more people in both Iraq and Afghanistan with 500,000+ killed, with an estimated 90% civilian death rate.\nhttps://en.wikipedia.org/wiki/Lancet_surveys_of_Iraq_War_casualties\nThey murdered those people for the zionists too- note that Afghanistan was targeted because it did not pretend ‘israel’ is a real country, just like the DPRK, Iran, and Venezuela are being today.\nMy point was really only that Israel is still an taking baby steps when it comes to crimes against humanity compared to the US. But I guess if Israel is behind all of it the US’s Middle East activities, well, okay then.\nJustl like Israel doesn’t consider Palestine a real country.\nJust like Russia doesn’t consider Ukraine to be a real country.\nBlood thirsty imperialists are all the same.\nUS support for the human butchery in Gaza, is no barriert to the Russians doing a deal with the Yanks over Sakhalin oil.\nSame as Russia’s aggression against Ukraine is no barrier to the Americans doing a deal with the Russians over Sakhalin oil.\nThese two butchers have a common interest in raping humanity and the planet, sometimes their interests collide, sometimes their interests intersect.\nThis is the deal they did in Alaska\nhttps://egyptoil-gas.com/news/exxonmobil-may-return-to-sakhalin-1-two-years-after-putins-takeover/?\nThis is so disgusting it makes one want to totally give up on mankind. The wholesale butchering of so many human beings has become impossible to comprehend. It isn’t a war – it is extreme mass murder. So AGAIN what is NZ doing to counteract or show their revulsion at the carnage and barbaric waste of life. Why the hell should Palestinians be forced to relocate because it’s what Israel wants? How much lower can Israel stoop – not much – so how about it Luxon/Peters, it’s way past time to show you both still have some decency left in you. Imagine if the above photo was the aftermath from say Auckland – how would we all feel or cope? Saying more were killed in other confrontations is never a good enough excuse. This is happening NOW. It has to stop and only those in power can do this, so show some courage and just do it!\nTotally agree .\nOnly trouble is Luxon Peters and Seymour lack the balls .\nThey are in the Zionists pockets.\n” What is the point of being a Democracy if we enable genocide with our silence? ”\nI’d argue ” What’s the point of pretending there are democracies while instead we have neoliberalism.”\nNeoliberalism isn’t some innocent nylon brain fart popping out of the roger ya know. Neoliberalism has been around for decades. The term ‘neoliberalism’ was first coined at a conference in Paris in 1938 then and we were infected by the disease from the roger thing.\n“…if we enable genocide with our silence? …” But we do and that’s why we AO/NZ’ers MUST mandate the vote. Lazy silence isn’t an option.\nLook. Let’s be clear in our appraisals re The Gaza Slaughter. What you’re witnessing in Gaza is neoliberalism on hyper-meth. An unhinged greed for money, power and chrome plated status and aided and protected by an orange psychopath with a bent mushroom nob and a criminal conscience.\nAs seen here, on the TDB.\nJonathon Pie. re Trump etc\nhttps://www.youtube.com/watch?v=x0eq7VNCcYY\nNow check out this piece. A nonstop psyops brain-wash to normalise a critical and urgent disaster in its process of manufacture.\nIs this when we should watch for a flotilla of israeli war ships and cruise liners?\nGutless kiwis would rather run than stand. You fucking cowards.\nWhy Living In New Zealand Is Becoming Incredibly Hard\nhttps://youtu.be/vZtNpbrKN7w?feature=shared"
    },
    {
      "news_title": "Revealed: Israeli military’s own data indicates civilian death rate of 83% in Gaza war",
      "news_link": "https://bioethics.com/archives/99354",
      "bias": "unknown",
      "text": "Revealed: Israeli military’s own data indicates civilian death rate of 83% in Gaza war\nAugust 22, 2025\n(The Guardian) – Figures from a classified Israeli military intelligence database indicate five out of six Palestinians killed by Israeli forces in Gaza have been civilians, an extreme rate of slaughter rarely matched in recent decades of warfare. (Read More)"
    },
    {
      "news_title": "Israeli data shows 83% of Gaza war dead are civilians",
      "news_link": "https://www.daily-sun.com/post/821524",
      "bias": "unknown",
      "text": "Monday 25 August 2025\nLatest\nE-Paper\nবাংলা\nPrevious Month\nAugust 2025\nJanuary\nFebruary\nMarch\nApril\nMay\nJune\nJuly\nAugust\nSeptember\nOctober\nNovember\nDecember\n2013\n2014\n2015\n2016\n2017\n2018\n2019\n2020\n2021\n2022\n2023\n2024\n2025\nSu\nMo\nTu\nWe\nTh\nFr\nSa\n27\n28\n29\n30\n31\n1\n2\n3\n4\n5\n6\n7\n8\n9\n10\n11\n12\n13\n14\n15\n16\n17\n18\n19\n20\n21\n22\n23\n24\n25\n26\n27\n28\n29\n30\n31\n1\n2\n3\n4\n5\n6\n7\n8\n9\n10\n11\n12\n13\nE-Paper\nNewspaper\nBN\nBudget 2025-2026\nEid ul Azha Special\nOnline Version\nPrint Version\nSpecial Issue\nBangladesh's Cooling Boom - Online Version\nBangladesh's Cooling Boom - Print Version\n14th-Anniversary Special Issue-01\n14th-Anniversary Special Issue-02\n14th-Anniversary Special Issue-03\n14th-Anniversary Special Issue-04\nEid Magazine 2024\nICC Champions Trophy 2025\nPhoto Gallery\nLatest\nMore News\nFive journalists among 20 killed in Israeli strikes on Gaza hospital\nNorthern Gaza braces for looming offensive\n'Far too late': Palestinians despair after UN declares famine in Gaza\nGaza famine a 'moral outrage', and 'man-made': UK govt\nIsrael vows to destroy Gaza City if Hamas doesn't disarm, free hostages\nFive die of hunger as Amnesty says Israel deliberately starving Gaza\nLeaked recording reveals ex-Israeli military intelligence chief calling 50,000 deaths in Gaza ‘necessary’\nIsrael's Netanyahu says protesters calling to end war strengthening Hamas\nTrending\nRampal plant feeds national grid with 10.5 billion units\nContent creator Tawhid Afridi arrested\nBangladesh calls on Pakistan to offer formal apology for 1971 genocide\nPakistan upbeat on stronger trade ties with Bangladesh\nForex reserves rise to $30.87 billion: BB\n1,586 more crime suspects arrested in 24hrs\nBangladesh, Pakistan sign visa deal, 5 MoUs amid 1971 dispute\nJICA delegation meets DU VC to discuss flood forecast project\nRain, heavy showers likely across country over next five days\nHuawei recognised for SD-WAN five years in a row\nRival groups locked in scuffle in front of CEC\nCox's Bazar dialogue recommendations will be presented at NY Rohingya conference: FS\nTwo banned BCL leaders sent to jail\nCase filed as Hanif Paribahan bus seized over deadly Cumilla crash\nPrivate sector growth stagnates, DCCI calls for banking sector, political stability\nRussia and Ukraine each send back 146 POWs: Moscow\nPartition: Divided Homes, Broken Heritage and Ruptured History\n3 suspected AL men detained during sudden rally in Gulistan\nNecessity and Viability of Padma Barrage Project\nGaza civil defence reports 42 killed in Israeli attacks\nSouth Africa's most vulnerable struggle to find HIV medication after US aid cuts\nTrump clashes with Democrats as he expands National Guard plans\nBangladesh needs 35GW renewables, $42b to meet 2040 target: CPD\nDRU demands 9th wage board, 2-day weekend for journalists\nI don’t think election will be held in February: NCP’s Nahid\nDespite China’s assurance, India hastens to counter ‘war risks’ from Tibet dam\nDCCI seminar: Economic growth slows down\nYunus places 7-point roadmap for Rohingya repatriation\nSingapore trip offered to alter Abu Sayed’s autopsy report\nPoverty in Bangladesh increases sharply to 27.93%"
    },
    {
      "news_title": "The real Gaza death toll is impossible to know today, but the minimum isn’t",
      "news_link": "https://johnmenadue.com/post/2025/08/the-real-gaza-death-toll-is-impossible-to-know-today-but-the-minimum-isnt/",
      "bias": "unknown",
      "text": "The real Gaza death toll is impossible to know today, but the minimum isn’t\nAugust 23, 2025\nNote: At the time of writing, a summary analysis similar to the one below was published in Current Affairs, attributed to “Lex Syd.” There are a few differences in our sources and analyses, but the numbers are the same.\nFor a year and a half, whether we’ve noticed it or not, people who look at international news have read variations on the following sentence many, many times: “The Gaza Ministry of Health does not distinguish between civilians and combatants.” Its inclusion is so mindlessly automatic at this point that it keeps showing up in major media’s occasional articles on how many children the Israeli Defence Forces have killed, an obscene caveat suggesting that for all we know, most of these kids — even most of the pre-teenage kids — were justified targets.\nIt has made some sense to rely on the ministry’s count as a baseline death toll, since it only includes recovered bodies, most of them identified by name. This is why every country, UN organisation, international humanitarian organisation, and mainstream media outlet uses it — even Israeli intelligence agrees with its numbers. But given the shocking pace at which the death toll in Gaza has climbed, it has seemed to genocide skeptics to demand a qualifier. So, early on in the war on Gaza, the “does not distinguish” sentence became an editorial incantation allowing a measure of disbelief in the live streamed reality of the mass killing of civilians.\nThis obsession with ambiguity was at once very human — who wouldn’t prefer to see a reality where we weren’t complicit in a genocide? — and deeply inhuman, in its rote soft-pedalling of atrocities in which all Americans, as their primary suppliers and chief international supporters, have always been complicit. If the unbelievable numbers of unarmed people killed by one of our closest allies, with the active support of our own country — 5000 of them, and then very quickly 10,000, and 25,000, and then 30 and 40 and 60,000 people just like us and our families — if an indeterminate number of them were actually “combatants,” well, maybe this was only, as so many supporters of the campaign kept saying, the storm and fog of just another war. After all, the IDF had estimated, as the siege began, that there were some 30,000 Hamas fighters in Gaza. Maybe a 30%, or a 40%, or even a 50% civilian death rate, many people apparently thought, was just the price that had to be paid for the realisation of a fantasy that no one ever really believed was possible – the “eradication” of Hamas.\nWherever one has stood in relation to this open-ended spectrum of horror, the ministry numbers have seemed to be something everyone could pretty much agree on, at least inside of the fringes of the discourse on Gaza. Unless you were so rabid to keep the death machine rolling that your first instinct was to call the unspooling names of dead children “Hamas propaganda”, or you were so certain that we were being forced into complicity in a genocide that you obsessively recalculated and posted the most probable real death toll (as I’ve done every month since the war began), you went with the visible consensus: however many thousands, “according to the Gaza Ministry of Health, which does not distinguish between civilians and combatants”.\nYet, virtually everyone who accepts that number also accepts that it must be an undercount of some significant but unknowable size. Since the Health Ministry only counts recovered bodies, every single unrecovered body is also uncounted. When we recall what the damage in Gaza looks like — massive bombs dropped on densely populated urban areas, generally with no actionable warning, usually with vague or expired location data and often without guidance systems anyway — it’s hard to avoid the question of how many people have died, quickly or in prolonged agony, whose bodies have never been recovered. Imagine for a moment that the greater New York metropolitan area were reduced to this, with virtually no-one allowed to leave as it happened, nowhere to shelter, and with further bombing of the areas to which any internal refugees relocated, and you can begin to imagine how many human beings were hit so hard that there was nothing left to recover or identify; how many more could never be recovered, brought in to be identified, or counted; how many bodies were buried either anonymously, in cemeteries since razed flat by the IDF, or in the mass graves it has dug; how many f amilies had no members left alive to report the dead.\nAs Arwa Mahdawi put it in _The Guardian_ last week, “We have no idea how many people have been killed in Gaza but I would bet my own life that the number is far higher than the 60,000 number the media uses.” That’s a very common thought in discussions of Gaza. There’s even a very occasional qualifier to the “does not distinguish” clause in major media coverage, noting that the ministry’s death toll is “ likely to be an undercount”.\nThe problem with leaving this sentiment at “we have no idea how many people have been killed” is that we do have a very clear idea of the minimum, based on the most rigorous, detailed analyses that statisticians, epidemiologists, trauma specialists, and experts on urban warfare, working together under stringent peer review in the world’s leading research forums, agree on. And that minimum number is indeed much higher than the ministry’s count.\nThat minimum scientifically plausible number of traumatic deaths only — immediate deaths from bullets, bombs, and demolished buildings — in the Gaza genocide is currently more than 115,000.\nThe minimum scientifically plausible number of deaths attributable to the genocide overall is more than 460,000.\nAnyone who claims to rely on the best scientific consensus today must report the current death toll in the Gaza genocide as “more than 115,000” violent deaths or “more than 460,000” overall.\nHere, in some detail, is why.\nThe Gaza Ministry of Health’s death toll as I write this has just passed 62,000 — I’ll refer to this number as “GMH,” so anyone can easily replicate this math at any point in the future. These are the steps, with citations, for understanding this number’s relationship to the current 115,000 to 460,000 range. In every step, I will use the most conservative plausible parameters of any uncertainly, ensuring that our minimum really is the minimum.\n1. The first adjustment that must be made to GMH is its likely undercount, due to the sheer chaos of the genocide. The definitive scientific study calculating this number was published in February 2025 by four of the world’s leading clinicians, epidemiologists, and experts in emergency medicine, in _The Lancet_ – a 200-year-old, rigorously peer-reviewed scientific journal and the world’s most prominent research publication in general medicine. The researchers, the research, and the venue here are unimpeachable, and its undercount results have since been confirmed almost exactly by a second major study using a completely different approach. The study found, with a 95% confidence interval, that the ministry undercounted the death toll from traumatic injury by 41%. This means that the ministry’s count at the time represented only 59% of actual deaths due to traumatic injury. It is almost certainly more of an undercount now, since reporting conditions have only deteriorated in the more than 13 months since the end of the period considered in the study – but we will stay with the minimum plausible number.\nFor this, we need to divide GMH / .59, for a minimum of 105,085 deaths by traumatic injury.\n2. The calculation of this undercount excludes those who are missing and presumed dead.\nA second adjustment must be made for the percentage of Gazans whose whereabouts are unknown but who are likely dead. That calculation has remained more or less set, by organisations including the UN Office for the Co-ordination of Humanitarian Affairs and the Lancet study, since at least May 2024, at about 10,000.\nIt is almost certainly much higher now: ever more buildings have been bombed and demolished, and no heavy equipment capable of digging out bodies has been allowed to operate. An indeterminate number of Gazans have been shipped to Israeli prison camps to be imprisoned without charges and frequently starved, beaten, and/or sexually or medically tortured. An unknown number of these people have also been killed, their bodies dumped on the ground back in Gaza to be identified or not, or buried or stored in Israeli territory, their names often unrecorded and rarely reported.\nBut again, we’ll go with the consensus minimum: 10,000.\nGMH / .59\n+10,000\nThe current minimum death toll in the Gaza genocide is now 115,085 — our overall minimum number for deaths by traumatic impact alone.\n3. This number does not include anyone killed in the genocide by any means other than traumatic violence leading more or less directly to death (though we can be sure that many thousands of those actually suffered in the worst imaginable pain and despair beneath the rubble, or in the street, or on a bombed-out hospital floor, for some time before dying).\nIf we want to include Gazans killed by other siege tactics — Israel’s strategic denial of food, water, medical supplies, power, and medicine — we must rely on data from previous bombing and siege campaigns with similar profiles. This is challenging, in part because the Gaza genocide is genocidal: because only a tiny fraction of Gazans have been allowed to leave Gaza, and because the IDF has ensured a civilian casualty rate that vastly exceeds that of comparable bombardments, and because no bombing campaign has been as proportionately destructive since or even before World War II, the scope of “excess mortality” compared to the death rate before October 2023 may be so large that there is nothing in the historical data to help us estimate a probable maximum.\nSo again, let’s set the minimum.\nThe Lancet followed up its initial study by publishing a letter from three other internationally respected doctors and epidemiologists pointing out that according to extensive studies of recent wars compiled by the UNHCR, the ratio of “indirect deaths” to direct deaths from traumatic impact ranged from 3:1 to 15:1. It’s worth emphasising once again that the bombing campaign in Gaza has been more destructive than any of the wars that yielded these ratios. Nonetheless, we will take the smallest recorded ratio of 3:1 – even less than the 4:1 ratio that the UNHCR study uses as its most “conservative” metric.\nGMH / .59\n+10,000\nx3\nThe minimum death toll in the Gaza genocide is now 463,220 — our minimum number of deaths directly attributable to the genocide.\nThese numbers, which represent the most conservative minimum that is scientifically plausible in each case, can now be used as a baseline for further calculations:\n+ Before October 2023, the population of the Gaza Strip was about 2.23 million. Direct deaths from the genocide have killed at least 5% of the population. Direct and indirect deaths from the genocide have killed at least 20% of the population.\n+ Given Israel’s own estimate that there were some 30,000 Hamas fighters in Gaza as of October 2023, of which it now says it has killed some 20,000 (it has provided no evidence for either figure), the civilian death rate it has inflicted through direct deaths is more than 83%. The overall civilian death rate it has inflicted in Gaza since October 2023 is at least 96%. Both percentages are well within the range the IDF has _explicitly_ _allowed_.\n+ Before October 2023, c hildren under 15 years old represented 44% of Gaza’s population. The Lancet study found 59% of direct deaths to be those of women, children, and the elderly—excluding military-age men. Basic demographics show that 66% of that 59% were children under 15. The direct death toll for children under 15 in this genocide is at least 45,221. The death toll for children under 15 including all deaths caused by the genocide is, at minimum, 135,664 – and almost certainly many more.\nThere will be no way to accurately count the dead in Gaza until the bombing ends. Even then, it will take years, at best. Nonetheless, we can bear better witness than the repetition of the baseline numbers tallied by the Gaza Ministry of Health; and we can bear far better witness than to recite, like a talisman, that it “does not distinguish between civilians and combatants\".\nWe can — we must — start acknowledging the bare minimum of what this genocide has already, indisputably wrought.\nRepublished from CounterPunch, 19 August 2025\nThe views expressed in this article may or may not reflect those of Pearls and Irritations."
    },
    {
      "news_title": "83% of killed in Gaza are civilians: Israel's classified database",
      "news_link": "https://madhyamamonline.com/world/83-of-killed-in-gaza-are-civilians-israels-classified-database-1440117",
      "bias": "unknown",
      "text": "83% of killed in Gaza are civilians: Israel's classified database\ntext_fieldsTel Aviv: A classified Israeli military intelligence database states that five out of six Palestinians killed by Israeli forces in Gaza were civilians, reported The Guardian.\nNineteen months into the war, Israel killed 53,000 Palestinians according to health authorities in Gaza.\nThe database lists 8,900 named fighters from Hamas and Palestinian Islamic Jihad as dead or “probably dead”. This accounts for just 17 per cent of the total deaths, and thus 83 per cent of the rest are civilians.\nThe database shows that the apparent ratio of deaths of civilians to combatants is extremely high for modern warfare, even compared with conflicts notorious for indiscriminate killings in the Syrian and Sudanese wars.\nMeanwhile, experts warned that Gaza was at risk of famine. The Gaza Strip's largest city is now gripped by famine, according to the world's leading authority on food crises, the Associated Press reported.\nThe Integrated Food Security Phase Classification, or IPC, said Friday that famine was occurring in Gaza City, and is likely to spread to the southern cities of Khan Younis and Deir al-Balah without a ceasefire and an end to restrictions on humanitarian aid.\nAid groups and food security experts have warned for months that Gaza was on the brink of famine, yet this is the first official confirmation.\nCOGAT, the Israeli military agency in charge of transferring aid to the territory, said the report was “false and biased”. It rejected the claim that there was famine in Gaza and said that in recent weeks, significant steps had been taken to expand the amount of aid entering the strip.\nThe situation has vastly deteriorated in Gaza. The IPC report said that from early July until mid-August, it has seen the most severe deterioration since it began analysing food insecurity and malnutrition in Gaza. And despite the “unprecedented pace” over that time frame, the IPC expects the situation to get worse.\nOne third of Gaza's population is expected to experience catastrophic levels of hunger by the end of next month, the IPC said.\nIsraeli Prime Minister Benjamin Netanyahu has denied there is hunger in Gaza, calling reports of starvation “lies” promoted by Hamas.\nFamine occurs when these conditions are met. The IPC was first set up in 2004 during the famine in Somalia. It includes more than a dozen UN agencies, aid groups, governments and other bodies.\nFamine can appear in pockets, sometimes small ones, and so a formal classification requires caution."
    },
    {
      "news_title": "How Israeli army’s own data shows vast civilian death rate in Gaza – Monkey Viral",
      "news_link": "https://monkeyviral.com/how-israeli-armys-own-data-shows-vast-civilian-death-rate-in-gaza/",
      "bias": "unknown",
      "text": "How Israeli army’s own data shows vast civilian death rate in Gaza\nFigures from a leaked Israeli military database indicate that 83 percent of Palestinians killed in Gaza are civilians.\nFigures from a leaked Israeli military database indicate that 83 percent of Palestinians killed in Gaza are civilians."
    },
    {
      "news_title": "Israeli database hints: at least 83% of Gaza dead were civilians",
      "news_link": "https://israelpalestinenews.org/israel-kills-with-impunity/",
      "bias": "unknown",
      "text": "Classified intelligence from May reveals Israel believed it had killed some 8,900 militants in its attacks on Gaza, indicating a proportion of civilian slaughter with few parallels in modern warfare, a joint investigation finds.\nData from an internal Israeli intelligence database indicates that at least 83 percent of Palestinians killed in Israel’s onslaught on Gaza were civilians, an investigation by +972 Magazine, Local Call, and the Guardian can reveal.\nFigures obtained from the classified database — which records the deaths of militants from Hamas and Palestinian Islamic Jihad (PIJ) — contradict by a huge margin the public statements of Israeli army and government officials throughout the war, which have generally claimed a 1:1 or 2:1 ratio of civilian to militant casualties. Instead, the classified data backs up the findings of several studies suggesting Israel’s bombardment of Gaza has killed civilians at a rate with few parallels in modern warfare.\nThe Israeli army confirmed the existence of the database, which is managed by the Military Intelligence Directorate (known by the Hebrew acronym “Aman”). Multiple intelligence sources familiar with the database said the army views it as the only authoritative tally of militant casualty figures. In the words of one of them: “There’s no other place to check.”\nThe database includes a list of 47,653 names of Palestinians in Gaza whom Aman considers to be active in the military wings of Hamas and PIJ; according to the sources, the list is based on the groups’ own internal documents acquired by the army (which +972, Local Call, and the Guardian were unable to verify). The database designates 34,973 of the names as operatives of Hamas and 12,702 as operatives of Islamic Jihad (a small number are listed as active with both groups, but these are counted only once in the overall total).\nAccording to the data, which was obtained in May of this year, the Israeli army believed it had killed around 8,900 operatives since October 7 — the deaths of 7,330 of whom were considered certain and 1,570 recorded as “probably dead.” The vast majority of them were junior, with the army suspecting it had killed 100-300 senior Hamas operatives out of a total of 750 named in the database.\nA source familiar with the database explained that a specific piece of intelligence is attached to the name of every operative on the list whom the army is sure it killed, justifying that designation. +972, Local Call, and The Guardian obtained the numerical data from the database without the names or additional intelligence reports.\nThe overall death tolls published daily by the Gaza Health Ministry (which Local Call revealed last year are considered reliable even by the Israeli military) do not distinguish between civilians and militants. But taking the militant casualty figures obtained from the internal Israeli army database in May and lining them up against the Health Ministry’s total death toll, it is possible to calculate an approximate civilian casualty ratio for the war up until three months ago, when the death toll stood at 53,000.\nAssuming that all of the certain and probable militant deaths were counted in the death toll, that would mean over 83 percent of Gaza’s dead were civilians. If the probable deaths are discounted and only the certain deaths included, the proportion of civilian deaths rises to more than 86 percent.\nThe intelligence sources explained that the total number of militants killed is likely higher than the number recorded in the internal database, since it does not include Hamas or PIJ operatives who were killed but could not be identified by name, Gazans who took part in fighting but were not officially members of Hamas or PIJ, nor political figures in Hamas such as mayors and government ministers whom Israel also considers legitimate targets (in violation of international law).\nHowever, that does not necessarily mean the ratio of civilian casualties is lower than calculated above; in fact, it could be even higher. Recent studies have suggested the Health Ministry’s death toll — which currently stands at around 62,000 — is also likely a significant undercount of the total number of casualties from Israel’s onslaught, possibly by as many as several tens of thousands.\nFudging the numbers\nSince early on in the war, Israeli officials have sought to dismiss accusations of wanton killing in Gaza as the Palestinian death toll rapidly stacked up. In December 2023, with the death toll already at 16,000, the Israeli army’s international spokesperson, Jonathan Conricus, told CNN that Israel had killed two civilians for every one militant — a ratio he described as “tremendously positive.” In May 2024, with the death toll at 35,000, Prime Minister Benjamin Netanyahu asserted that the ratio was in fact closer to 1:1, a claim he repeated in September of the same year.\nThe specific number of militants Israel claims to have killed since October 7 has fluctuated seemingly without any logic. In November 2023, a senior security official implied to Israel’s Ynet news site that Israel had already killed over 10,000 militants. In an official military assessment presented to the government the following month, this number dropped to 7,860.\nMysterious jumps and drops in militant casualty numbers continued into 2024. In February of that year, the IDF Spokesperson claimed that Israel had killed 13,000 Hamas operatives, but a week later, the army reported a lower figure of 12,000. By August 2024, the army declared that it had killed 17,000 Hamas and PIJ operatives — a number that shrank again two months later to 14,000 killed “with high probability.” In November 2024, Netanyahu put the number “close to 20,000.”\nIn his retirement speech in January of this year, outgoing Chief of Staff Herzi Halevi reiterated that Israel had killed 20,000 militants in Gaza since October 7. And in June, the right-wing Begin-Sadat Center for Strategic Studies at Bar-Ilan University cited military sources claiming that the number of militant casualties in Gaza stood at 23,000.\nIntelligence sources told +972, Local Call, and the Guardian that some of these claims likely arose from an older, inaccurate database maintained by the army’s Southern Command, which estimated late last year — without a list of names — that around 17,000 militants had been killed. “Those numbers are tall tales of the Southern Command,” one intelligence source said.\nThe Southern Command’s exaggerated reports were likely based on statements from commanders in the field whose subordinates regularly misreported civilian casualties as militants.\nFor example, +972 and Local Call recently revealed a case in which a battalion stationed in Rafah killed around 100 Palestinians and recorded them all as “terrorists,” yet an officer in the battalion testified that in all but two cases the victims had been unarmed. An investigation by Haaretz last year similarly found that only 10 out of 200 “terrorists” the IDF Spokesperson stated that the 252nd Division had killed in the Netzarim Corridor could be verified as Hamas operatives.\nIn April 2024, the right-wing daily Israel Hayom reported that several members of the Knesset’s Foreign Affairs and Defense Committee had questioned the reliability of the militant casualty figures presented to them by the army. After examining the army’s own data, the committee members found that the real number was much lower, and that the army had inflated the number of militant casualties “in order to create a 2:1 ratio” between civilian and militant deaths.\n“We are reporting a lot of Hamas operatives killed, but I think most of the people we report as dead are not really Hamas operatives,” an intelligence source who accompanied forces on the ground told +972, Local Call, and the Guardian. “People are promoted to the rank of terrorist after their death. If I had listened to the brigade, I would have come to the conclusion that we had killed 200 percent of Hamas operatives in the area.”\nAn official security source confirmed that before the intelligence database was in use, the army’s militant casualty figures — such as the number 17,000 — were just an “estimate” largely based on officer testimonies. “The method of counting changed,” the source said. “At the start of the war, [we relied] on commanders saying ‘I killed five terrorists.’”\nThe intelligence database, in contrast, is based on a person-by-person analysis and is the only number the army can “commit to” with a high degree of certainty, the source explained — even while assuming that it could be an undercount. The source added that the numbers political leaders say publicly are not coordinated with the available intelligence data.\nPalestinian analyst Muhammad Shehada told +972, Local Call, and the Guardian that the numbers in the intelligence database line up closely with figures quoted to him by Hamas and PIJ officials: in December 2024, they estimated that Israel had killed around 6,500 of their members, including from the political wing.\n‘They lie non-stop’\nSoon after October 7, Yossi Sariel, then-commander of the army’s elite signals intelligence squad, Unit 8200, began sharing a daily update with his subordinates showing the number of Hamas and PIJ operatives killed in Gaza. The graph, according to three sources familiar with it, was called the “war dashboard” and was presented by Sariel as a measure of the army’s success.\n“He put a lot of emphasis on ‘data, data, data,’” one of Sariel’s subordinates explained. “[There was a] need to measure everything in quantitative terms. To show efficiency. To try to make everything smarter and more technological.” Another source said it was like “a football game, officers sitting around watching the numbers go up on the dashboard.” (Yossi Sariel declined our request for comment, referring us to the IDF Spokesperson.)\nMaj. Gen. (res.) Itzhak Brik, who served for many years as a commander in the Israeli army and later as Ombudsman for Soldiers’ Complaints, explained how this outlook fueled a culture of lying. “They created a measure [whereby] the more you killed, the more you succeeded, and as a result they lied about how many they killed,” he said, describing the numbers presented by the IDF Spokesperson as “one of the most serious bluffs” in Israel’s history.\n“They lie non-stop — both the military echelon and the political echelon,” Brik added. “In every raid, the IDF Spokesperson’s announcements said: ‘Hundreds of terrorists were killed,’” he continued. “It’s true that hundreds were killed, but they weren’t terrorists. There is absolutely no connection between the numbers they announce and what is actually happening.”\nWhile speaking to soldiers whose job was to examine and identify the bodies of people the army kills in Gaza, he said they told him: “Everyone the army says it killed, most of them are [civilians]. Period.”\nBoth Hamas and PIJ have been severely weakened by Israel’s offensive over the past two years, which has killed most of the groups’ senior command and significantly damaged their military infrastructure. Still, the data obtained from the intelligence database shows that Israel has killed only one-fifth of those it considers to be militants. American intelligence estimates suggest Hamas has recruited 15,000 operatives during the war, twice as many as Israel killed.\nBut widespread genocidal rhetoric from Israel’s leadership and senior military command since the very beginning of the war suggests an intention to harm all Palestinians in Gaza, not just militants. On the morning of October 7, then-Chief of Staff Herzi Halevi told his wife, “Gaza will be destroyed,” she revealed on a recent podcast. And in a leaked recording from recent months aired last week on Israel’s Channel 12, the then-director of Aman, Aharon Haliva, said “50 Palestinians must die” for every Israeli killed on October 7, adding, “it doesn’t matter now if they are children.”\nInternational law does not assert what constitutes an “acceptable” civilian casualty ratio, but rather examines each attack according to the principle of “proportionality.” In this regard, as early as November 2023, +972 and Local Call revealed that the Israeli army had significantly loosened restrictions on civilian casualties after October 7, authorizing the killing of more than 100 Palestinian civilians when attempting to assassinate one senior Hamas commander, and up to 20 for junior operatives.\nThe result of this firing policy and the broader culture of revenge following October 7 is a civilian casualty ratio in Gaza that is extremely high for modern warfare, experts say, even compared with conflicts notorious for indiscriminate killing, such as the Syrian and Sudanese civil wars.\n“That proportion of civilians among those killed would be unusually high, particularly as it has been going on for such a long time,” said Therese Pettersson from the Uppsala Conflict Data Programme (UCDP), which collects data on civilian casualties worldwide. She added that it is possible to find similar civilian casualty ratios when singling out a particular city or battle within a broader conflict, but “very rarely” when looking at a war as a whole.\nIn global conflicts tracked by UCDP since 1989, civilians made up a greater proportion of the dead only in the genocides in Srebrenica (1992-95) and Rwanda (1994) and during Russia’s three-month siege of Mariupol (2022), Pettersson said.\nOnly when there is a ceasefire will it be possible to precisely calculate the number of civilian and militant casualties in Gaza. But the intelligence database indicates that the civilian casualty ratio is vastly higher than the figures Israel has presented to the world for almost two years.\n+972 and Local Call initially approached the IDF Spokesperson for comment at the end of July, and received a statement that did not dispute our findings: “Throughout the war, comprehensive intelligence assessments were conducted on the number of terrorists eliminated in the Gaza Strip. The count is a complex intelligence process that is based on the situation of the forces on the ground and intelligence information, while cross-referencing a wide range of intelligence sources.”\nThree weeks later, after the Guardian’s request for comment on the same data, the army said it wanted to “rephrase” its response and rejected our findings without further explanation: “The figures presented in the article are incorrect and do not reflect the data available in the IDF’s systems. Throughout the war, continuous intelligence assessments are conducted regarding the number of terrorists eliminated in the Gaza Strip, based on BDA [bomb damage assessment] methodologies and cross-checking efforts from various sources … [including] documents originating from terrorist organizations in the Strip.”\nA spokesperson did not immediately respond when asked why the military had given different responses to questions about a single set of data.\nYuval Abraham is a journalist and filmmaker based in Jerusalem.\nRELATED:\n- More than 80 Organizations Call on Congress to Uphold US Law and Suspend Security Assistance to Israel\n- Israel’s Targeting of Palestinian Reporters in Gaza Isn’t Collateral Damage. It’s Strategy\n- Israel’s army formed special intel unit to ‘justify killing’ of hundreds of Gaza journalists\n- Israel’s arms industry thrives on genocide and the world keeps buying\n- 100,000 Dead: What We Know About Gaza’s True Death Toll\n- Gaza death toll may be 41% higher than official figures: study"
    },
    {
      "news_title": "'Israeli' data admits 83% of Gaza casualties are civilians, contradicting previous claims",
      "news_link": "https://en.royanews.tv/news/62378",
      "bias": "unknown",
      "text": "Welcome to Roya News, stay informed with the most important news at your fingertips.\nLog In\nLive Broadcast\nعربي\nHome\nGold Prices\nJordan\nPalestine\nMENA\nWorld\nLifestyle\nHealth\nTechnology\nWeather\nEconomy\nSport\nTop Stories\nVideos\nLoading news details..."
    },
    {
      "news_title": "Israeli data shows 83 percent of Gaza war dead are civilians",
      "news_link": "https://www.arabobserver.com/israeli-data-shows-83-percent-of-gaza-war-dead-are-civilians/",
      "bias": "unknown",
      "text": "Israeli data shows 83 percent of Gaza war dead are civilians\nLeaked Israeli intelligence confirms one of the highest civilian tolls in modern conflicts.\nA classified Israeli military database shows the vast majority of Palestinians killed in Gaza are civilians, according to a joint investigation by The Guardian, +972 Magazine, and Local Call.\nFigures reviewed by the outlets revealed on Thursday indicate that, as of May 2025 – 19 months into Israel’s war on Gaza – Israeli military intelligence had listed 8,900 fighters from Hamas and Palestinian Islamic Jihad (PIJ) as confirmed or “probably” dead.\nOver the same period, Gaza’s health authorities recorded at least 53,000 deaths from Israeli attacks, meaning that named fighters accounted for just 17 percent of those killed, with civilians at about about 83 percent of the total death toll.\nRights groups and genocide scholars argue the findings further support claims that Israel is committing genocide in Gaza, pointing to mass civilian deaths alongside deliberate starvation.\nConflict researchers say that ratio is almost unparalleled in modern warfare. Only the Rwandan genocide, the 1995 Srebrenica massacre, and Russia’s 2022 siege of Mariupol recorded a higher civilian death rate, the authors noted.\nWhen asked to comment by The Guardian, +972 Magazine, and Local Call, the Israeli military did not deny the existence of the intelligence database or the listed figures for Hamas and PIJ casualties.\nleaked audio recordings aired on Israel’s Channel 12, Aharon Haliva, the former head of military intelligence, claimed, “The fact that there are already 50,000 dead in Gaza is necessary and required for future generations.”\nIsraeli politicians and military leaders have long inflated fighter death tolls, at times claiming as many as 20,000 fighters killed or insisting on a civilian-to-combatant ratio of 1:1 – figures that the report notes they do not believe in private.\nMeanwhile, Israeli rhetoric has increasingly mirrored genocidal language.\nIn leaked audio recordings aired on Israel’s Channel 12, Aharon Haliva, the former head of military intelligence, claimed, “The fact that there are already 50,000 dead in Gaza is necessary and required for future generations.”\nHe went further, saying: “For each [victim] on 7 October, 50 Palestinians have to die … There’s no choice, they need a Nakba every now and then to feel the consequences.” The Nakba, or “catastrophe”, refers to the killing and ethnic cleansing of Palestinians in 1948 to make way for the creation of Israel.\nBy March, Gaza’s death toll had reached 50,000; it has since risen to beyond 62,000, according to the enclave’s health ministry. The total number of wounded has now exceeded 157,000.\nThe International Criminal Court has issued arrest warrants for Israeli Prime Minister Benjamin Netanyahu and his former Defence Minister Yoav Gallant, accusing them of war crimes and crimes against humanity committed between October 2023 and May 2024."
    },
    {
      "news_title": "Israeli information exhibits 83 p.c of Gaza struggle useless are civilians: Report | Israel-Palestine battle Information",
      "news_link": "https://pokonews.com/israeli-information-exhibits-83-p-c-of-gaza-struggle-useless-are-civilians-report-israel-palestine-battle-information/",
      "bias": "unknown",
      "text": "Verifying that you are not a robot..."
    },
    {
      "news_title": "+972 Magazine: Israeli army database suggests at least 83% of Gaza dead were civilians - Brave New Europe",
      "news_link": "https://braveneweurope.com/972-magazine-israeli-army-database-suggests-at-least-83-of-gaza-dead-were-civilians",
      "bias": "unknown",
      "text": "Classified intelligence from May reveals Israel believed it had killed some 8,900 militants in its attacks on Gaza, indicating a proportion of civilian slaughter with few parallels in modern warfare, a joint investigation finds.\nRelated Articles\nVOA News: EU Says Croatia Ready to Adopt Euro Currency in 2023\nThe European Commission said Wednesday that Croatia had met all the criteria to join the eurozone, paving the way for the country to become the single currency’s 20th member on January 1. Read Here\nEurostat: No EU growth in second quarter 2023 – Minus avoided thanks to Ireland’s Leprechaun economy\nRead HERE\nGreenpeace: ECB injects over €7 billion into fossil fuels since start of COVID-19 crisis\nJune 3, 2020\nMathew D. Rose\nClimate Crisis, Energy, Finance, Financial Institutions, Sustainability\n0\nSo much for von der Leyen’s Green Deal Read here\nBe the first to comment"
    },
    {
      "news_title": "83% Of Those Killed In Gaza Are Civilians, Per Israel's Own Data",
      "news_link": "https://progressivehub.net/83-of-those-killed-in-gaza-are-civilians-per-israels-own-data/",
      "bias": "unknown",
      "text": "Classified intelligence from May reveals Israel believed it had killed some 8,900 militants in its attacks on Gaza, indicating a proportion of civilian slaughter with few parallels in modern warfare, a joint investigation finds.\nBy Yuval Abraham, +972 Magazine\nData from an internal Israeli intelligence database indicates that at least 83 percent of Palestinians killed in Israel’s onslaught on Gaza were civilians, an investigation by +972 Magazine, Local Call, and the Guardian can reveal.\nFigures obtained from the classified database — which records the deaths of militants from Hamas and Palestinian Islamic Jihad (PIJ) — contradict by a huge margin the public statements of Israeli army and government officials throughout the war, which have generally claimed a 1:1 or 2:1 ratio of civilian to militant casualties. Instead, the classified data backs up the findings of several studies suggesting Israel’s bombardment of Gaza has killed civilians at a rate with few parallels in modern warfare.\nThe Israeli army confirmed the existence of the database, which is managed by the Military Intelligence Directorate (known by the Hebrew acronym “Aman”). Multiple intelligence sources familiar with the database said the army views it as the only authoritative tally of militant casualty figures. In the words of one of them: “There’s no other place to check.”\nThe database includes a list of 47,653 names of Palestinians in Gaza whom Aman considers to be active in the military wings of Hamas and PIJ; according to the sources, the list is based on the groups’ own internal documents acquired by the army (which +972, Local Call, and the Guardian were unable to verify). The database designates 34,973 of the names as operatives of Hamas and 12,702 as operatives of Islamic Jihad (a small number are listed as active with both groups, but these are counted only once in the overall total).\nAccording to the data, which was obtained in May of this year, the Israeli army believed it had killed around 8,900 operatives since October 7 — the deaths of 7,330 of whom were considered certain and 1,570 recorded as “probably dead.” The vast majority of them were junior, with the army suspecting it had killed 100-300 senior Hamas operatives out of a total of 750 named in the database.\nA source familiar with the database explained that a specific piece of intelligence is attached to the name of every operative on the list whom the army is sure it killed, justifying that designation. +972, Local Call, and the Guardian obtained the numerical data from the database without the names or additional intelligence reports.\nRecent Posts\nTrump Threatens Chicago With Federal Takeover Despite Falling Crime\nAugust 25, 2025\nTake Action Now Democrats decry a “manufactured crisis” as the White House touts a post-DC crackdown and eyes Chicago, despite data showing declining…\nWill The DNC End Their Complicity In Israeli Genocide Or Double Down?\nAugust 25, 2025\nTake Action Now As apologists for Israel, Democratic leaders in Congress and at the DNC are doing major damage to the party’s prospects for…\nHow LA Is Uniting To Provide Mutual Aid For Those Impacted By ICE Raids\nAugust 24, 2025\nTake Action Now Through fundraisers, grocery deliveries, ‘adopt a corner’ initiatives and ICE watch, Angelenos are coming together to support their…\nDemocrat Warns U.S. Progressives Against Moving Toward The Center: ‘It Lost Me The Election’\nAugust 23, 2025\nTake Action Now India Walton, who defeated incumbent mayor only to lose general election, says ‘moderating is what got us here’By Joseph Gedeon,…"
    },
    {
      "news_title": "Guardian: Israeli Army secrets show that 83% of the dead in Gaza are civilians - World Stock Market",
      "news_link": "https://www.worldstockmarket.net/guardian-israeli-army-secrets-show-that-83-of-the-dead-in-gaza-are-civilians/",
      "bias": "unknown",
      "text": "Evidence from a secret database of the Israeli Military Intelligence Service shows that five in six Palestinians killed by Israeli forces in Gaza were civilians -an extremely high rate, which has rarely been observed in wars in recent decades, as the Guardian reports. In May, 19 months after the start of the war, Israeli intelligence officials recorded 8,900 named Fighters of Hamas and Palestinian Islamic Jihad as dead or “probably dead”, according to a Guardian investigation of the Israeli-Palestinian +9 At the same time, Gaza’s health authorities reported 53,000 Palestinian dead from Israeli attacks, a number that includes fighters and civilians. Fighters named in the Army database account for only 17% of the total, indicating that 83% of the dead were civilians. “Extremely high” percentage of civilians This percentage is considered extremely high for modern conflicts, even in conflicts known for uncontrolled violence, such as civil wars in Syria and […]\nSource: News Beast\nWith 6 years of experience, I bring to the table captivating and informative writing in the world news category. My expertise covers a range of industries, including tourism, technology, forex and stocks. From brief social media posts to in-depth articles, I am dedicated to creating compelling content for various platforms."
    }
  ]
}