{
  "story_id": "GN_20250823_200817_f7b57827",
  "metadata": {
    "title": "India says US trade negotiations are still going on as fresh tariffs loom",
    "timestamp": "2025-08-23T20:08:17.125275",
    "url": "https://ground.news/article/india-says-us-trade-negotiations-are-still-going-on-as-fresh-tariffs-loom_835031"
  },
  "bias_distribution": {
    "total_sources": "34",
    "leaning_left": "3",
    "center": "11",
    "leaning_right": "6"
  },
  "perspective_summaries": {
    "left": [
      "On August 23, 2025, Indian Foreign Minister Subrahmanyam Jaishankar confirmed that discussions regarding trade with the United States are continuing despite existing tensions and tariffs.",
      "These talks follow the Trump administration's decision to raise tariffs above 50% on Indian goods as a penalty for India's continued purchase of Russian oil, which India disputes.",
      "Jaishankar emphasized that defending farmers' and small producers' interests are red lines that India will not compromise, and he criticized the framing of the dispute mainly as an oil issue.",
      "He highlighted that the volume of trade between Russia and European countries significantly exceeds that between Russia and India, noting that claims about India financing the war overlook the larger scale of Russia-EU commerce.",
      "A scheduled trip by American trade officials to New Delhi from August 25 to 29 was called off, reducing expectations for a rollback or delay of tariffs amid ongoing discussions between the two nations."
    ],
    "center": [
      "On August 23, 2025, Indian Foreign Minister Subrahmanyam Jaishankar confirmed that discussions regarding trade with the United States are continuing despite existing tensions and tariffs.",
      "These talks follow the Trump administration's decision to raise tariffs above 50% on Indian goods as a penalty for India's continued purchase of Russian oil, which India disputes.",
      "Jaishankar emphasized that defending farmers' and small producers' interests are red lines that India will not compromise, and he criticized the framing of the dispute mainly as an oil issue.",
      "He highlighted that the volume of trade between Russia and European countries significantly exceeds that between Russia and India, noting that claims about India financing the war overlook the larger scale of Russia-EU commerce.",
      "A scheduled trip by American trade officials to New Delhi from August 25 to 29 was called off, reducing expectations for a rollback or delay of tariffs amid ongoing discussions between the two nations."
    ],
    "right": [
      "India's trade negotiations with the United States continue, according to External Affairs Minister S. Jaishankar, who stated that defending farmers' interests is a priority and that there are non-negotiable red lines in the talks.",
      "A 25 percent tariff on Indian imports to the U.S. is currently imposed, with an additional 25 percent scheduled for August 27, significantly impacting trade.",
      "Jaishankar criticized the U.S. for its harsh tariffs, calling them \"unjustified and unreasonable,\" while emphasizing India’s right to make decisions in its national interest.",
      "Concerns have arisen as the planned visit by U.S. trade negotiators to Delhi from August 25 to 29 has been canceled, suggesting that tariffs may not be lowered."
    ]
  },
  "sources": [
    {
      "news_title": "India Says US Trade Negotiations Are Still Going on as Fresh Tariffs Loom",
      "news_link": "https://www.usnews.com/news/top-news/articles/2025-08-23/india-says-trade-negotiations-with-us-are-still-going-on",
      "bias": "Lean Left",
      "text": null
    },
    {
      "news_title": "India says US trade negotiations are still going on as fresh tariffs loom",
      "news_link": "https://www.reuters.com/world/china/india-says-us-trade-negotiations-are-still-going-fresh-tariffs-loom-2025-08-23/",
      "bias": "Center",
      "text": null
    },
    {
      "news_title": "India says US trade negotiations still going on as fresh tariffs loom",
      "news_link": "https://www.channelnewsasia.com/asia/india-us-trade-negotiations-ongoing-tariffs-russia-oil-5310576",
      "bias": "Center",
      "text": "India says US trade negotiations still going on as fresh tariffs loom\nMUMBAI: India's foreign minister said on Saturday (Aug 23) that trade negotiations with Washington are continuing but there are lines that New Delhi needs to defend, just days before hefty additional US tariffs are due to hit.\nIndian goods face additional US tariffs of up to 50 per cent, among the highest imposed by Washington, due to its increased purchases of Russian oil. A 25 per cent tariff has already come into effect, while the remaining 25 per cent is set to be enforced from Aug 27.\nA planned visit by US trade negotiators to New Delhi from Aug 25 to Aug 29 has been called off, dashing hopes that the levies may be lowered or postponed.\n\"We have some redlines in the negotiations, to be maintained and defended,\" Indian Foreign Minister Subrahmanyam Jaishankar said at an Economic Times forum event in New Delhi, singling out the interests of the country's farmers and small producers.\nIndia-US trade talks collapsed earlier this year due to India not agreeing to open its vast agricultural and dairy sectors. Bilateral trade between the world's largest and fifth-largest economy is worth over US$190 billion.\n\"It is our right to make decisions in our 'national interest',\" Jaishankar said.\nAnalysts at Capital Economics said on Friday that if the full US tariffs come into force and stick, the hit to India's economic growth would be 0.8 percentage points both this year and next.\n\"The longer-term harm could be even greater as a high tariff could puncture India’s appeal as a global manufacturing hub.\"\nThe Indian minister described US President Donald Trump's policy announcements as \"unusual\".\n\"We have not had a US president who conducts his foreign policy so publicly as the current one and (it) is a departure from the traditional way of conducting business with the world,\" Jaishankar said.\nHe also said Washington's concern over India's Russian oil purchases was not being applied to other major buyers such as China and European Union.\n\"If the argument is oil, then there are (other) big buyers. If argument is who is trading more (with Russia), than there are bigger traders,\" he said.\nRussia-European trade is bigger than India-Russia trade, he added.\nThe minister also said India's purchases of Russian oil had not been raised in earlier trade talks with the US before the public announcement of tariffs."
    },
    {
      "news_title": "India to defend 'red lines' as fresh US tariffs loom",
      "news_link": "https://thewest.com.au/business/india-to-defend-red-lines-as-fresh-tariffs-loom-c-19779747",
      "bias": "Lean Right",
      "text": "Close navigation menu\nSubscribe\nLog In\nSearch\nHome\nSubscriber Exclusive\nLatest\nToday's Paper\nPuzzles\nTimespool\nWest Rewards\nVanishing Cousins\nUp Late\nCourt in the Act\nNews\nReveal sub navigation\nChevron Down Icon\nWA News\nAustralia\nWorld\nRegional\nCrime\nCourts & Justice\nHealth\nEducation\nSport\nReveal sub navigation\nChevron Down Icon\nAFL\nCricket\nWest Coast Eagles\nFremantle Dockers\nAFLW\nWAFL\nBasketball\nSoccer\nNRL\nRugby Union\nHorse Racing\nNetball\nTennis\nMotorsport\nGolf\nBusiness\nReveal sub navigation\nChevron Down Icon\nMarkets\nProperty\nMining\nEnergy\nHerd On The Terrace\nYour Money\nAgriculture\nBulls N’ Bears\nThe Debrief\nPolitics\nReveal sub navigation\nChevron Down Icon\nFederal Politics\nState Politics\nLocal Government\nWorld Politics\nRegional\nReveal sub navigation\nChevron Down Icon\nSouth West\nGreat Southern\nGoldfields\nPeel/Rockingham\nGascoyne\nMid West\nKimberley\nPilbara\nOpinion\nReveal sub navigation\nChevron Down Icon\nEditorials\nBen Harvey\nJessica Page\nKate Emery\nKatina Curtis\nBasil Zempilas\nEmma Garlett\nKim MacDonald\nPaul Murray\nJustin Langer\nBelle Taylor\nLaura Newell\nAnxiety Aunt\nLifestyle\nReveal sub navigation\nChevron Down Icon\nFood\nDrink\nHealth & Wellbeing\nGarden\nRetirement\nFashion\nMotoring\nNew Homes\nReal Estate\nHouse That!\nSTM\nPLAY\nEntertainment\nReveal sub navigation\nChevron Down Icon\nCelebrity Gossip\nMovies\nTV\nMusic\nTheatre\nBooks\nArts\nCompetitions & Puzzles\nTravel\nReveal sub navigation\nChevron Down Icon\nWestern Australia\nAustralia\nAsia\nWest Travel Club\nPhotography\nTravel Tips\nEurope\nTechnology\nReveal sub navigation\nChevron Down Icon\nGadgets\nGaming\nInternet\nApps\nSmartphones\nHardware\nScience\nInnovation\nTelecommunications\nSecurity\nMenu\nHome\nSearch\nSearch\nThe West Australian\nToday's Paper\nPlace an Ad\nSaturday, 23 August 2025\nBusiness\nIndia to defend 'red lines' as fresh US tariffs loom"
    },
    {
      "news_title": "\"Not Something That...\": S Jaishankar Explains \"Red Lines\" In US Trade Negotiations",
      "news_link": "https://www.ndtv.com/india-news/s-jaishankar-explains-red-lines-in-india-us-trade-negotiations-9144639",
      "bias": "Lean Right",
      "text": null
    },
    {
      "news_title": "Jaishankar hits out at U.S. tariffs, says India will not compromise on farmers' interests",
      "news_link": "https://www.thehindu.com/news/national/jaishankar-hits-out-at-us-tariffs-says-india-will-not-compromise-on-farmers-interests/article69967779.ece",
      "bias": "Lean Left",
      "text": "External Affairs Minister S. Jaishankar on Saturday (August 23, 2025) hit out at the United States for what he called “unjustified and unreasonable” tariffs on Indian goods, after the Trump administration raised duties to over 50% as a penalty for India’s purchase of Russian oil.\nSpeaking at The Economic Times World Leaders Forum 2025, Mr. Jaishankar said India’s priority was to protect farmers and small producers, stressing that New Delhi would not compromise on their interests.\n“What we are concerned about is that red lines are primarily the interest of our farmers and, to some extent, our small producers. So when people pronounce that we have succeeded or failed, we as a government are committed to defending the interests of our farmers and small producers. We are determined on that. That’s not something we can compromise,” Mr. Jaishankar said.\n‘Oil dispute’\nThe Minister also argued that the tariff issue was being wrongly presented as an “oil dispute.” He noted that the same criticism levelled at India for purchasing Russian energy had not been applied to larger importers, such as China and European nations.\nBullying tactics: On India pushing back against the U.S., the EU\n“The second issue is that this is being presented as an oil issue. But why I say ‘being presented’ is because the same arguments that have been used to target India have not been applied to the largest oil importer, which is China, and have not been applied to the largest LNG importer, which is the European nations,” he said.\nMr. Jaishankar pointed out the contradiction in the West’s stance, saying Europe trades far more with Russia than India does.\n“And when people say we are funding the war and putting the money, Russia-European trade is bigger than India-Russia trade. So European money is not putting coffers? The overall Russia-EU trade is bigger than the Russia-India trade. If the argument is energy, they (the EU) are bigger buyers. If the argument is who is the bigger trader, they are bigger than us. India’s exports to Russia have grown, but not that much,” he added.\nThe Minister further said India has every right to take decisions in its own national interest. “The issue of decisions that we make in our national interest is our right. And I would say that’s what strategic autonomy is about,” he said.\nTalks with U.S. ongoing\nOn India-U.S. ties, Mr. Jaishankar said talks were ongoing despite tensions. “We are two big countries, as I say, the lines are not cut, people are talking to each other, and we will see where it goes,” he added.\nWhen asked about Washington’s new ambassador to India, Jaishankar avoided comment, saying, “Look, I am the Foreign Minister, I don’t comment on ambassadorial appointments of other countries.”\nEarlier this week, Jaishankar visited Russia, where he met Russian President Vladimir Putin, Deputy First PM Denis Manturov and Foreign Minister Sergey Lavrov. He also co-chaired the 26th session of the India-Russia Inter-Governmental Commission on Trade, Economic, Scientific, Technological and Cultural Cooperation (IRIGC-TEC).\nAccording to the Ministry of External Affairs (MEA), the visit included discussions on terrorism, the conflict in Ukraine, and regional developments in West Asia and Afghanistan. Mr. Jaishankar also conveyed Prime Minister Narendra Modi’s greetings to President Putin and discussed key bilateral and global issues.\nPublished - August 23, 2025 01:44 pm IST"
    },
    {
      "news_title": "'No Compromise On Farmers’ Interests': Jaishankar Highlights 'Red Line' In India-US Trade Talks",
      "news_link": "https://news.abplive.com/business/no-compromise-on-farmers-interests-jaishankar-highlights-red-line-in-india-us-trade-talks-1796187",
      "bias": "Lean Right",
      "text": "'No Compromise On Farmers’ Interests': Jaishankar Highlights 'Red Line' In India-US Trade Talks\nEAM S. Jaishankar slams US tariffs on Indian goods, defends farmers’ interests, stresses strategic autonomy, rejects mediation on Pakistan, and highlights double standards on Russian oil trade.\nExternal Affairs Minister S. Jaishankar on Saturday strongly criticized the United States for imposing steep tariffs on Indian exports, calling the move “unjustified and unreasonable.” His remarks came after the Trump administration raised duties to over 50 percent, penalizing India for continuing oil purchases from Russia.\nSpeaking at The Economic Times World Leaders Forum 2025, Jaishankar underscored that protecting India’s farmers and small producers remains the government’s top priority.\n“Our red lines are clear, our farmers and small producers. Defending their interests is non-negotiable, and that’s something we will not compromise,” he said.\nTariffs Framed as ‘Oil Dispute’\nJaishankar dismissed the notion that the dispute was about energy trade, pointing out a double standard in the West’s criticism of India.\n“This is being presented as an oil issue, but the same arguments have not been applied to China, the world’s largest oil importer, or to European nations, who are the biggest LNG buyers,” he noted.\nHighlighting the contradictions, he added, “Europe trades far more with Russia than India does. If the argument is that buying energy funds the war, then European money is flowing in larger volumes than India’s. Russia–EU trade is far bigger than Russia–India trade.”\nStrategic Autonomy and National Interest\nThe minister firmly defended India’s right to make independent choices in foreign policy.\n“Decisions we make in our national interest are our right. That is what strategic autonomy is about,” Jaishankar asserted.\nOn ongoing negotiations with Washington, he confirmed that dialogue continues despite tensions: “We are two big countries. The lines are not cut; people are talking to each other. We will see where it goes.”\nWhen asked about the new US ambassador to India, Jaishankar declined to comment, saying it was not his place to weigh in on another country’s diplomatic appointments.\nIndia-Russia Engagement\nJaishankar’s remarks followed his recent visit to Russia, where he met President Vladimir Putin, Deputy First PM Denis Manturov, and Foreign Minister Sergey Lavrov. He also co-chaired the 26th session of the India-Russia Inter-Governmental Commission on Trade, Economic, Scientific, Technological and Cultural Cooperation (IRIGC-TEC).\nAccording to the Ministry of External Affairs, discussions covered terrorism, the Ukraine conflict, West Asia, and Afghanistan. Jaishankar conveyed Prime Minister Narendra Modi’s greetings to Putin and discussed bilateral and global issues.\n#WATCH | Delhi: At The Economic Times World Leaders Forum 2025, EAM Dr S Jaishankar speaks on his meeting with Russian President Vladimir Putin, says, \"We have a practice of annual summits with the Russians. We are planning one at the end of the year. It's an annual exercise.… pic.twitter.com/6ljPU8wnug\n— ANI (@ANI) August 23, 2025\nReflecting on his talks with Putin, Jaishankar said India has consistently supported efforts for an early resolution to the conflict in Ukraine. “Our good wishes are there for an early end to the conflict on terms set by the parties themselves,” he said.\nRejecting Mediation on Pakistan\nReiterating India’s long-standing position, Jaishankar said New Delhi will not accept external mediation in its relations with Pakistan.\n“Since the 1970s, there has been a national consensus that we do not accept mediation on Pakistan. Our positions are very clear—whether on trade, farmers’ interests, or strategic autonomy,” he stressed.\n#WATCH | Delhi: At The Economic Times World Leaders Forum 2025, EAM Dr S Jaishankar says, \"On the issue of mediating (India-Pak conflict), since 1970s, for more than 50 years now, there's a national consensus in this country that we do not accept mediation in our relations with… pic.twitter.com/YtqEE6q2M1\n— ANI (@ANI) August 23, 2025\nOn Trump’s Public Diplomacy\nJaishankar also noted the unusual style of US President Donald Trump’s foreign policy.\n“We have not had a US president who has conducted foreign policy as publicly as the current one. Even domestic policies are being played out in public. Applying tariffs in this way, even for non-trade issues, is a novel approach,” he remarked, adding that the entire world is adjusting to this shift.\nDefiant Stand on Trade\nAddressing criticism of India’s energy trade, Jaishankar delivered a pointed message:\n“It’s funny to have a pro-business American administration accuse others of doing business. If you don’t like buying oil or refined products from India, don’t buy it. Nobody forces you. Europe buys, America buys—so if you don’t like it, simply don’t buy it.”"
    },
    {
      "news_title": "India says trade negotiations with US are still going on",
      "news_link": "https://www.straitstimes.com/asia/south-asia/india-says-trade-negotiations-with-us-are-still-going-on",
      "bias": "Lean Right",
      "text": "India says trade negotiations with US are still going on\nSign up now: Get ST's newsletters delivered to your inbox\nFollow topic:\nMUMBAI – India’s foreign minister Subrahmanyam Jaishankar said on Aug 23 that trade negotiations with the United States are still going on but there are lines that New Delhi needs to defend.\nIndian goods face additional US tariffs of up to 50 per cent, among the highest imposed by Washington, due to its increased purchases of Russian oil. A 25 per cent tariff has already come into effect, while the remaining 25 per cent is set to be enforced from Aug 27.\nA planned visit by US trade negotiators to New Delhi from Aug 25 to 29 has been called off\n“We have some redlines in the negotiations, to be maintained and defended,” Mr Subrahmanyam said at an event in New Delhi, singling out the interests of the country’s farmers and small producers.\nIndia-US trade talks collapsed earlier this year due to India not agreeing to open its vast agricultural and dairy sectors. Bilateral trade between the world’s largest and fifth largest economy is worth over US$190 billion (S$243 billion).\n“It is our right to make decisions in our ‘national interest’,” Mr Jaishankar said.\nAnalysts at Capital Economics said on Aug 22 that if the full US tariffs come into force and stick, the hit to India’s economic growth would be 0.8 percentage points both this year and next.\n“The longer-term harm could be even greater as a high tariff could puncture India’s appeal as a global manufacturing hub,” said the Indian minister, who described US President Donald Trump’s policy announcements as “unusual”.\n“We have not had a US president who conducts his foreign policy so publicly as the current one and it is a departure from the traditional way of conducting business with the world,” Mr Jaishankar said.\nHe also said Washington’s concern over India’s Russian oil purchases was not being applied to other major buyers such as China and the European Union.\n“If the argument is oil, then there are other big buyers. If the argument is who is trading more, than there are bigger traders,” he said.\nRussia-European trade is bigger than India-Russia trade, he added.\nThe minister also said India’s purchases of Russian oil had not been raised in earlier trade talks with the US before the public announcement of tariffs. REUTERS"
    },
    {
      "news_title": "S Jaishankar on India-US trade talks: ‘Negotiations continue, but we have some red lines’",
      "news_link": "https://www.moneycontrol.com/news/india/s-jaishankar-on-india-us-trade-talks-negotiations-continue-but-we-have-some-red-lines-13481599.html",
      "bias": "Lean Right",
      "text": "External affairs minister S Jaishankar on Saturday said that India-US trade negotiations are currently underway, however, the bottom line is that “we have some red lines” – just days before heavy extra US tariffs are due to hit Indian goods.\n“Negotiations are still going on in the sense that nobody said the negotiations are off. People do talk to each other. It is not like there's a 'kutti' there,” he said at the Economic Times World Leaders Forum 2025.\n“Where we are concerned, the red lines are primarily the interests of our farmers and, to some extent, of our small producers... We, as a government, are committed to defending the interests of our farmers and our small producers. We are very determined on that. That's not something that we can compromise on,” he added.\nTalks between India and the US collapsed as India, the world’s fifth-largest economy, opposed opening up its massive agricultural and dairy sectors, despite bilateral trade exceeding $190 billion.\n#WATCH | Delhi: At The Economic Times World Leaders Forum 2025, EAM Dr S Jaishankar says, \"Negotiations (India-US trade negotiations) are still going on. But the bottom line is we have some red lines. Negotiations are still going on in the sense that nobody said the negotiations… pic.twitter.com/deCHoeDSrx— ANI (@ANI) August 23, 2025\nIndian exports face US duties of up to 50 per cent -- which happens to be among the highest imposed by Washington -- after President Donald Trump announced extra tariffs as a punishment over purchases of Russian oil.\nCurrently, a 25 per cent tariff on the import of Indian goods into the US has come into effect, while the remaining 25 per cent is set to be enforced from August 27.\nOn a question over Trump’s hard stance against India, Jaishankar said, \"We've not had a US President who's conducted foreign policy as publicly as the current one. That itself is a departure that's not limited to India... President Trump's way of dealing with the world, even dealing with his own country, is a very major departure from the traditional orthodox manner of doing so.”\nEarlier, commerce minister Piyush Goyal said that India will address its future trade relationship with the United States with a \"very open mind\".\nSpeaking at the same event, Goyal said India is addressing the issue of trade with US with a \"very open mind, a positive outlook and the confidence that India-US relationship is very consequential and very important to both the countries.\"\nDiscover the latest Business News, Budget 2025 News, Sensex, and Nifty updates. Obtain Personal Finance insights, tax queries, and expert opinions on Moneycontrol or download the Moneycontrol App to stay updated!"
    },
    {
      "news_title": "'Negotiations Continue, But We Have Some Red Lines': EAM Jaishankar On India-US Trade Deal",
      "news_link": "https://www.ndtvprofit.com/nation/negotiations-continue-but-we-have-some-red-lines-eam-jaishankar-on-india-us-trade-deal",
      "bias": "unknown",
      "text": "'Negotiations Continue, But We Have Some Red Lines': EAM Jaishankar On India-US Trade Deal\nIndia-US Trade Deal: The external affairs minister said trade is 'really the major issue' between the two countries.\nIndia has certain 'red-lines' about its trade negotiations with the US and India will not compromise on protecting the interests of farmers and small producers, External Affairs Minister S Jaishankar said on Saturday. \"We've not had a US president who has conducted foreign policy as publicly as the current one. That itself is a departure that's not limited to India,\" he said.\nThe relations between India and the US are on a downturn after Trump doubled tariffs on Indian goods to 50%, including 25% additional duties for India's purchase of Russian crude oil. The external affairs minister said trade is 'really the major issue' between the two countries.\n\"The negotiations are still going on and the bottom line is we have some red lines. The red lines are primarily the interest of our farmers and to some extent small producers. So when people pronounced that we succeeded or failed,\" he said.\n\"My answer to this is, we as a government are committed to defend the interests of our farmers and small producers. We are very determined on that. That's not something we can compromise on,\" he added.\nThe external affairs minister also responded to allegations by Trump administration officials that India is 'profiteering' by buying discounted Russian crude oil, then selling refined petroleum products at premium prices in Europe.\n\"It's funny to have people who work for a pro-business American administration accusing other people of doing business. That's really curious. If you have a problem buying oil or refined products from India, don't buy it. Nobody forces you to buy it. But Europe buys, America buys, so you don't like it, don't buy it,\" he said.\nThe external affairs minister also rejected observations that India's relations with China are improving in view of strain in India-US ties.\n(With inputs from PTI)"
    },
    {
      "news_title": "We have certain red lines: EAM Jaishankar on negotiations for trade deal with US",
      "news_link": "https://www.newsdrum.in/national/we-have-certain-red-lines-eam-jaishankar-on-negotiations-for-trade-deal-with-us-9726185",
      "bias": "unknown",
      "text": "New Delhi: India has certain \"red-lines\" in its trade negotiations with the US and New Delhi will not compromise on protecting the interests of farmers and small producers, External Affairs Minister S Jaishankar said on Saturday.\nJaishankar said the negotiations for a trade deal between the two sides are underway.\nSpeaking at the Economic Times World Leaders Forum, Jaishankar also said that US President Donald Trump's way of dealing with the world is a very major departure from the traditional way of doing so and the entire world is facing this issue.\n\"We've not had a US president who has conducted foreign policy as publicly as the current one. That itself is a departure that's not limited to India,\" he said.\nThe relations between New Delhi and Washington are on a downturn after Trump doubled tariffs on Indian goods to a whopping 50 per cent, including 25 per cent additional duties for India's purchase of Russian crude oil.\nThe external affairs minister said trade is \"really the major issue\" between the two countries.\n\"The negotiations are still going on and the bottom line is we have some red lines.\" \"The red lines are primarily the interest of our farmers and to some extent small producers. So when people pronounced that we succeeded or failed etc.\"\n\"My answer to this is -- we as a government are committed to defend the interests of our farmers and small producers. We are very determined on that. That's not something we can compromise on.\"\nThe external affairs minister also responded to repeated allegations by Trump administration officials that India is \"profiteering\" by buying discounted Russian crude oil and then selling refined petroleum products at premium prices in Europe and other places.\n\"It's funny to have people who work for a pro-business American administration accusing other people of doing business,\" Jaishankar said.\n\"That's really curious. If you have a problem buying oil or refined products from India, don't buy it. Nobody forces you to buy it. But Europe buys, America buys, so you don't like it, don't buy it,\" he added.\nThe external affairs minister also rejected observations that India's relations with China are improving in view of strain in New Delhi-Washington ties.\n\"I think it would be a mistaken analysis to try and crunch everything and make it into an integrated response to a very specific situation,\" he said."
    },
    {
      "news_title": "Jaishankar slammed us tariffs, says that India will not compromise on the interests of farmers",
      "news_link": "https://www.thelocalreport.in/jaishankar-slammed-us-tariffs-says-that-india-will-not-compromise-on-the-interests-of-farmers/",
      "bias": "unknown",
      "text": "New Delhi, 23 August: The Trump administration said that after extending more than 50 percent of the duty for the purchase of India’s Russian oil, External Affairs Minister S Jaishankar on Saturday said in the United States for “unfair and inappropriate and unfair” tariffs in the United States.\nSpeaking at the Economic Times World Leaders Forum 2025, Jaishankar said that India’s priority is to protect farmers and small producers, saying that New Delhi will not compromise on their interests.\n“We are worried about that red lines are mainly interested in our farmers and to some extent, our small producers. So when people say that we have succeeded or failed, we are committed to defending the interests of our farmers and small producers as a government. We are set on it. We can do nothing.”\nThe minister also argued that the tariff issue was incorrectly being presented as “oil dispute”. He said that the same criticism in India to buy Russian energy was not implemented to large importers, such as China and European nations.\n“The second issue is that it is being presented as an oil issue. But why do I say ‘is being presented’ because the same arguments used to target India have not been applied to the largest oil importer, which is China, and not applied to the largest LNG importer, which is European countries.”\nJaishankar pointed to the contradiction in the west stance, stating that Europe trades more with Russia than in India. “And when people say that we are financing war and putting money, Russia-European trade is larger than India-Russia trade. So European is not putting Coffeers Coffeers? Overall Russia-European Union’s trade is larger than Russia-India’s business. If logic is energy, they (European Union) are big. He said.” He said.\nThe minister further said that India has every right to take decisions in its national interest. He said, “The issue of decisions we make in our national interest is our right. And I would say what strategic autonomy is,” he said.\nOn Indo-American relations, Jaishankar said that negotiations were going on despite stress. He said, “We are two big countries, as I say, lines are not cut, people are talking to each other, and we will see where it goes,” he said.\nWhen asked about the new Washington’s new ambassador to India, Jaishankar refrained from the comment, saying, “Look, I am a foreign minister, I do not comment on the ambassador appointments of other countries.”\nEarlier this week, Jaishankar visited Russia, where he met Russian President Vladimir Putin, Deputy First PM Dennis Manturov and Foreign Minister Sergei Lavrov. He co-headed the 26th session of the Indo-Russian Commission on Trade, Economic, Scientific, Technical and Cultural Cooperation (IRIGC-Tea).\nAccording to the Ministry of External Affairs (Mea), the journey included discussion on terrorism, struggle in Ukraine and regional development in West Asia and Afghanistan. Jaishankar greeted President Putin on Prime Minister Narendra Modi and discussed major bilateral and global issues. (AI)"
    },
    {
      "news_title": "US tariffs on India over Russia trade ‘unjustified’, says S Jaishankar",
      "news_link": "https://madhyamamonline.com/india/us-tariffs-on-india-over-russia-trade-unjustified-says-s-jaishankar-1440398",
      "bias": "unknown",
      "text": "US tariffs on India over Russia trade ‘unjustified’, says S Jaishankar\ntext_fieldsNew Delhi: External Affairs Minister S. Jaishankar on Friday criticised Washington’s decision to impose additional tariffs on Indian goods, calling the move “unjustified and unreasonable.”\nHe stressed that New Delhi would continue trade negotiations with the United States but made it clear that India had “redlines” that must be defended.\nSpeaking at The Economic Times World Leaders Forum 2025, Jaishankar argued that the issue was being wrongly portrayed as a dispute over oil. “If the argument is oil, then there are (other) big buyers. If argument is who is trading more (with Russia), than there are bigger traders,” he said. He noted that Russia’s trade with Europe is much larger than its trade with India.\n“This is being presented as an oil issue. But why I say ‘being presented’ is because the same arguments that have been used to target India have not been applied to the largest oil importer, which is China, and the largest LNG importer, which is the European nations,” he added.\nThe minister underscored that discussions with Washington were ongoing, but India would not compromise on certain national interests. “We have some redlines in the negotiations, to be maintained and defended,” Jaishankar said.\nCurrently, Indian exports face additional US tariffs of up to 50% in response to India’s continued purchases of Russian oil. A 25% tariff has already been enforced, with a further 25% scheduled to come into effect from August 27."
    },
    {
      "news_title": "Jaishankar: No compromise on farmers in India-US trade talks",
      "news_link": "https://www.newsbytesapp.com/news/india/jaishankar-explains-red-lines-in-us-trade-negotiations/story",
      "bias": "unknown",
      "text": "Jaishankar: No compromise on farmers in India-US trade talks\nWhat's the story\nExternal Affairs Minister S Jaishankar has reiterated India's firm commitment to safeguarding its farmers' interests and strategic autonomy in ongoing trade negotiations with the United States. Speaking at The Economic Times World Leaders Forum, he emphasized that these \"red lines\" are non-negotiable for India. \"Where we are concerned, the red lines are primarily the interests of our farmers and, to some extent, of our small producers,\" he said.\nTrade tensions\nUS pushing India to open markets to American agricultural products\nThe trade talks between India and the US have been stalled over major differences, with the US pressuring India to open its markets to American dairy, poultry, and agricultural products such as corn and soybeans. However, India continues to resist these demands due to concerns over genetically modified crops and their potential impact on health and the environment.\nPolitical commitment\nModi's stand on protecting farmers' interests\nPrime Minister Narendra Modi has also publicly committed to protecting farmers' interests. In his Independence Day speech, he said, \"Modi is standing like a wall against any harmful policy related to farmers, fishermen, and cattle rearers of India.\" Jaishankar also took a firm stand on India's strategic autonomy regarding Russian oil imports. He said decisions would be taken in the national interest despite external pressures.\nDiplomatic stance\nJaishankar rules out mediation with Pakistan\nOn the issue of mediation with Pakistan, Jaishankar reiterated India's long-standing position against it. He said, \"Since the 1970s... there's a national consensus in this country that we do not accept mediation in our relations with Pakistan.\" The minister emphasized that while India is open to dialogue and negotiation, it will not compromise on issues vital to its sovereignty and citizens' welfare."
    },
    {
      "news_title": "India says US trade negotiations are still going on as fresh tariffs",
      "news_link": "https://www.thedailystar.net/business/news/india-says-us-trade-negotiations-are-still-going-fresh-tariffs-loom-3968881",
      "bias": "unknown",
      "text": "India says US trade negotiations are still going on as fresh tariffs loom\nIndia's foreign minister said on Saturday that trade negotiations with Washington are continuing but there are lines that New Delhi needs to defend, just days before hefty additional U.S. tariffs are due to hit.\nIndian goods face additional U.S. tariffs of up to 50%, among the highest imposed by Washington, due to its increased purchases of Russian oil. A 25% tariff has already come into effect, while the remaining 25% is set to be enforced from August 27.\nA planned visit by U.S. trade negotiators to New Delhi from August 25-29 has been called off, dashing hopes that the levies may be lowered or postponed.\n\"We have some redlines in the negotiations, to be maintained and defended,\" Indian Foreign Minister Subrahmanyam Jaishankar said at an Economic Times forum event in New Delhi, singling out the interests of the country's farmers and small producers.\nIndia-U.S. trade talks collapsed earlier this year due to India not agreeing to open its vast agricultural and dairy sectors. Bilateral trade between the world's largest and fifth largest economy is worth over $190 billion.\n\"It is our right to make decisions in our 'national interest',\" Jaishankar said.\nAnalysts at Capital Economics said on Friday that if the full U.S. tariffs come into force and stick, the hit to India's economic growth would be 0.8 percentage points both this year and next.\n\"The longer-term harm could be even greater as a high tariff could puncture India's appeal as a global manufacturing hub.\"\nThe Indian minister described U.S. President Donald Trump's policy announcements as \"unusual\".\n\"We have not had a U.S. president who conducts his foreign policy so publicly as the current one and (it) is a departure from the traditional way of conducting business with the world,\" Jaishankar said.\nHe also said Washington's concern over India's Russian oil purchases was not being applied to other major buyers such as China and European Union.\n\"If the argument is oil, then there are (other) big buyers. If argument is who is trading more (with Russia), than there are bigger traders,\" he said.\nRussia-European trade is bigger than India-Russia trade, he added.\nThe minister also said India's purchases of Russian oil had not been raised in earlier trade talks with the U.S. before the public announcement of tariffs.\nComments"
    },
    {
      "news_title": "Trade talks on with US but interest of farmers and small producers our priority: EAM Jaishankar - tennews.in: National News Portal",
      "news_link": "https://tennews.in/trade-talks-on-with-us-but-interest-of-farmers-and-small-producers-our-priority-eam-jaishankar/",
      "bias": "unknown",
      "text": "Trade talks on with US but interest of farmers and small producers our priority: EAM Jaishankar\nNew Delhi, Aug 23 (IANS) External Affairs Minister (EAM) S. Jaishankar on Saturday said that the India-US trade negotiations are still underway but “we have some red lines”, as the country stared at steep 50 per cent tariffs from August 27.\nSpeaking at the ‘Economic Times World Leaders Forum 2025’ here, EAM Jaishankar shared that negotiations with the US are underway.\n“What we are concerned about is that the red lines are primarily the interests of our farmers and, to some extent, of our small producers. We, as a government, are committed to defending the interests of our farmers and our small producers. We are very determined on that. That’s not something that we can compromise on,” the EAM told the gathering.\nThe EAM further said that US President Donald Trump’s way of dealing with the world, even dealing with his own country, “is a very major departure from the traditional orthodox manner of doing so”.\nEarlier, Commerce and Industry Minister Piyush Goyal said at the same event that the government’s approach in trade negotiations for free trade agreements with other countries will be guided by national interest and the priorities of Indian industry.\n“I’ve always held a very clear vision. When we do trade deals, I have to protect national interests. We usually now work with different countries with the pre-understanding, before even getting into negotiations: you respect my sensitivities, I respect your sensitivities. There are areas of concern in every country in the world,” the Commerce Minister said at the event on Friday.\nHe further stated that India is engaging regularly with the European Union and fast-tracking discussions on three to four more trade agreements.\n“The EU also has certain areas which are very sensitive to them. We respect that. As they respect ours. And, therefore, I think it will not be difficult to come to terms on the trade front,” the minister added.\nThe minister said that India’s relations with the US are “very consequential” and India has resilience, strength, and is full of possibilities as the world’s fastest-growing economy.\n–IANS\nna/svn\nComments are closed."
    },
    {
      "news_title": "Jaishankar slams US Tariffs, says India won’t compromise farmers’ interests",
      "news_link": "https://www.awazthevoice.in/india-news/jaishankar-slams-us-tariffs-says-india-won-t-compromise-farmers-interests-40749.html",
      "bias": "unknown",
      "text": "New Delhi\nExternal Affairs Minister S Jaishankar on Saturday hit out at the United States for what he called \"unjustified and unreasonable\" tariffs on Indian goods, after the Trump administration raised duties to over 50 per cent as a penalty for India's purchase of Russian oil.\nSpeaking at The Economic Times World Leaders Forum 2025, Jaishankar said India's priority was to protect farmers and small producers, stressing that New Delhi would not compromise on their interests.\n\"What we are concerned about is that red lines are primarily the interest of our farmers and, to some extent, our small producers. So when people pronounce that we have succeeded or failed, we as a government are committed to defending the interests of our farmers and small producers. We are determined on that. That's not something we can compromise,\" Jaishankar said.\nThe minister also argued that the tariff issue was being wrongly presented as an \"oil dispute.\" He noted that the same criticism levelled at India for purchasing Russian energy had not been applied to larger importers, such as China and European nations.\n\"The second issue is that this is being presented as an oil issue. But why I say 'being presented' is because the same arguments that have been used to target India have not been applied to the largest oil importer, which is China, and have not been applied to the largest LNG importer, which is the European nations,\" he said.\nJaishankar pointed out the contradiction in the West's stance, saying Europe trades far more with Russia than India does. \"And when people say we are funding the war and putting the money, Russia-European trade is bigger than India-Russia trade. So European money is not putting coffers? The overall Russia-EU trade is bigger than the Russia-India trade. If the argument is energy, they (EU) are bigger buyers. If the argument is who is the bigger trader, they are bigger than us. India's exports to Russia have grown, but not that much,\" he added.\nThe minister further said India has every right to take decisions in its own national interest. \"The issue of decisions which we make in our national interest is our right. And I would say that's what strategic autonomy is about,\" he said.\nOn India-US ties, Jaishankar said talks were ongoing despite tensions. \"We are two big countries, as I say, the lines are not cut, people are talking to each other, and we will see where it goes,\" he added.\nWhen asked about Washington's new ambassador to India, Jaishankar avoided comment, saying, \"Look, I am the Foreign Minister, I don't comment on ambassadorial appointments of other countries.\"\nEarlier this week, Jaishankar visited Russia, where he met Russian President Vladimir Putin, Deputy First PM Denis Manturov and Foreign Minister Sergey Lavrov. He also co-chaired the 26th session of the India-Russia Inter-Governmental Commission on Trade, Economic, Scientific, Technological and Cultural Cooperation (IRIGC-TEC).\nREAD MORE: C Shukkur and Sheena set off a quiet 'remarriage' tsunami among Muslims\nAccording to the Ministry of External Affairs (MEA), the visit included discussions on terrorism, the conflict in Ukraine, and regional developments in West Asia and Afghanistan. Jaishankar also conveyed Prime Minister Narendra Modi's greetings to President Putin and discussed key bilateral and global issues."
    },
    {
      "news_title": "Auto sector will continue to grow, our exports go beyond US, says Nitin Gadkari as Trump tariff deadline looms",
      "news_link": "https://indiashippingnews.com/auto-sector-will-continue-to-grow-our-exports-go-beyond-us-says-nitin-gadkari-as-trump-tariff-deadline-looms/",
      "bias": "unknown",
      "text": "Auto sector will continue to grow, our exports go beyond US, says Nitin Gadkari as Trump tariff deadline looms\nNEW DELHI : Union Roads, Highways and Transport Minister Shri Nitin Gadkari has said that India’s automobile sector is strong and will continue to grow, as it exports to many more countries than the United States.\nThe minister made these comments in an interview, with less than a week to go for the US’ additional 25 percent Russia oil penalty to kick in on Indian goods. The US is already levying an increased 25 percent tax on Indian imports, with the Russia levy, the duty will climb to 50 percent.\n“Our automobile sector is strong and continues to grow … I am confident that the way we are working on alternate fuels, bio fuels, electric, ethanol, methanol, (and) biodiesel, we will be the number one automobile market in the world,” Gadkari told in an exclusive interview.\nTatas, Mahindra and Mahindra are making good electric vehicles and won’t be impacted by Tesla’s entry, the minister said, adding the future of auto industry looks “very good”. While India exports to the US, it also exports to other countries, Gadkari added.\nWhile India’s auto exports rose 14 percent year-on-year in the first half of FY25 to 2,528,248 units, it doesn’t export much to the US. In 2024, India’s passenger car exports to the US were worth $8.9 million and auto parts $2.2 billion.\nAccording to a report from the heavy industries ministry, India exported automobile and auto components worth $35 billion in FY25. Saudi Arabia, South Africa, Mexico and the United Arab Emirates are the top destinations for Indian autos.\n“When I became minister of roads, transport and highways in 2014, we were at number 7 in the world. Now we are at number 3. America’s size of the market is Rs 78 lakh crore, China is Rs 49 lakh crore and we are a Rs 22 lakh crore automobile market,” he added.\nWhen asked if the Indian EV sector was ready to face competition from EV giants like Elon Musk-led Tesla, Gadkari said, “Anyone who wants to come to the Indian market can. Indian EV makers like Tatas, Mahindra are making good models.”\nIn terms of design, quality, cost Indian automakers are making good models. “The Indian EV market is projected to reach over $110 billion by 2029 and is dominated by domestic players,” he said.\n“Tesla is the latest entrant in the market and will be launching its imported Model Y SUV. However, the company faces high import duties that with lack of local manufacturing will make it prohibitively expensive for a majority of Indians.”\nTo a question if the government would extend more support to the EV sector, Gadkari said the segment was growing and does not need schemes or further support. “In the coming times, I see a bright future for the Indian automobile sector,” the minister said."
    },
    {
      "news_title": "Indian exports to China surge 20% in April–July FY26 - Maritime Gateway",
      "news_link": "https://www.maritimegateway.com/indian-exports-to-china-surge-20-in-april-july-fy26/",
      "bias": "unknown",
      "text": "India’s merchandise exports to China rose 20% year-on-year to $5.76 billion in the first four months of FY26 (April–July), compared to $4.80 billion in the same period last year, official data shows. The growth—driven by strong demand for energy products, electronics, and agricultural commodities—comes as a relief amid concerns over export losses from US tariff measures.\nIn FY25, India’s exports to China had contracted sharply by 14.5% to $14.25 billion, against $16.67 billion in FY24, with shipments declining in 11 out of 12 months. By contrast, FY26 has seen a consistent rebound from the start of the year:\n- April 2025: up 12.9% to $1.4 billion\n- May 2025: up 24% to $1.63 billion\n- June 2025: up 17% to $1.38 billion\n- July 2025: up 27% to $1.35 billion\nIf sustained, this trend could mark the first full-year recovery in Indian exports to China after last year’s slump, people familiar with the matter said.\nSector-wise growth\n- Energy products: Petroleum product exports nearly doubled to $883 million (95.3% growth).\n- Electronics: Shipments surged to $521 million (202.7%), reflecting industrial and consumer demand.\n- Agriculture: Oil meals at $41.7 million (2656.1%), rice at $32.2 million (1383.3%), and oil seeds at $16 million (1791.7%) led extraordinary gains.\n- Chemicals & traditional sectors: Organic and inorganic chemicals rose to $335.1 million (16.3%), spices to $234.5 million (21.9%), tea to $8.9 million (93.9%), and gems & jewellery to $11.5 million (72.7%).\n- Moderate growth: Marine products (5.1%), mica/coal/ores (3.0%), and ready-made garments (14.8%).\nDiplomatic boost\nThe rebound also comes on the back of recent positive diplomatic engagements. During Chinese Foreign Minister Wang Yi’s visit to New Delhi on August 19, both sides agreed to enhance bilateral trade, reopen border trade at Lipulekh, Shipki La, and Nathu La passes, and facilitate investment flows through “concrete measures,” according to India’s Ministry of External Affairs.\nDespite the recent gains, India still faces a wide trade deficit with China, which stood at $99.2 billion in FY25. Sustained export growth in FY26 could help narrow this gap."
    },
    {
      "news_title": "As US tariffs loom, India’s exports to China jump 18% amid renewed diplomatic outreach",
      "news_link": "https://www.indiaweekly.biz/us-tariffs-india-china-exports/",
      "bias": "unknown",
      "text": "Highlights:\n- India’s exports to China rose 18% year-on-year in Q1 FY26 to $4.4 billion, reversing two years of decline.\n- Petroleum product exports nearly doubled, while spices, organic chemicals, and marine products also saw strong growth.\n- The surge comes as the US prepares to impose a 50% tariff on Indian goods over energy ties with Russia.\n- China’s Foreign Minister Wang Yi visited India for talks with NSA Ajit Doval, agreeing to reopen border trade and boost connectivity.\n- Chinese envoy Xu Feihong pledged Beijing’s support, saying China would “stand with India against trade bullies.”\nIndia’s exports to China showed a strong rebound in the first quarter of the fiscal year 2026 (April to June), rising by 18 percent year-on-year to $4.4 billion, following two years of decline during the same period. This uptick comes against the backdrop of escalating trade tensions with the United States, where the Trump administration is set to impose a 50 percent tariff on Indian goods linked to energy imports from Russia. The new tariff regime is scheduled to take effect on August 27, 2025.\nThe sharp growth in exports to China was driven mainly by petroleum products, which nearly doubled from $452 million to $865 million. Other significant contributors included spices, which surged by 33 percent, organic chemicals that increased by 26 percent to $147 million, and marine products, which saw a modest 5 percent rise.\nThis growing trade momentum aligns with a fresh wave of diplomatic engagement between India and China. On August 18 and 19, China’s Foreign Affairs Minister Wang Yi visited India at the invitation of India’s National Security Advisor Ajit Doval. During the Special Representatives Dialogue, the two sides emphasized the importance of maintaining peace and tranquility along the border areas to enhance the overall development of bilateral ties.\nFollowing the discussions, India and China agreed on several economic and people-centric initiatives to boost cooperation. These include reopening border trade through strategic mountain passes such as Lipulekh, Shipki La, and Nathu La; resuming direct flights between the two countries; facilitating easier visa processes for business and tourism; increasing pilgrimage flows; and enabling greater bilateral trade and investment.\nFurther reaffirming China’s support for stronger trade relations, Chinese Ambassador to India Xu Feihong declared at the SCO Summit 2025 on August 20 that China stands “with India against trade bullies.” He highlighted the significance of unity and cooperation between two large neighbouring countries as essential to achieving “common development.”\nThis convergence of diplomatic outreach and trade growth illustrates how India and China are working to deepen economic ties despite global geopolitical pressures. As the US tightens its trade stance against India, New Delhi appears to be leveraging its relationship with Beijing to sustain its trade expansion and strategic interests.\nSuch developments signal a nuanced shift in India’s international commercial relations and underline the growing complexity of global trade dynamics in the current geopolitical climate."
    },
    {
      "news_title": "Trump’s 50% tariffs could reshape India’s festive ad spend",
      "news_link": "https://www.socialsamosa.com/experts-speak/trump-50-tariffs-could-reshape-india-festive-ad-spend-9687726",
      "bias": "unknown",
      "text": "President Trump's announcement to double tariffs on Indian imports to 50%, effective August 27, 2025, has prompted India's advertising industry to reassess spending strategies and market positioning. The move, aimed at penalising India for purchasing Russian oil, affects nearly all of India's $86.5 billion in annual goods exports to the US. According to a BBC report, almost all of India's annual goods exports to the US stand to become commercially unviable if these rates sustain, with a potential GDP impact of 0.2-0.4% from even a 25% tariff.\nThe timing of this policy announcement is particularly crucial, coming as India's AdEx was expected to grow by 7.8% year-on-year to ₹1371 billion ($15.9 billion), according to MAGNA’s projections.\nHowever, the advertising market now faces budget reallocations as companies respond to changing trade dynamics. The timing coincides with India's festive season planning, when brands typically increase advertising investments across categories.\nFestive marketing strategies to face adjustment\nThe immediate casualties of Trump's tariff announcement are becoming clear, with export-oriented sectors that have traditionally been significant advertising spenders preparing for budget reductions. Krishnarao Buddha, Independent Brand Consultant and former Senior Category Head at Parle Products, explains the direct impact on specific sectors.\n\"The immediate impact will be felt most by export-oriented sectors with a high dependence on the US market, such as Gems & Jewellery, Textiles, Leather, Auto components, etc. These categories are likely to cut back ad spending first,\" Buddha says.\nThe gems and jewellery sector, traditionally a significant advertiser during festive seasons, faces particular challenges given its export dependence.\nSuresh Ramalingam, CEO, Ipsos India, believes that it will take a few months before the impact of 50% Trump Tariffs will be felt. While he echoes Buddha’s statement that there would be cutbacks in ad spending by certain sectors, including the automotive, retail and jewellery, Ramalingam comments, “domestic brands which instil national pride could capitalise on the opportunities emerging within the country and increase ad spends to woo domestic consumers.”\nThe tariff implementation timing, just before India's festive season, creates planning challenges for marketing strategies already in development.\n“Sectors heavily dependent on exports and imports could see the impact of these steep tariffs on the upcoming festival season and curtailing of sales promotion budgets – unless negotiations between India and the Trump administration lead to some resolution reaching the middle ground,” stated Ramalingam.\nThe festive period typically sees brands spending approximately $3.9 billion on advertising, marketing and promotions, according to media reports. Moreover, a report suggests that festive shoppers are planning to spend an average of Rs 16,500 this year, with the majority of consumers planning to start their festive shopping before September. Among these, 90% of shoppers believe online ads are important in helping them discover new products and promotions.\nRahul Vengalil, CEO & Co-founder, tgthr, provides context on the broader economic picture and its advertising implications.\n\"First things first, India runs on an internal consumption economy a lot more than exports. In the export also, 40% of our export categories are left out of the tariff.”\nApart from the few categories mentioned above, Vengalil believes that categories like Agro/Farming and Apparel/footwear will likely be impacted.\n“I believe from an advertising POV, this is more a psychological challenge, and if we look beyond the muddled waters, I think we should be fine,\" Vengalil says. “FMCGs are big spenders during the Diwali period & Coke/Pepsi group falls under this bracket, Food chains fall under this category, E-commerce giants like Amazon fall under this category. So there is going to be some tension, uncertainties and definite impact on the adex,\" he continues.\nHowever, he acknowledges the potential for consumer behaviour to drive broader market impacts. If consumers start taking emotional decisions and boycott US brands, then the situation could spiral for the worse.\nVigyan Verma, Founder of The Bottom Line, a brand consulting firm, comments that India benefits through exports of US brands manufactured in India (Apple, Nike, Levi's, etc), although industries like leather, textiles & apparel, and gems & jewellery are directly impacted by US tariffs. American brands with substantial festive advertising presence face the challenge of maintaining market presence while navigating potential consumer sentiment shifts.\nVerma says, “Robust local set-ups for US corporate brands like Coca-Cola, Pepsico, P&G, and Colgate-Palmolive exist along with manufacturing units, and these contribute to our economy and employment of our citizens.”\nHowever, Buddha expects strategic adaptations across festive marketing. \"The festive season marketing, typically a bellwether for annual ad spends, will require rapid adaptations, budgets may shrink for global luxury brands and imported categories, but surge for domestic brands leveraging the national pride.\"\nThis may lead to messaging that emphasises craftsmanship heritage while adjusting international market references.\nMedia planning could shift toward performance channels\nBudget pressures and the need for measurable results could accelerate existing trends toward digital and performance-driven advertising channels. Companies seeking cost-effective reach during uncertain periods could adjust their media mix strategies.\n\"On the media mix front, brands will trim high-cost TV and print in favour of performance-driven digital channels, micro-influencers and native content. Expect hyperlocal targeting, short-form video storytelling with a greater focus on measurable ROI,\" Buddha explains.\nThe shift toward performance-driven channels reflects immediate budget optimisation needs and longer-term strategic thinking about market engagement. Micro-influencer strategies offer authentic local voices and cost-effective reach, particularly valuable when brands navigate sensitive political and economic terrain.\nVengalil notes, “Videos will still remain the most important medium, be it digital or linear Television. Print will play a key role for a lot of retail clients in the coming days.\"\nHyperlocal targeting becomes more relevant as brands connect with specific regional sentiments and economic concerns. As per 2024 reports, 47% of Indian consumers were influenced by short-form videos while making their festive purchases. Short-form video content, already dominant in India's digital landscape, provides flexibility for rapid message adaptation as situations evolve.\nDomestic brands could find growth opportunities\nWhile some sectors contract spending, others have the potential for increased investment. Domestic-focused industries view the tariff situation as an opportunity to strengthen their market position and capture consumer attention.\n\"Conversely, certain sectors with huge domestic consumption like Agriculture produce, FMCG, homegrown electronics and regional consumer durables could see increased marketing investment as brands try to capitalise on the Vocal for Local sentiment,\" Buddha observes.\nIndia's FMCG sector, which grew 10.6% in the October-December quarter of 2024, driven by rural demand, is positioned to benefit from this shift.\nThe advertising industry's response requires balancing immediate crisis management with long-term strategic positioning. \"The chances of anti-American sentiments were somewhat high immediately after the additional 25% tariff announcement. Citizens may continue to view the United States as an unreliable partner, but that may not translate into hatred for American brands,\" Verma explains.\nExperts also believe that homegrown brands will try to use the 'Made in India' slogan in their messaging.\n\"If the crisis prolongs, the overall economy could get impacted, and then, of course, brands across board (not just American) could face business pressures leading up to the festive season, and that will require holistic tactical interventions- for example, pushing smaller packs, not just advertising spends and media mix tweaks,\" Verma adds.\nAs of now, BJP national spokesperson Syed Zadar Islam has claimed that India faces minimal tariff impact due to the \"57-58% contribution of local consumption to our GDP\".\nBut, if it were to affect brand spends, advertisers and agencies will need to focus on keeping consumer trust at the core with the agility to adapt messages and platforms, helping them maintain the momentum during this period of policy-induced uncertainty.\nPrime Minister Narendra Modi is most likely going to visit the United States in September for the United Nations General Assembly (UNGA) and could schedule a meeting with President Donald Trump.\nAs the August 27 implementation date approaches, decisions regarding budget allocation, messaging strategy, and media planning will influence India's advertising market trajectory. The tariff policy serves as a test of the industry's ability to adapt to changed economic conditions while maintaining market vitality and consumer engagement."
    }
  ]
}