{
  "story_id": "GN_20250823_205939_7c7807fe",
  "metadata": {
    "title": "Justice Dept. declines to defend grants for Hispanic-serving colleges, calling them unconstitutional",
    "timestamp": "2025-08-23T20:59:39.288712",
    "url": "https://ground.news/article/trump-administration-says-grants-for-hispanic-serving-colleges-are-unconstitutional-and-it-wont-defend-them-in-court"
  },
  "bias_distribution": {
    "total_sources": "107",
    "leaning_left": "26",
    "center": "61",
    "leaning_right": "2"
  },
  "perspective_summaries": {
    "left": [
      "The Trump administration will not defend a grant program for colleges with large Hispanic student populations, claiming the funding is unconstitutional.",
      "The Justice Department stated it agrees with a lawsuit to eliminate grants for colleges where at least 25% of undergraduates are Hispanic.",
      "Tennessee argues that all its public universities serve Hispanic students but do not qualify for the grants due to an 'arbitrary ethnic threshold."
    ],
    "center": [
      "Solicitor General John Sauer notified Republican House Speaker Mike Johnson on July 25 that the U.S. Justice Department has decided not to defend the Hispanic-Serving Institution grant program.",
      "The State of Tennessee and an anti-affirmative action group sued the U.S. Education Department in June, and the Justice Department told Congress it agrees with the legal challenge.",
      "Justice Department officials said the Hispanic-Serving Institution grant program confers an unconstitutional advantage based on race or ethnicity.",
      "Congress appropriated about $350 million for the program in 2024, and the suit says affected schools lose tens of millions, while more than 500 colleges designated Hispanic-Serving Institutions compete for grants.",
      "The program, created by Congress in 1998, targets colleges with at least a quarter undergraduate Hispanic share to address Latino students' lower college and graduation rates."
    ],
    "right": [
      "The Trump Administration is ending a $350 million-a-year federal program for Hispanic-Serving Institutions, declaring it unconstitutional according to Solicitor General D. John Sauer's letter to House Speaker Mike Johnson.",
      "This decision may confront other identity-driven grant programs across the government.",
      "Officials indicated that Historically Black Colleges and Universities do not face similar constitutional issues due to their historical status, not quotas.",
      "The Department of Education reserves funds for universities with at least 25 percent Hispanic enrollment, excluding others that do not meet this requirement."
    ]
  },
  "sources": [
    {
      "news_title": "Justice Department says U.S. won't defend grants for Hispanic-serving colleges, calling them unconstitutional",
      "news_link": "https://www.cbsnews.com/news/justice-department-hispanic-colleges-grants-unconstitutional/",
      "bias": "Lean Left",
      "text": "Justice Department says U.S. won't defend grants for Hispanic-serving colleges, calling them unconstitutional\nThe Trump administration said Friday it will not defend a decades-old grant program for colleges with large numbers of Hispanic students that is being challenged in court, declaring the government believes the funding is unconstitutional.\nIn a memo sent to Congress, the Justice Department said it agrees with a lawsuit attempting to strike down grants that are reserved for colleges and universities where at least a quarter of undergraduates are Hispanic. Congress created the program in 1998 after finding Latino students were attending college and graduating at far lower rates than white students.\nJustice Department officials argued the program provides an unconstitutional advantage based on race or ethnicity.\nThe state of Tennessee and an anti-affirmative action organization sued the U.S. Education Department in June, asking a judge to halt the Hispanic-Serving Institution program. Tennessee argued all of its public universities serve Hispanic students, but none meet the \"arbitrary ethnic threshold\" to be eligible for the grants. Those schools miss out on tens of millions of dollars because of discriminatory requirements, the lawsuit said.\nOn Friday, the Justice Department released a letter in which Solicitor General D. John Sauer notified Republican House Speaker Mike Johnson that the department \"has decided not to defend\" the program, saying certain aspects of it are unconstitutional. The letter, dated July 25, cited the 2023 Supreme Court decision outlawing affirmative action, which said \"outright racial balancing\" is \"patently unconstitutional.\"\nThe Justice Department declined to comment.\nTennessee is backed in the suit by Students for Fair Admissions, a conservative legal group that successfully challenged affirmative action in admissions at Harvard and the University of North Carolina. That suit led to a 2023 Supreme Court ruling that forbids universities from considering students' race in admissions decisions.\nEdward Blum, president of Students for Fair Admissions, said Friday the group would decline to comment.\nMore than 500 colleges and universities are designated as Hispanic-Serving Institutions, making them eligible for the grant program. Congress appropriated about $350 million for the program in 2024. Colleges compete for the grants, which can go toward a range of uses, from building improvements to science programs.\nFormer President Joe Biden made Hispanic-serving universities a priority, signing an executive action last year that promised a new presidential advisory board and increased funding. President Donald Trump revoked the order on his first day in office.\nTrump is taking steps to dismantle the Education Department and has called for massive funding cuts, yet his 2026 budget request preserved grants for Hispanic-serving colleges and even asked Congress for a slight increase. Even so, there have been doubts about his administration's commitment to the funding.\nA national association of Hispanic-serving universities filed a motion last month to intervene as a defendant in the Tennessee lawsuit, voicing concern that the federal government would not adequately represent the group's members.\nThe Hispanic Association of Colleges and Universities said Trump's agenda is \"entirely adverse\" to the group's interests, citing the president's aim to close the Education Department entirely. The administration is \"on record denouncing programs like HSIs, that take account of and seek to redress ethnic or racial disparity,\" the group wrote.\nTennessee and Students for Fair Admissions did not object to the group's request to lead the legal defense.\nUnlike historically Black or Native American tribal colleges and universities, which receive their designations based on their missions, any college can receive the HSI label and grants if its Latino enrollment makes up at least 25% of the undergraduate student body.\nThe list of HSIs includes flagship campuses like the University of Texas at Austin and the University of Arizona, along with many community colleges and smaller institutions.\nIn its court filing, the national association argues the grants are constitutional and help put its members on an even playing field.\nThe group's schools enroll 67% of the nation's Latino undergraduate students, yet studies find that those schools receive far less in state and federal funding than other institutions. Hispanic-serving universities are open to students of all races - as an example, the association pointed to Southern Adventist University, a private school in Tennessee whose student body is 28% Hispanic and 40% white.\nThe Justice Department generally has a duty to uphold the Constitution and federal legislation, but in rare cases it can refuse to defend laws it believes are unconstitutional. The Obama administration did so in 2011 when it refused to enforce the Defense of Marriage Act. During his first term, Trump did the same with the Affordable Care Act.\nThe Trump administration has fought to end diversity, equity and inclusion policies in government, education and business, arguing that they discriminate against white and Asian American people."
    },
    {
      "news_title": "Trump DOJ won't defend major Hispanic college grant program, calling it unconstitutional",
      "news_link": "https://www.rawstory.com/trump-hispanic-college/",
      "bias": "Left",
      "text": "The Trump administration's Justice Department has declared it believes a decades-old Hispanic college grant program is unconstitutional and will not defend it from a legal challenge brought by the state of Tennessee.\nAccording to The Associated Press, the DOJ announced its intentions not to defend the Hispanic-Serving Institution program in a memo to Congress. The program, created in 1998 to address disparities in Hispanic college admittance and graduation rates, provides grants to colleges and universities with an undergraduate Hispanic proportion of 25 percent or more.\n\"The state of Tennessee and an anti-affirmative action organization sued the U.S. Education Department in June, asking a judge to halt the Hispanic-Serving Institution program,\" reported Collin Binkley and Jocelyn Gecker. \"Tennessee argued all of its public universities serve Hispanic students but none meet the 'arbitrary ethnic threshold' to be eligible for the grants. Those schools miss out on tens of millions of dollars because of discriminatory requirements, the suit said.\"\nTennessee is represented by Students for Fair Admissions, the same group that led the cases that led the Supreme Court to strike down affirmative action programs at Harvard and the University of North Carolina.\nThat decision prohibited schools, other than military institutions, from \"outright racial balancing,\" although it left open the possibility that some racial diversity programs could be constitutional if they centered on applicants' background or experience rather than strictly their membership in a racial group.\nAccording to the report, \"More than 500 colleges and universities are designated as Hispanic-Serving Institutions, making them eligible for the grant program. Congress appropriated about $350 million for the program in 2024. Colleges compete for the grants, which can go toward a range of uses, from building improvements to science programs.\" Former President Joe Biden pledged to seek increased funding for this program, but Trump revoked the executive order advocating this.\nThis comes at a moment when Trump is cratering with Hispanic voters in polling, after relying on a stronger-than-usual performance with them to secure his re-election in 2024."
    },
    {
      "news_title": "DOJ Deems Definition of HSIs Unconstitutional, Won’t Defend",
      "news_link": "https://www.insidehighered.com/news/institutions/minority-serving-institutions/2025/08/22/doj-deems-definition-hsis",
      "bias": "Lean Left",
      "text": "You have /5 articles left.\nSign up for a free account or log in.\nThe country’s roughly 600 Hispanic-serving institutions are in peril of losing hundreds of millions of dollars annually from the federal government, after the Department of Justice said it won’t defend the program against a lawsuit alleging the way HSIs are currently defined is unconstitutional. The suit challenges the requirement that a college or university’s undergraduate population must be at least a quarter Hispanic to receive HSI funding.\nU.S. solicitor general D. John Sauer wrote to House Speaker Mike Johnson July 25 that the DOJ “has determined that those provisions violate the equal-protection component of the Fifth Amendment's Due Process Clause.” Federal law requires DOJ officers to notify Congress when they decide to refrain from defending a law on the grounds that it’s unconstitutional.\nCiting the 2023 U.S. Supreme Court ruling that banned affirmative action in student admissions, Sauer wrote that “the Supreme Court has explained that ‘[o]utright racial balancing’ is ‘patently unconstitutional’” and said “its precedents make clear that the government lacks any legitimate interest in differentiating among universities based on whether ‘a specified number of seats in each class’ are occupied by ‘individuals from the preferred ethnic groups.’\"\nThe Washington Free Beacon, a conservative outlet, first reported on the letter Friday. The DOJ subsequently provided Inside Higher Ed with the letter but gave no further comment or interviews.\nThe Free Beacon wrote that “the letter likely spells the end for the HSI grants, which the Trump administration is now taking steps to wind down.” The Education Department wrote in an email, “We can confirm the Free Beacon’s reporting,” but didn’t provide Inside Higher Ed an interview or answer further written questions.\nJust because the executive branch has given up defending the program doesn’t necessarily mean it’s over—or that the group Students for Fair Admissions and the state of Tennessee have won the lawsuit they filed in June. The Hispanic Association of Colleges and Universities moved to intervene in the case late last month, asking U.S. District Court judge Katherine A. Crytzer to add the group as a defendant. She has yet to rule, but the Education Department and education secretary Linda McMahon, the current defendants, didn’t oppose this intervention.\nThe legal complaint from Students for Fair Admissions and Tennessee asks Crytzer to declare the program’s ethnicity-based requirements unconstitutional, but not necessarily to end the program altogether. Students for Fair Admissions is the group whose suits against Harvard University and the University of North Carolina at Chapel Hill yielded the 2023 Supreme Court decision banning affirmative action in admissions. In the suit over the HSI program, that group and Tennessee’s attorney general, Jonathan Skrmetti, now argue that the admissions ruling means Tennessee colleges and universities can’t use affirmative action to increase Hispanic student enrollments in order to qualify for HSI funding.\nDeborah Santiago, co-founder and chief executive officer of Excelencia in Education, which promotes Latino student success, said Friday that the Education Department in June “opened a competition to award grants for this fiscal year for HSIs.”\n“There are proposals to the Department of Education right now that they said they were going to allocate,” Santiago said, noting that the program was set to dole out more than $350 million this fiscal year—money that institutions use for faculty development, facilities and other purposes.\n“The program doesn’t require that any of the money go to Hispanics at all,” she said. For a college or university to qualify for the program, at least half of the student body must be low-income, in addition to the requirement that a quarter be Hispanic.\n“The value of a program like this has really been investing in institutions that have a high concentration of low-income, first generation students,” Santiago said."
    },
    {
      "news_title": "Trump to End Race-Based 'Hispanic-Serving Institution' Grants",
      "news_link": "https://americanfaith.com/trump-administration-to-end-hispanic-serving-institution-grants/",
      "bias": "Right",
      "text": "The Trump Administration is moving to end a $350 million-a-year federal program that funnels taxpayer dollars to so-called “Hispanic-Serving Institutions” (HSIs), determining the race-based initiative is unconstitutional. This decision will sunset one of the largest identity-driven grant programs in higher education and may set a precedent for dismantling similar schemes throughout the government.\nThe Department of Education reserves hundreds of millions exclusively for universities with at least 25 percent Hispanic enrollment, locking out schools that fail to meet the racial quota. In June, the state of Tennessee and Students for Fair Admissions challenged the program, arguing it incentivizes affirmative action, which the Supreme Court struck down in 2023.\nIn a letter to House Speaker Mike Johnson, Solicitor General D. John Sauer declared, “The Department of Justice has decided not to defend the constitutionality of certain provisions of the Higher Education Act of 1965. The Department of Justice has determined that those provisions violate the equal-protection component of the Fifth Amendment’s Due Process Clause.”\nA senior Education Department official confirmed the administration is reviewing three HSI grant programs “to determine the legal path forward.” Importantly, officials clarified that Historically Black Colleges and Universities (HBCUs) do not face the same constitutional problems because their status reflects history, not racial quotas. “The quota-based eligibility formula for HSI programs distinguishes them from HBCUs,” the official said.\nThis marks a sharp correction to decades of race-preferential policies that have skewed higher education. As Sauer made clear, “those provisions violate the equal-protection component of the Fifth Amendment’s Due Process Clause.”"
    },
    {
      "news_title": "Justice Dept. declines to defend grants for Hispanic-serving colleges, calling them unconstitutional",
      "news_link": "https://apnews.com/article/hispanic-colleges-trump-a795fc966590681f41410c2b3e268ac0",
      "bias": "Lean Left",
      "text": "Justice Dept. declines to defend grants for Hispanic-serving colleges, calling them unconstitutional\nJustice Dept. declines to defend grants for Hispanic-serving colleges, calling them unconstitutional\nWASHINGTON (AP) — The Trump administration said Friday it will not defend a decades-old grant program for colleges with large numbers of Hispanic students that is being challenged in court, declaring the government believes the funding is unconstitutional.\nIn a memo sent to Congress, the Justice Department said it agrees with a lawsuit attempting to strike down grants that are reserved for colleges and universities where at least a quarter of undergraduates are Hispanic. Congress created the program in 1998 after finding Latino students were going to college and graduating at far lower rates than white students.\nJustice Department officials argued the program provides an unconstitutional advantage based on race or ethnicity.\nThe state of Tennessee and an anti-affirmative action organization sued the U.S. Education Department in June, asking a judge to halt the Hispanic-Serving Institution program. Tennessee argued all of its public universities serve Hispanic students but none meet the “arbitrary ethnic threshold” to be eligible for the grants. Those schools miss out on tens of millions of dollars because of discriminatory requirements, the suit said.\nOn Friday, the Justice Department released a letter in which Solicitor General John Sauer notified Republican House Speaker Mike Johnson that the department “has decided not to defend” the program, saying certain aspects of it are unconstitutional. The letter, dated July 25, cited a 2023 Supreme Court decision that “outright racial balancing” is “patently unconstitutional.”\nThe Justice Department declined to comment.\nTennessee is backed in the suit by Students for Fair Admissions, a conservative legal group that successfully challenged affirmative action in admissions at Harvard and the University of North Carolina. That suit led to a 2023 Supreme Court ruling that forbids universities from considering students’ race in admissions decisions.\nEdward Blum, president of Students for Fair Admissions, said Friday the group would decline to comment.\nMore than 500 colleges and universities are designated as Hispanic-Serving Institutions, making them eligible for the grant program. Congress appropriated about $350 million for the program in 2024. Colleges compete for the grants, which can go toward a range of uses, from building improvements to science programs.\nFormer President Joe Biden made Hispanic universities a priority, signing an executive action last year that promised a new presidential advisory board and increased funding. President Donald Trump revoked the order his first day in office.\nTrump is taking steps to dismantle the Education Department and has called for massive funding cuts, yet his 2026 budget request preserved grants for Hispanic universities and even asked Congress for a slight increase. Even so, there have been doubts about his administration’s commitment to the funding.\nA national association of Hispanic universities filed a motion last month to intervene as a defendant in the Tennessee lawsuit, voicing concern that the federal government would not adequately represent the group’s members.\nThe Hispanic Association of Colleges and Universities said Trump’s agenda is “entirely adverse” to the group’s interests, citing the president’s aim to close the Education Department entirely. The administration is “on record denouncing programs like HSIs, that take account of and seek to redress ethnic or racial disparity,” the group wrote.\nTennessee and Students for Fair Admissions did not object to the group’s request to lead the legal defense.\nUnlike historically Black or Native American tribal colleges and universities, which receive their designations based on their missions, any college can receive the HSI label and grants if its Latino enrollment makes up at least 25% of the undergraduate student body.\nThe list of HSIs includes flagship campuses like the University of Texas at Austin and the University of Arizona, along with many community colleges and smaller institutions.\nIn its court filing, the national association argues the grants are constitutional and help put its members on an even playing field.\nThe group’s schools enroll 67% of the nation’s Latino undergraduate students, yet studies find those schools receive far less in state and federal funding than other institutions. Hispanic universities are open to students of all races — as an example, the association pointed to Southern Adventist University, a private school in Tennessee whose student body is 28% Hispanic and 40% white.\nThe Justice Department generally has a duty to uphold the Constitution and federal legislation, but in rare cases it can refuse to defend laws it believes are unconstitutional. The Obama administration did so in 2011 when it refused to enforce the Defense of Marriage Act. During his first term, Trump did the same with the Affordable Care Act.\nThe Trump administration has fought to end diversity, equity and inclusion policies in government, education and business, arguing that they discriminate against white and Asian American people.\n___\nThe Associated Press’ education coverage receives financial support from multiple private foundations. AP is solely responsible for all content. Find AP’s standards for working with philanthropies, a list of supporters and funded coverage areas at AP.org."
    },
    {
      "news_title": "Alert: Trump administration says grants for Hispanic-serving colleges are unconstitutional and it won't defend them in court",
      "news_link": "https://www.houstonchronicle.com/news/politics/article/alert-trump-administration-says-grants-for-20888649.php",
      "bias": "Center",
      "text": null
    },
    {
      "news_title": "Justice Dept. declines to defend grants for Hispanic-serving colleges",
      "news_link": "https://spectrumlocalnews.com/nyc/all-boroughs/news/2025/08/22/justice-department-declines-to-defend-grants-for-hispanic-serving-colleges",
      "bias": "Center",
      "text": "WASHINGTON — The Trump administration said Friday it will not defend a decades-old grant program for colleges with large numbers of Hispanic students that is being challenged in court, declaring the government believes the funding is unconstitutional.\nWhat You Need To Know\n- The Trump administration says it will not defend a decades-old grant program for heavily Hispanic universities that is being challenged in court, declaring that the government believes the funding is unconstitutional\n- In a memo sent Friday to Congress, the Justice Department said it agrees with a June lawsuit attempting to strike down grants that are reserved for colleges and universities where at least a quarter of undergraduates are Hispanic\n- Congress created the program in 1998 after finding that Latino students were going to college and graduating at far lower rates than white students\n- Justice Department officials argued the program provides an unconstitutional advantage based on race or ethnicity\nIn a memo sent to Congress, the Justice Department said it agrees with a lawsuit attempting to strike down grants that are reserved for colleges and universities where at least a quarter of undergraduates are Hispanic. Congress created the program in 1998 after finding Latino students were going to college and graduating at far lower rates than white students.\nJustice Department officials argued the program provides an unconstitutional advantage based on race or ethnicity.\nThe state of Tennessee and an anti-affirmative action organization sued the U.S. Education Department in June, asking a judge to halt the Hispanic-Serving Institution program. Tennessee argued all of its public universities serve Hispanic students but none meet the \"arbitrary ethnic threshold\" to be eligible for the grants. Those schools miss out on tens of millions of dollars because of discriminatory requirements, the suit said.\nOn Friday, the Justice Department released a letter dated July 25 in which Solicitor General John Sauer notified Republican House Speaker Mike Johnson that the department \"has decided not to defend\" the program, saying that certain aspects of it are unconstitutional. The letter cited a 2023 Supreme Court decision that racial balancing is \"patently unconstitutional.\"\nThe Justice Department did not immediately respond to a request for comment."
    }
  ]
}