{
  "story_id": "GN_20250825_224751_2eeec29f",
  "metadata": {
    "title": "Irish folk band The Mary Wallopers say they were muted at festival for showing Palestinian flag on stage",
    "timestamp": "2025-08-25T22:47:51.232504",
    "url": "https://ground.news/article/irish-folk-band-the-mary-wallopers-say-they-were-muted-at-festival-for-showing-palestinian-flag-on-stage"
  },
  "bias_distribution": {
    "total_sources": "52",
    "leaning_left": "12",
    "center": "19",
    "leaning_right": "6"
  },
  "perspective_summaries": {
    "left": [
      "The Irish folk group The Mary Wallopers was removed from the Victorious Festival stage after displaying a Palestinian flag and chanting 'Free Palestine' just 20 minutes into their performance.",
      "Victorious Festival stated that they have a long-standing policy of not allowing flags of any kind at the event.",
      "The band confirmed the incident via Instagram, stating, 'Just got cut off at Victorious Festival for having a Palestinian flag on the stage.'",
      "Victorious Festival stated that they cut the sound after the group used a chant deemed potentially discriminatory, not solely for displaying the flag."
    ],
    "center": [
      "Irish folk band The Mary Wallopers claimed they were \"cut off\" for displaying a Palestinian flag during their set at the Victorious music festival in England.",
      "Several bands, including The Academic and Cliffords, pulled out of the festival in protest after the organizers cut off the sound when The Mary Wallopers displayed the Palestinian flag.",
      "The festival organizers initially defended their actions, citing a policy against displaying flags, but later apologized for not handling \"the explanation of our policies sensitively or far enough in advance."
    ],
    "right": [
      "The Irish folk band The Mary Wallopers were muted during their performance at the Victorious music festival after displaying a Palestinian flag, leading to controversy over free speech.",
      "Festival organizers initially claimed the band's performance ended due to a discriminatory chant, but later apologized, admitting sound was cut for their audience.",
      "Audience members protested the band's muting by chanting 'Free Palestine' and 'Let them play!' during the incident.",
      "The festival management stated that their decision to cut sound was made after the band led a chant with a discriminatory context, despite allowing some expressions of views."
    ]
  },
  "sources": [
    {
      "news_title": "British music festival apologizes after cutting mics of Irish band that displayed Palestinian flag - Jewish Telegraphic Agency",
      "news_link": "https://www.jta.org/2025/08/25/culture/british-music-festival-apologizes-after-cutting-mics-of-irish-band-that-displayed-palestinian-flag",
      "bias": "Center",
      "text": "A British festival has apologized and pledged “a substantial donation” to Palestinian aid after sparking an outcry by cutting the amplification of an Irish band that displayed a Palestinian flag in violation of the festival’s rules.\nThe Victorious music festival in Portsmouth, England, had aimed to head off possible controversies after a summer festival season marked by uproars over performers’ displays of Palestinian solidarity and anti-Israel sentiment. It told bands that they were not permitted to display flags during their sets.\nSo when the Mary Wallopers, an Irish folk band, attached a large Palestinian flag to a speaker at the start of their set on Saturday, festival staff intervened. Video that the band shared shows a staffer taking down the first flag after exchanging words with one of the band members.\nLead singer Andrew Hendy had kicked off the set by telling the crowd, “Free Palestine, and f–k Israel” to applause. According to the video, after Hendy calls attention to the flag removal and calls for the audience to leave, the band’s microphones are cut. The group members remain on stage for some time, restoring the removed Palestinian flag and waving others.\n“We playing or what?” guitarist Charles Hendy asks someone off-screen after approaching the back of the stage. The answer: “You’re not playing until the flag’s removed.”\nAndrew Hendy then discovers that a banjo is still amplified and leads a continued “Free Palestine” chant through it.\nThe festival initially put out a statement saying that the band had “used a chant which is widely understood to have a discriminatory context,” without specifying what it was. But after other bands backed out and the Mary Wallopers released its video, the festival issued a new statement, apologizing and saying that it had not intended to quash expression.\n“We didn’t handle the explanation of our policies sensitively or far enough in advance to allow a sensible conclusion to be reached,” Victorious said in the statement. “This put the band and our own team in a difficult position which never should have arisen. We would like to seriously apologise to all concerned.”\nIt added, “We absolutely support the right of artists to freely express their views from the stage, within the law and the inclusive nature of the event.”\nOther bands came to the Mary Wallopers’ aid during their own performances.\n“If someone was punished for flying a flag, that is wrong and they deserve an apology,” Vampire Weekend frontman Ezra Koenig, who is Jewish, said during the band’s set later on Saturday after saying he had heard about the controversy but did not have all the details. “The terrible suffering of the Palestinian people deserves all of our sympathy.”\nThe incident adds to a growing number in which British acts have rallied audiences in pro-Palestinian chants. The U.S. State Department canceled the visas of the group Bob Vylan after its lead singer led Glastonbury festival attendees in chanting “Death to the IDF” in June. The Irish post-punk band Fontaines D.C. projected the message “Israel is committing genocide” during a performance in Spain later that month.\nThe string of incidents began when the Irish act Kneecap displayed a projection reading “F–k Israel” at Coachella in the United States in April. A Kneecap member, Mo Chara, has since been charged with an act of terrorism in the United Kingdom for displaying a Hezbollah flag during a concert.\nThe band, which is soon to start a near sold-out U.S. tour, led its own “Free Palestine” chant at a festival in Paris on Sunday, where it performed despite pressure on the festival to drop the act.\nJTA has documented Jewish history in real-time for over a century. Keep our journalism strong by joining us in supporting independent, award-winning reporting."
    },
    {
      "news_title": "Vampire Weekend Call Out Victorious Festival Organizers After Mary Wallopers Set Cut Short",
      "news_link": "https://pitchfork.com/news/vampire-weekend-call-out-victorious-festival-organizers-after-mary-wallopers-set-cut-short/",
      "bias": "Lean Left",
      "text": "On Friday, August 22, Irish folk band the Mary Wallopers had their set at Portsmouth, England’s Victorious Festival cut short after flying the Palestinian flag onstage and leading a chant of “free Palestine.” Several artists, including the Last Dinner Party, subsequently pulled out of their scheduled performances in protest, but Vampire Weekend, among this year’s headliners, chose to perform at the festival and used their platform to call out the Victorious organizers.\nAs reported by Portsmouth’s The News, Ezra Koenig addressed the crowd during Vampire Weekend’s set last night (Saturday, August 23). “If someone was punished for flying a flag, that is wrong and they deserve an apology,” Koenig said. “The terrible suffering of the Palestinian people deserves all of our sympathy.”\nWriting to NME, representatives for Victorious originally claimed to have cut off the Mary Wallopers’ sound because they “used a chant which is widely understood to have a discriminatory context.” The Mary Wallopers then responded with their own statement alongside footage of the stage during their set: “The festival have released a misleading statement to the press claiming they cut our sound because of a discriminatory chant and not the band’s call to Free Palestine.”\nThe statement continues: “Our video clearly shows a Victorious crew member coming on stage, interfering with our show, removing the flag from the stage and then the sound being cut following a chant of ‘Free Palestine.’” The same crew member is later heard in the video saying “you aren’t playing until the flag is removed.” Victorious Festival then released a second statement apologizing to the band.\nIn June, British punk-rap duo Bob Vylan had their U.S. visas revoked after a controversial Glastonbury set where frontman Bobby Vylan led the crowd in a chant of “Death, death to the IDF.” Irish rap trio Kneecap, whose performance at Coachella 2025 featured pro-Palestine and anti-Israel messages, have found themselves removed from the lineup of Glasgow’s TRNSMT music festival and banned from Hungary, while their members, Mo Chara, is charged with a terror offense for allegedly displaying the Hezbollah flag during a 2024 concert. Both groups were investigated by British police following their sets at Glastonbury this year, but police dropped the investigation into Kneecap.\nCorrection: An earlier version of this story incorrectly stated that Avon and Somerset Police is currently investigating the band Kneecap. Police chose to close the investigation in July."
    },
    {
      "news_title": "Bands boycott UK's Victorious Festival after it censors pro-Palestine Irish group",
      "news_link": "https://www.thenationalnews.com/arts-culture/music-stage/2025/08/24/bands-boycott-uks-victorious-festival-after-it-censors-pro-palestine-irish-group/",
      "bias": "Center",
      "text": "Several bands have boycotted the Victorious Festival in the UK after organisers cut off audio during Irish folk group The Mary Wallopers' set as they were leading a \"Free Palestine\" chant.\nBritish alternative rock band The Last Dinner Party, Irish band Cliffords and Irish indie group The Academic pulled out hours before their scheduled performances in solidarity with The Mary Wallopers.\nHeld in the city of Portsmouth since 2012, more than 80,000 music fans attended the first day of the three-day festival, according to the BBC, with headliners including American rockers Queens of the Stone Age and English indie group Kaiser Chiefs.\nOn Friday, The Mary Wallopers' set was dramatically cut short after one of the group's members walked on stage with a Palestinian flag. Following a brief altercation, a crew member was seen removing the flag, which led to frontman Charles Hendy stopping his set asking for the flag to be brought back. He then led the crowd with chants of \"Free Palestine\".\nThe group shared a video of the incident on social media on Saturday.\n\"We completely reject Victorious’ portrayal of today’s events and request that they retract their statement immediately,\" they said.\n\"Yesterday, a famine was declared in Gaza, where at least 65 people were killed by Israeli attacks, all the while Israel pushed ahead with plans to split the West Bank in two. These are the important facts about yesterday.\n\"We are uploading this video so everybody can see Victorious Festival cut our gig short for having a Palestinian flag on stage. We know this is getting some attention and we don’t want another distraction which takes attention away from the genocide that is happening in Palestine.\"\nIn a statement on social media, Victorious Festival apologised for the incident and said it has had a policy of not allowing flags of any kind on stage for many years \"for wider event management and safety reasons\".\n\"We accept that, although mics remained live for longer, sound for The Mary Wallopers' audience was cut as described in the band's video and that comments after that were not audible to the public,\" it said. \"We are sorry that this situation has come about and will be making a substantial donation to humanitarian relief efforts for the Palestinian people.\"\nFollowing the statement, The Last Dinner Party announced they were boycotting the festival.\n\"We are outraged by the decision made to silence The Mary Wallopers yesterday at Victorious. As a band, we cannot co-sign political censorship and will therefore be boycotting the festival today,\" they posted on Instagram on Saturday. \"We are so deeply sorry to our fans who were looking forward to seeing us today, and we are devastated to be put in this position that upsets both us and you. Free Palestine.\"\nThe Academic followed suit, saying they would not \"play at a festival that silences free speech and the right to express your views\".\n\"We stand in solidarity with the other Irish acts here this weekend. Up the Mary Wallopers. Free Palestine,\" the group posted.\nMembers of the Irish group Cliffords also said they refused to play \"if we are to be censored for showing our support to the people of Palestine\".\n\"We were not made aware of a 'no flag' policy when we agreed to play Victorious, and while we understand their predicament, we have no intention of playing if this is how artists are treated for speaking out against genocide,\" the group posted, along with a photo of its members holding a Palestinian flag.\n\"We will be donating to Medical Aid for Palestinians. We’ll put a link on our story so you can donate too,\" they added.\nMoral education needed in a 'rapidly changing world'\nMoral education lessons for young people is needed in a rapidly changing world, the head of the programme said.\nAlanood Al Kaabi, head of programmes at the Education Affairs Office of the Crown Price Court - Abu Dhabi, said: \"The Crown Price Court is fully behind this initiative and have already seen the curriculum succeed in empowering young people and providing them with the necessary tools to succeed in building the future of the nation at all levels.\n\"Moral education touches on every aspect and subject that children engage in.\n\"It is not just limited to science or maths but it is involved in all subjects and it is helping children to adapt to integral moral practises.\n\"The moral education programme has been designed to develop children holistically in a world being rapidly transformed by technology and globalisation.\"\n'Laal Kaptaan'\nDirector: Navdeep Singh\nStars: Saif Ali Khan, Manav Vij, Deepak Dobriyal, Zoya Hussain\nRating: 2/5\n10 tips for entry-level job seekers\n- Have an up-to-date, professional LinkedIn profile. If you don’t have a LinkedIn account, set one up today. Avoid poor-quality profile pictures with distracting backgrounds. Include a professional summary and begin to grow your network.\n- Keep track of the job trends in your sector through the news. Apply for job alerts at your dream organisations and the types of jobs you want – LinkedIn uses AI to share similar relevant jobs based on your selections.\n- Double check that you’ve highlighted relevant skills on your resume and LinkedIn profile.\n- For most entry-level jobs, your resume will first be filtered by an applicant tracking system for keywords. Look closely at the description of the job you are applying for and mirror the language as much as possible (while being honest and accurate about your skills and experience).\n- Keep your CV professional and in a simple format – make sure you tailor your cover letter and application to the company and role.\n- Go online and look for details on job specifications for your target position. Make a list of skills required and set yourself some learning goals to tick off all the necessary skills one by one.\n- Don’t be afraid to reach outside your immediate friends and family to other acquaintances and let them know you are looking for new opportunities.\n- Make sure you’ve set your LinkedIn profile to signal that you are “open to opportunities”. Also be sure to use LinkedIn to search for people who are still actively hiring by searching for those that have the headline “I’m hiring” or “We’re hiring” in their profile.\n- Prepare for online interviews using mock interview tools. Even before landing interviews, it can be useful to start practising.\n- Be professional and patient. Always be professional with whoever you are interacting with throughout your search process, this will be remembered. You need to be patient, dedicated and not give up on your search. Candidates need to make sure they are following up appropriately for roles they have applied.\nArda Atalay, head of Mena private sector at LinkedIn Talent Solutions, Rudy Bier, managing partner of Kinetic Business Solutions and Ben Kinerman Daltrey, co-founder of KinFitz\nUAE currency: the story behind the money in your pockets\nOur legal consultant\nName: Dr Hassan Mohsen Elhais\nPosition: legal consultant with Al Rowaad Advocates and Legal Consultants.\nKey facilities\n- Olympic-size swimming pool with a split bulkhead for multi-use configurations, including water polo and 50m/25m training lanes\n- Premier League-standard football pitch\n- 400m Olympic running track\n- NBA-spec basketball court with auditorium\n- 600-seat auditorium\n- Spaces for historical and cultural exploration\n- An elevated football field that doubles as a helipad\n- Specialist robotics and science laboratories\n- AR and VR-enabled learning centres\n- Disruption Lab and Research Centre for developing entrepreneurial skills\nWhy are asylum seekers being housed in hotels?\nThe number of asylum applications in the UK has reached a new record high, driven by those illegally entering the country in small boats crossing the English Channel.\nA total of 111,084 people applied for asylum in the UK in the year to June 2025, the highest number for any 12-month period since current records began in 2001.\nAsylum seekers and their families can be housed in temporary accommodation while their claim is assessed.\nThe Home Office provides the accommodation, meaning asylum seekers cannot choose where they live.\nWhen there is not enough housing, the Home Office can move people to hotels or large sites like former military bases.\nDubai Bling season three\nCast: Loujain Adada, Zeina Khoury, Farhana Bodi, Ebraheem Al Samadi, Mona Kattan, and couples Safa & Fahad Siddiqui and DJ Bliss & Danya Mohammed\nRating: 1/5\nSchedule for Asia Cup\nSept 15: Bangladesh v Sri Lanka (Dubai)\nSept 16: Pakistan v Qualifier (Dubai)\nSept 17: Sri Lanka v Afghanistan (Abu Dhabi)\nSept 18: India v Qualifier (Dubai)\nSept 19: India v Pakistan (Dubai)\nSept 20: Bangladesh v Afghanistan (Abu Dhabi) Super Four\nSept 21: Group A Winner v Group B Runner-up (Dubai)\nSept 21: Group B Winner v Group A Runner-up (Abu Dhabi)\nSept 23: Group A Winner v Group A Runner-up (Dubai)\nSept 23: Group B Winner v Group B Runner-up (Abu Dhabi)\nSept 25: Group A Winner v Group B Winner (Dubai)\nSept 26: Group A Runner-up v Group B Runner-up (Abu Dhabi)\nSept 28: Final (Dubai)\nJetour T1 specs\nEngine: 2-litre turbocharged\nPower: 254hp\nTorque: 390Nm\nPrice: From Dh126,000\nAvailable: Now\n<html><head><meta http-equiv=\"Content-Type\" content=\"text/html\" charset=\"UTF-8\" /></head><body><!--PSTYLE=* Labels%3aFH Label 18 Sport--><p>Beach soccer</p><!--PSTYLE=BY Byline--><p>Amith Passela</p><p /></body></html>\nCall of Duty: Black Ops 6\nDeveloper: Treyarch, Raven Software\nPublisher: Activision\nConsole: PlayStation 4 & 5, Windows, Xbox One & Series X/S\nRating: 3.5/5\nThe specs\nEngine: 2.0-litre 4cyl turbo\nPower: 261hp at 5,500rpm\nTorque: 405Nm at 1,750-3,500rpm\nTransmission: 9-speed auto\nFuel consumption: 6.9L/100km\nOn sale: Now\nPrice: From Dh117,059\nLexus LX700h specs\nEngine: 3.4-litre twin-turbo V6 plus supplementary electric motor\nPower: 464hp at 5,200rpm\nTorque: 790Nm from 2,000-3,600rpm\nTransmission: 10-speed auto\nFuel consumption: 11.7L/100km\nOn sale: Now\nPrice: From Dh590,000\nThe%20US%20Congress%2C%20explained\n%3Cp%3E-%20US%20Congress%20is%20divided%20into%20two%20chambers%3A%20the%20House%20of%20Representatives%20and%20Senate%3C%2Fp%3E%0A%3Cp%3E-%20435%20members%20make%20up%20the%20House%2C%20and%20100%20in%20the%20Senate%3C%2Fp%3E%0A%3Cp%3E-%20A%20party%20needs%20control%20of%20218%20seats%20to%20have%20a%20majority%20in%20the%20House%3C%2Fp%3E%0A%3Cp%3E-%20In%20the%20Senate%2C%20a%20party%20needs%20to%20hold%2051%20seats%20for%20control%3C%2Fp%3E%0A%3Cp%3E-%20In%20the%20event%20of%20a%2050-50%20split%2C%20the%20vice%20president's%20party%20retains%20power%20in%20the%20Senate%3C%2Fp%3E%0A\nMost F1 world titles\n7 — Michael Schumacher (1994, ’95, 2000, ’01 ’02, ’03, ’04)\n7 — Lewis Hamilton (2008, ’14,’15, ’17, ’18, ’19, ’20)\n5 — Juan Manuel Fangio (1951, ’54, ’55, ’56, ’57)\n4 — Alain Prost (1985, ’86, ’89, ’93)\n4 — Sebastian Vettel (2010, ’11, ’12, ’13)\nWhat are the GCSE grade equivalents?\n- Grade 9 = above an A*\n- Grade 8 = between grades A* and A\n- Grade 7 = grade A\n- Grade 6 = just above a grade B\n- Grade 5 = between grades B and C\n- Grade 4 = grade C\n- Grade 3 = between grades D and E\n- Grade 2 = between grades E and F\n- Grade 1 = between grades F and G\nJiu-jitsu calendar of events for 2017-2018:\nAugust 5:\nRound-1 of the President’s Cup in Al Ain.\nAugust 11-13:\nAsian Championship in Vietnam.\nSeptember 8-9:\nAjman International.\nSeptember 16-17\nAsian Indoor and Martial Arts Games, Ashgabat.\nSeptember 22-24:\nIJJF Balkan Junior Open, Montenegro.\nSeptember 23-24:\nGrand Slam Los Angeles.\nSeptember 29:\nRound-1 Mother of The Nation Cup.\nOctober 13-14:\nAl Ain U18 International.\nSeptember 20-21:\nAl Ain International.\nNovember 3:\nRound-2 Mother of The National Cup.\nNovember 4:\nRound-2 President’s Cup.\nNovember 10-12:\nGrand Slam Rio de Janeiro.\nNovember 24-26:\nWorld Championship, Columbia.\nNovember 30:\nWorld Beach Championship, Columbia.\nDecember 8-9:\nDubai International.\nDecember 23:\nRound-3 President’s Cup, Sharjah.\nJanuary 12-13:\nGrand Slam Abu Dhabi.\nJanuary 26-27:\nFujairah International.\nFebruary 3:\nRound-4 President’s Cup, Al Dhafra.\nFebruary 16-17:\nRas Al Khaimah International.\nFebruary 23-24:\nThe Challenge Championship.\nMarch 10-11:\nGrand Slam London.\nMarch 16:\nFinal Round – Mother of The Nation.\nMarch 17:\nFinal Round – President’s Cup.\n%3Cp%3E%3Ca%20href%3D%22https%3A%2F%2Fwww.thenationalnews.com%2Fbusiness%2Feconomy%2Fislamic-economy-consumer-spending-to-increase-45-to-3-2tn-by-2024-1.936583%22%20target%3D%22_self%22%3EGlobal%20Islamic%20economy%20to%20grow%203.1%25%20to%20touch%20%242.4%20trillion%20by%202024%3C%2Fa%3E%26nbsp%3B%3C%2Fp%3E%0A%3Cp%3E%3Ca%20href%3D%22https%3A%2F%2Fwww.thenationalnews.com%2Fbusiness%2Feconomy%2Fuk-economy-plunges-into-worst-ever-recession-after-record-20-4-contraction-1.1062560%22%20target%3D%22_self%22%3EUK%20economy%20plunges%20into%20worst-ever%20recession%20after%20record%2020.4%25%20contraction%3C%2Fa%3E%3C%2Fp%3E%0A%3Cp%3E%3Ca%20href%3D%22https%3A%2F%2Fwww.thenationalnews.com%2Fbusiness%2Feconomy%2Fislamic-economy-consumer-spending-to-increase-45-to-3-2tn-by-2024-1.936583%22%20target%3D%22_self%22%3EIslamic%20economy%20consumer%20spending%20to%20increase%2045%25%20to%20%243.2tn%20by%202024%3C%2Fa%3E%3C%2Fp%3E%0A\nSpringtime in a Broken Mirror,\nMario Benedetti, Penguin Modern Classics\nHow to wear a kandura\nDos\n- Wear the right fabric for the right season and occasion\n- Always ask for the dress code if you don’t know\n- Wear a white kandura, white ghutra / shemagh (headwear) and black shoes for work\n- Wear 100 per cent cotton under the kandura as most fabrics are polyester\nDon’ts\n- Wear hamdania for work, always wear a ghutra and agal\n- Buy a kandura only based on how it feels; ask questions about the fabric and understand what you are buying\nSPECS\n%3Cp%3E%3Cstrong%3EEngine%3A%3C%2Fstrong%3E%20Dual%20electric%20motors%20with%20102kW%20battery%20pack%3C%2Fp%3E%0A%3Cp%3E%3Cstrong%3EPower%3A%20%3C%2Fstrong%3E570hp%3C%2Fp%3E%0A%3Cp%3E%3Cstrong%3ETorque%3A%3C%2Fstrong%3E%20890Nm%3C%2Fp%3E%0A%3Cp%3E%3Cstrong%3ERange%3A%3C%2Fstrong%3E%20Up%20to%20428km%3C%2Fp%3E%0A%3Cp%3E%3Cstrong%3EOn%20sale%3A%3C%2Fstrong%3E%20Now%3C%2Fp%3E%0A%3Cp%3E%3Cstrong%3EPrice%3A%20%3C%2Fstrong%3EFrom%20Dh1%2C700%2C000%3C%2Fp%3E%0A\nThe specs\nAT4 Ultimate, as tested\nEngine: 6.2-litre V8\nPower: 420hp\nTorque: 623Nm\nTransmission: 10-speed automatic\nPrice: From Dh330,800 (Elevation: Dh236,400; AT4: Dh286,800; Denali: Dh345,800)\nOn sale: Now\nNew schools in Dubai\nSarfira\nDirector: Sudha Kongara Prasad\nStarring: Akshay Kumar, Radhika Madan, Paresh Rawal\nRating: 2/5\nIndoor cricket in a nutshell\nIndoor Cricket World Cup - Sept 16-20, Insportz, Dubai\n16 Indoor cricket matches are 16 overs per side\n8 There are eight players per team\n9 There have been nine Indoor Cricket World Cups for men. Australia have won every one.\n5 Five runs are deducted from the score when a wickets falls\n4 Batsmen bat in pairs, facing four overs per partnership\nScoring In indoor cricket, runs are scored by way of both physical and bonus runs. Physical runs are scored by both batsmen completing a run from one crease to the other. Bonus runs are scored when the ball hits a net in different zones, but only when at least one physical run is score.\nZones\nA Front net, behind the striker and wicketkeeper: 0 runs\nB Side nets, between the striker and halfway down the pitch: 1 run\nC Side nets between halfway and the bowlers end: 2 runs\nD Back net: 4 runs on the bounce, 6 runs on the full\nPharaoh's curse\nBritish aristocrat Lord Carnarvon, who funded the expedition to find the Tutankhamun tomb, died in a Cairo hotel four months after the crypt was opened.\nHe had been in poor health for many years after a car crash, and a mosquito bite made worse by a shaving cut led to blood poisoning and pneumonia.\nReports at the time said Lord Carnarvon suffered from “pain as the inflammation affected the nasal passages and eyes”.\nDecades later, scientists contended he had died of aspergillosis after inhaling spores of the fungus aspergillus in the tomb, which can lie dormant for months. The fact several others who entered were also found dead withiin a short time led to the myth of the curse.\nSpecs\nEngine: Dual-motor all-wheel-drive electric\nRange: Up to 610km\nPower: 905hp\nTorque: 985Nm\nPrice: From Dh439,000\nAvailable: Now\nThe specs\nEngine: 2.0-litre 4-cyl\nPower: 153hp at 6,000rpm\nTorque: 200Nm at 4,000rpm\nTransmission: 6-speed auto\nPrice: Dh99,000\nOn sale: now\nThe Old Slave and the Mastiff\nPatrick Chamoiseau\nTranslated from the French and Creole by Linda Coverdale"
    },
    {
      "news_title": "Hampshire music festival Victorious boycotted by bands over Palestine protest",
      "news_link": "https://www.hampshirechronicle.co.uk/news/25413913.hampshire-music-festival-boycotted-bands-palestine-protest/",
      "bias": "Center",
      "text": "Sex On Fire rockers Kings Of Leon are due to close the final night of the Victorious Festival tonight, which has hit controversy over a pro-Palestine protest.\nThree bands boycotted the event on Southsea Common in Hampshire, after Irish folk music band The Mary Wallopers claimed they were “cut off” for displaying a Palestinian flag during their set and declaring “Free Palestine”.\nThe Last Dinner Party, Cliffords and The Academic announced on Saturday that they would no longer be performing following Friday’s incident.\nThe organisers, who claimed the band had their set cut short for using a “discriminatory” chant, have since issued an apology to the band and pledged to make “a substantial donation to humanitarian relief efforts for the Palestinian people”.\nRead more\n- 10 things to do this bank holiday weekend in Hampshire\n- Victorious Festival: 'The beautiful seaside festival that's perfect for families'\n- Boomtown 2025 day four review: The Wurzels brought folk and Sex Pistols brought punk\n- Community music festival celebrating 10th anniversary\nThe festival said in a statement: “We absolutely support the right of artists to freely express their views from the stage, within the law and the inclusive nature of the event.\n“Our policy of not allowing flags of any kind, which has been in place for many years for wider event management and safety reasons, is not meant to compromise that right.”\nSaturday night headliners Vampire Weekend addressed the issue at the start of their set when lead singer Ezra Koenig said: “If someone was censored for flying a flag then that’s wrong and they deserve an apology.”\nHe added that the people of Palestine “deserve our sympathies”.\nThe New York band was given an extended set time because of the acts which had pulled out which allowed them to play improvised songs suggested by the audience including Buddy Holly by Weezer and to the crowd’s delight Common People by Pulp.\nScottish rockers Travis took the sundown slot ahead of the headliners and got the crowd singing along with hit Why Does It Always Rain on Me?\nAs well as the boycotting bands, the festival has also had to fill slots vacated by comedian Chris McCausland and Michael Kiwanuka because of illness with Kaiser Chiefs stepping in to take the place of the singer-songwriter on Saturday.\nBut Kings Of Leon, from Nashville, Tennessee, who have had to cancel their other UK shows earlier in the summer after frontman Caleb Followill suffered a “freak accident” are still set to headline the closing night on Sunday.\nAccording to a statement from the band, Followill had a “serious” shattered heel injury and needed “a significant emergency surgery that will prevent him from travelling and performing”.\nThe Friday night headline slots at Victorious were taken by Queens Of The Stone Age and ska legends Madness."
    },
    {
      "news_title": "Festival apologises to band ‘cut off’ for waving Palestine flag",
      "news_link": "https://7news.com.au/news/british-music-festival-apologises-to-band-who-say-they-were-cut-off-for-waving-palestinian-flag-c-19789689",
      "bias": "Lean Right",
      "text": "Organisers of a music festival in Portsmouth, England have apologised to Irish folk band The Mary Wallopers who claim they were muted during their set for displaying a Palestinian flag.\nA string of other performers pulled out of the Victorious music festival over the spat, accusing organisers of stifling free speech.\nAfter initially claiming that the band’s performance was stopped over a “discriminatory” chant, the festival issued a statement on Instagram saying sorry and pledging to donate to humanitarian efforts for Palestinians.\nKnow the news with the 7NEWS app: Download today\n“We didn’t handle the explanation of our policies sensitively or far enough in advance to allow a sensible conclusion to be reached,” the statement seen by British news agency PA Media said.\n“This put the band and our own team in a difficult situation which never should have arisen. We would like to sincerely apologise to all concerned.”\nThe statement continued, “We accept that, although mics remained live for longer, sound for The Mary Wallopers’ audience was cut as described in the band’s video and that comments after that were not audible to the public.”\nIn a post on Instagram, the band claimed that they were “cut off” at the festival, “for having a Palestinian flag on the stage,” and called Victorious’ initial explanation misleading.\nThe band’s statement continued, “We’ve been doing this for six years now and this has never happened before.”\nEdited video from the concert posted by the band on Instagram show that the Mary Wallopers’ banjo player Andrew Hendy began the set by saying “Free Palestine, and f**k Israel” before the group launched into one of their songs.\nTheir playing continues for about a minute further, according to the video, when a stagehand appears to come on stage and remove a Palestinian flag that the band had affixed to one of its speakers.\nAndrew Hendy tells the crowd that the band were instructed not to fly a Palestinian flag or they would be cut off, encouraging audience members to leave the festival grounds. The banjo player began chanting “Free Palestine” before his mic was cut.\nLater, video from another angle shows the band’s guitarist Charles Hendy asking a person offscreen whether the band will be allowed to continue playing. The response is muffled, but the person appears to reply that the Palestinian flag needs to be removed.\n“We’re not playing,” Charles Hendy responds.\n“Fine,” the person offscreen says.\nAs the band waved to the crowd and left the stage, audience members began chanting “Free Palestine” and “Let them play!”\n“People were upset and angry,” said Emma Gaynor, an audience member who attended the concert with her partner. “I didn’t hear anything discriminatory, it all happened very quickly.”\nJess Huxham, another attendee, said that other bands who played the festival that day had also said “Free Palestine” during their sets.\n“From all I heard,” Huxham said in an email. “[The Mary Wallopers] did say ‘Free Palestine,’ which other bands on the main stage had said before their set.”\nThe incident comes amid fierce controversy around pro-Palestinian activism and free speech in the UK, with musicians often at the forefront.\nAfter rap duo Bob Vylan chanted “death to the IDF” at their Glastonbury Festival set in June, police in the UK launched a criminal investigation. Even the United States government weighed in, revoking the band members’ visas ahead of their US tour.\nThe Mary Wallopers are due to tour Australia next month, playing shows in Perth, Brisbane, Sydney, Thirroul and Melbourne.\nStream free on"
    },
    {
      "news_title": "Kings Of Leon to headline last night of Victorious Festival",
      "news_link": "https://www.standard.co.uk/showbiz/celebrity-news/kings-of-leon-the-last-dinner-party-caleb-followill-portsmouth-hampshire-b1244304.html",
      "bias": "Center",
      "text": "Kings Of Leon to headline last night of Victorious Festival\nSex On Fire rockers Kings Of Leon are closing the final night of the Victorious Festival which has hit controversy over a pro-Palestine protest.\nThree bands boycotted the event on Southsea Common in Portsmouth, Hampshire, after Irish folk music band The Mary Wallopers claimed they were “cut off” for displaying a Palestinian flag during their set and declaring “Free Palestine”.\nThe Last Dinner Party, Cliffords and The Academic announced on Saturday that they would no longer be performing following Friday’s incident.\nThe organisers, who claimed the band had their set cut short for using a “discriminatory” chant, have since issued an apology to the band and pledged to make “a substantial donation to humanitarian relief efforts for the Palestinian people”.\nThe festival said in a statement: “We absolutely support the right of artists to freely express their views from the stage, within the law and the inclusive nature of the event.\n“Our policy of not allowing flags of any kind, which has been in place for many years for wider event management and safety reasons, is not meant to compromise that right.”\nSaturday night headliners Vampire Weekend addressed the issue at the start of their set when lead singer Ezra Koenig said: “If someone was censored for flying a flag then that’s wrong and they deserve an apology.”\nHe added that the people of Palestine “deserve our sympathies”.\nThe New York band was given an extended set time because of the acts which had pulled out which allowed them to play improvised songs suggested by the audience including Buddy Holly by Weezer and to the crowd’s delight Common People by Pulp.\nScottish rockers Travis took the sundown slot ahead of the headliners and got the crowd singing along with hit Why Does It Always Rain on Me?\nAs well as the boycotting bands, the festival has also had to fill slots vacated by comedian Chris McCausland and Michael Kiwanuka because of illness with Kaiser Chiefs stepping in to take the place of the singer-songwriter on Saturday.\nBut Kings Of Leon, from Nashville, Tennessee, who have had to cancel their other UK shows earlier in the summer after frontman Caleb Followill suffered a “freak accident” are still set to headline the closing night on Sunday.\nRead More\nAccording to a statement from the band, Followill had a “serious” shattered heel injury and needed “a significant emergency surgery that will prevent him from travelling and performing”.\nThe Friday night headline slots at Victorious were taken by Queens Of The Stone Age and ska legends Madness."
    },
    {
      "news_title": "Bands pull out from festival after group 'cut off' over Palestine flag",
      "news_link": "https://news.sky.com/story/bands-pull-out-from-festival-after-group-claims-it-was-cut-off-over-palestine-flag-13417474",
      "bias": "Center",
      "text": "Bands pull out from festival after group 'cut off' over Palestine flag\nSeveral bands have pulled out from the Victorious music festival just hours before their scheduled performances, after Irish folk group The Mary Wallopers had their set cut short.\nSunday 24 August 2025 14:50, UK\nSeveral bands have pulled out from the Victorious music festival just hours before their scheduled performances, following claims by Irish folk group The Mary Wallopers that they were \"cut off\" for displaying a Palestinian flag.\nThe Last Dinner Party, Cliffords, and The Academic announced on Saturday that they would no longer be performing at the annual music festival in Portsmouth following Friday's incident.\nThe organisers, who said the band's set was cut short for using a \"discriminatory\" chant, have since apologised and promised to make \"a substantial donation to humanitarian relief efforts for the Palestinian people\".\nRock band The Last Dinner Party said they are \"outraged\" by the incident and would boycott the festival.\n\"We are outraged by the decision made to silence The Mary Wallopers yesterday at Victorious. As a band we cannot cosign political censorship and will therefore be boycotting the festival today,\" they said in a statement shared on their Instagram page.\n\"As Gazans are deliberately plunged into catastrophic famine after two years of escalating violence, it is urgent and obvious that artists use their platform to draw attention to the cause.\n\"To see an attempt to direct attention away from the genocide in order to maintain an apolitical image is immensely disappointing.\"\nThe Last Dinner Party said that throughout the summer, they have used their performances to encourage their audiences to make donations to a medical charity supporting Palestinians and urged their fans \"more than ever to do the same\".\nThe band said they are \"devastated to be put in this position\" and apologised to those who were hoping to see them perform.\nFollowing The Mary Wallopers' set, a spokesperson for Victorious said: \"We spoke to the artist before the performance regarding the festival's long-standing policy of not allowing flags of any kind at the event, but that we respect their right to express their views during the show.\n\"Although a flag was displayed on stage contrary to our policy, and this was raised with the artist's crew, the show was not ended at this point, and it was the artist's decision to stop the song.\"\nRead more from Sky News:\nCriminals could be banned from pubs and sports grounds under new plans\nLegendary boxer to stand trial in Mexico over alleged cartel ties\nThe Mary Wallopers claimed the festival had released a \"misleading statement to the press claiming they cut our sound because of a discriminatory chant, and not the band's call to Free Palestine\".\nThe band said their video \"clearly shows a Victorious crew member coming on stage, interfering with our show, removing the flag from the stage and then the sound being cut following a chant of 'Free Palestine'\".\n\"The same crew member is later heard in the video saying 'you aren't playing until the flag is removed',\" the band added.\nBe the first to get Breaking News\nInstall the Sky News app for free\nRock band The Academic have also pulled out of the festival, saying they could not \"in good conscience\" perform at \"a festival that silences free speech\", while Irish band Cliffords said they \"refuse to play if we are to be censored for showing our support to the people of Palestine\".\nAfter the bands' announcements that they were pulling out of the festival, the organisers released another statement, saying that they did not handle \"the explanation of our policies sensitively or far enough in advance to allow a sensible conclusion to be reached\", and issued an apology."
    },
    {
      "news_title": "Bands boycott UK festival after Irish group 'cut off' for waving Palestinian flag",
      "news_link": "https://www.presstv.ir/Detail/2025/08/24/753680/Music-bands-boycott-festival-Irish-folk-band-The-Mary-Wallopers-Palestinian-flag-",
      "bias": "Right",
      "text": "Several bands have pulled out of a major UK music festival after an Irish folk band said organizers cut their set when they displayed a Palestinian flag and chanted “Free Palestine.”\nThe Mary Wallopers were performing at Victorious Festival in Portsmouth on Friday when organizers accused them of using a chant “widely understood to have a discriminatory context.”\nThe Mary Wallopers dismissed the allegation as “misleading,” saying, “Our video clearly shows a Victorious crew member coming on stage, interfering with our show, removing the flag from the stage and then the sound being cut following a chant of ‘Free Palestine’.”\nOrganizers first claimed the set was stopped over a chant, but later admitted the sound was cut after the flag was shown. They apologized “to all concerned” and pledged a “substantial donation” to humanitarian relief for Palestinians.\nIn protest, The Last Dinner Party, The Academic and Cliffords announced on Saturday that they would boycott the festival over censorship.\n“We are outraged by the decision to silence The Mary Wallopers,” The Last Dinner Party wrote on Instagram, calling it “political censorship.”\nThe Academic said they could not “in good conscience” perform at a festival that silences free speech, while Cliffords said they “refuse to play if we are to be censored for showing our support to the people of Palestine.”\nThe festival, which continues through Sunday with headliners including Kings of Leon, Bloc Party and Gabrielle, now faces growing backlash over silencing pro-Palestinian protest."
    },
    {
      "news_title": "Bands boycott festival after Mary Wallopers claim they were ‘cut off’ over Palestine flag",
      "news_link": "https://www.independent.ie/entertainment/music/music-news/bands-boycott-festival-after-mary-wallopers-claim-they-were-cut-off-over-palestine-flag/a987739366.html",
      "bias": "Lean Right",
      "text": "Bands boycott festival after Mary Wallopers claim they were ‘cut off’ over Palestine flag\nA string of bands have pulled out of the Victorious music festival hours before they were due to perform after Irish folk music band The Mary Wallopers claimed they were “cut off” for displaying a Palestinian flag.\nThe Last Dinner Party, Cliffords and The Academic announced on Saturday that they would no longer be performing at the Portsmouth music festival following Friday’s incident.\nThe organisers, who claimed the band had their set cut short for using a “discriminatory” chant, have since issued an apology to the band and pledged to make “a substantial donation to humanitarian relief efforts for the Palestinian people”.\nRock band The Last Dinner Party said they would boycott the festival in a statement shared on their Instagram page.\nThe statement said: “We are outraged by the decision made to silence The Mary Wallopers yesterday at Victorious. As a band we cannot cosign political censorship and will therefore be boycotting the festival today.\n“As Gazans are deliberately plunged into catastrophic famine after two years of escalating violence it is urgent and obvious that artists use their platform to draw attention to the cause. To see an attempt to direct attention away from the genocide in order to maintain an apolitical image is immensely disappointing.\n“Throughout this summer we have used our stages to encourage our audiences to donate even a drink’s worth of money to Medical Aid for Palestinians, and today we urge you more than ever to do the same.\n“We are so deeply sorry to our fans who were looking forward to seeing us today, and we are devastated to be put in this position that upsets both us and you. Free Palestine.”\nFollowing The Mary Wallopers’ set, a spokesperson for Victorious said: “We spoke to the artist before the performance regarding the festival’s long-standing policy of not allowing flags of any kind at the event, but that we respect their right to express their views during the show.\n“Although a flag was displayed on stage contrary to our policy, and this was raised with the artist’s crew, the show was not ended at this point, and it was the artist’s decision to stop the song.”\nIn response, The Mary Wallopers claimed the festival had released a “misleading statement to the press claiming they cut our sound because of a discriminatory chant, and not the band’s call to Free Palestine.\n“Our video clearly shows a Victorious crew member coming on stage, interfering with our show, removing the flag from the stage and then the sound being cut following a chant of ‘Free Palestine,'” they said.\n“The same crew member is later heard in the video saying ‘you aren’t playing until the flag is removed’.”\nRock band The Academic have also pulled out of the festival, saying they could not “in good conscience” perform at “a festival that silences free speech”, while Irish band Cliffords said they “refuse to play if we are to be censored for showing our support to the people of Palestine”.\nAs the bands announced they would no longer perform at the festival, the organisers issued another statement on Instagram which read: “The Mary Wallopers are a fantastic band and we were very much looking forward to their performance at Victorious on Friday.\n“We didn’t handle the explanation of our policies sensitively or far enough in advance to allow a sensible conclusion to be reached.\n“This put the band and our own team in a difficult situation which never should have arisen. We would like to sincerely apologise to all concerned.\n“We absolutely support the right of artists to freely express their views from the stage, within the law and the inclusive nature of the event. Our policy of not allowing flags of any kind, which has been in place for many years for wider event management and safety reasons, is not meant to compromise that right.\n“We accept that, although mics remained live for longer, sound for The Mary Wallopers’ audience was cut as described in the band’s video and that comments after that were not audible to the public.\n“We are sorry that this situation has come about and will be making a substantial donation to humanitarian relief efforts for the Palestinian people.”\nThe festival is set to feature Vampire Weekend, The Kaiser Chiefs and Kings Of Leon over the weekend.\nStarting Vampire Weekend’s headline set on the Common Stage, lead singer Ezra Koenig said: “If someone was censored for flying a flag then that’s wrong and they deserve an apology.”\nHe added that the people of Palestine “deserve our sympathies”.\nHave you tried Focail and Conundrum?\nDaily word puzzles designed to test your vocabulary and lateral thinking skills."
    },
    {
      "news_title": "UK festival organisers APOLOGISE after banning Palestine chants",
      "news_link": "https://www.express.co.uk/news/uk/2099425/uk-victorious-festival-organisers-apologise-palestine-ban",
      "bias": "Lean Right",
      "text": null
    },
    {
      "news_title": "Irish band cut off at U.K. festival for waving Palestinian flag, other acts pull out",
      "news_link": "https://www.haaretz.com/world-news/europe/2025-08-24/ty-article/.premium/irish-band-cut-off-at-u-k-festival-for-waving-palestinian-flag-other-acts-pull-out/00000198-dae9-dd20-a5fc-feeb8de70000",
      "bias": "Lean Left",
      "text": "Irish Band Cut Off at U.K. Festival for Waving Palestinian Flag, Other Acts Pull Out\nThe Irish band the Mary Wallopers had their performance at the Victorious Festival in Portsmouth cut short on Friday after members waved a Palestinian flag.\nThe Irish band the Mary Wallopers had their performance at the Victorious Festival in Portsmouth cut short on Friday after members waved a Palestinian flag."
    },
    {
      "news_title": "Bands pull out of UK festival following Palestinian flag controversy",
      "news_link": "https://www.arabnews.com/node/2612836/lifestyle",
      "bias": "Lean Right",
      "text": "LONDON: Several bands withdrew from a British festival on Saturday following claims that Irish folk group The Mary Wallopers had their set cut short for displaying a Palestinian flag.\nThe incident sparked a wave of boycotts from other performers in solidarity, it was reported on Sunday.\nThe Last Dinner Party, Cliffords, and The Academic announced that they would no longer perform at the annual Victorious Festival in Portsmouth, citing concerns over political censorship.\nRock band The Last Dinner Party described the incident as “outrageous” and said they could not condone silencing artists.\n“As Gazans are deliberately plunged into catastrophic famine after two years of escalating violence, it is urgent and obvious that artists use their platform to draw attention to the cause,” the band said in a statement shared on Instagram.\nThey urged fans to support Palestinian medical charities and apologized to those hoping to see them perform.\nThe Mary Wallopers claimed the festival released a “misleading statement” by suggesting their set was cut due to a discriminatory chant, rather than the band’s call to “Free Palestine.”\nThey released video footage showing a crew member removing the flag from the stage before the sound was cut.\n“The same crew member is later heard saying ‘You aren’t playing until the flag is removed’,” the band added.\nThe Academic said they could not “in good conscience” perform at a festival that silenced free speech, while Cliffords said they “refuse to play if we are to be censored for showing our support to the people of Palestine.”\nFestival organizers initially said The Mary Wallopers’ microphones were turned off after displaying the flag, citing a long-standing policy against flags for safety and event management reasons.\nThey said: “We spoke to the artist before the performance regarding the festival’s long-standing policy of not allowing flags of any kind at the event, but (we said) that we respect their right to express their views during the show.”\nThey acknowledged, however, that the policy was not communicated sensitively and apologized for the way the situation was handled.\nThey added: “The Mary Wallopers are a fantastic band, and we were very much looking forward to their performance on Friday.\n“We are in the business of putting on great shows, not cutting them off, and this is the last thing we wanted — for the band, their fans and ourselves.”\nOrganizers also pledged to make a “substantial donation” to humanitarian relief efforts for Palestinians.\nThe festival’s closing day on Sunday was set to feature Kings of Leon, with Bloc Party, Gabrielle, and The Reytons among the other acts scheduled to perform."
    },
    {
      "news_title": "Bands boycott Victorious music festival after group 'cut-off'",
      "news_link": "https://www.bbc.com/news/articles/c1jnyrk07ndo",
      "bias": "Center",
      "text": "Bands boycott music festival after group 'cut off'\nA string of bands have pulled out of a music festival hours before they were due to perform after Irish folk band The Mary Wallopers claimed they were \"cut off\" for displaying a Palestinian flag.\nThe Last Dinner Party, Cliffords and The Academic announced on Saturday that they would no longer be performing at Portsmouth's Victorious festival.\nThe organisers, who initially claimed The Mary Wallopers had their set cut on Friday for using a \"discriminatory\" chant, have since issued an apology to the band.\nThey also pledged to make \"a substantial donation to humanitarian relief efforts for the Palestinian people\".\nRock band The Last Dinner Party said they were boycotting the festival in a statement shared on their Instagram page.\nThey said they were \"outraged by the decision made to silence The Mary Wallopers\" and accused the organisers of \"political censorship\".\nThey apologised to their fans and expressed their support for Palestinians.\nFollowing The Mary Wallopers' set, a spokesperson for Victorious said: \"We spoke to the artist before the performance regarding the festival's long-standing policy of not allowing flags of any kind at the event, but that we respect their right to express their views during the show.\n\"Although a flag was displayed on stage contrary to our policy, and this was raised with the artist's crew, the show was not ended at this point, and it was the artist's decision to stop the song.\"\nIn response, The Mary Wallopers claimed the festival had released a \"misleading statement to the press claiming they cut our sound because of a discriminatory chant, and not the band's call to Free Palestine\".\n\"Our video clearly shows a Victorious crew member coming on stage, interfering with our show, removing the flag from the stage and then the sound being cut following a chant of 'Free Palestine',\" they added.\nRock band The Academic have also pulled out of the festival, saying they could not \"in good conscience\" perform at \"a festival that silences free speech\", while Irish band Cliffords said they \"refuse to play if we are to be censored for showing our support to the people of Palestine\".\nAs the bands announced they would no longer perform at the festival, the organisers issued another statement on Instagram.\nDescribing The Mary Wallopers as \"a fantastic band\", they said: \"We didn't handle the explanation of our policies sensitively or far enough in advance to allow a sensible conclusion to be reached.\n\"This put the band and our own team in a difficult situation which never should have arisen. We would like to sincerely apologise to all concerned.\n\"We absolutely support the right of artists to freely express their views from the stage, within the law and the inclusive nature of the event. Our policy of not allowing flags of any kind, which has been in place for many years for wider event management and safety reasons, is not meant to compromise that right.\n\"We accept that, although mics remained live for longer, sound for The Mary Wallopers' audience was cut as described in the band's video and that comments after that were not audible to the public.\"\nThey apologised for what had happened and pledged to make a \"substantial donation\" to humanitarian relief efforts.\nThe festival's closing day is set to be headlined by Kings of Leon, with Bloc Party, Gabrielle and The Reytons among the other acts on the line-up.\nYou can follow BBC Hampshire & Isle of Wight on Facebook, X (Twitter), or Instagram."
    },
    {
      "news_title": "Bands boycott festival after group claim they were ‘cut off’ over Palestine flag",
      "news_link": "https://www.theargus.co.uk/news/national/25413280.bands-boycott-festival-group-claim-cut-off-palestine-flag/",
      "bias": "Center",
      "text": "A string of bands have pulled out of the Victorious music festival hours before they were due to perform after Irish folk music band The Mary Wallopers claimed they were “cut off” for displaying a Palestinian flag.\nThe Last Dinner Party, Cliffords and The Academic announced on Saturday that they would no longer be performing at the Portsmouth music festival following Friday’s incident.\nThe organisers, who claimed the band had their set cut short for using a “discriminatory” chant, have since issued an apology to the band and pledged to make “a substantial donation to humanitarian relief efforts for the Palestinian people”.\nRock band The Last Dinner Party said they would boycott the festival in a statement shared on their Instagram page.\nThe statement said: “We are outraged by the decision made to silence The Mary Wallopers yesterday at Victorious. As a band we cannot cosign political censorship and will therefore be boycotting the festival today.\n“As Gazans are deliberately plunged into catastrophic famine after two years of escalating violence it is urgent and obvious that artists use their platform to draw attention to the cause. To see an attempt to direct attention away from the genocide in order to maintain an apolitical image is immensely disappointing.\n“Throughout this summer we have used our stages to encourage our audiences to donate even a drink’s worth of money to Medical Aid for Palestinians, and today we urge you more than ever to do the same.\n“We are so deeply sorry to our fans who were looking forward to seeing us today, and we are devastated to be put in this position that upsets both us and you. Free Palestine.”\nFollowing The Mary Wallopers’ set, a spokesperson for Victorious said: “We spoke to the artist before the performance regarding the festival’s long-standing policy of not allowing flags of any kind at the event, but that we respect their right to express their views during the show.\n“Although a flag was displayed on stage contrary to our policy, and this was raised with the artist’s crew, the show was not ended at this point, and it was the artist’s decision to stop the song.”\nIn response, The Mary Wallopers claimed the festival had released a “misleading statement to the press claiming they cut our sound because of a discriminatory chant, and not the band’s call to Free Palestine.\n“Our video clearly shows a Victorious crew member coming on stage, interfering with our show, removing the flag from the stage and then the sound being cut following a chant of ‘Free Palestine,'” they said.\n“The same crew member is later heard in the video saying ‘you aren’t playing until the flag is removed’.”\nRock band The Academic have also pulled out of the festival, saying they could not “in good conscience” perform at “a festival that silences free speech”, while Irish band Cliffords said they “refuse to play if we are to be censored for showing our support to the people of Palestine”.\nAs the bands announced they would no longer perform at the festival, the organisers issued another statement on Instagram which read: “The Mary Wallopers are a fantastic band and we were very much looking forward to their performance at Victorious on Friday.\n“We didn’t handle the explanation of our policies sensitively or far enough in advance to allow a sensible conclusion to be reached.\n“This put the band and our own team in a difficult situation which never should have arisen. We would like to sincerely apologise to all concerned.\n“We absolutely support the right of artists to freely express their views from the stage, within the law and the inclusive nature of the event. Our policy of not allowing flags of any kind, which has been in place for many years for wider event management and safety reasons, is not meant to compromise that right.\n“We accept that, although mics remained live for longer, sound for The Mary Wallopers’ audience was cut as described in the band’s video and that comments after that were not audible to the public.\n“We are sorry that this situation has come about and will be making a substantial donation to humanitarian relief efforts for the Palestinian people.”\nThe festival is set to feature Vampire Weekend, The Kaiser Chiefs and Kings Of Leon over the weekend.\nStarting Vampire Weekend’s headline set on the Common Stage, lead singer Ezra Koenig said: “If someone was censored for flying a flag then that’s wrong and they deserve an apology.”\nHe added that the people of Palestine “deserve our sympathies”."
    },
    {
      "news_title": "Bands withdraw from festival after Irish folk act \"cut off\" for Palestine flag",
      "news_link": "https://www.belfastlive.co.uk/whats-on/bands-withdraw-festival-after-irish-32339047",
      "bias": "Center",
      "text": "Bands withdraw from festival after Irish folk act \"cut off\" for Palestine flag\nThe organisers, who claimed the band had their set cut short for using a “discriminatory” chant, have since issued an apology\nA string of bands have pulled out of the Victorious music festival hours before they were due to perform after Irish folk music band The Mary Wallopers claimed they were “cut off” for displaying a Palestinian flag.\nThe Last Dinner Party, Cliffords and The Academic announced on Saturday that they would no longer be performing at the Portsmouth music festival following Friday’s incident.\nThe organisers, who claimed the band had their set cut short for using a “discriminatory” chant, have since issued an apology to the band and pledged to make “a substantial donation to humanitarian relief efforts for the Palestinian people”.\nRock band The Last Dinner Party said they would boycott the festival in a statement shared on their Instagram page.\nThe statement said: “We are outraged by the decision made to silence The Mary Wallopers yesterday at Victorious. As a band we cannot cosign political censorship and will therefore be boycotting the festival today.\n“As Gazans are deliberately plunged into catastrophic famine after two years of escalating violence it is urgent and obvious that artists use their platform to draw attention to the cause. To see an attempt to direct attention away from the genocide in order to maintain an apolitical image is immensely disappointing.\n“Throughout this summer we have used our stages to encourage our audiences to donate even a drink’s worth of money to Medical Aid for Palestinians, and today we urge you more than ever to do the same.\n“We are so deeply sorry to our fans who were looking forward to seeing us today, and we are devastated to be put in this position that upsets both us and you. Free Palestine.”\nFollowing The Mary Wallopers’ set, a spokesperson for Victorious said: “We spoke to the artist before the performance regarding the festival’s long-standing policy of not allowing flags of any kind at the event, but that we respect their right to express their views during the show.\n“Although a flag was displayed on stage contrary to our policy, and this was raised with the artist’s crew, the show was not ended at this point, and it was the artist’s decision to stop the song.”\nIn response, The Mary Wallopers claimed the festival had released a “misleading statement to the press claiming they cut our sound because of a discriminatory chant, and not the band’s call to Free Palestine.\n“Our video clearly shows a Victorious crew member coming on stage, interfering with our show, removing the flag from the stage and then the sound being cut following a chant of ‘Free Palestine,'” they said.\n“The same crew member is later heard in the video saying ‘you aren’t playing until the flag is removed’.”\nRock band The Academic have also pulled out of the festival, saying they could not “in good conscience” perform at “a festival that silences free speech”, while Irish band Cliffords said they “refuse to play if we are to be censored for showing our support to the people of Palestine”.\nAs the bands announced they would no longer perform at the festival, the organisers issued another statement on Instagram which read: “The Mary Wallopers are a fantastic band and we were very much looking forward to their performance at Victorious on Friday.\n“We didn’t handle the explanation of our policies sensitively or far enough in advance to allow a sensible conclusion to be reached.\n“This put the band and our own team in a difficult situation which never should have arisen. We would like to sincerely apologise to all concerned.\n“We absolutely support the right of artists to freely express their views from the stage, within the law and the inclusive nature of the event. Our policy of not allowing flags of any kind, which has been in place for many years for wider event management and safety reasons, is not meant to compromise that right.\n“We accept that, although mics remained live for longer, sound for The Mary Wallopers’ audience was cut as described in the band’s video and that comments after that were not audible to the public.\n“We are sorry that this situation has come about and will be making a substantial donation to humanitarian relief efforts for the Palestinian people.”\nThe festival is set to feature Vampire Weekend, The Kaiser Chiefs and Kings Of Leon over the weekend.\nFor all the latest news, visit the Belfast Live homepage here and sign up to our daily newsletter here."
    },
    {
      "news_title": "Last Dinner Party Boycotts Victorious Festival After Mary Wallopers’ Set Cut Short Over ‘Free Palestine’ Message",
      "news_link": "https://www.billboard.com/music/music-news/last-dinner-party-boycotts-victorious-festival-palestine-1236050564/",
      "bias": "Center",
      "text": "The Last Dinner Party withdrew from their scheduled performance at Victorious Festival on Saturday (Aug. 23) in protest of an incident involving fellow band the Mary Wallopers, whose set was cut short after they showed support for Palestine.\nThe British indie rock-pop group announced their decision on social media Saturday morning, referencing the previous day’s events in which the Mary Wallopers displayed a Palestinian flag on stage and called for a “Free Palestine.”\n“We are outraged by the decision made to silence the Mary Wallopers yesterday at Victorious,” the Last Dinner Party wrote on Instagram. “As a band we cannot cosign political censorship and will therefore be boycotting the festival today.”\nTrending on Billboard\nThey continued, “As Gazans are deliberately plunged into catastrophic famine after two years of escalating violence it is urgent and obvious that artists use their platform to draw attention to the cause. To see an attempt to direct attention away from the genocide in order to maintain an apolitical image is immensely disappointing.”\nThe Last Dinner Party also encouraged fans to donate to medical aid for Palestinians and closed their message with “Free Palestine.”\nOn Friday (Aug. 22), members of the Mary Wallopers took the stage at Victorious Festival carrying a Palestinian flag and voiced the message, “Free Palestine and f—k Israel.” Their sound was cut off after a crew member removed the flag, prompting the band to lead a chant of “Free Palestine” and encourage festival-goers to leave.\nThe incident was documented in a video posted on the Mary Wallopers’ Instagram.\n“We are uploading this video so everybody can see @victoriousfestival cut our gig short for having a Palestinian flag on stage,” the Irish band captioned the post. “The festival have released a misleading statement to the press claiming they cut our sound because of a discriminatory chant and not the band’s call to Free Palestine. Our video clearly shows a Victorious crew member coming on stage, interfering with our show, removing the flag from the stage and then the sound being cut following a chant of ‘Free Palestine.’ The same crew member is later heard in the video saying ‘you aren’t playing until the flag is removed.'”\nOn Saturday, Victorious Festival organizers addressed the incident in a statement on their Facebook page.\n“We are in the business of putting on great shows, not cutting them off and this is the last thing we wanted, for the band, their fans and ourselves,” the statement read. “We didn’t handle the explanation of our policy sensitively or far enough in advance to allow a sensible conclusion to be reached. This put the band and our own team in a difficult situation which never should have arisen. We would like to sincerely apologise to all concerned.”\nThe organizers added, “We absolutely support the right of artists to freely express their views from the stage, within the law and the inclusive nature of the event. Our policy of not allowing flags of any kind, which has been in place for many years for wider event management and safety reasons, is not meant to compromise that right.”\nThe statement concluded, “We accept that, although mics remained live for longer, sound for The Mary Wallopwers’ audience was cut as described in the band’s video and that comments after that were not audible to the public. We are sorry that this situation has come about and will be making a substantial donation to humanitarian relief efforts for the Palestinian people.”\nSeveral other acts, including The Academic and Cliffords, have also announced they will be boycotting this year’s Victorious Festival.\nThe 2025 edition of Victorious launched on Friday and runs through Sunday (Aug. 24), with headliners including Queens of the Stone Age, Vampire Weekend and Kings of Leon."
    },
    {
      "news_title": "Festival that cut off The Mary Wallopers to make 'substantial' donation to Palestine relief",
      "news_link": "https://www.thejournal.ie/the-mary-wallopers-festival-cut-off-palestine-6797636-Aug2025/",
      "bias": "Lean Left",
      "text": "Support from readers like you keeps The Journal open.\nYou are visiting us because we have something you value. Independent, unbiased news that tells the truth. Advertising revenue goes some way to support our mission, but this year it has not been enough.\nIf you've seen value in our reporting, please contribute what you can, so we can continue to produce accurate and meaningful journalism. For everyone who needs it.\nhave your say"
    },
    {
      "news_title": "Islanders gutted as artists boycott Victorious after pro-Palestine band silenced",
      "news_link": "https://www.countypress.co.uk/news/25412990.victorious-festival-artists-boycott-pro-palestine-band-silenced/",
      "bias": "Center",
      "text": "Isle of Wight residents at this weekend’s Victorious Festival are disappointed to learn some acts have dropped out of the lineup after a pro-Palestine band had their performance cut short.\nThe Last Dinner Party, who were scheduled to take to the stage this evening, have cancelled their appearance, stating they will be boycotting the event because they are ‘outraged’ following a band’s set being halted the day before.\nThe Last Dinner Party, who performed at the Isle of Wight Festival in 2023, were supposed to perform ahead of American rock-pop group Vampire Weekend.\nAlongside the Mercury Prize nominees, the bands Cliffords and The Academic have also cancelled their concert at the Southsea event.\nThe cancellations come after Irish folk group The Mary Wallopers had their performance cut short only seconds into their first song.\nThe band said they were ‘cut off’ for having a Palestinian flag on stage.\nVictorious Festival organisers have since apologised and vowed to make a “substantial donation to humanitarian relief efforts for the Palestinian people”.\nIn a statement issued yesterday, Victorious Festival organisers told the County Press “it was the artist’s decision to stop the song” and “the decision by the event management to cut the sound and end the performance was only taken after the band used a chant widely understood to have a discriminatory context”.\nIn a fresh statement issued today, they said: “The Mary Wallopers are a fantastic band, and we were very much looking forward to their performance on Friday.\n“We are in the business of putting on great shows, not cutting them off, and this is the last thing we wanted, for the band, their fans and ourselves.\n“We didn't handle the explanation of our policies sensitively or far enough in advance to allow a sensible conclusion to be reached.\n“This put the band and our own team in a difficult situation which never should have arisen.\n“We would like to sincerely apologise to all concerned.\n“We absolutely support the right of artists to freely express their views from the stage, within the law and the inclusive nature of the event.\n“Our policy of not allowing flags of any kind, which has been in place for many years for wider event management and safety reasons, is not meant to compromise that right.\n“We accept that, although mics remained live for longer, sound for The Mary Wallopers' audience was cut as described in the band's video, and that comments after that were not audible to the public.\n“We are sorry that this situation has come about and will be making a substantial donation to humanitarian relief efforts for the Palestinian people.”"
    },
    {
      "news_title": "Last Dinner Party Boycott Victorious After Fest Cuts Mary Wallopers Set Following ‘Free Palestine’ Support",
      "news_link": "https://www.rollingstone.com/music/music-news/last-dinner-party-boycott-victorious-fest-free-palestine-1235414414/",
      "bias": "Left",
      "text": "Last Dinner Party Boycott Victorious After Fest Cuts Mary Wallopers Set Following ‘Free Palestine’ Support\nThe Last Dinner Party have pulled out of their set at Victorious Festival in Portsmouth, England today (Aug. 23), in solidarity with the Mary Wallopers, whose set was cut short on Friday after the Irish band showed their support for Palestine.\n“We are outraged by the decision made to silence the Mary Wallopers yesterday at Victorious,” The Last Dinner Party posted in a statement on Instagram. “As a band we cannot cosign political censorship and will therefore be boycotting the festival today.”\nOn Friday, the Mary Wallopers were performing onstage and after they unfurled a Palestinian flag and called for a “Free Palestine,” their show was cut short. The band posted video from the incident on Instagram, where they appeared to enter the stage with a Palestinian flag and opened with a remark to “Free Palestine.” After they began performing, a Victorious crew member looked to confront the band about the flag, which was draped onstage, and then the crew member removed it.\n“Free, free Palestine,” the band said from the stage, many in the audience could be heard joining in per the video. Immediately afterward, the band’s sound was cut and the crowd responded with boos. The band then brought the flag back out which elicited cheers, and more chants from the audience and band to “free Palestine.”\nA rep for Victorious Festival did not immediately return Rolling Stone’s request for comment. A festival spokesperson told the BBC the show was ended after the band used “a chant which is widely understood to have a discriminatory context,” but did not provide specifics. In the Mary Wallopers’ video post, they rejected the festival’s claim and asked that the fest “retract their statement immediately.”\n“The festival have released a misleading statement to the press claiming they cut our sound because of a discriminatory chant and not the band’s call to Free Palestine,” the band wrote. “Our video clearly shows a Victorious crew member coming on stage, interfering with our show, removing the flag from the stage and then the sound being cut following a chant of ‘Free Palestine.’ The same crew member is later heard in the video saying, ‘you aren’t playing until the flag is removed.'”\nIn the Last Dinner Party’s post on Saturday, they wrote, “As Gazans are deliberately plunged into catastrophic famine after two years of escalating violence it is urgent and obvious that artists use their platform to draw attention to the cause. To see an attempt to direct attention away from the genocide in order to maintain an apolitical image is immensely disappointing.” They also encouraged their fans to donate to medical aid for Palestinians, and signed the post with “Free Palestine.”\nThroughout this year’s festival season, artists have been showing their support for Palestinians onstage. At Newport Folk Festival, the Resistance Revival Chorus sang a prayer for Gaza and actor-comedian John C. Reilly waved a Palestinian flag from the main stage. At Coachella earlier this year, Kneecap’s pro-Palestine messaging was cut from the festival’s livestream on the first weekend and sparked controversy on the second weekend. Kneecap member Mo Chara faces terror charges in the U.K. over a claim he allegedly displayed a Hezbollah flag onstage during a London concert in November 2024. Mo Chara and the band have repeatedly denied the allegations, stating previously that they “do not, and have never, supported Hamas or Hezbollah.”"
    },
    {
      "news_title": "Queens Of The Stone Age headline festival rocked by controversy",
      "news_link": "https://www.perspectivemedia.com/queens-of-the-stone-age-headline-festival-rocked-by-controversy",
      "bias": "Lean Left",
      "text": "Irish band The Mary Wallopers had their sound cut over an onstage pro-Palestinian protest.\nUS rockers Queens Of The Stone Age have got the crowd rocking as the first headliners of a seaside festival which has been hit by controversy over an onstage pro-Palestinian protest.\nThousands of music lovers have descended on Southsea Common in Portsmouth, Hampshire, for the three-day Victorious Festival.\nRuby singers Kaiser Chiefs stepped in to perform on the Common Stage on Friday after singer-songwriter Michael Kiwanuka cancelled his festival appearances last month because of an “ongoing illness”.\nA large crowd gathered in the sunshine for the Leeds-based indie band with a mosh pit forming at the centre for the hit song I Predict A Riot.\nEarlier in the afternoon, Irish band The Mary Wallopers had their set cut short after they put up a Palestinian flag.\nThe festival organisers say the sound was turned off because the band used a “discriminatory” chant during their set which the group deny.\nThey said in a statement: “The festival have released a misleading statement to the press claiming they cut our sound because of a discriminatory chant, and not the band’s call to Free Palestine.”\nThey added: “Yesterday, a famine was declared in Gaza, where at least 65 people were killed by Israeli attacks, all the while Israel pushed ahead with plans to split the West Bank in two. These are the important facts about yesterday.”\nHeadliners Queens Of The Stone Age launched straight into their hit songs after taking to the stage including No One Knows.\nHalf-way through the set, frontman Josh Homme stopped to take a song request from the audience before launching into Little Sister.\nThe festival also announced that comedian Chris McCausland had been forced to pull out because of illness with indie band Crystal Tides stepping in to take his slot on the Common Stage.\nOn the Castle Stage, next to Henry VIII’s Southsea Castle, Madness had the crowds singing and dancing along to their greatest hits including House Of Fun, Baggy Trousers and It Must Be Love.\nOther headliners during the weekend include Vampire Weekend and Kings Of Leon who had to cancel their other UK shows earlier in the summer after frontman Caleb Followill suffered a “freak accident”.\nAccording to a statement from the band, he had a “serious” shattered heel injury and needed “a significant emergency surgery that will prevent him from travelling and performing”.\nVictorious Festival was started in 2012 when it was a modestly-sized event held at the Hampshire city’s historic dockyard.\nThe event moved to Southsea Common two years later, where it has expanded in size and ambition, with headline acts including Sam Fender, Mumford And Sons and Jamiroquai.\nLast year’s top acts, Biffy Clyro, Snow Patrol, Jamie T and Fatboy Slim helped the event win the major festival of the year category at the Live Awards 2024.\nFounder James Ralls has said that the success of regional festivals such as Victorious has shown a changing dynamic with fewer people regularly going to nightclubs and people of all ages seeking alternatives to the often sold-out major events such as Glastonbury and Reading and Leeds.\nVictorious has grown from about 40,000 people attending in 2013 to around 170,000 last year.\nHe said: “The scene has definitely changed, I think some of the big players are still big but the independent festival sector has grown massively.\n“The metropolitan festivals like us have taken off.”\nVictorious Festival runs until Sunday, August 24."
    },
    {
      "news_title": "Irish band say festival set cut short over Palestinian flag",
      "news_link": "https://www.the-independent.com/bulletin/culture/mary-wallopers-palestine-victorious-festival-b2813026.html",
      "bias": "Lean Left",
      "text": "Irish band say festival set cut short over Palestinian flag\nIrish band The Mary Wallopers claim their performance at Victorious Festival in Portsmouth was cut short on Friday for displaying a Palestinian flag on stage.\nFootage showed the folk group with the flag and beginning their set by chanting \"Free Palestine and f*** Israel.\"\nA spokesperson for Victorious Festival stated the band's set was ended due to a \"discriminatory\" chant, not the flag.\nThe festival clarified its policy prohibits flags of any kind, but respects artists' right to express views. “Although a flag was displayed on stage contrary to our policy, and this was raised with the artist’s crew, the show was not ended at this point, and it was the artist’s decision to stop the song,” they said.\nWatch the video in full above.\nThank you for registering\nPlease refresh the page or navigate to another page on the site to be automatically logged inPlease refresh your browser to be logged in"
    },
    {
      "news_title": "Mary Wallopers claim they were ‘cut off’ at UK festival for displaying Palestinian flag",
      "news_link": "https://www.irishtimes.com/world/uk/2025/08/23/mary-wallopers-claim-they-were-cut-off-at-uk-festival-for-displaying-palestinian-flag/",
      "bias": "Lean Left",
      "text": "A string of bands have pulled out of a UK music festival hours before they were due to perform after Irish band The Mary Wallopers said they were “cut off” for displaying a Palestinian flag.\nThe Last Dinner Party, Cliffords and The Academic announced on Saturday that they would no longer be performing at the Victorious festival in Portsmouth following Friday’s incident.\nThe Mary Wallopers shared a video on Instagram on Saturday of their performance, saying they rejected a “misleading” statement from the festival organisers and that a festival crew member had interfered with their show.\nOrganisers of the festival, who said The Mary Wallopers had their set cut short for using a “discriminatory” chant, have since issued an apology to the band and pledged to make “a substantial donation to humanitarian relief efforts for the Palestinian people”.\nREAD MORE\nRock band The Last Dinner Party said they would boycott the festival in a statement shared on their Instagram page: “We are outraged by the decision made to silence The Mary Wallopers yesterday at Victorious. As a band we cannot cosign political censorship and will therefore be boycotting the festival today.”\nFollowing The Mary Wallopers’ set, a spokesperson for Victorious said: “We spoke to the artist before the performance regarding the festival’s long-standing policy of not allowing flags of any kind at the event, but that we respect their right to express their views during the show.\n“Although a flag was displayed on stage contrary to our policy, and this was raised with the artist’s crew, the show was not ended at this point, and it was the artist’s decision to stop the song.”\nIn response, The Mary Wallopers claimed the festival had released a “misleading statement to the press claiming they cut our sound because of a discriminatory chant, and not the band’s call to Free Palestine.\n“Our video clearly shows a Victorious crew member coming on stage, interfering with our show, removing the flag from the stage and then the sound being cut following a chant of ‘Free Palestine,’” they said.\n“The same crew member is later heard in the video saying ‘you aren’t playing until the flag is removed’.”\nRock band The Academic have also pulled out of the festival, saying they could not “in good conscience” perform at “a festival that silences free speech”. Irish band Cliffords said they “refuse to play if we are to be censored for showing our support to the people of Palestine”.\nAs the bands announced they would no longer perform at the festival, the organisers issued another statement on Instagram, which read: “The Mary Wallopers are a fantastic band and we were very much looking forward to their performance at Victorious on Friday.\n“We didn’t handle the explanation of our policies sensitively or far enough in advance to allow a sensible conclusion to be reached.\n“This put the band and our own team in a difficult situation which never should have arisen. We would like to sincerely apologise to all concerned.”\nThe Mary Wallopers received support from Irish rap trio Kneecap, who wrote in a post on X: “Speak up against genocide in England and you’re treated like a criminal. Up the Mary Wallopers.”\nLast week, Kneecap’s Liam Óg Ó hAnnaidh, aka Mo Chara, appeared in a London court on a terror-related charge for allegedly displaying a flag of a proscribed organisation – Hizbullah, in this case ‐ at a gig they played in London in November 2024.\nAfter three hours of legal argument the judge adjourned the case until September 26th.\nÓ hAnnaidh’s first court appearance was in June, not long before Kneecap played Glastonbury. In response to the controversy, the BBC, which broadcast 90 hours of Glastonbury coverage, decided not to stream the gig live.\nThe BBC last month issued an apology for the divisive set by punk rap duo Bob Vylan at Glastonbury in June.\nBob Vylan performed on the West Holts Stage before Kneecap and led the crowd in chants of “Free, free Palestine” and “Death, death to the IDF”. – PA"
    },
    {
      "news_title": "Band ‘cut off’ at UK festival for ‘having a Palestinian flag’ on stage",
      "news_link": "https://www.independent.co.uk/tv/culture/mary-wallopers-victorious-palestine-video-b2813001.html",
      "bias": "Lean Left",
      "text": null
    },
    {
      "news_title": "Irish folk band The Mary Wallopers say they were muted at festival for showing Palestinian flag on stage",
      "news_link": "https://www.cnn.com/2025/08/23/uk/mary-wallopers-palestinian-flag-festival-latam-intl",
      "bias": "Lean Left",
      "text": "Organizers of a music festival in Portsmouth, England have apologized to Irish folk band The Mary Wallopers who claim they were muted during their set for displaying a Palestinian flag.\nA string of other performers pulled out of the Victorious music festival over the spat, accusing organizers of stifling free speech.\nAfter initially claiming that the band’s peformance was stopped over a “discriminatory” chant, the Victorious music festival issued a statement on Instagram saying sorry and pledging to donate to humanitarian efforts for Palestinians.\n“We didn’t handle the explanation of our policies sensitively or far enough in advance to allow a sensible conclusion to be reached,” the statement seen by British news agency PA Media said.\n“This put the band and our own team in a difficult situation which never should have arisen. We would like to sincerely apologise to all concerned.”\nThe statement continued, “We accept that, although mics remained live for longer, sound for The Mary Wallopers’ audience was cut as described in the band’s video and that comments after that were not audible to the public.”\nIn a post on Instagram, the band claimed that they were “cut off” at the festival, “for having a Palestinian flag on the stage,” and called Victorious’ initial explanation misleading.\nThe band’s statement continued, “We’ve been doing this for six years now and this has never happened before.”\nEdited video from the concert posted by the band on Instagram show that the Mary Wallopers’ banjo player Andrew Hendy began the set by saying “Free Palestine, and f**k Israel” before the group launched into one of their songs.\nTheir playing continues for about a minute further, according to the video, when a stagehand appears to come on stage and remove a Palestinian flag that the band had affixed to one of its speakers.\nAndrew Hendy tells the crowd that the band were instructed not to fly a Palestinian flag or they would be cut off, encouraging audience members to leave the festival grounds. The banjo player began chanting “Free Palestine” before his mic was cut.\nLater, video from another angle shows the band’s guitarist Charles Hendy asking a person offscreen whether the band will be allowed to continue playing. The response is muffled, but the person appears to reply that the Palestinian flag needs to be removed.\n“We’re not playing,” Charles Hendy responds.\n“Fine,” the person offscreen says.\nAs the band waved to the crowd and left the stage, audience members began chanting “Free Palestine” and “Let them play!”\n“People were upset and angry,” said Emma Gaynor, an audience member who attended the concert with her partner. “I didn’t hear anything discriminatory, it all happened very quickly.”\nJess Huxham, another attendee, said that other bands who played the festival that day had also said “Free Palestine” during their sets.\n“From all I heard,” Huxham said in an email. “[The Mary Wallopers] did say ‘Free Palestine,’ which other bands on the main stage had said before their set.”\nThe incident comes amid fierce controversy around pro-Palestinian activism and free speech in the UK, with musicians often at the forefront.\nAfter rap duo Bob Vylan chanted “Death to the IDF” at their Glastonbury Festival set in June, police in the UK launched a criminal investigation. Even the United States government weighed in, revoking the band members’ visas ahead of their US tour."
    },
    {
      "news_title": "Festival pulls plug on pro-Palestine band during set",
      "news_link": "https://www.telegraph.co.uk/news/2025/08/23/festival-pulls-plug-on-pro-palestine-band-during-set/",
      "bias": "Lean Right",
      "text": "Artists are boycotting a British music festival after it cut a band’s performance short for leading chants of “free Palestine”.\nThe Mary Wallopers, an Irish folk group who also unfurled a Palestinian flag on stage, had their microphones cut off shortly after beginning their set at Victorious Festival in Portsmouth on Friday.\nThe decision has provoked a backlash, with a number of scheduled acts announcing that they would no longer perform at the event.\nThe Last Dinner Party, a Brit Award-winning group, condemned the festival for “political censorship”, writing on Instagram: “We are outraged by the decision made to silence The Mary Wallopers yesterday at Victorious. As a band we cannot cosign political censorship, and will therefore be boycotting the festival today.\n“As Gazans are deliberately plunged into catastrophic famine after two years of escalating violence, it is urgent and obvious that artists use their platform to draw attention to the cause. To see an attempt to direct attention away from the genocide in order to maintain an apolitical image is immensely disappointing.\n“Throughout this summer we have used our stages to encourage our audience to donate even a drink’s worth of money to Medical Aid for Palestinians, and today we urge you more than ever to do the same.\n“We are so deeply sorry to our fans who were looking forward to seeing us today, and we are devastated to be put in this position that upsets both us and you.”"
    },
    {
      "news_title": "Mary Wallopers 'cut off' at gig over Palestinian flag",
      "news_link": "https://www.rte.ie/entertainment/2025/0823/1529796-mary-wallopers-cut-off-at-gig-over-palestinian-flag/",
      "bias": "Center",
      "text": "The Mary Wallopers have said they were \"cut off\" from performing at a British music festival for \"having a Palestinian flag on the stage\".\nThe Dundalk band were performing at Victorious Festival in Portsmouth on Friday, an event which is set to feature Vampire Weekend, The Kaiser Chiefs and Kings of Leon over the weekend.\nIn a post on Instagram following their set, the band said: \"Just got cut off at Victorious Festival for having a Palestinian flag on the stage.\n\"We've been doing this for 6 years now and this has never happened before. Free Palestine all day every day.\"\nHowever, a spokesperson for the festival said the band had their set cut short for using a \"discriminatory\" chant.\nA statement carried by the Daily Mail said: \"We spoke to the artist before the performance regarding the festival’s long-standing policy of not allowing flags of any kind at the event, but that we respect their right to express their views during the show.\n\"Although a flag was displayed on stage contrary to our policy, and this was raised with the artist’s crew, the show was not ended at this point, and it was the artist’s decision to stop the song.\n\"The decision by the event management to cut the sound and end the performance was only taken after the band used a chant which is widely understood to have a discriminatory context.\n\"To be clear, we respect the right of artists to use their platform to express their views within the inclusive nature of the event and it was not the band’s call to 'Free Palestine’ which resulted in this outcome.\"\nThe Mary Wallopers received support from Irish rap trio Kneecap, who wrote in a post on X: \"Our good pals The Mary Wallopers have just been pulled off stage and the PA shut down at @VictoriousFest in Portsmouth for taking out a Palestinian flag and saying Free Palestine.\n\"Speak up against genocide in England and you’re treated like a criminal. Up the Mary Wallopers.\n\"Free Palestine! Free the 6 counties!\"\nSource: Press Association"
    },
    {
      "news_title": "Irish folk band 'cut off' during festival for displaying Palestine flag",
      "news_link": "https://www.thenational.scot/news/25412526.irish-folk-band-cut-off-festival-displaying-palestine-flag/",
      "bias": "Lean Left",
      "text": "IRISH folk band The Mary Wallopers have said they were “cut off” during a performance at a UK music festival for displaying a Palestine flag on stage.\nThe band were performing at Victorious Festival in Portsmouth on Friday, an event which is set to feature Vampire Weekend, The Kaiser Chiefs and Kings of Leon over the weekend.\nIn an Instagram story following their set, the band said: “Just got cut off at Victorious Festival for having a Palestinian flag on the stage.\nREAD MORE: The University of Edinburgh has apologised over its past – but what about Gaza?\n“We’ve been doing this for six years now and this has never happened before. Free Palestine all day every day.”\nThe band followed up with a later post, sharing a screenshot of an article from Far Out magazine captioned: “So the spin begins folks. As expected.”\nKneecap, who wrote in a post on Twitter/X: “Our good pals The Mary Wallopers have just been pulled off stage and the PA shut down at @VictoriousFest in Portsmouth for taking out a Palestinian flag and saying Free Palestine.\nThe Mary Wallopers received support from Irish rap trio“Speak up against genocide in England and you’re treated like a criminal. Up the Mary Wallopers.\n“Free Palestine! Free the six counties!”\nOur good pals The Mary Wallopers have just been pulled off stage and the PA shut down at @VictoriousFest in Portsmouth for taking out a 🇵🇸 flag and saying Free Palestine.\n— KNEECAP (@KNEECAPCEOL) August 22, 2025\nSpeak up against genocide in England and you're treated like a criminal.\nUp the Mary Wallopers 💚🤍🧡… pic.twitter.com/l9XdBL1jcm\nKneecap's Liam Óg Ó hAnnaidh, known by stage name Mo Chara, is currently facing terror charges after allegedly displaying a Hezbollah flag at a show in 2024. Judgement has been reserved on the issue until September 26.\nA Victorious Festival spokesperson told the Daily Mail: “We spoke to the artist before the performance regarding the festival's long-standing policy of not allowing flags of any kind at the event, but that we respect their right to express their views during the show.\nREAD MORE: 'I was a Unionist and active Scottish Tory. Now I campaign for Irish unity'\n“Although a flag was displayed on stage contrary to our policy, and this was raised with the artist's crew, the show was not ended at this point, and it was the artist's decision to stop the song.\n“The decision by the event management to cut the sound and end the performance was only taken after the band used a chant which is widely understood to have a discriminatory context.\n“To be clear, we respect the right of artists to use their platform to express their views within the inclusive nature of the event and it was not the band's call to ‘Free Palestine’ which resulted in this outcome.”"
    },
    {
      "news_title": "The Mary Walloppers: Irish band ‘cut off’ from festival performance for ‘having a Palestinian flag’",
      "news_link": "https://www.nationalworld.com/news/the-mary-walloppers-irish-band-cut-off-from-festival-performance-for-having-a-palestinian-flag-5285867",
      "bias": "Lean Left",
      "text": null
    },
    {
      "news_title": "Irish band cut off at UK festival 'for having Palestinian flag on stage'",
      "news_link": "https://metro.co.uk/2025/08/22/irish-band-cut-off-uk-festival-for-palestinian-flag-stage-23979073/",
      "bias": "Lean Left",
      "text": "Several bands pulled out of a UK music festival this weekend after one Irish folk group was removed mid-set for unfurling a Palestinian flag and leading a pro-Palestine chant.\nThe Mary Wallopers were just 20 minutes into their Friday performance at Victorious Festival in Portsmouth when microphones were cut and the band was ushered off stage.\nThe incident came immediately after the group held up a Palestinian flag and began chants of ‘Free Palestine.’\nFootage shared online shows crowds booing as the stage fell silent.\nThe band later confirmed the disruption on Instagram, writing: ‘Just got cut off at Victorious Festival for having a Palestinian flag on the stage. We’ve been doing this for 6 years now and this has never happened before. Free Palestine all day every day.’\nFans quickly voiced anger on social media. One audience member posted: ‘They pulled the plug on the Mary Wallopers because they had a Palestine flag on stage. Organisers are serious cowards.’\nNorthern Irish rap trio Kneecap publicly backed the group, writing on X: ‘Speak up against genocide in England and you’re treated like a criminal. Up the Mary Wallopers. Free Palestine.’\nThe Mary Wallopers, known for their politically outspoken performances, have consistently voiced support for Palestine. Last year, they headlined the Gig for Gaza fundraising concert.\nFestival organisers, however, disputed the band’s account of events. In a statement to Metro, Victorious Festival said they had reminded the group of its ‘long-standing policy of not allowing flags of any kind at the event’ but emphasised that the show was not stopped at that point.\nThe spokesperson continued: ‘The decision by the event management to cut the sound and end the performance was only taken after the band used a chant which is widely understood to have a discriminatory context.\n‘To be clear, we respect the right of artists to use their platform to express their views within the inclusive nature of the event, and it was not the band’s call to ‘Free Palestine’ which resulted in this outcome.’\nHitting back, The Mary Wallopers claimed the festival had released a ‘misleading statement to the press claiming they cut our sound because of a discriminatory chant’ and not the band’s call to Free Palestine.\nIn contrast later on, a second message from the festival included an apology. Organisers have pledged to make ‘a substantial donation to humanitarian relief efforts for the Palestinian people’.\nThis was after The Last Dinner Party, Cliffords, and The Academic announced on Saturday that they would no longer be performing at the Portsmouth music festival following Friday’s incident.\nRock band The Last Dinner Party said they would boycott the festival in a statement shared on their Instagram page, expressing solidarity with The Mary Wallopers, writing: ‘We are outraged by the decision made to silence The Mary Wallopers yesterday at Victorious. As a band we cannot cosign political censorship and will therefore be boycotting the festival today.\n‘As Gazans are deliberately plunged into catastrophic famine after two years of escalating violence it is urgent and obvious that artists use their platform to draw attention to the cause. To see an attempt to direct attention away from the genocide in order to maintain an apolitical image is immensely disappointing.\n‘Throughout this summer we have used our stages to encourage our audiences to donate even a drink’s worth of money to Medical Aid for Palestinians, and today we urge you more than ever to do the same.\n‘We are so deeply sorry to our fans who were looking forward to seeing us today, and we are devastated to be put in this position that upsets both us and you. Free Palestine.’\nRock band The Academic also pulled out of the festival, saying they could not ‘in good conscience’ perform at ‘a festival that silences free speech’, while Irish band Cliffords said they ‘refuse to play if we are to be censored for showing our support to the people of Palestine’.\nAs the bands announced they would no longer perform, the organisers issued another statement, reading: ‘The Mary Wallopers are a fantastic band and we were very much looking forward to their performance at Victorious on Friday.\n‘We didn’t handle the explanation of our policies sensitively or far enough in advance to allow a sensible conclusion to be reached.\n‘This put the band and our own team in a difficult situation which never should have arisen. We would like to sincerely apologise to all concerned.\n‘We absolutely support the right of artists to freely express their views from the stage, within the law and the inclusive nature of the event. Our policy of not allowing flags of any kind, which has been in place for many years for wider event management and safety reasons, is not meant to compromise that right.\n‘We accept that, although mics remained live for longer, sound for The Mary Wallopers’ audience was cut as described in the band’s video and that comments after that were not audible to the public.\n‘We are sorry that this situation has come about and will be making a substantial donation to humanitarian relief efforts for the Palestinian people.’\nAs for other acts on the bill, it is set to feature Vampire Weekend, The Kaiser Chiefs, and Kings Of Leon over the weekend.\nStarting Vampire Weekend’s headline set on the Common Stage, lead singer Ezra Koenig said: ‘If someone was censored for flying a flag, then that’s wrong, and they deserve an apology.’\nHe added that the people of Palestine ‘deserve our sympathies’.\nWhat's going on in Palestine?\nSince Israel began its military campaign in Gaza after the Hamas-led attack on 7 October 2023, nearly 60,000 people have been killed – the vast majority civilians, including women, children, and infants, according to health authorities in Gaza.\nNewly released images reveal the extent of the devastation, with entire neighborhoods reduced to rubble, the landscape blanketed in dust and ash.\nOn 25 July, a United Nations official warned that Palestinians in Gaza are starting to resemble ‘walking corpses,’ as Israel continues to impose severe limits on food and humanitarian aid, following an 11-week total blockade earlier this year.\nThe situation in Gaza is worsening by the hour, prompting more than 100 international aid organisations to warn of targeted ‘mass starvation’.\nPhotos of starving Palestinians, some of them babies, have emerged from Gaza in the past weeks, sparking public outcry for intervention in the conflict, which is about to enter its third year.\nIsrael has denied any responsibility for what experts have deemed a famine, despite controlling the flow of all aid into the enclave.\nThis controversy comes after Kneecap’s Liam Óg Ó hAnnaidh, known by his stage name Mo Chara, was charged with an alleged terror offence in relation to the group’s pro-Palestine statements.\nThe rapper, 27, is one of the founding members of the West Belfast hip hop group, which has found itself in the spotlight in recent months.\nMore Trending\nIn May, O’ hAnnaidh was charged over an incident at a gig in the O2, where he’s been accused of displaying a flag in support of the Lebanese Shia Islamist political party, Hezbollah, a proscribed organisation in the UK.\nThe next month, he appeared in the Westminster Magistrate’s Court for the first time, only speaking briefly to confirm his name before being released on bail.\nAfter several hours in court on August 20, it was announced that the judge would not be announcing his judgment, despite saying he was ‘conscious and anxious’ that a ‘speedy resolution’ was wanted.\n‘I will reserve my judgment for a couple of weeks,’ he told the court.\nGot a story?\nIf you’ve got a celebrity story, video or pictures get in touch with the Metro.co.uk entertainment team by emailing us celebtips@metro.co.uk, calling 020 3615 2145 or by visiting our Submit Stuff page – we’d love to hear from you.\nMORE: Palestinians searching for food killed by Israeli strikes after famine in Gaza declared\nMORE: I love Glastonbury – but going to Reading Festival was so much better\nMORE: 9 essentials every first timer needs for Notting Hill Carnival 2025"
    },
    {
      "news_title": "The Mary Wallopers set cut short at Victorious Festival after calling for \"free Palestine\"",
      "news_link": "https://www.nme.com/news/music/the-mary-wallopers-set-cut-short-at-victorious-festival-after-calling-for-free-palestine-3886572",
      "bias": "Center",
      "text": "The Mary Wallopers have had their set cut short at Victorious Festival after calling for a ‘Free Palestine’ and displaying the country’s flag.\nThe Irish band had barely started their show at the Portsmouth festival on Friday (August 22) when their microphones were cut off. In videos shared online by those in attendance, the crowd can be heard booing the decision and leading chants of “let them play” and “free, free Palestine”.\nWriting on their Instagram Stories, the band said: “Just got cut off at Victorious Festival for having a Palestinian flag on the stage. We’ve been doing this for 6 years now and this has never happened before. Free Palestine all day every day.”\nVictorious Festival has just cut off The Mary Wallopers for showing support to Palestine. So grim. pic.twitter.com/nV2010AcUY\n— Leigh Kimmins McManus (@LeighMcManus1) August 22, 2025\nA Victorious Festival spokesperson told NME: “We spoke to the artist before the performance regarding the festival’s long-standing policy of not allowing flags of any kind at the event, but that we respect their right to express their views during the show.”\n“Although a flag was displayed on stage contrary to our policy, and this was raised with the artist’s crew, the show was not ended at this point, and it was the artist’s decision to stop the song. The decision by the event management to cut the sound and end the performance was only taken after the band used a chant which is widely understood to have a discriminatory context.”\n“To be clear, we respect the right of artists to use their platform to express their views within the inclusive nature of the event and it was not the band’s call to ‘Free Palestine’ which resulted in this outcome.”\nRecommended\nVictorious is one of many festivals to be operated by Superstruct Entertainment, which is owned by the controversial global investment firm KKR, which has been criticised by many artists for its alleged stakes in weapons manufacturing companies and Israel corporations operating in the occupied Palestinian territories.\nKneecap wrote on X: “Our good pals The Mary Wallopers have just been pulled off stage and the PA shut down at @VictoriousFest in Portsmouth for taking out a Palestine flag and saying Free Palestine.”\n“Speak up against genocide in England and you’re treated like a criminal. Up the Mary Wallopers. Free Palestine! Free the 6 counties!”\nOur good pals The Mary Wallopers have just been pulled off stage and the PA shut down at @VictoriousFest in Portsmouth for taking out a 🇵🇸 flag and saying Free Palestine.\nSpeak up against genocide in England and you're treated like a criminal.\nUp the Mary Wallopers 💚🤍🧡… pic.twitter.com/l9XdBL1jcm\n— KNEECAP (@KNEECAPCEOL) August 22, 2025\nSee footage from the crowd showing the band being cut off here, along with reactions from those in attendance:\nCutting Mary Wallopers for wrongthink is pathetic @VictoriousFest. Absolutely shambolic. pic.twitter.com/eZ3fu8kvdf\n— Deej (@WrongWingDeej) August 22, 2025\nShame on the victorious festival for kicking of the Mary wallopers off stage for saying free Palestine 🇵🇸 pic.twitter.com/cyQ6uwJmt2\n— ks 🙏🏽❤️ (@kristia43208575) August 22, 2025\nAbsolutely cowardly decision to cut off the The Mary Wallopers from @VictoriousFest for having a Palestine flag 🇵🇸\nAs the bands next up on the bill, I hope @wunderhorse @KaiserChiefs and @qotsa all take a stand – they can’t censor everyone ✊ pic.twitter.com/psgKDwg6LS\n— Greg Newcombe (@gregnewcombe) August 22, 2025\nAt victorious festival and they’ve just pulled the Mary wallopers off stage cos the shouted ‘free Palestine’\nFuck victorious festival— Mike Duffy (@themightysteds) August 22, 2025\nAt Victorious Festival in Portsmouth. Irish band the Mary Wallopers booted off stage for flying a Palestine flag. Which is not illegal. Who took this decision to stop a band expressing legitimate views? Very worrying whatever view you have on the Middle East.\n— Mark English (@EULondonMark) August 22, 2025\nNME have contacted Victorious Festival’s representatives for comment.\nSeveral other festivals that are backed by KKR have addressed their concerns about the connection. Tramlines said they would “never send them a single Euro”, while Mighty Hoopla stated their “clear opposition to KKR’s unethical investments”.\nBoiler Room, which was also acquired by Superstruct, issued a statement in March stating that KKR “categorically don’t align with our values” while reiterating their allegiance to pro-Palestine organisations.\nSimilarly, Field Day said in May that they have “never compromised” on their “ambitions and values” and have been engaged in “a passionate discussion” with KKR. They said they recognised “the strength of the feeling of the artists involved and the fans who attend” and said it was “sorry” that some artists have pulled out.\nThey later clarified: “We are sorry we did not say earlier what we unequivocally say now: We are passionately opposed to KKR’s unethical investments in Israel. We cannot control who owns our parent company but we promise to make our – and your – voices, and the ethical values we regard as non-negotiable, heard and understood at all levels.”\nOne group of 50 artists, which included Massive Attack and Brian Eno, signed an open letter urging Field Day to distance itself from KKR in May, while another 11 artists announced that they were boycotting the festival in solidarity with Palestine.\nVictorious Festival is running on the Southsea seafront this weekend, with Kings Of Leon, Queens Of The Stone Age and Vampire Weekend topping the bill."
    },
    {
      "news_title": "Bands boycott festival after group 'cut off after displaying Palestinian flag'",
      "news_link": "https://news.stv.tv/entertainment/bands-boycott-victorious-festival-after-the-mary-wallopers-cut-off-after-displaying-palestinian-flag",
      "bias": "unknown",
      "text": "A string of bands pulled out of the Victorious music festival hours before they were due to perform after Irish folk music band The Mary Wallopers claimed they were “cut off” for displaying a Palestinian flag.\nThe Last Dinner Party, Cliffords and The Academic announced on Saturday that they would no longer be performing at the Portsmouth music festival following Friday’s incident.\nThe organisers, who claimed the band had their set cut short for using a “discriminatory” chant, have since issued an apology to the band and pledged to make “a substantial donation to humanitarian relief efforts for the Palestinian people”.\nRock band The Last Dinner Party said they would boycott the festival in a statement shared on their Instagram page.\nThe statement said: “We are outraged by the decision made to silence The Mary Wallopers yesterday at Victorious. As a band we cannot cosign political censorship and will therefore be boycotting the festival today.\n“As Gazans are deliberately plunged into catastrophic famine after two years of escalating violence it is urgent and obvious that artists use their platform to draw attention to the cause. To see an attempt to direct attention away from the genocide in order to maintain an apolitical image is immensely disappointing.\n“Throughout this summer we have used our stages to encourage our audiences to donate even a drink’s worth of money to Medical Aid for Palestinians, and today we urge you more than ever to do the same.\n“We are so deeply sorry to our fans who were looking forward to seeing us today, and we are devastated to be put in this position that upsets both us and you. Free Palestine.”\nFollowing The Mary Wallopers’ set, a spokesperson for Victorious said: “We spoke to the artist before the performance regarding the festival’s long-standing policy of not allowing flags of any kind at the event, but that we respect their right to express their views during the show.\n“Although a flag was displayed on stage contrary to our policy, and this was raised with the artist’s crew, the show was not ended at this point, and it was the artist’s decision to stop the song.”\nIn response, The Mary Wallopers claimed the festival had released a “misleading statement to the press claiming they cut our sound because of a discriminatory chant, and not the band’s call to Free Palestine.\n“Our video clearly shows a Victorious crew member coming on stage, interfering with our show, removing the flag from the stage and then the sound being cut following a chant of ‘Free Palestine,’” they said.\n“The same crew member is later heard in the video saying ‘you aren’t playing until the flag is removed’.”\nRock band The Academic have also pulled out of the festival, saying they could not “in good conscience” perform at “a festival that silences free speech”, while Irish band Cliffords said they “refuse to play if we are to be censored for showing our support to the people of Palestine”.\nAs the bands announced they would no longer perform at the festival, the organisers issued another statement on Instagram which read: “The Mary Wallopers are a fantastic band and we were very much looking forward to their performance at Victorious on Friday.\n“We didn’t handle the explanation of our policies sensitively or far enough in advance to allow a sensible conclusion to be reached.\n“This put the band and our own team in a difficult situation which never should have arisen. We would like to sincerely apologise to all concerned.\n“We absolutely support the right of artists to freely express their views from the stage, within the law and the inclusive nature of the event. Our policy of not allowing flags of any kind, which has been in place for many years for wider event management and safety reasons, is not meant to compromise that right.\n“We accept that, although mics remained live for longer, sound for The Mary Wallopers’ audience was cut as described in the band’s video and that comments after that were not audible to the public.\n“We are sorry that this situation has come about and will be making a substantial donation to humanitarian relief efforts for the Palestinian people.”\nThe festival is set to feature Vampire Weekend, The Kaiser Chiefs and Kings Of Leon over the weekend.\nStarting Vampire Weekend’s headline set on the Common Stage, lead singer Ezra Koenig said: “If someone was censored for flying a flag then that’s wrong and they deserve an apology.”\nHe added that the people of Palestine “deserve our sympathies”.\nFollow STV News on WhatsApp\nScan the QR code on your mobile device for all the latest news from around the country"
    },
    {
      "news_title": "Bands Pull Out from Music Festival in UK after The Mary Wallopers Set 'Cut Off' over Palestine Flag",
      "news_link": "https://see.news/bands-pull-out-from-music-festival-in-uk-after-the-mary-wallopers-set-cut-off-over-palestine-flag",
      "bias": "unknown",
      "text": "Several bands boycotted and pulled out from the Victorious music festival in Portsmouth, UK over the weekend, in some cases just hours before their scheduled performances.\nThey were standing in solidarity with the Irish folk band The Mary Wallopers, who had their set cut short on Friday for displaying a Palestinian flag.\nThe Mary Wallopers made it halfway through their opening song when the sound was cut by the festival organisers.\nThe Palestinian flag on stage with them was taken away, despite the crowd standing by the band and leading chants of “Free, free Palestine”.\nA festival spokesperson said: \"We spoke to the artist before the performance regarding the festival's long-standing policy of not allowing flags of any kind at the event, but that we respect their right to express their views during the show. Although a flag was displayed on stage contrary to our policy, and this was raised with the artist's crew, the show was not ended at this point, and it was the artist's decision to stop the song.\"\nIt turns out that this statement was misleading.\nThe Mary Wallopers updated fans on Saturday with an Instagram post reading: “Yesterday, a famine was declared in Gaza, where at least 65 people were killed by Israeli attacks, all the while Israel pushed ahead with plans to split the West Bank in two. These are the important facts about yesterday.”\nThe band were referring to the Integrated Food Security Phase Classification (IPC), the world's leading authority on food crises, officially announcing last Friday that Gaza City is gripped by famine and that it is likely to spread across the territory without a ceasefire and an end to restrictions on humanitarian aid.\nThe band then addressed the festival’s statement: “The festival have released a misleading statement to the press claiming they cut our sound because of a discriminatory chant and not the band’s call to Free Palestine. Our video clearly shows a Victorious crew member coming on stage, interfering with our show, removing the flag from the stage and then the sound being cut following a chant of ‘Free Palestine’. The same crew member is later heard in the video saying, ‘you aren’t playing until the flag is removed’.”\nFollowing this incident, several artists announced they would not be playing their programmed sets at Victorious, including The Last Dinner Party, Cliffords, and The Academic.\n“We are outraged by the decision made to silence The Mary Wallopers yesterday at Victorious,” The Last Dinner Party wrote in a statement. “As a band we cannot cosign political censorship and will therefore be boycotting the festival today.”\nThey continued: “As Gazans are deliberately plunged into catastrophic famine after two years of escalating violence, it is urgent and obvious that artists use their platform to draw attention to the cause. To see an attempt to direct attention away from the genocide in order to maintain an apolitical image is immensely disappointing.”\n“Throughout this summer we have used our stages to encourage our audience to donate even a drink’s worth of money to Medical Aid for Palestinians, and today we urge you more than ever to do the same,” they added. “We are so deeply sorry to our fans who were looking forward to seeing us today, and we are devastated to be put in this position that upsets both us and you.”\nThe Academic said they “can’t in good conscience stand up and play at a festival that silences free speech and the right to express your views”, while Cliffords said: “We refuse to play if we are to be censored for showing our support to the people of Palestine”.\nFaced with the boycott, the festival posted a second statement saying that they “didn’t handle the explanation of our policies sensitively or far enough in advance to allow a sensible conclusion to be reached.”\nThey added: “We would like to sincerely apologise to all concerned. We absolutely support the right of artists to freely express their views from the stage, within the law and the inclusive nature of the event. Our policy of not allowing flags of any kind, which has been in place for many years for wider event management and safety reasons, is not meant to compromise that right. We accept that, although mics remained live for longer, sound for The Mary Wallopers’ audience was cut as described in the band’s video and that comments after that were not audible to the public.”\nThe festival further apologised and pledged to make “a substantial donation to humanitarian relief efforts for the Palestinian people.”\nFor context, the Victorious festival is operated by Superstruct Entertainment, which is owned by global investment firm KKR.\nEarlier this year, many artists like Massive Attack and Brian Eno spoke out against KKR in an open letter and urged Field Day festival to distance itself from the firm over its alleged stakes in weapons manufacturing companies and Israeli corporations operating in the occupied Palestinian territories.\n“KKR invests billions of pounds in companies which, for example, develop Israeli underground data centres, and advertise real estate on illegally occupied land in Israeli settlements in the West Bank,” stated the letter. “While we understand that this acquisition was not the choice of Field Day, it nonetheless means that the festival is now implicated in the crimes against humanity of apartheid and genocide.”\nElsewhere, Kneecap has routinely been at the centre of much debate over freedom of speech and how some festivals have failed to protect artists’ right to free expression.\nThe Irish rappers have frequently used their platform to speak out not against the Jewish people but against Israel's war in Gaza.\nRegardless, many politicians have tried to remove the band from festival line-ups this summer, with Hungary’s Prime Minister Viktor Orbán going so far as to ban the group from the country for three years.\nKneecap has consistently denied accusations of anti-Semitism, claiming that those attacking the band “weaponize” the false accusation to “distract, confuse, and provide cover for genocide.”"
    },
    {
      "news_title": "Vampire Weekend Call Out Victorious Festival Organizers After Mary Wallopers Set Cut Short – Mnnofa",
      "news_link": "https://www.mnnofa.com/music/vampire-weekend-call-out-victorious-festival-organizers-after-mary-wallopers-set-cut-short/",
      "bias": "unknown",
      "text": "On Friday, August 22, Irish folk band the Mary Wallopers had their set at Portsmouth, England’s Victorious Festival cut short after flying the Palestinian flag onstage and leading a chant of “free Palestine.” Several artists, including the Last Dinner Party, subsequently pulled out of their scheduled performances in protest, and now Vampire Weekend, who are among this year’s headliners, have called out the festival’s organizers.\nAs reported by Portsmouth News, Ezra Koenig addressed the crowd during Vampire Weekend’s set last night (Saturday, August 23). “If someone was punished for flying a flag, that is wrong and they deserve an apology,” Koenig said. “The terrible suffering of the Palestinian people deserves all of our sympathy.”\nWriting to NME, representatives for Victorious originally claimed to have cut off the Mary Wallopers’ sound because they “used a chant which is widely understood to have a discriminatory context.” The band then responded with their own statement alongside footage of the stage during their set: “The festival have released a misleading statement to the press claiming they cut our sound because of a discriminatory chant and not the band’s call to Free Palestine.”\nThe statement continues: “Our video clearly shows a Victorious crew member coming on stage, interfering with our show, removing the flag from the stage and then the sound being cut following a chant of “Free Palestine.” The same crew member is later heard in the video saying “you aren’t playing until the flag is removed.” Victorious Festival then released a second statement apologizing to the band. Read both in full below.\nIn June, British punk-rap duo Bob Vylan had their U.S. visas revoked after a controversial Glastonbury set where frontman Bobby Vylan led the crowd in a chant of “Death, death to the IDF.” Irish rap trio Kneecap, whose performance at Coachella 2025 featured pro-Palestine and anti-Israel messages, have since been removed from the lineup of Glasgow’s TRNSMT music festival, banned from Hungary, and had one of their members, Mo Chara, charged with a terror offense for allegedly displaying the Hezbollah flag during a 2024 concert. Both groups are currently being investigated by British police following their sets at Glastonbury this year.\nInstagram content\nThis content can also be viewed on the site it originates from."
    },
    {
      "news_title": "Bands boycott UK festival after Irish group ‘cut off’ for waving Palestinian flag",
      "news_link": "https://alethonews.com/2025/08/24/bands-boycott-uk-festival-after-irish-group-cut-off-for-waving-palestinian-flag/",
      "bias": "unknown",
      "text": "Bands boycott UK festival after Irish group ‘cut off’ for waving Palestinian flag\nPress TV – August 24, 2025\nSeveral bands have pulled out of a major UK music festival after an Irish folk band said organizers cut their set when they displayed a Palestinian flag and chanted “Free Palestine.”\nThe Mary Wallopers were performing at Victorious Festival in Portsmouth on Friday when organizers accused them of using a chant “widely understood to have a discriminatory context.”\nThe Mary Wallopers dismissed the allegation as “misleading,” saying, “Our video clearly shows a Victorious crew member coming on stage, interfering with our show, removing the flag from the stage and then the sound being cut following a chant of ‘Free Palestine’.”\nOrganizers first claimed the set was stopped over a chant, but later admitted the sound was cut after the flag was shown. They apologized “to all concerned” and pledged a “substantial donation” to humanitarian relief for Palestinians.\nIn protest, The Last Dinner Party, The Academic and Cliffords announced on Saturday that they would boycott the festival over censorship.\n“We are outraged by the decision to silence The Mary Wallopers,” The Last Dinner Party wrote on Instagram, calling it “political censorship.”\nThe Academic said they could not “in good conscience” perform at a festival that silences free speech, while Cliffords said they “refuse to play if we are to be censored for showing our support to the people of Palestine.”\nThe festival, which continues through Sunday with headliners including Kings of Leon, Bloc Party and Gabrielle, now faces growing backlash over silencing pro-Palestinian protest.\nNo comments yet.\nLeave a comment"
    },
    {
      "news_title": "The Murder Capital show support for The Mary Wallopers after Victorious festival controversy - Los Angeles Weekly Times",
      "news_link": "https://losangelesweeklytimes.com/the-murder-capital-show-support-for-the-mary-wallopers-after-victorious-festival-controversy/",
      "bias": "unknown",
      "text": "The Murder Capital expressed their support for The Mary Wallopers during their All Points East festival set.\nThe Irish band played at London’s All Points East Festival today (August 24), and asked the crowd to show their support for The Mary Wollopers, who had their sound cut by Victorious festival organisers and the Palestinian flag they had on stage taken away.\nThe Mary Wallopers were halfway through the opening song of their set at the Portsmouth festival when the sound was cut, and the organisers’ decision was met with furious responses from both the band themselves and many of the other artists on the bill.\nActs including The Last Dinner Party, The Academic, Cliffords and Esme Emerson decided to boycott the festival as a result.\nAfter The Mary Wallopers’ set was cut off, Victorious representatives told NME that the show was not ended because of the presence of the flag on stage, but because “the band used a chant which is widely understood to have a discriminatory context”.\nIn response, the band shared an unedited video of the events from the stage, and said: “The festival have released a misleading statement to the press claiming they cut our sound because of a discriminatory chant and not the band’s call to Free Palestine. Our video clearly shows a Victorious crew member coming on stage, interfering with our show, removing the flag from the stage and then the sound being cut following a chant of ‘Free Palestine’. The same crew member is later heard in the video saying, ‘you aren’t playing until the flag is removed’.”\n“We completely reject Victorious’ portrayal of today’s events and request that they retract their statement immediately.”\nNow, the Murder Capital have spoken about the incident. “Make some noise for The Mary Wollopers,” the band’s frontman says to the crowd. “I want you to make some fucking noise for the bands that pulled out of that shitty festival. I want to hear some fucking noise for the people of Palestine.”\nThe crowd starts chanting “Free Palestine” after he finishes. Watch footage of the moment below.\nOn Saturday night (August 23), Vampire Weekend topped the Victorious festival bill and, after their opening song ‘Mansard Roof’, frontman Ezra Koenig addressed the controversy. Explaining that the band had been travelling and did not have all of the information, he said it would be “wrong” if any artists had been prevented from sharing a political view.\n“If someone was punished for flying a flag, that is wrong and they deserve an apology,” he said. “The terrible suffering of the Palestinian people deserves all of our sympathy.”\nAs reported by Portsmouth News, Koenig’s comments were met with huge cheers and applause from the crowd.\nIn other news, The Murder Capital have been forced to cancel the US and Canadian leg of their tour due to “unforeseen financial challenges” and uncertainty.\nThey were set to embark on a North American leg of the tour later this autumn, however, in a new update with fans, the five-piece have explained that they have had to scrap all of those dates.\nThis, they explained, was due to financial struggles and uncertainties around travel. It seems like no replacement dates have been scheduled, and fans who have tickets to the shows should be issued refunds shortly.\n“With heavy hearts, we have to cancel our tour this autumn due to unforeseen financial challenges and the ongoing travel uncertainties,” their statement read on social media yesterday (July 1). “This is a bitter pill to swallow. We hope you know how much we wanted to be out there playing these shows for ye all.”\nThey continued: “Thank you to all our fans that bought tickets, we appreciate your support and can’t wait to come back as soon as the time is right. Sending you all love in these strange times. All our summer shows are on, we look forward to seeing everyone out there.”\nRead the original article here"
    },
    {
      "news_title": "Bands boycott Victorious music festival after group 'cut-off' - Finnoexpert",
      "news_link": "https://finnoexpert.com/bands-boycott-victorious-music-festival-after-group-cut-off/",
      "bias": "unknown",
      "text": "A string of bands have pulled out of a music festival hours before they were due to perform after Irish folk band The Mary Wallopers claimed they were “cut off” for displaying a Palestinian flag.\nThe Last Dinner Party, Cliffords and The Academic announced on Saturday that they would no longer be performing at Portsmouth’s Victorious festival.\nThe organisers, who initially claimed The Mary Wallopers had their set cut on Friday for using a “discriminatory” chant, have since issued an apology to the band.\nThey also pledged to make “a substantial donation to humanitarian relief efforts for the Palestinian people”.\nRock band The Last Dinner Party said they were boycotting the festival in a statement shared on their Instagram page.\nThey said they were “outraged by the decision made to silence The Mary Wallopers” and accused the organisers of “political censorship”.\nThey apologised to their fans and expressed their support for Palestinians.\nFollowing The Mary Wallopers’ set, a spokesperson for Victorious said: “We spoke to the artist before the performance regarding the festival’s long-standing policy of not allowing flags of any kind at the event, but that we respect their right to express their views during the show.\n“Although a flag was displayed on stage contrary to our policy, and this was raised with the artist’s crew, the show was not ended at this point, and it was the artist’s decision to stop the song.”\nIn response, The Mary Wallopers claimed the festival had released a “misleading statement to the press claiming they cut our sound because of a discriminatory chant, and not the band’s call to Free Palestine”.\n“Our video clearly shows a Victorious crew member coming on stage, interfering with our show, removing the flag from the stage and then the sound being cut following a chant of ‘Free Palestine’,” they added.\nRock band The Academic have also pulled out of the festival, saying they could not “in good conscience” perform at “a festival that silences free speech”, while Irish band Cliffords said they “refuse to play if we are to be censored for showing our support to the people of Palestine”.\nAs the bands announced they would no longer perform at the festival, the organisers issued another statement on Instagram.\nDescribing The Mary Wallopers as “a fantastic band”, they said: “We didn’t handle the explanation of our policies sensitively or far enough in advance to allow a sensible conclusion to be reached.\n“This put the band and our own team in a difficult situation which never should have arisen. We would like to sincerely apologise to all concerned.\n“We absolutely support the right of artists to freely express their views from the stage, within the law and the inclusive nature of the event. Our policy of not allowing flags of any kind, which has been in place for many years for wider event management and safety reasons, is not meant to compromise that right.\n“We accept that, although mics remained live for longer, sound for The Mary Wallopers’ audience was cut as described in the band’s video and that comments after that were not audible to the public.”\nThey apologised for what had happened and pledged to make a “substantial donation” to humanitarian relief efforts.\nThe festival’s closing day is set to be headlined by Kings of Leon, with Bloc Party, Gabrielle and The Reytons among the other acts on the line-up."
    },
    {
      "news_title": "Irish folk band The Mary Wallopers say they were muted at festival for showing Palestinian flag on stage - Egypt Independent",
      "news_link": "https://www.egyptindependent.com/irish-folk-band-the-mary-wallopers-say-they-were-muted-at-festival-for-showing-palestinian-flag-on-stage/",
      "bias": "unknown",
      "text": "Irish folk band The Mary Wallopers say they were muted at a music festival in Portsmouth, England on Friday for displaying a Palestinian flag during their set, something denied by organizers.\n“Just got cut off at Victorious festival for having a Palestinian flag on the stage,” the band said in a post on Instagram. “We’ve been doing this for six years now and this has never happened before.”\n“Free Palestine all day every day.”\nThe festival organizers denied the band’s account, saying event management had cut the sound after the band “used a chant which is widely understood to have a discriminatory context.”\n“Although a flag was displayed on stage contrary to our policy, and this was raised with the artist’s crew, the show was not ended at this point, and it was the artist’s decision to stop the song,” the festival statement said. “The decision by the event management to cut the sound and end the performance was only taken after the band used a chant which is widely understood to have a discriminatory context.”\nCNN has approached the band and the festival for further details.\nEdited video from the concert posted by the band on Instagram show that the Mary Wallopers’ banjo player Andrew Hendy began the set by saying “Free Palestine, and f**k Israel” before the group launched into one of their songs.\nTheir playing continues for about a minute further, according to the video, when a stagehand appears to come on stage and remove a Palestinian flag that the band had affixed to one of its speakers.\nAndrew Hendy tells the crowd that the band were instructed not to fly a Palestinian flag or they would be cut off, encouraging audience members to leave the festival grounds. The banjo player began chanting “Free Palestine” before his mic was cut.\nLater, video from another angle shows the band’s guitarist Charles Hendy asking a person offscreen whether the band will be allowed to continue playing. The response is muffled, but the person appears to reply that the Palestinian flag needs to be removed.\n“We’re not playing,” Charles Hendy responds.\n“Fine,” the person offscreen says.\nAs the band waved to the crowd and left the stage, audience members began chanting “Free Palestine” and “Let them play!”\n“People were upset and angry,” said Emma Gaynor, an audience member who attended the concert with her partner. “I didn’t hear anything discriminatory, it all happened very quickly.”\nJess Huxham, another attendee, said that other bands who played the festival that day had also said “Free Palestine” during their sets.\n“From all I heard,” Huxham said in an email. “[The Mary Wallopers] did say ‘Free Palestine,’ which other bands on the main stage had said before their set.”\nThe incident comes amid fierce controversy around pro-Palestinian activism and free speech in the UK, with musicians often at the forefront.\nAfter rap duo Bob Vylan chanted “Death to the IDF” at their Glastonbury Festival set in June, police in the UK launched a criminal investigation. Even the United States government weighed in, revoking the band members’ visas ahead of their US tour."
    },
    {
      "news_title": "The Mary Wallopers 'completely reject' festival's reasons for 'cutting' set",
      "news_link": "https://extra.ie/2025/08/24/entertainment/music/mary-wallopers-victorious",
      "bias": "unknown",
      "text": "Irish folk band The Mary Wallopers have said they ‘completely reject’ how a music festival have portrayed events after their set was ‘cut’ over the weekend.\nThe Louth-based band were among performers at British festival, Victorious Festival, over the weekend and took to the stage in Portsmouth on Friday.\nThe set was cut short after the band presented a Palestinian flag on the stage, with organisers from Victorious stating the set was shortened due to the use of a ‘discriminatory’ chant.\nOn Saturday, the band released a video of their short set, which saw band members take to the stage with one band member putting the flag up at the back while lead singer Charles Hendy spoke to attendees.\nThe band kick off their set, but it’s quickly pulled when a member of the crew comes on in the background.\n‘We were told our gig was gonna be cut if we flew a Palestinian flag — this is the smell of sh*t around here,’ Charles said, as the music stopped.\n‘Everyone should just leave this f*cking place. Get that flag back,’ he said, before chanting: ‘Free Free Palestine.’\nThe sound was then completely cut, much to the anger of fans of the band.\nAfter another few moments, Charles can be heard off camera asking if the band were playing, with a crew member saying not until the flag was removed.\n‘We’re not playing,’ the lead singer confirmed.\n‘Yesterday, a famine was declared in Gaza, where at least 65 people were killed by Israeli attacks, all the while Israel pushed ahead with plans to split the West Bank in two. These are the important facts about yesterday,’ the band wrote alongside the clip.\n‘We are uploading this video so everybody can see @VictoriousFestival cut our gig short for having a Palestinian flag on stage.’\nThe band added that a ‘misleading statement’ had been released claiming the sound was cut short due to a discriminatory chant.\nThe statement noted that the video ‘clearly’ showed a crew member ‘interfering’ with the show and taking the flag before the sound was cut.\nThe band added that it was the same crew member who told them they weren’t playing until the flag was gone, and said they ‘completely reject’ the festival’s portrayal of events and requested an immediate retraction.\n‘We know this is getting some attention and we don’t want another distraction which takes attention away from the genocide that is happening in Palestine,’ they said, ‘FREE PALESTINE.’\nThe band statement was met with an inundation of support from fellow Irish stars and musicians.\nRap band Kneecap wrote a string of clapping hand emojis while RTÉ broadcaster Louise Duffy said: ‘That is insane. Well done @marywallopers.’\nAnother wrote: ‘The insane thing is that the festival booked a band that sings about oppression and thinks that they won’t sing about oppression of another nation at THEIR festival.’\nThe cutting of The Mary Wallopers set has led to a number of artists pulling out from the festival line-up including Cliffords Band and The Last Dinner Party.\nA statement from The Last Dinner Party said they were ‘outraged’ with the silencing of the band and were ‘therefore boycotting the festival.’\n‘Throughout this summer we have used our stages to encourage our audience to donate even a drink’s worth of money to Medical Aid for Palestinians and today we urge you more than ever to do the same,’ the band wrote."
    },
    {
      "news_title": "Mary Wallopers Festival Set Cut Short Over Palestine Message, The Last Dinner Party Cancel In Protest",
      "news_link": "https://www.stereogum.com/2320423/mary-wallopers-festival-set-cut-short-over-palestine-message-the-last-dinner-party-cancel-in-protest/news/",
      "bias": "unknown",
      "text": null
    },
    {
      "news_title": "Omnihanded Entertainmet News | The Last Dinner Party lead boycott of Victorious as The Mary Wallopers hit back and festival respond",
      "news_link": "https://omnihanded.com/the-last-dinner-party-lead-boycott-of-victorious-as-the-mary-wallopers-hit-back-and-festival-respond/",
      "bias": "unknown",
      "text": "The Last Dinner Party are among a group of artists to have boycotted Victorious Festival after The Mary Wallopers’ set was cut short for displaying a Palestinian flag.\nOn Friday (August 22), the Irish band were halfway through their opening song at the Portsmouth festival when their sound was cut by festival organisers and the Palestine flag on stage with them was taken away. As the crowd started to boo, the band led a chant of “free, free Palestine”.\nThe Mary Wallopers updated fans on Saturday with an Instagram post reading: “Yesterday, a famine was declared in Gaza, where at least 65 people were killed by Israeli attacks, all the while Israel pushed ahead with plans to split the West Bank in two. These are the important facts about yesterday.”\nAlongside an unedited video of their set being cut short, they added: “The festival have released a misleading statement to the press claiming they cut our sound because of a discriminatory chant and not the band’s call to Free Palestine. Our video clearly shows a Victorious crew member coming on stage, interfering with our show, removing the flag from the stage and then the sound being cut following a chant of ‘Free Palestine’. The same crew member is later heard in the video saying, ‘you aren’t playing until the flag is removed’.”\n“We completely reject Victorious’ portrayal of today’s events and request that they retract their statement immediately. We know this is getting some attention and we don’t want another distraction which takes attention away from the genocide that is happening in Palestine,” they added.\nNow, a number of other artists have announced they will not be playing at Victorious this weekend, including The Last Dinner Party, The Academic and Cliffords.\nRecommended\n“We are outraged by the decision made to silence The Mary Wallopers yesterday at Victorious,” The Last Dinner Party wrote in a statement. “As a band we cannot cosign political censorship and will therefore be boycotting the festival today.”\n“As Gazans are deliberately plunged into catastrophic famine after two years of escalating violence, it is urgent and obvious that artists use their platform to draw attention to the cause. To see an attempt to direct attention away from the genocide in order to maintain an apolitical image is immensely disappointing.”\n“Throughout this summer we have used our stages to encourage our audience to donate even a drink’s worth of money to Medical Aid for Palestinians, and today we urge you more than ever to do the same,” they continued.\n“We are so deeply sorry to our fans who were looking forward to seeing us today, and we are devastated to be put in this position that upsets both us and you.”\nThe Mary Wallopers’ fellow Irish artists The Academic and Cliffords have also pulled out of the festival. The Academic said they “can’t in good conscience stand up and play at a festival that silences free speech and the right to express your views”, while Cliffords said, “we refuse to play if we are to be censored for showing our support to the people of Palestine”.\nOn Friday, Victorious told NME that “although a flag was displayed on stage contrary to our policy, and this was raised with the artist’s crew, the show was not ended at this point, and it was the artist’s decision to stop the song. The decision by the event management to cut the sound and end the performance was only taken after the band used a chant which is widely understood to have a discriminatory context.”\nThe festival has since posted a statement that said they “didn’t handle the explanation of our policies sensitively or far enough in advance to allow a sensible conclusion to be reached. This put the band and our own team in a difficult situation which never should have arisen. We would like to sincerely apologise to all concerned.”\nPosted by Victorious Festival on Saturday, August 23, 2025\n“We absolutely support the right of artists to freely express their views from the stage, within the law and the inclusive nature of the event,” they added. “Our policy of not allowing flags of any kind, which has been in place for many years for wider event management and safety reasons, is not meant to compromise that right.”\n“We accept that, although mics remained live for longer, sound for The Mary Wallopers’ audience was cut as described in the band’s video and that comments after that were not audible to the public. We are sorry that this situation has come about and will be making a substantial donation to humanitarian relief efforts for the Palestinian people.”\nVictorious is one of many festivals to be operated by Superstruct Entertainment, which is owned by the controversial global investment firm KKR, which has been criticised by many artists for its alleged stakes in weapons manufacturing companies and Israel corporations operating in the occupied Palestinian territories.\nSeveral other festivals that are backed by KKR have addressed their concerns about the connection. Tramlines said they would “never send them a single Euro”, while Mighty Hoopla stated their “clear opposition to KKR’s unethical investments”.\nOne group of 50 artists, which included Massive Attack and Brian Eno, signed an open letter urging Field Day to distance itself from KKR in May, while another 11 artists announced that they were boycotting the festival in solidarity with Palestine.\nVictorious Festival is running on the Southsea seafront this weekend, with Kings Of Leon, Queens Of The Stone Age and Vampire Weekend topping the bill.\nComments are closed, but trackbacks and pingbacks are open."
    }
  ]
}