{
  "story_id": "GN_20250825_222918_27bfe6b8",
  "metadata": {
    "title": "Men putting up English flags ‘attacked with firebomb’",
    "timestamp": "2025-08-25T22:29:18.703842",
    "url": "https://ground.news/article/patriotic-flag-raisers-attacked-with-petrol-bombs-after-hanging-st-georges-crosses-in-community-but-they-say-it-wont-stop-us"
  },
  "bias_distribution": {
    "total_sources": "10",
    "leaning_left": "1",
    "center": "1",
    "leaning_right": "6"
  },
  "perspective_summaries": {
    "left": [
      "A group of men was attacked with a petrol bomb while putting up English flags in Stevenage, resulting in one man, Louis, suffering a laceration to his head.",
      "Police were called to Fairlands Way at 12:09 am on August 23 to respond to the assault, and Louis was taken to Lister Hospital for treatment.",
      "The victims stated that the attack reflects a 'deep resentment and hatred towards our nation,' but they will continue to display the flag to preserve their heritage and identity.",
      "Chief Inspector Sarach Gilbertson confirmed the investigation is ongoing while reassuring the community that the incident was contained, despite concerns for local residents."
    ],
    "center": [
      "A group of men was attacked with a petrol bomb while putting up English flags in Stevenage, resulting in one man, Louis, suffering a laceration to his head.",
      "Police were called to Fairlands Way at 12:09 am on August 23 to respond to the assault, and Louis was taken to Lister Hospital for treatment.",
      "The victims stated that the attack reflects a 'deep resentment and hatred towards our nation,' but they will continue to display the flag to preserve their heritage and identity.",
      "Chief Inspector Sarach Gilbertson confirmed the investigation is ongoing while reassuring the community that the incident was contained, despite concerns for local residents."
    ],
    "right": [
      "A group of men was attacked with a petrol bomb while putting up English flags in Stevenage, resulting in one man, Louis, suffering a laceration to his head.",
      "Police were called to Fairlands Way at 12:09 am on August 23 to respond to the assault, and Louis was taken to Lister Hospital for treatment.",
      "The victims stated that the attack reflects a 'deep resentment and hatred towards our nation,' but they will continue to display the flag to preserve their heritage and identity.",
      "Chief Inspector Sarach Gilbertson confirmed the investigation is ongoing while reassuring the community that the incident was contained, despite concerns for local residents."
    ]
  },
  "sources": [
    {
      "news_title": "Fury as English flags graffitied at Welsh beauty spot",
      "news_link": "https://www.walesonline.co.uk/news/wales-news/fury-english-flags-graffitied-welsh-32346284",
      "bias": "Lean Left",
      "text": "Fury as English flags graffitied at Welsh beauty spot\nA National Trust beauty spot in Pembrokeshire was vandalised with England flags and graffiti mentioning the likes of far-right extremist Tommy Robinson\nResidents fumed after English flags were painted on a \"sacred\" National Trust beauty spot in Wales.\nThe graffiti appeared last week at Stackpole Quay in Pembrokeshire, described by the National Trust as a \"historic masonry harbour nestled amongst dramatic cliffs with a pebbled beach revealed at low tide\".\nIt makes reference to the controversial \"raise the flag\" campaign, aiming to \"coat the local community in England flags\". It also mentioned Tommy Robinson, Donald Trump, Nigel Farage and Make England Great Again.\nLocals in Pembrokeshire have been left fuming by the move, with one blasting: \"If they love Trump so much, go on holiday to America. If they adore the English flag so much, stay in England.\"\nThe site is near Barafundle beach which is regularly voted one of the best beaches in the world.\nMembers of the Town Cast Pembroke took the photos and described the vandalism as \"disgraceful\". A spokesperson for the group said: \"This is absolutely disgraceful graffiti on National Trust land at Stackpole Quay.\n\"If you can't read it, we have Tommy Robinson, Trump, Farmers and Farage plus 'Make England great again' and a load of England flags.\n\"I hope they prosecute the backside off whoever did this!\" The spokesperson continued that the site is \"almost a holy place locally\".\nThey continued: \"It is almost a holy place locally - everyone local - including many English born people - would never dare to do it.\n\"The reaction from local English residents is one of shame.\"\nMany places in England have seen the raising of flags of St George and Union Jacks in the last week.\nIt follows protests outside some hotels housing asylum seekers in the UK. Union Jack and St George's Cross flags have featured among the placards.\nThe campaign has also been called Operation Raise the Colours but those behind it deny it is racist though it has received the support of far-right groups.\nBut locals near the beauty site were less than impressed, with another fuming: \"Disgusting.. whoever has done this shame on you.\"\nOne more said: \"Typical behaviour from those across the border. We don't want that here.\"\nA spokesperson for the National Trust in Pembrokeshire said: “We were saddened to find that the rocks at Stackpole Quay had been vandalised, and our team has now cleared the graffiti.\n\"We urge people to come and enjoy the harbour and coastline without leaving any trace of their visit or doing any damage.”"
    },
    {
      "news_title": "Police launch probe into petrol bomb attack on man 'putting up flags' in Stevenage",
      "news_link": "https://www.standard.co.uk/news/crime/stevenage-petrol-bomb-attack-flags-b1244352.html",
      "bias": "Center",
      "text": "An investigation is under way after a man was struck in the face by a petrol bomb while reportedly putting up St George’s flags in a London commuter belt town.\nThe man, who is in his 30s, suffered a cut to the head after being struck by a glass bottle containing a lit rag during the attack in Stevenage, Hertfordshire Police said.\nThe force said it was called to reports a man had been assaulted in Fairlands Way at 12.09am on Saturday and that he was taken to Lister Hospital in Stevenage for treatment.\nA group called Stevenage Patriots said on Twitter that they had been hanging St George's flags on lampposts and poles for around three hours when the incident took place.\nRead More\nStevenage Chief Inspector Sarah Gilbertson said: “It appears the victim was struck by a glass bottle containing a lit rag and sustained a cut to his head.\n“I know that this incident will concern people living locally, but I would like to reassure the community that this was a contained incident.\n“Our investigation continues and anyone with information is asked to get in touch with police.”"
    },
    {
      "news_title": "Police probe 'petrol bomb attack' on man hanging St George's Flags",
      "news_link": "https://www.lbc.co.uk/article/petrol-bomb-stevenage-st-georges-flag-5HjdBQq_2/",
      "bias": "Lean Right",
      "text": "Police probe 'petrol bomb attack' on man hanging St George's Flags\nPolice are investigating reports a man hanging St George's flags was hit in the head by a petrol bomb in Stevenage.\nListen to this article\nHertfordshire Police say a man in his 30s suffered a cut to the head after being struck by a glass bottle containing a lit rag.\nA group calling themselves Stevenage Patriots posted footage of the incident in which a bottle and flames can be seen on the ground near a man with a head wound and blood on his face and hands.\nRead More: Man arrested accused of racist abuse after flags painted on Essex buildings\nRead More: It is 'shameful' of councils to remove St George’s Cross flags, says Kemi Badenoch\nIn the video, one person can be heard saying: “Just finished the night, three hours of flagging – and our boy has been petrol-bombed.\n“A petrol bomb was thrown at the car, smashed straight onto his head.”\nCh Insp Sarah Gilbertson said: “Officers attended and spoke with the victim, a man in his 30s, who had suffered a laceration to his head.\n“He was taken to Lister Hospital in Stevenage for treatment. It appears that the victim was struck by a glass bottle containing a lit rag and sustained a cut to his head.\nFlag-raising groups have sprung up across Britain in recent days, as part of an online trend called \"Operation Raise the Colours\".\nThe trend started with residents in Birmingham installing hundreds of flags throughout the city last week in a 'patriotic outpouring' and has since been followed by others across the country.\nBirmingham City Council announced that it had removed the flags as it was upgrading streetlights to energy-efficient LED lighting.\nCountless towns have now seen guerrilla flag raisings in response."
    },
    {
      "news_title": "Man 'attacked' with petrol bomb while putting up St George's flags",
      "news_link": "https://www.thesun.co.uk/news/36422081/man-attacked-petrol-bomb-stevenage-hertfordshire-english-flags/",
      "bias": "Lean Right",
      "text": "A MAN has been injured after claiming he was attacked with a \"petrol bomb\" while hanging up St George's Cross flags.\nThe man, aged in his 30s, suffered a cut to his head after \"appearing to be struck by a glass bottle containing a lit rag\", police said.\nPosting on social media, the group Stevenage Patriots shared a video saying the man had been putting up English flags in the Hertfordshire town when he was \"attacked\".\nThe clip shows a fire burning on the pavement next to a car, understood to be owned by one of the group.\nThe man who filmed the clip can be heard saying: \"Move you car bruv, move your car,\" as flames rise up from the ground.\nHe continues: \"F***ing petrol bomb. Move the car bruv.\nRead More on UK News\n\"Putting flags up [and] got petrol bombed.\"\nSome of the group can then be seen entering a van to leave the scene.\nLater, the injured man can be seen with blood streaking down his face and hands as well as on his hoodie.\nOther members of the group appear to apply bandages to the man's head while the cameraman explains: \"Patriots putting the other patriot together.\nMost read in The Sun\n\"We've just been attacked with a petrol bomb. Police are here.\"\nAnother person can be heard asking if the man's hand has also been cut, referring to \"lumps of flesh\" being seen \"hanging\".\nThen, another says: \"Why are people such cowards?\", in reference to the throwers of the \"petrol bomb\".\nTurning to a police officer attending the scene, the cameraman asks what he thinks of the situation, to which the cop replies: \"No comment.\"\nIn the video, the group explains they had just \"finished the night\" after hanging up flags for \"three hours\" when the attack took place.\nThe cameraman says: \"A petrol bomb was thrown at the car [and it] smashed straight onto his head.\nA voice can be heard referring to those responsible as \"absolute scumbags\" and \"cowards\".\nStills at the end of the video show the shattered remains of what appears to be an alcohol spirit bottle on the pavement next to a rag as well as scorch marks on the ground.\nHertfordshire Police confirmed it had attended the scene after a man in his 30s suffered a cut to the head after \"appearing to be struck by a glass bottle containing a lit rag\".\nThe force said it was called to reports a man had been assaulted in Fairlands Way at 12.09am on Saturday, adding that the man was taken to Lister Hospital in Stevenage for treatment.\nStevenage Chief Inspector Sarah Gilbertson said: “It appears the victim was struck by a glass bottle containing a lit rag and sustained a cut to his head.\n“I know that this incident will concern people living locally, but I would like to reassure the community that this was a contained incident.\n“Our investigation continues and anyone with information is asked to get in touch with police.”\nThis comes as groups across the country have vowed to put up St George's Cross flags after some councils were seen removing them.\nAfter English flags in the London Borough of Tower Hamlets were taken down \"as part of routine maintenance\", enraged locals vowed to put up more flags, inspiring similar movements nationwide."
    },
    {
      "news_title": "Group of Men Putting Up St George’s Flags Are ‘Attacked With Firebomb’ – The Daily Sceptic",
      "news_link": "https://dailysceptic.org/?p=267163",
      "bias": "Right",
      "text": "A man was left with a nasty gash and blood pouring down his face after being attacked with “a glass bottle and lit rag” just minutes after putting up England flags in his hometown. The Mail has the story.\nA man, known as Louis, told police he was struck by the flaming object in Stevenage, Hertfordshire, as he and a group of others were hanging St George’s flags on lampposts and poles just after midnight on Saturday.\nFootage from the incident posted on social media by StevenagePatriots shows the bottle ablaze on the ground and close to the rear tyres of a parked car.\nThe person taking the video can then be heard saying: “Putting flags up, got petrol bombed.”\nSeconds later, the video shows ‘Louis’ looking shocked and standing with blood running down his face and hands as he awaited emergency services.\nThe man behind the camera says: ‘Just finished the night, three hours of flagging – and our boy has been petrol bombed.\n“A petrol bomb was thrown at the car, smashed straight onto his head.”\nThe voice off-camera can then be heard calling those responsible “absolute scumbags” and “cowards”.\nLouis was helped by paramedics, before being taken off to Lister Hospital in Stevenage for treatment.\nOne of the men at the scene, who wished to remain anonymous, told GB News: “It is, of course, worrying to see such hostility, but it will never stop us from raising our flag with pride.\n“The fact that people are so quick to attack us is concerning, yet it only makes us more determined to stand firm in who we are.”\nHe added: “My message is simple: keep going, keep waving your flags, because we are a country that does not surrender – and we never will.” …\nAnyone with information is asked to contact Hertfordshire Police on 101 or Crimestoppers anonymously on 0800 555 111. …\nYesterday, rival groups angrily clashed in front of migrant hotels as a wave of protests spread across Britain.\nAt least 30 demonstrations took place, with police bracing themselves for more over the bank holiday. …\nLast night, Avon and Somerset Police said a 37 year-old woman was arrested for assaulting an emergency worker. Tensions also boiled over in Oxford, as opposing groups clashed outside the Holiday Inn Express hotel. But in a rare moment of unity, both groups chanted together “Keir Starmer is a w*****.”\nWorth reading in full.\nTo join in with the discussion please make a donation to The Daily Sceptic.\nProfanity and abuse will be removed and may lead to a permanent ban."
    },
    {
      "news_title": "Man putting up St George's flags brutally 'attacked with firebomb'",
      "news_link": "https://www.express.co.uk/news/uk/2099456/st-george-flag-man-attacked",
      "bias": "Lean Right",
      "text": null
    },
    {
      "news_title": "Men putting up English flags ‘attacked with firebomb’",
      "news_link": "https://www.telegraph.co.uk/news/2025/08/24/men-putting-up-england-flags-attacked-with-firebomb/",
      "bias": "Lean Right",
      "text": "The injured man, known as Louis, appeared to be the organiser of a group calling itself Stevenage Patriots that was putting up the flags.\nIn the days leading up to the incident, he posted on social media that he was trying to organise “a night of putting flags up around town” and asked people to donate flags and cable ties.\nIn a post on Facebook on Wednesday, he said “around 40 flags” had been donated, writing: “Don’t ever feel ashamed of the flag.”\nFollowing the incident, one of the group members told GB News: “It is of course worrying to see such hostility, but it will never stop us from raising our flag with pride. The fact that people are so quick to attack us is concerning, yet it only makes us more determined to stand firm in who we are.”\nIt comes amid a growing movement that has seen members of the public display flags in towns and cities across England.\nAn online “patriotism campaign” called Operation Raise the Colours, encouraging people to hang flags, has gathered momentum online.\nRobert Jenrick, the shadow justice secretary, hoisted Union flags in his constituency in Newark earlier this week\nMini-roundabouts in the West Midlands and Dorset have also been daubed with red paint to resemble the St George’s flag in recent days."
    },
    {
      "news_title": "Patriotic flag raisers attacked with 'petrol bombs' after hanging St George's crosses in community but they say 'it won't stop us'",
      "news_link": "https://www.gbnews.com/news/hertfordshire-news-men-attacked-petrol-bomb-st-georges-flags-stevenage",
      "bias": "Lean Right",
      "text": "Patriotic flag raisers attacked with 'petrol bombs' after hanging St George's crosses in community but they say 'it won't stop us'\nTHIS STORY CONTAINS GRAPHIC IMAGES\nDon't Miss\nMost Read\nTrending on GB News\nA group of men have been attacked with a 'petrol bomb' in Stevenage, Hertfordshire, after putting up a series of English flags in their town.\nThe attack occurred in the early hours of this morning, leaving one man, known as Louis, with a huge gash and a head covered in blood.\nThe group were putting up English flags across their town on lampposts and poles.\n**ARE YOU READING THIS ON OUR APP? DOWNLOAD NOW FOR THE BEST GB NEWS EXPERIENCE**\nFootage on the group's X page (@HertsStandUp) and Instagram (@StevenagePatriots) shows Louis with a significant cut on his head.\nHe was attended to by paramedics at the scene following the attack.\nOne of the men, who prefers to remain anonymous, told GB News: \"It is, of course, worrying to see such hostility, but it will never stop us from raising our flag with pride.\n\"The fact that people are so quick to attack us is concerning, yet it only makes us more determined to stand firm in who we are.\"\nLATEST DEVELOPMENTS\n- As an outraged American, I raise my mother country's flag proudly against Labour's great betrayal - Lee Cohen\n- Britons ‘raising the flag’ are promoting national pride, say organisers as St George's flags removed from another council area\n- GB News guest erupts at 'left-wingers' for turning their backs on Union flag: 'It’s everybody’s flag!'\nLouis can be seen bleeding from his head\n|X/HERTSSTANDUP\nThe men said that the only reason they can see for why people would attack them is through carrying \"a deep resentment and hatred towards our nation and everything it represents\".\nThey continued: \"Sadly, that intolerance surfaces when we choose to proudly display our national identity.\"\nOne of the men explained the attack would not deter them and they will continue: \"Flying the flag... to keep our nation's spirit alive\".\nHe explained: \"We are a tolerant, welcoming country, but we also want to preserve our heritage and identity.\nParamedics at the scene attending to Louis\n|X/HERTSSTANDUP\nThe police said the victim was attacked with a 'glass bottle containing a lit rag'\n|X/HERTSSTANDUP\n\"The St George's flag is something to be proud of - it represents resilience, unity, and the values we hold dear.\n\"My message is simple: keep going, keep waving your flags, because we are a country that does not surrender - and we never will.\"\nHerts Police confirmed they were called to reports of a man being assaulted in Fairlands Way, Stevenage, at 12.09am on Saturday, August 23.\nStevenage Chief Inspector Sarach Gilbertson said: \"Officers attended and spoke with the victim, a man in his 30s, who had suffered a laceration to his head. He was taken to Lister Hospital in Stevenage for treatment.\nFlags can be seen across the street which the men were putting up\n|X/HERTSSTANDUP\n\"It appears that the victim was struck by a glass bottle containing a lit rag and sustained a cut to his head.\n\"I know that this incident will concern people living locally, but I would like to reassure the community that this was a contained incident.\n\"Our investigation continues, and anyone with information is asked to get in touch with police.\"\nHerts Police said people can report and provide information online or call the non-emergency number 101."
    },
    {
      "news_title": "Man in his 30s injured after being ‘hit with petrol bomb while...",
      "news_link": "https://www.flyingeze.com/man-attacked-petrol-bomb-stevenage-hertfordshire-english-flags",
      "bias": "unknown",
      "text": "A MAN was left injured after claiming he was attacked with a “petrol bomb” while hanging up St George’s Cross flags.\nThe man, aged in his 30s, suffered a cut to his head after “appearing to be struck by a glass bottle containing a lit rag”, police said.\nPosting on social media, the group Stevenage Patriots shared a video saying the man had been putting up English flags in the Hertfordshire town when he was “attacked”.\nThe clip shows a fire burning on the pavement next to a car, understood to be owned by one of the group.\nThe man who filmed the clip can be heard saying: “Move you car bruv, move your car,” as flames rise up from the ground.\nHe continues: “F***ing petrol bomb. Move the car bruv.\n“Putting flags up [and] got petrol bombed.”\nSome of the group can then be seen entering a van to leave the scene.\nLater, the injured man can be seen with blood streaking down his face and hands as well as on his hoodie.\nOther members of the group appear to apply bandages to the man’s head while the cameraman explains: “Patriots putting the other patriot together.\n“We’ve just been attacked with a petrol bomb. Police are here.”\nAnother person can be heard asking if the man’s hand has also been cut, referring to “lumps of flesh” being seen “hanging”.\nThen, another says: “Why are people such cowards?”, in reference to the throwers of the “petrol bomb”.\nTurning to a police officer attending the scene, the cameraman asks what he thinks of the situation, to which the cop replies: “No comment.”\nIn the video, the group explains they had just “finished the night” after hanging up flags for “three hours” when the attack took place.\nThe cameraman says: “A petrol bomb was thrown at the car [and it] smashed straight onto his head.\nA voice can be heard referring to those responsible as “absolute scumbags” and “cowards”.\nStills at the end of the video show the shattered remains of what appears to be an alcohol spirit bottle on the pavement next to a rag as well as scorch marks on the ground.\nHertfordshire Police confirmed it had attended the scene after a man in his 30s suffered a cut to the head after “appearing to be struck by a glass bottle containing a lit rag”.\nThe force said it was called to reports a man had been assaulted in Fairlands Way at 12.09am on Saturday, adding that the man was taken to Lister Hospital in Stevenage for treatment.\nStevenage Chief Inspector Sarah Gilbertson said: “It appears the victim was struck by a glass bottle containing a lit rag and sustained a cut to his head.\n“I know that this incident will concern people living locally, but I would like to reassure the community that this was a contained incident.\n“Our investigation continues and anyone with information is asked to get in touch with police.”\nThis comes as groups across the country have vowed to put up St George’s Cross flags after some councils were seen removing them.\nAfter English flags in the London Borough of Tower Hamlets were taken down “as part of routine maintenance” , enraged locals vowed to put up more flags, inspiring similar movements nationwide."
    }
  ]
}