{
  "story_id": "GN_20250823_203002_a6b07461",
  "metadata": {
    "title": "Mail Services Halt US Deliveries Amid Tariff Rate Confusion",
    "timestamp": "2025-08-23T20:30:02.214847",
    "url": "https://ground.news/article/mail-services-halt-us-deliveries-amid-tariff-rate-confusion_5cdeff"
  },
  "bias_distribution": {
    "total_sources": "140",
    "leaning_left": "22",
    "center": "21",
    "leaning_right": "19"
  },
  "perspective_summaries": {
    "left": [
      "Australia Post is suspending transit shipping to the United States due to tariff confusion, effective August 20, 2025, impacting global postal and retail networks.",
      "Low-Value goods from Australia that were previously exempt from taxes will now face tariffs starting August 29, 2025, ending the 'de minimis' exemption for imports to the US."
    ],
    "center": [
      "On Friday, Germany's and France's postal services announced they would limit shipments to the U.S. in response to tariffs introduced by President Donald Trump.",
      "In late July, the Trump administration announced that starting August 29, small packages shipped to the US would no longer be exempt from taxes, and the customs processing threshold would be lowered from $2,500 to $800.",
      "DHL, owned by Deutsche Post, announced that starting Saturday, it will temporarily halt its regular package deliveries to the US, while France's La Poste plans to stop sending packages from Monday except for gifts valued under 100 euros, which will undergo additional inspections to prevent misuse.",
      "DHL explained that the limitations, which they believe will only last for a short period, are due to newly implemented procedures for mail delivery introduced by US officials. They also noted that key details remain unclear, such as who will be responsible for paying the tariffs and the exact process involved.",
      "These actions highlight ongoing trade disputes and have prompted postal operators across various European countries, such as those in Belgium, Austria, and Denmark, to implement temporary restrictions, thereby affecting small enterprises that depend on regular parcel shipments to the United States."
    ],
    "right": [
      "Germany's postal service announced temporary restrictions on package deliveries to the United States starting Aug 23 due to tariffs imposed by President Donald Trump.",
      "DHL stated that its standard package delivery will be suspended, but a more expensive express service will still be available to customers.",
      "Packages sent as presents valued under US$100 can still be sent, but will face extra checks to prevent misuse, according to DHL.",
      "From Aug 29, packages valued under US$800 will be taxed at 15 percent, as outlined by the Trump administration's new tariff policy."
    ]
  },
  "sources": [
    {
      "news_title": "European postal services to halt US-bound packages over tariff confusion",
      "news_link": "https://www.scmp.com/news/world/europe/article/3322935/european-postal-services-halt-us-bound-packages-citing-confusion-over-trump-tariffs",
      "bias": "Center",
      "text": "European, Indian postal services to halt US-bound packages, over Trump tariff confusion\nUnder a Trump decree, international goods under US$800 will face import duties from August 29, but parcels under US$100 will remain exempt\nMultiple postal services in Europe and India on Saturday suspended the shipment of many packages to the United States amid a lack of clarity over new US import duties.\nPostal services in Germany, Denmark, Sweden and Italy said they will stop shipping most merchandise to the US effective immediately. France and Austria will follow on Monday, and the United Kingdom on Tuesday.\nUnder a decree signed by President Donald Trump last month, international goods that were previously exempt from US tariffs – those valued under US$800 – will be subject to import duties from August 29. Letters, books, gifts and small parcels worth less than US$100 will continue to be exempt.\nA trade framework agreed by the US and the European Union last month set a 15 per cent tariff on the vast majority of products shipped from the EU.\nMany European postal services say they are pausing deliveries now because they cannot guarantee the goods will enter the US before August 29. They cite ambiguity about what kind of goods are covered by the new rules, and the lack of time to process their implications.\nStarting on Saturday, Deutsche Post and DHL Parcel Germany said they would “no longer be able to accept and transport parcels and postal items containing goods from business customers destined for the US”."
    },
    {
      "news_title": "European postal services suspend shipment of packages to U.S. over import tariffs",
      "news_link": "https://www.cbsnews.com/news/european-postal-services-suspend-us-packages-shipment-tariffs/",
      "bias": "Lean Left",
      "text": "Postal services in India, Europe to suspend shipment of packages to U.S. over import tariffs\nMultiple postal services around Europe announced Saturday that they are suspending the shipment of many packages to the United States amid a lack of clarity over new import duties.\nPostal services in Germany, Denmark, Sweden and Italy said they will stop shipping most merchandise to the U.S. effective immediately. France and Austria will follow Monday, and the United Kingdom Tuesday.\nIndia's government also said the country will temporarily suspend postal deliveries to the United States starting Monday, except letters, documents and gift items of up to $100 in value, the AFP reported.\nUnder a decree signed by President Donald Trump last month, international goods that were previously exempt from U.S. tariffs — those valued under $800 — will be subject to import duties from Aug. 29. Letters, books, gifts and small parcels worth less than $100 will continue to be exempt.\nA trade framework agreed by the U.S. and the European Union last month set a 15% tariff on the vast majority of products shipped from the EU.\nMany European postal services say they are pausing deliveries now because they cannot guarantee the goods will enter the U.S. before Aug. 29. They cite ambiguity about what kind of goods are covered by the new rules, and the lack of time to process their implications.\nStarting Saturday, Deutsche Post and DHL Parcel Germany said they \"will no longer be able to accept and transport parcels and postal items containing goods from business customers destined for the US.\"\nPostnord, the Nordic logistics company, and Italy's postal service announced similar suspensions effective Saturday.\n\"In the absence of different instructions from US authorities ... Poste Italiane will be forced, like other European postal operators, to temporarily suspend acceptance of all shipments containing goods destined for the United States, starting August 23. Mail shipments not containing merchandise will continue to be accepted,\" Poste Italiane said Friday.\nShipping by services such as DHL Express remains possible, it added.\nBjörn Bergman, head of PostNord's Group Brand and Communication, said the pause was \"unfortunate but necessary to ensure full compliance of the newly implemented rules.\"\nIn the Netherlands, PostNL spokesperson Wout Witteveen said the Trump administration is pressing ahead with the new duties despite U.S. authorities lacking a system to collect them. He said that PostNL is working closely with its U.S. counterparts to find a solution.\n\"If you have something to send to America, you should do it today,\" Witteveen told The Associated Press.\nIndia's communications ministry said in a statement that the executive order issued last month requires transport carriers or other \"qualified parties\" approved by US authorities to collect and remit the tariff duties, but \"several critical processes relating to the designation of 'qualified parties' and mechanisms for duty collection and remittance remain undefined.\"\n\"Consequently, US-bound air carriers have expressed their inability to accept postal consignments after 25th August, 2025, citing lack of operational and technical readiness,\" the ministry said.\nAustrian Post, Austria's leading logistics and postal service provider, stated that the last acceptance of commercial shipments to the U.S., including Puerto Rico, will take place Tuesday.\nFrance's national postal service, La Poste, said the U.S. did not provide full details or allow enough time for the French postal service to prepare for new customs procedures.\n\"Despite discussions with U.S. customs services, no time was provided to postal operators to re-organize and assure the necessary computer updates to conform to the new rules,\" it said in a statement.\nThe UK's Royal Mail said it would halt U.S. shipments on Tuesday \"to allow time for those packages to arrive before duties kick in.\" Items originating in the U.K. will require a 10% duty for items over $100, it said.\nPostEurop, an association of 51 European public postal operators, said that if no solution can be found by Aug. 29 all its members will likely follow suit."
    },
    {
      "news_title": "Postal department temporarily halts US services amid lack of clarity about Washington’s custom rules",
      "news_link": "https://scroll.in/latest/1085830/postal-department-temporarily-halts-us-services-amid-lack-of-clarity-about-washingtons-custom-rules",
      "bias": "Lean Left",
      "text": "Postal department temporarily halts US services amid lack of clarity about Washington’s custom rules\nThe Donald Trump administration has withdrawn the duty-free exemption for inbound postal goods valued up to $800.\nIndia’s Department of Posts said on Saturday that it will temporarily suspend postal services to the United States amid lack of clarity about the new customs rules announced by Washington.\nThe booking of all types of postal articles destined for the US will be temporarily suspended from Monday, except for letters or documents and gifts up to the value of $100, the Ministry of Communications said in a statement.\nThe scope of impact of the temporary suspension was not immediately clear.\nThis came after the Donald Trump administration on July 30 withdrew the duty-free exemption for goods valued up to $800. The order is to take effect on August 29.\nAs a result, a custom duty will be levied on all postal items entering the US, regardless of their value. Only gifts up to $100 in value will be exempted from the levies.\nThe Indian postal department said on Saturday that while the US Customs and Border Protection agency issued guidelines on August 15, several critical processes relating to the designation of “qualified parties” and mechanisms for the collection of the levies and remittance were undefined.\nAs a result, transport carriers delivering shipments to the US had expressed their inability to accept postal consignments after August 25, citing lack of operational and technical readiness, the department said.\nNew Delhi said that the postal department was “closely monitoring the evolving situation in coordination with all stakeholders” and efforts were being made to normalise services.\nCustomers who have already booked articles that cannot be dispatched to the US because of the uncertainty may seek a refund of postage, said the department of posts."
    },
    {
      "news_title": "European post offices to stop sending some parcels to US over tariffs",
      "news_link": "https://www.politico.eu/article/europes-post-offices-stop-sending-parcels-to-the-u-s/",
      "bias": "Lean Left",
      "text": "Postal services in Europe will stop sending parcels to the United States as new tariffs on the import of goods worth less than $800 kick in at the end of the month.\nU.S. President Donald Trump last month scrapped a long-standing tax exemption on the import of low value goods known as \"de minimis\" from Aug. 29 onwards via an executive order.\nNational post services in France, Spain, Germany and the U.K. have all said they would temporarily suspend their shipment services to the U.S. as of next week to prepare for the new measures. Belgian postal service Bpost already stopped shipping parcels to the U.S. on Friday, the company announced in a statement."
    },
    {
      "news_title": "Small business at risk of closure after NZ Post suspends shipping to US",
      "news_link": "https://www.rnz.co.nz/news/national/570844/small-business-at-risk-of-closure-after-nz-post-suspends-shipping-to-us",
      "bias": "Center",
      "text": "A small Wellington business is fearing for its future after NZ Post suspended shipping to the United States due to tariffs.\nSouth Pacific Berets describes itself as the most specialised beret shop in the world, serving Basque beret enthusiasts globally.\n\"Most of my customers, about 90 percent, live in the US,\" owner Daan Kolthoff said.\n\"I import berets from a number of countries: France, Spain, Italy, Czech Republic, Argentina, they come to New Zealand and from here they go to customers all over the world. There are very little [customers] in New Zealand, by far the most are US customers.\"\nKolthoff said the suspension came without warning.\n\"I found out yesterday trying to send parcels to the US via [NZ Post's] eShip system, but I wasn't able to,\" he explained.\n\"I sent them a message, expecting some fault with the website, but I haven't heard back from them. Then later on I read online an article that shipments to the US had been suspended.\"\nHe would now spend his weekend processing refunds, a difficult prospect for such a niche business.\n\"It's very painful. I have to contact them and refund their money, because I have no idea how long this will take or what sort of increase in cost there will be,\" he said.\n\"I have to cancel a number of orders and make an announcement on the website that US customers for the time being can't place orders with me. It's quite bad for my business.\"\nKolthoff said the lack of communication from NZ Post was concerning.\n\"I look forward to knowing more and being able to inform my customers, and to know where I stand because I can see a worst case scenario of my business coming to an end.\"\nIn a statement to RNZ, NZ Post said it was responding \"with agility\" to make the necessary changes to resume shipping.\n\"Guidance from US Customs & Border Protection was only recently issued and requires a number of changes for both businesses and NZ Post, including updates to shipment data, duty and tax payments, and how goods are processed for entry into the US,\" a spokesperson said.\n\"We've been advised by our main airline partners that due to these new rules they have made the decision they will not be carrying mail items subject to this tariff.\"\nNZ Post said it would continue to provide updates on its website.\nEarlier, on its website, NZ Post said there were some restrictions on what could be sent to the US and US territories. This included suspending a number of services temporarily \"until further notice\", while formal processes around the new US tariffs were being finalised.\nThe suspended services included sending with economy, economy tracked, economy plus, courier and express. Letters sent via economy letters and documents sent via express were the only services still available.\nNZ Post said it expected the suspension would be short term but could not give customers an exact date.\nSign up for Ngā Pitopito Kōrero, a daily newsletter curated by our editors and delivered straight to your inbox every weekday."
    },
    {
      "news_title": "'It's quite bad': Beret shop faces crisis as NZ Post halts US shipments",
      "news_link": "https://www.nzherald.co.nz/nz/wellington-beret-business-hit-by-nz-posts-us-shipping-halt/LYVN6VKG2RGRNLKBRJFJOCJZEU/",
      "bias": "Center",
      "text": "Kolthoff said the suspension came without warning.\n“I found out yesterday trying to send parcels to the US via [NZ Post’s] eShip system, but I wasn’t able to,” he explained.\n“I sent them a message, expecting some fault with the website, but I haven’t heard back from them. Then later on, I read online an article that shipments to the US had been suspended.”\nKolthoff would now spend his weekend processing refunds, a difficult prospect.\n“It’s very painful. I have to contact them and refund their money, because I have no idea how long this will take or what sort of increase in cost there will be,” he said.\n“I have to cancel a number of orders and make an announcement on the website that US customers for the time being can’t place orders with me. It’s quite bad for my business.”\nKolthoff said the lack of communication from NZ Post was concerning.\n“I look forward to knowing more and being able to inform my customers, and to know where I stand because I can see a worst case scenario of my business coming to an end.”\nRNZ has approached NZ Post for comment.\nOn its website, NZ Post said there were some restrictions on what could be sent to the US and US territories. This included suspending a number of services temporarily “until further notice”, while formal processes around the new US tariffs were being finalised.\nThe suspended services included sending with economy, economy tracked, economy plus, courier and express. Letters sent via economy letters and documents sent via express were the only services still available.\nNZ Post said it expected the suspension would be short-term but could not give customers an exact date.\n– RNZ"
    },
    {
      "news_title": "Much of the World Stops Sending Mail to U.S.",
      "news_link": "https://gizmodo.com/much-of-the-world-stops-sending-mail-to-u-s-2000647011",
      "bias": "Lean Left",
      "text": "Do you have a package coming your way from overseas? (I do, it’s a gift, and I’m very annoyed.) Hopefully it’s not urgent, because it’s going to be a minute before that thing gets to our shores. Questions surrounding the Trump administration’s ongoing tariff regime, including a policy to end an exemption from taxing small packages, have resulted in postal services across the world simply choosing not to ship to the United States until things get sorted out, according to Bloomberg.\nCentral to this problem is the de minimis exemption, which allows packages valued at no more than $800 to enter the country without being subject to tariffs. According to the White House, about four million packages that qualify for the policy enter the United States every single day, amounting to more than 1.35 billion per year. Trump has rolled back that policy considerably, setting the new bar at a value of under $100 to enter the country duty-free. Everything else will be subject to the tariffs that apply to the country from where the package is being shipped.\nThat new policy is set to go into effect on August 29, and the rest of the world is throwing up its hands about it. Per Bloomberg, there are still questions as to how the tariffs will be collected and how countries are even supposed to submit the relevant information to US authorities. Instead of dealing with all that, some countries are opting to simply not ship to America for the time being.\nBloomberg reported that Korea’s postal service, Korea Post, will stop sending packages to the US starting Tuesday. Singapore’s SingPost and Austria’s postal provider will do the same, just a day earlier. Norway and Finland are getting an even bigger head start, announcing that they will stop sending packages to America starting on Saturday, and Belgium is halting shipments as of Friday. Deutsche Post in Germany and the Czech Republic’s postal service have already stopped shipping packages state-side due to the confusion. Other countries, including Australia and the United Kingdom, announced temporary suspensions until they get things sorted.\nPresumably, these things will get straightened out, as this pause should be too much of a pain point for the Trump administration to drag this out forever, though it does seem to have a penchant for self-inflicted wounds. But the fact that this whole plan has been applied so haphazardly does not exactly infuse the rest of the world with confidence that things are going to be stable and predictable when doing business with the US.\nMeanwhile, it’ll be low-income Americans hit the hardest by this new policy, per the National Bureau of Economic Research, which found that eliminating the de minimis exemption would increase average tariffs faced by the poorest ZIP codes in the country to about 12%, nearly double the impact on richer ZIP codes. In total, the researchers warn that ditching di minimis will reduce consumer welfare by between $11 billion and $13 billion per year. But hey, that’s a small price to pay for pissing off the whole world to little actual gain."
    },
    {
      "news_title": "German Post Office Halts Package Deliveries To US Over Trump Tariffs",
      "news_link": "https://www.ndtv.com/world-news/german-post-office-halts-package-deliveries-to-us-over-trump-tariffs-9140878#publisher=newsstand",
      "bias": "Lean Right",
      "text": null
    },
    {
      "news_title": "French, German postal services suspend deliveries to US over tariffs",
      "news_link": "https://www.lemonde.fr/en/international/article/2025/08/22/french-german-postal-services-suspend-deliveries-to-united-states-over-tariffs_6744625_4.html",
      "bias": "Lean Left",
      "text": "The postal services of France and Germany announced a raft of restrictions on package deliveries to the United States on Friday, August 22, due to tariffs imposed by President Donald Trump.\nFrance's La Poste told Agence France-Presse it would suspend package deliveries to the US from Monday, except for gifts sent by individuals with a value of less than €100. The new tariff rules had been issued only on August 15, \"leaving European postal services with an extremely limited timeframe to get prepared,\" La Poste said in a statement, adding, \"Related documentation still requires further clarification.\" Each year, La Poste sends an average of 1.6 million packages to the US, 80% from businesses and 20% from individuals.\nDHL, which owns Germany's Deutsche Post service, said that from Saturday it would \"temporarily suspend\" its standard category of US package delivery, the preferred option for many small businesses. \"The reason for the restrictions, which we expect to be temporary, are new processes for postal delivery which have been put in place by the US authorities,\" DHL said in a statement. \"Important questions have not yet been answered, including who will have to pay the tariffs and how.\"\nDHL said a more expensive express service for packages weighing up to 70 kilograms would still be available. Individual customers will also still be able to send items as presents with a maximum value equivalent to $100, but DHL warned that these would be subject to extra checks to prevent the service being used for commercial goods.\nOther European postal services, including in Belgium, Austria and Denmark, have already taken similar measures.\nIn late July, the Trump administration said that as of August 29 it would abolish a tax exemption on small packages entering the US. Such packages with a value of less than $800 will now be taxed at 15%, the same rate as other imports from the European Union. That general tariff rate was agreed under a deal struck between Brussels and Washington late last month."
    },
    {
      "news_title": "German, French post offices restrict packages to US over tariffs",
      "news_link": "https://www.rfi.fr/en/international-news/20250822-german-french-post-offices-restrict-packages-to-us-over-tariffs",
      "bias": "Center",
      "text": "German, French post offices restrict packages to US over tariffs\nBerlin (AFP) – The postal services of Germany and France on Friday announced a raft of restrictions on package deliveries to the United States due to tariffs imposed by President Donald Trump.\nIssued on: Modified:\nDHL, which owns the Deutsche Post service, said that from Saturday it would \"temporarily suspend\" its standard category of US package delivery, the preferred option for many small businesses.\n\"The reason for the restrictions, which we expect to be temporary, are new processes for postal delivery which have been put in place by the US authorities,\" DHL said in a statement.\n\"Important questions have not yet been answered, including who will have to pay the tariffs and how,\" it added.\nFrance's La Poste told AFP it would suspend from Monday package deliveries to the United States, except for gifts sent by individuals with a value of less than 100 euros ($116).\nIt said the new rules had been issued only on August 15, \"leaving European postal services with an extremely limited timeframe to get prepared.\n\"Moreover, their related documentation still requires further clarification,\" La Poste added in a statement.\nEach year the French service sends 1.6 million packages on average to the United States, 80 percent from businesses and 20 percent from individuals.\nExtra checks\nOther European postal services, including in Belgium, Austria and Denmark, have already taken similar measures.\nDHL said a more expensive \"express\" service for packages weighing up to 70 kilograms (154 pounds) would still be available.\nIndividual customers will also still be able to send items as presents with a maximum value of $100 (86 euros) but DHL warned that these would be subject to extra checks to prevent the service being used for commercial goods.\nIn late July the Trump administration said that as of August 29 it would abolish a tax exemption on small packages entering the US.\nSuch packages with a value of less than $800 will now be taxed at 15 percent, the same rate as other imports from the European Union.\nThat general tariff rate was agreed under a deal struck between Brussels and Washington late last month.\nIn April, DHL said it was suspending delivery of packages to the United States with a value in excess of $800.\nIt cited changes to US Customs rules as part of Trump's trade war, which lowered the threshold at which parcels to individuals require formal entry processing by US Customs to $800 from $2,500 -- leading to significant delays.\n© 2025 AFP"
    },
    {
      "news_title": "French, German post offices restrict package deliveries to US due to Trump’s tariffs",
      "news_link": "https://www.france24.com/en/live-news/20250822-german-french-post-offices-restrict-packages-to-us-over-tariffs",
      "bias": "Center",
      "text": "French, German post offices restrict package deliveries to US due to Trump’s tariffs\nFrench and German postal services on Friday announced restrictions on the delivery of packages to the US due to new rules imposed under President Donald Trump's tariff hikes.\nThe postal services of Germany and France on Friday announced a raft of restrictions on package deliveries to the United States due to tariffs imposed by President Donald Trump.\nDHL, which owns the Deutsche Post service, said that from Saturday it would \"temporarily suspend\" its standard category of US package delivery, the preferred option for many small businesses.\n\"The reason for the restrictions, which we expect to be temporary, are new processes for postal delivery which have been put in place by the US authorities,\" DHL said in a statement.\n\"Important questions have not yet been answered, including who will have to pay the tariffs and how,\" it added.\nFrance's La Poste told AFP it would suspend from Monday package deliveries to the United States, except for gifts sent by individuals with a value of less than 100 euros ($116).\nIt said the new rules had been issued only on August 15, \"leaving European postal services with an extremely limited timeframe to get prepared.\n\"Moreover, their related documentation still requires further clarification,\" La Poste added in a statement.\nEach year the French service sends 1.6 million packages on average to the United States, 80 percent from businesses and 20 percent from individuals.\nExtra checks\nOther European postal services, including in Belgium, Austria and Denmark, have already taken similar measures.\nDHL said a more expensive \"express\" service for packages weighing up to 70 kilograms (154 pounds) would still be available.\nIndividual customers will also still be able to send items as presents with a maximum value of $100 (86 euros) but DHL warned that these would be subject to extra checks to prevent the service being used for commercial goods.\nIn late July the Trump administration said that as of August 29 it would abolish a tax exemption on small packages entering the US.\nSuch packages with a value of less than $800 will now be taxed at 15 percent, the same rate as other imports from the European Union.\nThat general tariff rate was agreed under a deal struck between Brussels and Washington late last month.\nIn April, DHL said it was suspending delivery of packages to the United States with a value in excess of $800.\nIt cited changes to US Customs rules as part of Trump's trade war, which lowered the threshold at which parcels to individuals require formal entry processing by US Customs to $800 from $2,500 – leading to significant delays.\n(FRANCE 24 with AFP)"
    },
    {
      "news_title": "Germany’s postal service restricts packages to US over Trump tariffs",
      "news_link": "https://www.straitstimes.com/world/europe/germanys-postal-service-restricts-packages-to-us-over-trump-tariffs",
      "bias": "Lean Right",
      "text": "Germany’s postal service restricts packages to US over Trump tariffs\nSign up now: Get ST's newsletters delivered to your inbox\nFollow topic:\n- DHL will \"temporarily suspend\" standard package delivery to the US from August 23 due to new US tariffs.\n- The tariffs affect packages worth under US$800, now taxed at 15 per cent, like other EU imports.\n- Express delivery and gifts under US$100 are still permitted, though with extra checks by DHL.\nAI generated\nBERLIN - Germany’s postal service announced on Aug 22 a raft of temporary restrictions on package deliveries to the United States due to tariffs imposed by President Donald Trump.\nDHL, which owns the Deutsche Post service, said that from Aug 23 it would “temporarily suspend” its standard category of package delivery to the US, the preferred option for many small businesses.\n“The reason for the restrictions, which we expect to be temporary, are new processes for postal delivery which have been put in place by the US authorities,” DHL said in a statement.\n“Important questions have not yet been answered, including who will have to pay the tariffs and how,” it added.\nOther European postal services, for example in Belgium, Austria and Denmark, have already taken similar measures.\nDHL said a more expensive “express” service for packages will still be available.\nIndividual customers will also still be able to send items as presents with a maximum value of US$100 (S$130) but DHL warned that these would be subject to extra checks to prevent the service being used for commercial goods.\nIn late July, the Trump administration said that as of Aug 29 it would abolish a tax exemption on small packages\nSuch packages with a worth of less than US$800 will now be taxed at 15 per cent, the same rate as other imports from the European Union.\nThat general tariff rate was agreed under a deal struck between Brussels and Washington in late July.\nIn April, DHL announced it was suspending delivery of packages to the US with a value in excess of US$800. AFP"
    },
    {
      "news_title": "DHL joins European peers in pausing many parcel shipments to the US",
      "news_link": "https://www.cnn.com/2025/08/22/business/dhl-us-shipments-de-minimis-intl",
      "bias": "Lean Left",
      "text": "German postal services group DHL said Friday that it would suspend the shipment of standard parcels for businesses to the United States, in line with similar moves by European peers deterred by looming US customs duties for low-value packages.\nUS President Donald Trump’s administration said last month that it would suspend the global “de minimis” exemption, which also allows minimal paperwork, for international shipments under $800, effective August 29.\nEarlier this week, postal groups in Scandinavia, Austria and Belgium said they would pause parcel shipments to the US.\n“The reason for these likely temporary restrictions is new processes required by US authorities for postal shipping,” DHL said.\nAugust 25 will be the last day it takes consignments, but premium delivery service DHL Express will not be affected by the suspension, the company added.\nIt said private customers could continue to send gifts worth less than $100 to the US as a standard parcel but these shipments would be subject to even stricter controls to prevent misuse.\nOn Thursday, Austrian Post said it would no longer take consignments for US-bound standard parcels from next Tuesday.\nThe state-controlled group cited both the scrapping of the “de minimis” exemption and uncertainty over future US postal customs clearance as reasons for its move.\n“This tightening poses major challenges for all postal companies worldwide when sending goods to the USA,” it said.\nSimilarly to DHL, the company added that it would continue to send gifts worth less than $100 to the US via standard parcel and that the suspension would also not apply to its premium service Post Express International."
    },
    {
      "news_title": "La Poste suspends parcel shipments from France to US",
      "news_link": "https://www.thelocal.fr/20250822/la-poste-suspends-parcel-shipments-from-france-to-us",
      "bias": "Lean Left",
      "text": "The French postal service La Poste announced in a press release on Friday that it had been obligated to temporarily suspend the shipping of parcels to the United States, due to changing US customs rules.\nThe suspension is due to come into effect on Monday, August 25th - although there will be an exception for gifts sent between individuals worth less than €100.\nThe change affects only parcels sent via the French postal service - courier companies like FedEx or Chronpost are continuing to make deliveries.\nWhy this change?\nIn the press release, La Poste explained that the change was a result of new US customs rules.\nAt the end of July, the Trump administration announced it would be ending the duty and tax exemption on small parcels from August 29th.\nAs such, postal deliveries worth less than $800 would be subject to the same tax rate as other products imported into the US from the EU, which is expected to be 15 percent (based on the trade agreement reached at the end of July).\nLa Poste said it was \"forced to temporarily suspend parcel shipments to the US, due to incomplete technical specifications and procedures, as well as the extremely short time frame to prepare\".\nThe statement added: \"Despite discussions with US customs officials, no time was given to postal operators to organise and implement the IT developments necessary to comply with the new rules.\n\"La Poste regrets this difficult situation for its customers (...) La Poste is working closely with US authorities and postal federations to resolve this as quickly as possible.\"\nSeveral other European postal services have taken similar measures recently, such as the Belgian, Spanish, Swedish-Danish, German, and Austrian postal services.\nComments"
    },
    {
      "news_title": "Global postal services pause US shipments as end to de minimis rule nears",
      "news_link": "https://www.business-standard.com/world-news/world-postal-services-pause-us-shipments-as-low-value-duty-rule-ends-125082201241_1.html",
      "bias": "Lean Right",
      "text": null
    },
    {
      "news_title": "German post office restricts packages to the US over tariffs",
      "news_link": "https://www.thelocal.de/20250822/german-post-office-restricts-packages-to-the-us-over-tariffs",
      "bias": "Lean Left",
      "text": "DHL, which owns the Deutsche Post service, said that from Saturday it would \"temporarily suspend\" its standard category of package delivery to the US, the preferred option for many small businesses.\n\"The reason for the restrictions, which we expect to be temporary, are new processes for postal delivery which have been put in place by the US authorities,\" DHL said in a statement.\n\"Important questions have not yet been answered, including who will have to pay the tariffs and how,\" it added.\nOther European postal services, for example in Belgium, Austria and Denmark, have already taken similar measures.\nDHL said a more expensive \"express\" service for packages weighing up to 70 kilograms will still be available.\nIndividual customers will also still be able to send items as presents with a maximum value of $100 (86 euros) but DHL warned that these would be subject to extra checks to prevent the service being used for commercial goods.\nIn late July the Trump administration said that as of August 29 it would abolish a tax exemption on small packages entering the US.\nSuch packages with a worth of less than 800 euros will now be taxed at 15 percent, the same rate as other imports from the European Union.\nThat general tariff rate was agreed under a deal struck between Brussels and Washington late last month.\nIn April DHL announced it was suspending delivery of packages to the United States with a value in excess of 800 euros.\nComments"
    },
    {
      "news_title": "MaltaPost suspends all post to US after duty free threshold change",
      "news_link": "https://timesofmalta.com/article/maltapost-suspends-post-us-duty-free-threshold-change.1115065",
      "bias": "Center",
      "text": "Updated 3.18pm\nMaltaPost is temporarily suspending all parcel and goods shipments to the US from Saturday August 23 after the sudden announcement of a US government executive order lifting the duty free threshold for all international shipments.\nIn a statement on Friday, MaltaPost said any final parcels and goods addressed to the US must be deposited at its head office in Marsa between 7am and 10am on Saturday.\nContacted by Times of Malta, Antoinette Camilleri, the head of MaltaPost's corporate office, said that while the company could not disclose the volume of post normally sent to the US, the country was one of the top destinations for mail from Malta.\nLetters or documents for the US are no longer to be deposited in the street post boxes as MaltaPost will be offering a special document/letter express service to the US through its express international service which can only be purchased through a post office.\nThe executive order was issued by US president Donald Trump on August 15 and will come into effect on August 29. It eliminates the existing duty-free threshold for international postal shipments.\nUnder the new policy, all postal items sent to the US, regardless of value or origin, will be subject to customs duties.\nThis change affects individuals and businesses globally, including Maltese customers.\nPartners cargo carriers and airlines have informed MaltaPost they are also suspending the carriage of postal shipments destined for the US “until a workable process is put in place”.\n“The suspension is a temporary and necessary measure to allow for the development, testing, and implementation of new cross-border technical and airline carrier solutions to comply with the new U.S. requirements,” MaltaPost said.\nThey added that postal operators across Europe are “working together to meet these obligations as quickly as possible.”\nHowever, they conceded that “several key implementation details remain unclear” including how US customs imposed duties will be collected and how data must be submitted.\n“Limited technical guidance was only issued by US Customs and Border Protection on August 15, leaving insufficient time for full implementation by the imposed deadline,” MaltaPost said."
    },
    {
      "news_title": "German post office restricts packages to US over tariffs",
      "news_link": "https://www.rte.ie/news/business/2025/0822/1529691-german-post-office-restricts-packages-to-us-over-tariffs/",
      "bias": "Center",
      "text": "Germany's postal service announced today a raft of temporary restrictions on package deliveries to the US due to tariffs imposed by President Donald Trump.\nDHL, which owns the Deutsche Post service, said that from Saturday it would \"temporarily suspend\" its standard category of package delivery to the US, the preferred option for many small businesses.\n\"The reason for the restrictions, which we expect to be temporary, are new processes for postal delivery which have been put in place by the US authorities,\" DHL said in a statement.\n\"Important questions have not yet been answered, including who will have to pay the tariffs and how,\" it added.\nOther European postal services, for example in Belgium, Austria and Denmark, have already taken similar measures.\nDHL said a more expensive \"express\" service for packages weighing up to 70 kilograms will still be available.\nIndividual customers will also still be able to send items as presents with a maximum value of $100 (€86) but DHL warned that these would be subject to extra checks to prevent the service being used for commercial goods.\nIn late July the Trump administration said that as of August 29 it would abolish a tax exemption on small packages entering the US.\nSuch packages with a worth of less than €800 will now be taxed at 15%, the same rate as other imports from the European Union.\nThat general tariff rate was agreed under a deal struck between Brussels and Washington late last month.\nIn April DHL announced it was suspending delivery of packages to the US with a value in excess of €800."
    },
    {
      "news_title": "Mail Services Halt US Deliveries Amid Tariff Rate Confusion",
      "news_link": "https://www.livemint.com/news/us-news/mail-services-halt-us-deliveries-amid-tariff-rate-confusion-11755851537062.html",
      "bias": "Center",
      "text": "Postal services across the world are suspending parcel deliveries to the US as the end of duty-free treatment for low-value packages starting next week sows chaos in global shipping.\nAs of Aug. 29, President Donald Trump is ending the so-called de minimis exemption that has applied to more than 4 million parcels flowing through the US each day, driven largely by e-commerce.\nUnder the new regime, which started with China and Hong Kong in May, goods mailed from other countries will be subject to tariffs and compliance with Customs and Border Protection rules. Verified gifts valued at less than $100 will remain duty-free and American travelers are still allowed to re-enter the country with $200 or less in personal items purchased abroad, according to the White House.\nIn response to the changes, a growing number of national mail services are pausing service to the US as soon as this week, citing a lack of clarity from US authorities on how the duties will be collected and how to submit required data.\nIn Asia, Korea Post said it will halt accepting air parcels and some express mail services to the US starting Tuesday, while keeping premium services, operated via private couriers, available subject to customs duties.\nSimilarly, Singapore’s SingPost will suspend standard services for commercial shipments to America from Monday, with Speedpost’s Express and Direct International Service available to retail and corporate customers, respectively.\nJapan warned of potential delays or returned parcels because of the changes, with authorities vowing to share more information when available.\nEuropean postal services also made adjustments in light of the changes, with several suspending shipments. Norway and Finland’s mail carriers both said their stoppages begin Saturday.\nNo Details\n“Customs duties must be paid before goods can be shipped to the US,” Posti, Finland’s mail service, said on its website. “US Customs has not yet provided details on how the payment process will work. Postal operators in various countries currently lack systems to collect the required customs duties.”\nThe Czech Republic has halted US-bound parcels, while Austria’s postal provider will stop accepting them after Aug. 25, citing the changes. Belgium’s Bpost will reportedly pause shipments from Friday due to regulatory uncertainty.\nThe UK’s Royal Mail plans a brief suspension next week to implement a revised system for handling the newly imposed duties.\nAustralia Post has temporarily suspended its transit service deliveries — a small number of items from third countries sent through Australia to the US, a spokesperson confirmed. However, regular direct deliveries between the two countries will be unaffected.\nThe White House and CBP did not immediately respond to requests for comment.\nThe service interruptions highlight the seismic impact from Trump’s decision to eliminate the de minimis exemption and raise concerns that cheap goods — from China especially — will flood into other economies given the new barriers in the US.\nWashington’s long-standing policy had allowed low-value parcels to flow into the US from around the world with little interruption or oversight, fueled by consumer demand for deals and speed. The White House claims it’s been abused to evade tariffs and funnel illegal drugs.\n‘Real Concern’\nNow, postal services, online sellers, consumers and shipping companies are attempting to sort through the costly and complicated process to comply with US rules with little guidance from federal agencies.\n“It is a real concern that the dominoes are falling and there will be a ripple effect where more and more posts announce that they will be suspending packages to the US,” said Kate Muth, executive director of the International Mailers Advisory Group, which represents the US international mailing and shipping industry.\nOnce the exemption ends, duties will be assessed on US imports shipped by mail based on the country-of-origin tariff rate that Trump imposed using his emergency powers. Alternatively, packages shipped via international post could be assessed with a temporary flat fee of $80 to $200 per item, but only for the next six months.\nCBP outlined in an Aug. 15 bulletin how the flat fees would be calculated, corresponding to the countries’ tariff rates. The agency also offered some additional instruction to shippers on Thursday, when it issued guidance certifying two companies to collect and pay duties on behalf of international mail carriers.\n“It’s obviously very welcomed,” Muth said, “but it’s still a concern that we’re just a week away and we only have the first two approved.”\nThe fallout is extending beyond mail carriers. Starting Aug. 25, online marketplace Etsy Inc. plans to suspend its shipping label service for national mail services in Australia, Canada and the UK for US-bound packages, according to its website.\nThe company suggested that shippers use carriers with services in place that allow them to pay duties before goods arrive in the US, such as United Parcel Service Inc. and FedEx Corp.\nFedEx said it continues to accept and transport shipments to the US and is unaffected by the postal operators’ decisions. UPS had no immediate comment. The US Postal Service didn’t immediately respond to a request for comment.\nWith assistance from Cailley LaPara, Kate Sullivan, Ben Westcott, Heesu Lee, Maho Nambu, Andrea Tan and Heidi Taksdal Skjeseth.\n©2025 Bloomberg L.P.\nThis article was generated from an automated news agency feed without modifications to text.\nStay updated with the latest Trending, India , World and US news. Read the latest updates on the Supreme Court verdict regarding Delhi-NCR stray dog relocation and ongoing protests now on Livemint."
    },
    {
      "news_title": "Trump's New Import Rules Create Ripples: Korea Post Suspends All US-Bound Mail And Parcels, Other Nations Make Similar Moves - (BABA), (AMZN)",
      "news_link": "https://www.benzinga.com/markets/macro-economic-events/25/08/47274082/trumps-new-import-rules-create-ripples-korea-post-suspends-all-us-bound-mail-and-parcels-other-nations-make-similar-moves",
      "bias": "Center",
      "text": "President Donald Trump’s executive order ending duty-free de-minimis exemptions for imports is already triggering fallout overseas, with Korea Post announcing that it will be halting all air parcels bound to the U.S. starting August 25.\nParcels Halted Amid Changes To Customs Policy\nOn Thursday, South Korea’s Ministry of Science and ICT announced that the counter acceptance of U.S.-bound air parcels will be halted from August 25, and all items, except for duty-free documents, will be suspended, starting August 26, according to a report by Yonhap News.\nThis has been attributed to the recent changes in the U.S. Customs policy, which is set to go into effect from August 29. The White House order, issued July 30, suspended the $800 duty-free exemptions that previously allowed low-value goods to enter the U.S. without tariffs.\nSee Also: Walmart Stock Tumbles: CEO Warns Tariffs Are Raising Costs\nAccording to Trump, the move was necessary, “to deal with the unusual and extraordinary threats” to the safety and security of Americans.\nKorea Post notes that the mandatory declaration and customs duties on all U.S.-bound items have led to difficulties in processing shipments for the mail network.\nThe “EMS Premium” product, however, which is operated in partnership with a private company, is still available, with the service handling customs clearance and charging the duties to the recipient.\nKorea Post’s CEO, Cho Hae-geun, says, “Customer uncertainty has increased due to changes in U.S. tariff policy. We will closely monitor related trends and swiftly develop countermeasures to minimize inconvenience to the public.”\neCommerce Giants Brace For Impact\neCommerce companies such as Alibaba Group Holding Ltd. BABA, Amazon.com Inc. AMZN, PDD Holdings Inc. PDD, which is the parent company of Temu and Shein, are all bracing for impact.\nPlatforms such as Shopify Inc. SHOP, Commerce.com Inc. CMRC and Lightspeed Commerce Inc. LSPD, which primarily cater to small online merchants, are also set to see significant headwinds as a result of this move.\n| Stocks | Year-To-Date Performance | Since Liberation Day |\n| Amazon.com Inc. AMZN | +0.79% | +29.75% |\n| Alibaba Group Holding Ltd. BABA | +39.01% | +1.33% |\n| PDD Holdings Inc. PDD | +26.91% | +17.99% |\n| Shopify Inc. SHOP | +27.11% | +77.76% |\n| Commerce.com Inc. CMRC | -26.54% | -16.23% |\n| Lightspeed Commerce Inc. LSPD | -25.54% | +49.10% |\nOther Postal Services Halt Shipments\nBesides Korea Post, Sweden’s PostNord has announced that it will be temporarily pausing shipments containing goods to the United States. “This decision is unfortunate but necessary to ensure full compliance of the newly implemented rules,” says Björn Bergman, Head of Group Brand and Communication for PostNord.\nThe Czech Republic’s postal service announced that it will be stopping shipments to the U.S. until further notice, starting August 21. The U.K.’s Royal Mail, however, plans to halt shipments to the U.S. only for one or two days, as it transitions to a new system to accommodate these changes, according to a report by The Edge Singapore.\nThis was followed by the Austrian Post, which joined its European peers in Scandinavia and Belgium to temporarily pause shipments, according to a Reuters report.\nPhoto Courtesy: Valery Evlakhov on Shutterstock.com\nRead More:\nEdge Rankings\nPrice Trend\n© 2025 Benzinga.com. Benzinga does not provide investment advice. All rights reserved."
    },
    {
      "news_title": "Postal service to halt U.S. shipments over tariff exemption removal",
      "news_link": "https://en.yna.co.kr/view/AEN20250821010200315",
      "bias": "Lean Right",
      "text": "Postal service to halt U.S. shipments over tariff exemption removal\nSEOUL, Aug. 21 (Yonhap) -- The national postal service said Thursday it will stop accepting packages bound for the United States starting next week in line with a U.S. suspension of a duty-free policy for international shipments.\nThe move comes as the U.S. is set to end the so-called de minimis exemption, under which low-cost parcels from overseas valued at US$800 or less can be shipped to the country without tariffs. All international shipments will face a 15 percent tariff starting Aug. 29.\nThe postal service will stop receiving U.S.-bound air freight packages starting Monday and all parcels shipped via the Express Mail Service (EMS) starting Tuesday. The move does not affect shipments of documents and correspondence.\nCustomers will still be able to send packages to the U.S. via the premium EMS service, which imposes tariffs on the recipient.\nThe postal service vowed to draw up measures to minimize customer inconvenience and urged people planning to send parcels to the U.S. to thoroughly prepare necessary shipping documents.\nmlee@yna.co.kr\n(END)\n-\nPark Chan-wook finds dark humor in man's predicament in 'No Other Choice'\n-\n'KPop Demon Hunters' director on how 'shame' powers Netflix's record-breaking hit\n-\nLAFC coach, teammates gush over Son Heung-min following victory\n-\nJungkook's 'Seven' becomes 1st K-pop song to garner 2.5 bln streams on Spotify\n-\nBTS' V to throw first pitch at Dodger Stadium next Monday\n-\nPark Chan-wook finds dark humor in man's predicament in 'No Other Choice'\n-\n'KPop Demon Hunters' director on how 'shame' powers Netflix's record-breaking hit\n-\nLAFC coach, teammates gush over Son Heung-min following victory\n-\nN. Korea continues to attract Russian tourists to Wonsan beach resort\n-\nTrump may want success in summit with Lee after no-deal meeting with Putin: expert\n-\nN. Korea continues to attract Russian tourists to Wonsan beach resort\n-\nUSFK says S. Korea-U.S. combined drills 'far from aggression' following N.K. criticism\n-\n(2nd LD) N. Korea berates S. Korea for firing warning shots at its troops in border area this week\n-\nLee set to embark on key diplomatic trip for high-stakes summits with Trump, Ishiba\n-\n(LEAD) N. Korea berates S. Korea for firing warning shots at its troops in border area this week"
    },
    {
      "news_title": "Australia Post halts transit shipping to US as global carriers face 'chaos'",
      "news_link": "https://www.abc.net.au/news/2025-08-21/australia-post-suspends-transit-shipping-parcels-us-trump-tariff/105680456",
      "bias": "Lean Left",
      "text": "Australia Post halts transit shipping to US as 'chaotic' Trump tariff deadline looms\nIn short:\nAustralia Post has temporarily suspended transit shipping to the US ahead of new tariffs due to come into effect next week.\nGlobal postal carriers have described a \"chaotic\" environment as some European services halt US shipments altogether.\nWhat's next?\nFrom August 29, low-value parcels imported into the US will attract tariffs or flat fees.\nAustralia Post is suspending some forms of shipping to the United States as a Trump administration tariff deadline creates \"chaos\" for postal networks and retailers globally.\nThe development means goods from other countries will no longer be able to be shipped to the US via Australia, a method known as \"transit\" shipping.\n\"In line with a number of other postal operators, Australia Post has temporarily suspended its transit service to the US and will no longer accept transit items containing goods destined for the United States of America,\"an Australia Post spokesperson said.\nAustralia Post's suspension comes as low-value goods imported into the US face additional tariffs from next week.\nUntil now, parcels of goods from Australia worth less than $US800 ($1,200) were not taxed when they arrived in the US, under what was known as the \"de minimis\" exemption.\nThe tax exemption is due to end on August 29 for imports from all countries globally, with parcels to be slugged with tariffs or flat fees.\n'Chaotic' moment for global postal services\nThe decision — formalised in an executive order on July 30 — has caught many postal operators globally off guard.\nKate Muth, who leads the US-based trade association, International Mailers Advisory Group (IMAG), said many of its members are confused about how to collect the duties set to come into play from next week.\n\"It's a bit chaotic here,\" she told ABC News from Washington, DC.\n\"A lot of uncertainty, a lot of concern about the postal stream being heavily impacted, and just a little over a week to get ready.\"\nAustralia Post is one of the global postal carriers that has elected to suspend transit mail to the US as it grapples with changes.\n\"[Transit mail] is where a postal operator in one country will use the services of another postal operator to send it on to the final destination,\" Ms Muth explained.\n\"For example, maybe the Philippines post uses Australia Post to send mail to the United States because Philippines has low volumes or infrequent flights.\"\nThe government-owned entity has not confirmed how many nations use Australia for transit mail, or what volume it handles for other countries, ultimately destined for the US.\nUncertainty around collection of tariffs\nABC News has sighted an \"emergency information\" letter from the United Nations' specialised postal agency informing members globally about Australia Post's decision.\n\"This measure will take effect on 20 August 2025,\" the letter read.\n\"Any transit or misrouted items containing goods that are destined for the United States and arrive at Australia Post's international mail processing centres will be returned to origin.\"\nThe uncertainty with postage has also created chaos for Australian e-commerce retailers, with one Brisbane based brand, Apéro, deciding to halt shipping to the US this week.\n\"The volatility in decision making, and the volatility of the market, and, quite frankly, the lack of ability of even Australia Post to be able to address these issues in a timely manner, puts us, and all of Australian fashion, in a really precarious position,\" Apéro co-founder Laz Smith told ABC News this week.\n\"We're just trying to react as quickly as we can.\"\nIMAG's Ms Muth said the overarching concern is that many postal carriers are not set up to \"collect and remit\" the duties specified by Donald Trump's executive order.\n\"Australian Post is not set up to do that … they obviously have to work with either an airline carrier who is willing to do [this], and we have not heard of any airline carrier that's willing to,\" she said.\nSeveral postal carriers globally have already gone one step further ahead of August 29 and suspended shipping to the US entirely.\nThey include Bpost — a logistics company based in Brussels — and several others in Europe.\nPostNord — which services Sweden and Denmark — has additionally axed shipments to Puerto Rico.\n\"Letters without goods will not be affected,\" PostNord's announcement said. \"Customers and partners will be kept updated and informed.\"\nAustralia Post would not confirm whether it is poised to halt US shipments entirely.\n\"Our priority is to keep our customers updated on the changes and what they mean for them,\"the spokesperson said.\nAustralia Post has sent updates to merchant retailers and uploaded information about the end of de minimis on its website.\n\"Australia Post is investigating paying duties and taxes through an approved third-party platform provider on behalf of our merchants,\" it wrote to merchants on Monday.\n\"These duties and taxes, including a handling fee, would be retrospectively charged to our merchant senders.\""
    },
    {
      "news_title": "Parts of Europe are suspending postal shipments to the US — and your order may not arrive",
      "news_link": "https://www.businessinsider.com/some-european-postal-services-sellers-are-suspending-us-bound-shipments-2025-8",
      "bias": "Lean Left",
      "text": "- Norway, Sweden, Denmark, and Belgium will halt parcel shipments to the US starting August 23.\n- The operators lack mechanisms to manage the payment of duties without the de minimis exemption.\n- Etsy suspended US-bound shipping labels with operators that cannot support prepaid duties.\nIf you have been eyeing something from overseas, you may want to click \"buy now\" today.\nPostal services operated by Norway, Sweden, Denmark, and Belgium — Posten Bring, PostNord, and bpost — said they will suspend parcel shipments to the US ahead of the end of a customs exemption that allows low-value packages to enter the country duty-free.\nThe conundrum facing postal operators comes as the Trump administration prepares to suspend the \"de minimis\" exemption starting on August 29. The exemption used to allow international shipments under $800 to cross the border with minimal paperwork and no duties.\nNow, these shipments will face tariffs, and not every operator can handle the customs declaration paperwork, have a payment mechanism in place, or be responsible for returns should a receiver refuse to pay tariffs. It's unclear when the temporary freeze on shipments will resume.\n\"Due to the short timeframe to adapt to the new specific requirements, PostNord will temporarily halt shipments to the United States and Puerto Rico until a compliant solution has been developed and implemented,\" wrote the operator owned by the Swedish and Danish governments in a statement on Wednesday.\nSeparately, Posten Bring, Norway's primary postal provider operated by the government, said in a statement that postal services have not been given clear instructions and solutions on how the duties will be paid or who would be responsible for returns. Therefore, Posten Bring sees suspension as the \"only option.\"\nAll three European postal services will suspend shipments starting August 23, which applies to all packages other than letters. This means that if you have a pending purchase that is not shipped by the deadline, your seller may need to cancel your order or arrange alternatives.\nBut even if you're not purchasing from these specific European countries, your shopping options might still dwindle and become more costly.\nEtsy, the US e-commerce giant and a hub for independent crafters, posted a notice Wednesday that shipping label purchases for Australia Post, Canada Post, Evri, and Royal Mail for US-bound packages will be temporarily suspended starting August 25.\nEtsy wrote in a statement that these operators are unable to support prepaid duties at the moment, which may result in a large number of rejected packages due to unpaid duties and surprise costs for buyers not listed at checkout.\nAcross social media platforms, many independent sellers based in the UK are also announcing that they can no longer support orders to the US, citing the introduction of an $80 flat fee plus handling charges for using Royal Mail to ship parcels to the US.\n\"We hope to resume shipping as soon as we can, but we really don't want our customers to be hit with an $80+ fee,\" wrote the Citrine Circle, a UK-based crystal shop, on Instagram. \"It feels like the world is getting smaller and smaller.\"\nThe White House did not immediately respond to a request for comment."
    },
    {
      "news_title": "Nordic, Belgian Postal Operators Pause Shipments to US as Trump Ends Parcel Tariff Relief",
      "news_link": "https://money.usnews.com/investing/news/articles/2025-08-20/nordic-postal-operators-pause-shipments-to-the-u-s-as-trump-ends-parcel-tariff-relief",
      "bias": "Lean Left",
      "text": null
    },
    {
      "news_title": "India Quickly Suspends Mail Providers Following Trump’s Tariff Hike",
      "news_link": "https://todayworldnews.in/2025/08/23/india-quickly-suspends-mail-providers-following-trumps-tariff-hike/",
      "bias": "unknown",
      "text": "Starting August 25, the Postal Division will droop the reserving and dispatch of mail to the USA, apart from paperwork and present parcels price as much as $100.\nGovernment Order No. 14324 ended the de minimis rule that beforehand allowed items valued underneath USD 800 to enter the U.S. duty-free.\nFollowing this alteration, carriers transporting consignments to the U.S. knowledgeable Indian authorities that they can’t deal with postal shipments owing to the absence of a correct system for customs obligation assortment and knowledge sharing.\n(Extra particulars awaited)"
    },
    {
      "news_title": "DHL restricts parcel services from Germany to US over tariffs",
      "news_link": "https://www.dailyfinland.fi/europe/44812/DHL-restricts-parcel-services-from-Germany-to-US-over-tariffs",
      "bias": "unknown",
      "text": "DHL restricts parcel services from Germany to US over tariffs\nPublished : 22 Aug 2025, 21:44\nGlobal logistics giant DHL is restricting parcel services from Germany to the United States due to new tariff regulations imposed by the Trump administration, the Germany-based company said on Friday, reported dpa.\nFor the time being, parcels posted in Germany and destined for the US will only be delivered if they are declared as gifts and if their value does not exceed $100, DHL said at its headquarters in Bonn.\nStarting Saturday, private customers may continue to send more valuable packages to the US via DHL's more expensive express mail service, while business customers will be allowed to do so from next Tuesday.\nIt comes as the US is set to abolish duty-free imports of goods worth less than $800 from August 29, as per an executive order issued by US President Donald Trump.\nCustoms duties of between $80 and $200 will be levied on each item.\n\"The majority of private customer parcels to the US are below the $100 threshold anyway, so private customers are relatively unaffected by the new regulations,\" a DHL spokesman said, stressing that the restrictions are expected to be temporary.\nHowever, it remained initially unclear how long the new rules will be in place.\nOther European postal services, including in Austria, Sweden and Belgium, have also changed their regulations for parcel services to the US in recent days in light of the planned customs changes.\nDHL noted that key issues regarding the new rules remain unresolved: \"in particular how and from whom customs duties are to be collected in future, what additional data is required and how data is to be transferred to the US customs authorities.\""
    },
    {
      "news_title": "Global Postal Services Pause U.S. Deliveries Amid New Tariff Regulations - The Global Herald",
      "news_link": "https://theglobalherald.com/news/global-postal-services-pause-u-s-deliveries-amid-new-tariff-regulations/",
      "bias": "unknown",
      "text": "Table of Contents\nIntroduction\nInternational postal services are temporarily halting their deliveries to the United States due to uncertainties stemming from newly imposed import taxes, effective at the end of this month.\nDetails on New Tariffs\nRecently, an executive order was enacted by U.S. President Donald Trump, which eliminates the blanket exemption previously offered for low-value imports. This new regulation will come into play on August 29.\nImpact of the Tariff Changes\n- Packages valued under $100 will remain exempt from duties.\n- All other parcels will now incur tariffs equal to those imposed on similar goods from their countries of origin.\nDue to these changes, postal companies, including Royal Mail and Deutsche Post DHL, have announced a suspension of their U.S. delivery services. They have stated that they require additional time to implement systems that comply with the new guidelines.\nResponse from Postal Services\nRoyal Mail has announced that it will terminate its current export services to the U.S. starting Tuesday, with the aspiration of having an updated system operational within two days to align with the new regulations.\nAccording to a Royal Mail spokesperson, “Royal Mail is working closely with the U.S. authorities and international partners to manage the impact of these changes which will affect everyone who sends goods to the USA.”\nInternational Reactions\nOther postal operators like Deutsche Post and DHL Parcel Germany have declared a suspension of shipments intended for U.S. business clients, citing that significant questions over duty payment processes remain unresolved.\nWhile DHL is “closely monitoring the further developments,” they emphasized that their express delivery services to the U.S. are still operational.\nConcerns and Observations\nVarious postal services including PostNord have also ceased shipments, with PostNord’s communications head, Bjorn Bergman, stating, “This decision is unfortunate but necessary to ensure full compliance with the newly implemented rules.”\nAdditionally, the online marketplace Etsy indicated they will stop offering shipping label purchases starting August 25 for certain services as courier companies adjust to these new measures.\nConclusion\nThis new tariff regulation reflects a broader change in import policy that is expected to impact various sectors, especially those relying on international shipping. As postal services work to adapt to these changes, businesses and consumers alike are encouraged to stay informed about the evolving situation."
    },
    {
      "news_title": "Post Office suspends service for sending goods to the USA in light of tariffs",
      "news_link": "https://www.manxradio.com/news/isle-of-man-news/post-office-suspends-service-for-sending-goods-to-the-usa-in-light-of-tariffs/",
      "bias": "unknown",
      "text": "United States Government removes ‘de-minimis’ postal exemption\nThe Isle of Man Post Office says, from tomorrow, it will suspend services for sending goods to the USA. (23 August)\nIt follows a recent decision by the United States Government to remove the ‘de-minimis’ postal exemption, which previously allowed goods valued under $800 to enter without import duty.\nFrom 29 August, tariffs will apply to all goods sent to the USA.\nItems sent tomorrow or thereafter will be returned to sender.\nMeanwhile, goods sent up to and including today (22 August) are expected to be delivered as normal.\nThe Post Office's partner, Royal Mail, is said to be working towards a solution to restore services.\nHowever, it says it cannot be certain that this will be in place before the new rules take effect.\nLetters and correspondence are unaffected and can continue to be sent as usual.\nIsle of Man Post Office will provide any further updates HERE."
    },
    {
      "news_title": "DHL: Temporary restrictions on postal goods shipping to the US for private/business customers - The Loadstar",
      "news_link": "https://theloadstar.com/dhl-temporary-restrictions-on-postal-goods-shipping-to-the-us-for-private-business-customers/",
      "bias": "unknown",
      "text": "This site uses cookies and other tracking technologies to assist with navigation and your ability to provide feedback, analyse your use of our products and services, assist with our promotional and marketing efforts, and provide content from third parties. Find out more.Manage Cookies\nComment on this article"
    },
    {
      "news_title": "Mail services around the world halt US deliveries ahead of de minimis end",
      "news_link": "https://www.businesstimes.com.sg/international/global/mail-services-around-world-halt-us-deliveries-ahead-de-minimis-end",
      "bias": "unknown",
      "text": "Mail services around the world halt US deliveries ahead of de minimis end\nPOSTAL services across the world are cutting off parcel deliveries to the US as the fast-approaching end of a tariff exception for low-value packages sows chaos in global shipping.\nAs at Aug 29, President Donald Trump is ending the so-called de minimis exemption that has applied to more than four million parcels processed by US Customs and Border Protection each day.\nIn response, a growing number of national mail services plan to temporarily suspend service to the US as soon as this week, citing a lack of clarity from American authorities on how the duties will be collected and how to submit required data.\nThe Czech Republic’s postal service will suspend US goods shipments until further notice starting on Thursday, according to its website. Austria’s post provider will no longer accept packages bound for the US after Aug 25, citing the changes to US customs rules.\n“There is currently insufficient information available about the customs clearance procedures that will be required in future,” Austrian Post said in a statement. “This tightening of the rules poses major challenges for all postal companies worldwide when shipping goods to the USA.”\nBelgium’s Bpost said it will temporarily stop sending parcels to the US starting Friday due to uncertainty surrounding the new US rules for international shipments, according to newspaper Het Laatste Nieuws.\nBT in your inbox\nStart and end each day with the latest news stories and analyses delivered straight to your inbox.\nThe UK’s Royal Mail meanwhile plans to suspend US shipments for one to two days next week as it transitions to a new system to allow shippers to pay the newly-imposed duties, according to its website.\nAustralia Post has temporarily suspended its transit service deliveries – a small number of items from third countries sent through Australia to the US – a spokesperson confirmed. However, regular deliveries directly from Australia to the US by consumers and businesses will be unaffected.\n“The United States Government recently announced significant changes to its import tariff rules that will impact customers sending items from Australia to the US,” the spokesperson said in an emailed statement. “This is moving very quickly, and we are working at speed and around the clock to find a solution for our customers.”\nThe White House and CBP did not immediately respond to requests for comment.\nThe service interruptions highlight the seismic impact from Trump’s decision to eliminate the de minimis exemption.\nThe policy had allowed low-value parcels to flow into the US from around the world with little interruption. Now, postal services, online sellers, consumers and shipping companies are attempting to sort through the costly and complicated process to comply with US rules with little guidance from federal agencies.\n“It is a real concern that the dominoes are falling and there will be a ripple effect where more and more posts announce that they will be suspending packages to the US,” said Kate Muth, executive director of the International Mailers Advisory Group, which represents the US international mailing and shipping industry.\nOnce the exemption ends, duties will be assessed on US imports shipped by mail based on the country-of-origin tariff rate that Trump imposed using his emergency powers. Alternatively, packages shipped via international post could be assessed with a temporary flat fee of US$80 to US$200 per item, but only for the next six months.\nCBP outlined in an Aug 15 bulletin how the flat fees would be calculated, corresponding to the countries’ tariff rates. The agency also offered some additional instruction to shippers on Thursday, when it issued guidance certifying two companies to collect and pay duties on behalf of international mail carriers.\n“It’s obviously very welcomed,” Muth said, “but it’s still a concern that we’re just a week away and we only have the first two approved.”\nThe fallout is extending beyond mail carriers. Starting Aug 25, online marketplace Etsy Inc. plans to suspend its shipping label service for national mail services in Australia, Canada and the UK for US-bound packages, according to its website.\nThe company suggested that shippers use carriers with services in place that allow them to pay duties before goods arrive in the US, such as United Parcel Service Inc and FedEx Corp.\nFedEx said it continues to accept and transport shipments to the US and is unaffected by the postal operators’ decisions. UPS had no immediate comment. The US Postal Service didn’t immediately respond to a request for comment. BLOOMBERG\nShare with us your feedback on BT's products and services\nmore in Global\nTrump says Intel has agreed to a deal for US to take 10% equity stake\nAug 23, 2025 07:23 AM\nAI hiring thaw helps relieve tech talent glut in China\nAug 23, 2025 06:47 AM\nUS Fed’s Powell, citing jobs risk, opens door to cuts but doesn’t commit\nAug 22, 2025 10:16 PM\nTikTok UK shifts to AI moderation, hundreds of jobs at risk\nAug 22, 2025 10:12 PM\nChina’s big cities offer rent-free industrial parks in battle to lure startups\nAug 22, 2025 05:16 PM\nChina loosens foreign capital curbs for some green projects\nAug 22, 2025 05:16 PM\nChina struggles to end deflation with 2015 playbook out of reach\nAug 22, 2025 11:15 AM\nJapan’s inflation hovers well above BOJ’s goal even as it slows\nAug 22, 2025 09:31 AM"
    },
    {
      "news_title": "Trump's New Import Rules Create Ripples: Korea Post Suspends All US-Bound Mail And Parcels, Other Nations Make Similar Moves",
      "news_link": "https://biztoc.com/x/8cd9493fa59d3c13",
      "bias": "unknown",
      "text": "Why did the US take a 10% stake in Intel?\nHow did Powell's speech impact stock markets?\nWhat caused Cracker Barrel's stock to drop?\nWhy are new tariffs planned on imported furniture?\nHow are European postal services responding to US tariffs?\nWhy is Tesla's Cybertruck sales strategy changing?\nWhat led to layoffs at Paramount Pictures?\nTrump's New Import Rules Create Ripples: Korea Post Suspends All US-Bound Mail And Parcels, Other Nations Make Similar Moves\nbenzinga.com/markets/macro-economic-events/25/08/47274082/trumps-new-import-rules-create-ripples-korea-post-suspends-all-us-bound-mail-and-pa\nPresident Donald Trump’s executive order ending duty-free de-minimis exemptions for imports is already triggering fallout overseas, with Korea Post announcing that it will be halting all air parcels bound to the U.S. starting August 25.\nParcels Halted Amid Changes To Customs Policy\nOn…\nThis story appeared on benzinga.com, 2025-08-22 02:40:16."
    },
    {
      "news_title": "Korea Post suspends most U.S.-bound packages as tariffs rise",
      "news_link": "https://koreajoongangdaily.joins.com/news/2025-08-22/national/socialAffairs/Korea-Post-suspends-most-USbound-packages-as-tariffs-rise/2381553",
      "bias": "unknown",
      "text": "Korea Post suspends most U.S.-bound packages as tariffs rise\nPublished: 22 Aug. 2025, 08:38\nUpdated: 22 Aug. 2025, 14:40\nKorean post offices will stop accepting most parcels bound for the United States next week as Washington ends its duty-free treatment of low-value imports.\nKorea Post, under the Ministry of Science and ICT, said Thursday that it will suspend air mail to the United States starting Monday. Express mail service (EMS) packages, with the exception of documents that are not subject to tariffs, will halt Tuesday.\nThe move comes ahead of a new U.S. policy set to take effect at midnight on Friday. For years, goods valued under $800 entered the U.S. tariff-free through international mail. Under the new rule, all incoming postal items — except letters and documents — must be declared and face a 15 percent tariff.\nUntil now, the U.S. government had waived tariffs on goods valued under $800 imported through international mail. However, starting Friday, all international postal items bound for the United States — excluding documents and letters — must be declared and will be subject to a 15 percent tariff.\nThis change stems from a presidential executive order signed on July 30 eliminating the $800 de minimis exemption, which the U.S. administration believes has become a conduit for smuggling narcotics and counterfeit goods.\nThe current international postal network cannot support the processing of mandatory customs declarations and tariff payments for all items, prompting the suspension, according to Korea Post.\nAs an alternative, Korea Post recommended the EMS Premium service operated by private courier companies. Under EMS Premium, the logistics provider handles customs clearance, and tariffs are paid by the recipient. The service may be more cost-effective for packages heavier than 4.5 kilograms (9.9 pounds), but delivery fees for lighter items may be higher.\nKorea Post said it will devise further measures to minimize inconvenience to the public. However, it remains uncertain when customs declaration and tariff systems can be integrated into the existing international postal network.\nThe agency also advised customers planning to send items to the United States to accurately declare the value and purpose of the goods and prepare necessary customs documents such as invoices.\nThis article was originally written in Korean and translated by a bilingual reporter with the help of generative AI tools. It was then edited by a native English-speaking editor. All AI-assisted translations are reviewed and refined by our newsroom.\nBY KIM NAM-YOUNG [[email protected]]\nwith the Korea JoongAng Daily\nTo write comments, please log in to one of the accounts.\nStandards Board Policy (0/250자)"
    },
    {
      "news_title": "Austrian Post says new US regulations \"poses major challenges for all postal companies worldwide\" | Post & Parcel",
      "news_link": "https://postandparcel.info/159864/news/e-commerce/austrian-post-says-new-us-regulations-poses-major-challenges-for-all-postal-companies-worldwide/",
      "bias": "unknown",
      "text": "Austrian Post says new US regulations “poses major challenges for all postal companies worldwide”\nAs of August 26, Austrian Post will no longer be able to accept shipments containing goods for the USA (including Puerto Rico) until further notice. The last day for the task is therefore Monday, August 25. The reason for this is changes in customs regulations in the USA. The regulation that goods with a value of less than 800 US dollars may be imported into the USA duty-free and tax-free has been abolished.\nAt the same time, the processes of postal customs clearance have been changed and there is currently insufficient information about the customs clearance procedures that will be necessary in the future. This tightening poses major challenges for all postal companies worldwide when shipping goods to the USA.\nExcluded from this regulation are gift shipments from private individuals with a value of less than 100 US dollars, which are also marked as gifts; Document consignments are not affected by these regulations and can be sent to the USA via Austrian Post as usual.\nThe only option at present for customers is to continue to send other consignments of goods to the USA with the “Post Express International” product, as these consignments are subject to a different method of handling.\nAAustrian"
    },
    {
      "news_title": "International Postal Services Scramble To Sort Out Tariffs & End Of De Minimis, With Some Pausing US Shipments",
      "news_link": "https://www.valueaddedresource.net/international-postal-services-de-minimis-pause-us-shipments/",
      "bias": "unknown",
      "text": "International Postal Services Scramble To Sort Out Tariffs & End Of De Minimis, With Some Pausing US Shipments\nUPDATE 8-22-25\nUS Customs & Border Protection has approved Zonos and SafePackage as qualified 3rd party solutions for collecting & paying duties on international shipments ahead of end of de minimis exemption.\nCBP has also updated their Frequently Asked Questions for ecommerce shippers:\nInternational postal services are scrambling to catch up with the latest changes to tariffs and the end of the duty-free de minimis exemption for low value packages with some temporarily pausing shipments into the US as a result.\nAfter President Trump signed an executive order moving up the end of the de minimis exemption to August 29, 2025, US Customs and Border Protection has issued new guidance about how incoming international postal shipments will be processed - including putting the burden of collecting duties and taxes for shipments which no longer have de minimis exemption on to the international postal services directly.\nPostal Service Suspensions Of Shipments To US\nAugust 20\nOmniva Estonia: \"Due to newly imposed customs duties by the United States, Omniva will temporarily suspend the delivery of parcels containing goods to the USA starting from August 20. Omniva will resume parcel shipments to the USA as soon as possible.\"\nAugust 22\nLithuanian Post: \"starting tomorrow, August 22, 2025, all shipments to the United States of America for both business and private customers will be temporarily suspended.\"\nDeutsche Post and DHL Parcel Germany: \"After August 22, Deutsche Post and DHL Parcel Germany will temporarily suspend the acceptance and transport of business customer parcels via the postal network to the U.S. Shipping via DHL Express remains possible.\"\n\"Packages and parcels that contain only gifts from individuals to individuals with a value of up to $100 and are declared as \"gift,\" as well as documents, can continue to be sent as usual.\"\nNZ Post New Zealand: \"There are some restrictions when sending to the United States and US territories...while formal processes around the new US tariffs, duties and taxes are being finalised...Our online labelling tools will be disabled for impacted services from 5pm, 22 August. We expect that this suspension will be short term.\"\nCzech Post: \"For Czech Post customers, this means that from August 22, 2025 until further notice, the reception of shipments to the USA containing goods, regardless of their value, will be suspended.\"\nAugust 23\nLatvian Post: \"From August 23, 2025, the Latvian Post will be forced to indefinitely stop accepting shipments containing items, or small packages and parcels, for delivery to the United States of America (USA). This is due to the executive order issued by US President Donald Trump to suspend the duty-free “de minimis” regime for all countries. \"Latvijas Pasts\" will continue to deliver letter correspondence, including documents, to the USA.\"\nPostNord: \"PostNord announces the temporary pause on postal shipments containing goods to the United States and Puerto Rico, effective from August 23, following a recent change in the customs and tariffs rules for the U.S., eliminating the De Minimis exemption for inbound goods.\"\nPosten Bring: \"On July 30, the Trump administration removed the duty and tax exemption for shipments with a value of less than 800 USD (just over 8,000 Norwegian kroner) with effect from August 29. As a consequence, it will not be possible to send this type of shipment to the United States, or Puerto Rico, which is a US territory, from Saturday, August 23.\"\nbpost: \"bpost announces the temporary pause on postal shipments containing goods to the United States, effective from August 23, following a recent change in the customs and tariffs rules for the U.S., eliminating the De Minimis exemption for inbound goods.\"\nPostNL Netherlands: \"US Customs is not sufficiently prepared to implement the new legislation. Therefore, starting tomorrow, August 23, it will no longer be possible to ship parcels and packages to the United States for the time being. We are currently working intensively on a new solution.\"\nPoste Italiane Italy: \"Poste Italiane will be forced, like other European postal operators, to temporarily suspend acceptance of all shipments containing goods destined for the United States, starting August 23.\"\nAugust 25\nFrance La Poste: will suspend parcel shipments to the United States as of August 25, with the exception of gifts between individuals worth less than €100. This decision was taken in response to the new US customs procedures introduced by the Trump administration.\nAustrian Post: \"As of August 26, Austrian Post will no longer be able to accept shipments containing goods for the USA (including Puerto Rico) until further notice. The last day for posting is therefore Monday, August 25. This is due to changes in customs regulations in the USA.\"\nKorea Post: \"The Korea Post of the Ministry of Science and ICT announced on the 21st that, starting from the 25th, it will stop accepting all items except documents exempt from tariffs for international air parcels to the U.S. and will cease accepting mail on the 26th.\"\nPolish Post Office: \"As of Monday, August 25, the Polish Post Office is temporarily limiting the acceptance of shipments containing goods destined for the United States. This decision was necessitated by restrictions imposed by the US government and air carriers, which prevent deliveries.\"\nCorreos Spain: \"The suspension, which affects package shipments with a commercial value equal to or less than $800, will take effect on August 25. The suspension will remain in effect for the time strictly necessary to adopt the necessary operational measures to meet the new obligations of the United States executive order that eliminates the tariff exemption for low-value shipments.\"\nUnconfirmed\nAustralia Post: Australian news outlets are reporting Australia Post has halted US shipments as of August 20th, but Australia Post has not confirmed this and their website still only says:\n\"18 August 2025: The United States recently announced significant changes to its import tariff rules that will take effect from 29 August 2025 and impact Postal customers sending items from Australia to the US. We are actively monitoring for any developments and will continue to provide timely updates as more information becomes available.\"\nRoyal Mail in the UK is advising shippers they are \"working closely with the US authorities and international partners to manage the impact of these changes\" and will be introducing a PDDP (Postal Delivered Duties Paid) service for account customers to use when exporting to the USA.\nWhat does this mean for UK customers exporting goods to the USA?\nIf you only send personal correspondence to the USA, you are not affected by these changes and can continue to send these items to the USA, without a customs declaration.If you ship goods to the USA and currently complete a customs declaration, we understand that the following changes will apply on the 29th of August 2025:\n- Senders in the UK will have to calculate, collect (or account for) duties at the point of sale. You may want to consider doing this by integrating a ‘landed cost calculator’ at your online checkout to calculate ‘landed cost’ (taxes and duties). Landed cost calculators can also collect those taxes and duties. The duties are then payable to US Customs in advance of items entering the USA.\n- Decide how you will account for these duties with your customers (e.g., you can choose to pass the cost of duties on to your customers or absorb it) and ensure your customs data is accurate.\n- We understand that the required duties for UK postal shipments will be based on an item’s value and the country-based tariff (country of manufacture rather than country of shipping).\nHow will Royal Mail support customers with these changes?\nRoyal Mail is working closely with the US authorities and international partners to manage the impact of these changes which will affect everyone who sends goods to the USA.\n- To enable you to continue to export goods to the USA, Royal Mail will be introducing a PDDP (Postal Delivered Duties Paid) service for account customers to use when exporting to the USA.\n- This is an extension of our Royal Mail PDDP services, which are currently in use to some EU destinations. This will allow continued ‘postal clearance’ into the USA with the same labelling, tracking and customer notifications. This will replace existing services and support compliance with the new requirements.\n- Our shipping platforms will be updated to capture necessary data to comply with the new requirements (much of which you already provide).\nCanada Post has still not issued any official statements about how they plan to navigate the situation, with alarming reports that Canadian business owners who have called Canada Post for more information are being hung up on according to Etsy seller and ecommerce consultant Cindy Baldassi.\nMarketplaces\nEtsy\nEtsy has advised sellers that they are suspending shipping label purchases from the platform for Australia Post, Canada Post, Everi and Royal Mail for US-bound packages, effective August 25th.\nGiven recent changes to tariffs in the US, many postal providers will be suspending service or changing delivery options to the US. In light of this, effective August 25, Etsy will be suspending shipping label purchases on Etsy for Australia Post, Canada Post, Evri and Royal Mail for US-bound packages.\nWe are in close contact with these carriers and will reactivate label offerings on Etsy when they are able to support orders into the US with DDP options.\nSellers are advised to keep an eye on Etsy's Seller Handbook for additional updates and will need to make their own shipping arrangements with Delivery Duties Paid (DDP) or stop selling to the US until Etsy is able to provide a solution to re-enable label purchases for these postal services.\neBay\neBay has promised to protect sellers from late shipping defects and negative or neutral feedback related to tariffs but the actual payment of duties once the de minimis exemption ends will still depend on the carrier/postal service being used.\nIn the UK, shipments which use eBay's Global Shipping Programme will have the duties calculated and charged to the buyer at checkout, but listings using any other international shipping method will not.\nFor other countries, eBay says: \"Duties, import fees, and personal information are typically collected by carriers after checkout. Prices displayed to buyers on eBay may exclude these costs.\"\nYou can check country-specific eBay help pages:\nUPDATE: eBay Canada has now announced they will be disabling the ability to purchase Canada Post labels, effective August 25th.\nDuties and customs clearance: Starting August 29th, all shipments to the US—regardless of value—will be subject to applicable duties and customs clearance. As of this date, Canada Post has advised that its current Delivered Duty Unpaid (DDU) shipping services to the US (Tracked Packet™ USA, Expedited Parcel™ USA, or Xpresspost™ USA) are not compliant with these changes.\nThere is a significant risk that non-compliant shipments arriving to the US beyond August 29th will be returned to the sender. Therefore, effective August 25th these Canada Post services will be disabled on eBay Labels.\nTo ensure a smooth cross-border shipping experience, we strongly recommend sellers take the following actions immediately to avoid in-transit shipments from being returned.\n- Use a commercial carrier such as UPS, FedEx, DHL, or Purolator that can handle US customs clearance; and note that discounted UPS and FedEx rates are available through eBay Labels.\n- Ensure the item location for your listings is accurate.\n- Include accurate Harmonized Tariff Codes as well as Country/Region of Manufacture (country of origin) information on your listings & customs declarations.\nIt’s important to note that, for any exports to the United States, the Country/Region of Manufacture will be required to properly assess and apply applicable customs duties\nMercari\nMercari is warning users that items shipping from Japan via their partnership with BEENOS will have estimated customs duties added into item prices.\nI'll be keeping this post updated with the latest news from various international postal services and online marketplaces. Stay tuned and let us know in the comments below how the end of de minimis is impacting your ecommerce business!"
    },
    {
      "news_title": "US De-Minimis Rollback Can Raise Landed Costs By Up To 15%, Cut Indian Shipments By 25%",
      "news_link": "https://www.ndtvprofit.com/economy-finance/us-de-minimis-rollback-can-raise-landed-costs-cut-indian-shipments",
      "bias": "unknown",
      "text": "US De-Minimis Rollback Can Raise Landed Costs By Up To 15%, Cut Indian Shipments By 25%\nThe industry is calling for policy cushioning to safeguard MSME competitiveness in the US market.\nThe proposed removal of the US de minimis exemption, which currently allows duty-free imports below $800, is set to hit Indian cross-border trade hard, with landed costs expected to rise by as much as 8–15% and shipment volumes to fall 15–25%, according to industry experts.\nThe US market is India’s largest for direct-to-consumer exports and over 35% of these shipments use the de minimis route. The rollback could therefore trigger widespread disruptions across price-sensitive sectors such as textiles, apparel, consumer electronics, jewellery, handicrafts and specialty foods.\n\"The removal of the de minimis exception could increase landed costs by 8–15% for small and mid-sized exporters. For India, where over 35% of D2C exports to the U.S. depend on this route, exporters may be forced to consolidate shipments, which will raise compliance and logistics costs,\" said Sunil Kharbanda, chief executive officer at Trezix, warning that the policy shift could slow India's e-commerce momentum.\nFor cross-border payments, the immediate impact will be lower flows. \"We expect a 15–25% immediate drop in shipment volumes, especially in categories like apparel, jewellery, handicrafts, beauty, and small consumer goods. This means lower transaction volumes for payment firms, particularly from MSMEs and D2C brands relying on sub-$800 shipments,\" said Sanjay Tripathy, co-founder of BRISKPE.\nTripathy added that while the short term will be painful, exporters will adapt through bulk shipments, nearshore fulfilment hubs and higher-value product mixes. But he warned that this adjustment would lock in a structurally higher cost base.\nThe industry is calling for policy cushioning, including diplomatic talks with Washington, GST rebates, export incentives, and stronger trade infrastructure, such as bonded warehouses, to safeguard MSME competitiveness in the US market."
    },
    {
      "news_title": "Bpost stops sending parcels to US due to tax uncertainty",
      "news_link": "https://www.belganewsagency.eu/bpost-stops-sending-parcels-to-us-due-to-tax-uncertainty",
      "bias": "unknown",
      "text": "Bpost stops sending parcels to US due to tax uncertainty\nFrom Friday, bpost will temporarily stop sending parcels to the US due to uncertainty about the new American rules for international shipments, Het Laatste Nieuws writes.\nUntil now, international shipments of goods worth less than 800 dollars were exempt from tax in the US. This exemption will disappear on 29 August. All parcels will then be subject to taxes and additional costs, regardless of where they were sent from.\nBut the US government has not yet provided clarity on how exactly the taxes should be calculated and collected. According to PostEurop, the umbrella organisation of European postal companies, the first technical details were shared on August 15, which \"barely leaves time to prepare\".\nTemporary measure\nTo protect its customers, Thursday is the last day on which a parcel can be sent to the US, bpost says. This exceptional measure is meant to \"avoid parcels being blocked or unexpected costs for our customers\", said spokesperson Mathieu Goedefroy.\nThe measure is temporary, the company says. It is working with international partners to find a solution as quickly as possible to restart shipments.\n\"We regret this situation,\" Goedefroy said. \"But as long as there is no clarity, we cannot take the risk.\"\n© BELGA PHOTO JONAS ROOSENS\nRelated news"
    }
  ]
}