{
  "story_id": "GN_20250826_011610_94eda555",
  "metadata": {
    "title": "25 people killed in Gaza as Gaza City becomes the focus of famine and a military offensive",
    "timestamp": "2025-08-26T01:16:10.082856",
    "url": "https://ground.news/article/25-people-killed-in-gaza-as-gaza-city-becomes-the-focus-of-famine-and-a-military-offensive_b881ca"
  },
  "bias_distribution": {
    "total_sources": "118",
    "leaning_left": "26",
    "center": "47",
    "leaning_right": "11"
  },
  "perspective_summaries": {
    "left": [
      "Israeli strikes in Gaza have killed at least 25 people, including displaced civilians, according to medics.",
      "The Integrated Food Security Phase Classification announced that Gaza City is experiencing famine, affecting nearly half a million people.",
      "Doctors Without Borders reported increased patient numbers as civilians flee bombardments in Gaza City.",
      "Israeli Prime Minister Benjamin Netanyahu's office denounced the famine claims, labeling them as lies."
    ],
    "center": [
      "On August 23, 2025, at least 25 Palestinians lost their lives in Gaza due to Israeli attacks involving both airstrikes and shootings, occurring amid worsening famine and ongoing conflict in Gaza City.",
      "The violence follows a 22-month Israeli offensive triggered by Hamas attacks on October 7, 2023, with preparations underway for a possible new military operation in Gaza City.",
      "Reports indicate that around 500,000 individuals in Gaza are experiencing severe hunger due to ongoing blockades and limited humanitarian aid, with displaced populations becoming increasingly at risk amid intensified airstrikes and ground operations.",
      "UNRWA Commissioner-General urged Israel to acknowledge the famine it has caused, while Israel's government rejected the famine report as an 'outright lie' and accused Hamas of starving hostages; grieving relatives pleaded for a truce, saying, 'We want to rest.'",
      "The ongoing humanitarian crisis and military escalation suggest continued civilian suffering, displacement, and international pressure as ceasefire efforts remain on hold awaiting Israel's response."
    ],
    "right": [
      "At least 25 Palestinians were killed in recent Israeli airstrikes and gunfire targeting aid seekers, according to local hospitals.",
      "The Integrated Food Security Phase Classification declared a famine in Gaza City, with 500,000 people facing catastrophic hunger.",
      "Munir al-Bursh, director general of Gaza's Health Ministry, reported that 281 people have died from malnutrition since the humanitarian crisis began.",
      "International calls for a ceasefire are growing as the humanitarian crisis worsens in Gaza amid ongoing military operations."
    ]
  },
  "sources": [
    {
      "news_title": "Political apathy a blight on humanity",
      "news_link": "https://www.theage.com.au/national/victoria/political-apathy-a-blight-on-humanity-20250824-p5mpee.html",
      "bias": "Lean Left",
      "text": "To submit a letter to The Age, email letters@theage.com.au. Please include your home address and telephone number below your letter. No attachments. See here for our rules and tips on getting your letter published.\nMIDDLE EAST\nThe situation in Palestine is appalling in that despite the ongoing humanitarian crimes perpetrated by Israel, including bombing of refugee camps, hospitals, schools, killing of civilians, journalists, mass starvation testified by human rights groups and individuals such as doctors, we then hear Israel’s intention to continue the destruction of Palestine expressed by the Israeli finance minister who said “The Palestinian State is being erased from the table” (″Gaza famine numbers hit 500,000″, 23/7).\nYet, all our government does is to keep calling for this travesty of justice to cease. No significant action to prevent it is proposed. This scenario of political apathy is a blight on humanity. Fortunately, more Australians are becoming deeply concerned and upset and are venting their feelings through rallies, personal boycotts and letter writing. May they succeed in their mission.\nLeigh Ackland, Deepdene\nFamine not deliberate act\nI find it difficult to resolve the use of the word “famine” in connection with the situation in Gaza. Famine implies a shortage of food with a natural cause, as opposed to the deliberate mass starvation atrocity being imposed on the Palestinian people by Netanyahu!\nJohn Alley, Thurgoona, NSW\nNetanyahu won’t stop\nRe (Letters, ″State of despair″, 23/8). Really? If Hamas released all hostages then Netanyahu would cease the bombing of civilians, stop the expansion in the West Bank and Gaza, submit to answering the criminal charges he faces, and willingly go to jail when and if found guilty. Really?\nDavid Raymond, Doncaster East\nHistory will judge Netanyahu\nHow much longer is the world going to look on as skeletal babies and children die a slow, agonising death and watch the daily slaughter in Gaza?\nHistory will judge Netanyahu, his apologists, those who sold him arms, those slow to impose sanctions on Israel, and those slow to call out the war for what it is.\nShowing great courage, many Israelis are marching for peace, and many are refusing to fight in Netanyahu’s war, and the International Court has a warrant out for his arrest for war crimes and crimes against humanity. Such leaders must be held to account and face consequences for their words and actions.\nMeanwhile, other world leaders should do whatever they can to immediately get food, water and medical aid into Gaza and ensure a ceasefire.\nMeryl Tobin, Grantville\nHamas brought its people devastation\nIf Israel succeeds in defeating Hamas, the people of Gaza may have the chance to rebuild their lives free from a movement that has brought them only devastation. By contrast, if Hamas were ever to prevail, Israel would face the destruction of its society and the mass slaughter of its citizens – outcomes Hamas has repeatedly declared as its goal.\nJennifer Stewart, South Chadstone\nExtremism on both sides must be curtailed\nRecognition of a Palestinian state at this point is not so much about recognising a state already existing, but more about the world’s recognition that a properly constituted Palestinian state must be enabled to be created. Without such a state, with appropriate security and international backing, there will never be peace in the Middle East.\nSimilarly, Israel needs the assurance that it will have security against attack from a Palestinian state. The extremists on both sides, who aim for the total destruction of the other side, must be controlled if this is to happen.\nMichael Meszaros, Alphington\nTHE FORUM\nLeft meets right\nAs Waleed Aly points out in his opinion piece (″The walkout of writers shows how promiscuous the politics of safety can be″, 22/8); several years ago, conservative libertarians argued that section 18C of the Racial Discrimination Act impaired their freedom of speech to insult and offend people on grounds of their race, whereas these days they argue that inflammatory, divisive and disrespectful language should be avoided in order to prevent insulting and offending people on grounds of race or political/religious leanings.\nHowever, it also can be argued that left-wing progressives back then, advocating keeping section 18C are today arguing that being directed to avoid such language limits their freedom of speech, despite it enabling hatred of Jewish Australians.\nAnd regarding the divisive notion of ″safetyism″, whereas, for a more harmonious multicultural society, I prefer terms like inclusion and equality, such as shown by the recent cancellation of a right-wing Israeli parliamentarian’s visa based on fears that he could upset Muslim communities.\nBut why then is avoiding the use of inflammatory, divisive and disrespectful language that’s fuelling the surge in antisemitism a violation of freedom of speech of writers at a writers’ festival?\nHenry Herzog, St Kilda East\nTreaty millstone\nThere is no such thing as a “Right side of history” (Letters, 24/8). The Allan government “treaty” with Indigenous people is not a “milestone”. It is a millstone, which, along with all Labor’s other errors and omissions – and debts – will weigh down the state for years, or decades, or generations. Can we expect other “identity”-based elected bodies? If not, why not?\nAnthony Caughey, Elwood\nTreaty overdue\nFantastic news: “Treaty negotiations complete, a historic agreement is within reach”, (23/8). Two hundred years late, but better late than never. Congratulations Labor.\nPatricia Rivett, Ferntree Gully\nNo child alike\nNot so long ago, early years’ classrooms catered for diversity – developmental delay was not unusual and class programs were adapted accordingly. Commonly, five-seven-year-old boys, in particular, were not ready to sit and listen. The aim of a prep-2 program was to tap into kids’ interests, build their self-esteem, and engage them in learning.\nThese days, we expect all kids to measure up in the same way on the same day with a national testing program which takes no account of normal developmental differences, let alone specific developmental delay. We now mandate a prescriptive one-size-fits-all teaching program for beginners as if all kids develop in exactly the same way.\nIt is no wonder parents are anxiously seeking support. They believe their kids are failing when they are forced into a system that is no longer set up to nurture the needs of individual learners, with in-school support as required. Parents should be celebrating milestones instead of comparing their kids.\nSusan Mahar, Fitzroy North\nEmpower, not surveil kids\nFor the past 30 years, I have dedicated my career to the early childhood education and care sector. The growing calls to install CCTV cameras in early childhood classrooms are deeply concerning– they suggest a lack of trust in our teachers and educators. Such measures undermine the very foundation of education, which is built on trust, respect, and human connection – qualities no camera can capture.\nEarly childhood educators are highly skilled professionals who nurture not only learning but also children’s confidence, curiosity, and emotional wellbeing. What they truly need is increased investment in professional development and supportive environments that recognise their expertise – not invasive surveillance that reduces their vital work to mere footage.\nChildren are active agents with rights, not passive subjects to be constantly monitored. Excessive surveillance strips them of dignity and erodes safe, nurturing spaces where meaningful relationships grow. Education should empower children, not condition them to accept surveillance as normal.\nTrust, professional respect, and genuine support protect children far more effectively than cameras ever could.\nRebecca Drysdale, Essendon North\nDon’t go back\nOn International Women’s Day 1975 I marched, I attended celebratory functions, I shared in the euphoria that said ″you’ve come a long way sister″. I read with increasing despair Julia Baird’s article (″Gilead rising: In Trump’s America, misogyny has found a powerful toehold″, 23/8) on the ways in which extreme forms of misogyny are taking over in America (and maybe in Australia as well).\nAs always, it is up to women to resist this creeping sexism and do all we can to disallow this march backwards.\nGloria Meltzer, Chewton\nTradwives and trad men\nReading Jacqueline Maley’s piece about ″tradwives″ made for difficult reading, not because of the topic itself, but because Maley’s contention is inconsistent (″Women should keep house: Baking mad or the conversation we need?″, 24/8). I have known several women who fulfil the criteria of a tradwife – or perhaps a ″tradwoman″, as some are unwed – and yet, none did so to please someone else.\nIt is an insult to the intelligence of women to assert they are still living in the shadow of men. Instead of challenging, in truth dismissing other people, if there is a societal or relational problem, we should be asking what is causing men to grasp for the ″manosphere″ and women to traditional ideals of gender roles.\nAnders Ross, Heidelberg\nRed tape, red herring\nBeware the ″red tape″ argument. When business whinges about ″red tape″, think workers’ wages and entitlements like super, sick pay, long service etc, occupational health and safety regulations, and their biggest bugbear, environmental safeguards.\nBusiness wants to be able to bulldoze, drill and/or ride roughshod over habitat and property everywhere without impediment or oversight. This is what business means by removing ″red tape″.\nBusiness wants no regulations, to pay no tax, and secretly wouldn’t mind a return to slave labour, but don’t you dare remove their lucrative government subsidies.\nJudy Loney, Drumcondra\nTaking the train\nI have also taken the XPT train to Sydney and agree the service needs to be improved to reduce the time taken (Letters, ″Long Track to Sydney″, 23/8).\nI was told by the staff that the train was capable of travelling at 136 km/h on good sections of the track. If the whole track was capable of this speed and an express service provided, the trip could be done in about five hours going city centre to city centre. If you take time to get to and from the airport, the security check, boarding time etc. many people would take the train instead of flying.\nPeter Hogan, Fitzroy North\nCouncils go basic\nI’m alarmed to see councils across Victoria rolling back climate commitments. Darebin was the first council in the world to declare a climate emergency in 2016, starting a global trend that has since spread to thousands of jurisdictions.\nYet now, even here, the language and ambition are being watered down. Just across the creek, Yarra, once a progressive leader, has also swung sharply with a more conservative coalition of councillors – and it shows.\nThis “back to basics” smokescreen is being used to wash away responsibility for climate change, as if it’s no longer urgent, popular or solvable. That is deeply irresponsible. This was the hottest summer on record, and our cities will only get hotter. Climate change will cost every local community far more, through storm clean-ups, damaged infrastructure and skyrocketing insurance, than acting early ever would. We know meeting this moment requires big change, but every big change begins at the grassroots. Councils should be stepping up, not stepping back.\nCate James, Northcote\nOrwell’s achievements\nWriter Anna Funder exaggerates George Orwell’s flaws while minimising his achievements ″Animal Farm has turned 80, but we still don’t know who wrote the best line″, (20/8).\nFeminist writer, Rebecca Solnit, in her book Orwells’ Roses, presents a far more balanced and nuanced portrait of the man who was sick all his life, died young, was a champion of the poor and downtrodden, fought for the Republic in Spain, loved gardening, wrote some of the best essays in the English language and was among the very first to see through Stalin’s Russia – yes much of this with the considerable practical and intellectual support of his wife Eileen O’Shaughnessy. As for ″no vanilla creature could give us that scarifying insight into darkness″, 1984, this is to place Orwell in a double-bind: Thanks for the masterpiece, pity you had to be a bastard to write it.\nMichael Read, Carnegie\nSupporter transference\nIt was extremely disappointing to hear so many Essendon supporters loudly boo when Adam Saad was in possession of the football on Thursday night. Saad came to Carlton some years ago from Essendon and he is entitled to be respected for his ability and his decision. Frequently, players change clubs for a variety of reasons.\nAs a Carlton supporter all my life, I hope my fellow supporters do not demean themselves, and our club, by booing any Blues’ players who transfer to other clubs next season. Unfortunately, I fear that could happen.\nTom Ward, Sorrento\nAND ANOTHER THING\nGhislaine Maxwell\nRe ″Maxwell saw nothing inappropriate”, (24/8). She “also said she did not witness any sexual abuse by Epstein”. Phew, I guess that gets Donald and the late Jeffrey off the hook. Now let’s see about a presidential pardon, for the ″wrongly convicted″ Ghislaine.\nLawrie Bradly, Surrey Hills\nGhislaine Maxwell delivered the classic self-interested denial in the Trump Epstein matter. Well, she would, wouldn’t she?\nPaul Custance, Highett\nFurthermore\nUkraine declared independence on August 24, 1991, but how much longer can it remain independent with current American and Russian leadership?\nVera Lubczenko, Geelong West\nWhile Albanese might be afraid of change, I think his party with fewer Baby Boomers and more young people will demand change. God help us if they don’t. We have to stop the intergenerational poverty which is currently the case.\nJohn Rome, Mount Lawley, WA\nAFL\nIt took the cardinals two days to elect the new Pope, five days for the AFL to resolve the Izak Rankine case.\nPeter Schiller, Camberwell\nSnoop Dogg? The AFL appears to me to be a little hypocritical. I saw recent snippets that presented him as a homophobe of a rather unsavoury character. It goes against the AFL’s own policy does it not?\nBill Proctor, Launching Place\nFinally\nWhat a combination! AI (Artificial Idiocy) and deregulation (“cutting red tape”) to solve the housing crisis? (″AI and a new ‘strike team’ deployed to combat housing crisis″, 24/8). SF (Spectacular Failure) is assured.\nJohn Laurie, Riddells Creek\nLately, there have been so many articles about chatbots and the like(“After three years with ChatGPT”, 24/8) that I fear that a malign artificial intelligence has taken over the pages of The Age.\nSandra Torpey, Hawthorn\nThe opinion newsletter is a weekly wrap of views that will challenge, champion and inform your own. Sign up here."
    },
    {
      "news_title": "25 people killed in Gaza as Gaza City becomes focus of famine and military offensive",
      "news_link": "https://japantoday.com/category/world/new-israeli-strikes-around-gaza-kill-25-as-famine-announcement-raises-pressure",
      "bias": "Lean Left",
      "text": "Israeli strikes and gunfire killed at least 25 Palestinians including people sheltering in tents or seeking scarce food Saturday in Gaza, local hospitals said, as a famine in Gaza’s largest city sparks new pressure on Israel over its 22-month offensive.\nIsrael's defense minister has warned that Gaza City could be destroyed in a new military operation perhaps just days away, even as famine spreads there.\nAid groups have long warned that the war, sparked by Hamas’ Oct. 7, 2023, attack, and months of Israeli restrictions on food and medical supplies entering Gaza are causing starvation.\nIsrael has rejected the data-based famine declaration as “an outright lie.\" Ceasefire efforts are on hold as mediators await Israel’s next steps.\nIsraeli strikes killed at least 14 people in southern Gaza, more than half of them women and children, according to morgue records and health officials at Nasser Hospital. The officials said the strikes targeted tents sheltering displaced people in Khan Younis.\n“Awad, why did you leave me?” a small boy asked his brother's plastic-wrapped body.\nAnother grieving relative, Hekmat Foujo, pleaded for a truce.\n“We want to rest,” Foujo said through her tears. ‘’Have some mercy on us.\"\nIn northern Gaza, Israeli gunfire killed at least five aid-seekers near the Zikim crossing with Israel, where U.N. and other agencies' truck convoys enter the territory, health officials at the Sheikh Radwan field hospital told the AP.\nSix people were killed in attacks elsewhere, according to hospitals and the Palestinian Red Crescent.\nIsrael's military said it was not aware of a strike in Khan Younis at that location and was looking into the other incidents.\nMohamed Saada was among thousands of people who sought food from a delivery in the Zikim area on Saturday — and one of many who left empty-handed.\n“I came here to bring food for my children but couldn’t get anything, due to the huge numbers of people and the difficulty of the situation between the shootings and the trucks running over people,” he said.\nSome carried sacks of food like lentils and flour. Others carried the wounded, including on a wooden pallet. They navigated fetid puddles and the rubble of war as temperatures reached above 92 degrees Fahrenheit (33 Celsius).\nFriday's report by the Integrated Food Security Phase Classification said Gaza City is gripped by famine that is likely to spread if fighting and restrictions on aid continue. It said nearly half a million people in Gaza — about one-fourth of the population — face catastrophic hunger.\nThe rare pronouncement came after Israel imposed a 2 1/2-month blockade on Gaza earlier this year, then resumed some access with a focus on a new U.S.-backed private aid supplier, the Gaza Humanitarian Foundation.\nIn response to global outrage over images of emaciated children, Israel has also allowed airdrops and a new influx of aid by land, but the U.N. and others say it's still far from enough.\nAP journalists have seen chaos on roads leading to aid deliveries, and there have been almost daily reports of Israeli troops firing toward aid-seekers. Israel's military says it fires warning shots if people approach troops or pose a threat.\nIsraeli Prime Minister Benjamin Netanyahu’s office asserts it has allowed enough aid to enter during the war, while accusing Hamas of starving the Israeli hostages it holds.\nWith ground troops already active in strategic areas, the military operation in Gaza City could start within days in an area that has hundreds of thousands of civilians.\nAid group Doctors without Borders, or MSF, said its clinics around Gaza City are seeing high numbers of patients as people flee. Caroline Willemen, MSF project coordinator in the city, noted a marked increase in airstrikes since early August.\n“Those who have not moved are wondering what they should do,” she told the AP. “People want to stay, they have been displaced endlessly before, but they also know that at some point it will become very dangerous to remain.”\nIsrael's military has said troops are operating on the outskirts of Gaza City and in the city’s Zeitoun neighborhood. Israel says Gaza City is still a Hamas stronghold, with a network of militant tunnels.\nMany Israelis fear the assault on Gaza City could doom the 20 hostages who are believed to have survived captivity since 2023. A further 30 are thought to be dead. Hundreds of thousands of Israelis protested a week ago for a deal to end the war and bring everyone home.\nNetanyahu said Thursday he had instructed officials to begin immediate negotiations to release hostages and end the war on Israel’s terms. It was unclear if Israel would return to talks mediated by the United States, Egypt and Qatar after Hamas said earlier this week it accepted a new proposal from Arab mediators.\nHamas has said it will release hostages in exchange for ending the war, but rejects disarming without the creation of a Palestinian state.\nU.S. President Donald Trump has expressed frustration with Hamas’ stance, suggesting the militant group is less interested in making deals with few hostages left alive.\n“I actually think (the hostages are) safer in many ways if you went in and you really went in fast and you did it,\" Trump told reporters Friday.\nGaza's Health Ministry said at least 62,622 Palestinians have been killed in the war, including missing people now confirmed dead by a special ministry judicial committee.\nThe total number of malnutrition-related deaths rose by eight to 281, the ministry said.\nA small group of Israelis protested against the far-right national security minister, Itamar Ben-Gvir, as he walked to a synagogue in Kfar Malal, north of Tel Aviv. Videos showed the minister arguing with the protesters.\n“We don’t want him in our village. Our message is to bring back the hostages,” one of the protesters, Boaz Levinstein, told the AP.\nBen-Gvir is a key partner in Netanyahu’s political coalition and a staunch opponent of reaching a deal with Hamas, which hostages’ families see as the only way to secure the release of loved ones.\nSam Mednick in Jerusalem and Michelle Price in Washington contributed.\n© Copyright 2025 The Associated Press. All rights reserved. This material may not be published, broadcast, rewritten or redistributed without permission.\n18 Comments\ntheFu\nThis war which Hamas started could be over immediately if they release all the hostages. Nobody else needs to die. Without any hostages held, Israel would look really bad invading Gaza.\nsakurasuki\nSo genocide has two front, famine front and military front?\nsakurasuki\n@theFu\nUN bodies already released the number of people being killed is over 50 thousands, you consider that hoax too?\nhttps://www.ohchr.org/en/press-releases/2025/05/end-unfolding-genocide-or-watch-it-end-life-gaza-un-experts-say-states-face\nu_s__reamer\nI've just come from a visit to the Mauthausen Concentration Camp in Austria and from the many photos and curated exhibits it's crystal clear to anyone who is honest and brave enough make a comparison that the Israelis are using the same sadistic playbook of extermination updated with all today's cutting-edge technology of mass-murder. We have learned nothing from history except to repeat it.\nCapuchin\ntheFu, the way you talk about the Palestinians in such a dehumanizing manner is grotesque. Maybe you should try getting your information from anywhere besides some Islamophobic youtuber.\nFamine has been confirmed in Gaza Governorate by the world’s top authority on food security and will spread further within the Strip unless fighting stops and much more aid is allowed in, UN humanitarians said on Friday.\n“This is irrefutable testimony… It is a famine, the Gaza famine,” UN relief chief Tom Fletcher told reporters in Geneva just as the report by the Integrated Food Security Phase Classification, or IPC, a 21-agency partnership which includes UN entities and non-governmental organizations, was released.\nhttps://www.un.org/unispal/wp-content/uploads/2025/08/IPC_Famine_Review_Committee_Report_Gaza_Aug2025-compressed.pdf\nJeffLee\n@Gurumick\nThose darn facts! Getting the way of my emotion-laden narrative! The New York Times, CNN, The Guardian, the BBC, etc. didn't bother to tell us that their main poster-child starvation victim in their famous photo was actually a victim of a genetic condition or several conditions, possibly including cerebral palsy. None of the MSM also didn't question why his mother in the photo appears well-fed while her kid was supposedly starving. Was she hogging the household food?!? Not a lot of journalistic instincts, I'd say.\nhttps://www.abc.net.au/news/2025-07-31/controversy-over-image-of-a-skeletal-one-year-old-gazan-boy/105596198\nhttps://david-collier.com/the-truth-behind-the-viral-gaza-famine-photo/\nSome independent investigave types believe there have been about a dozen such other cases, often with the suspected causes being the high incidence of cousin marriage within Pally culture.\nThere's food problem there, but it is overwhelmingly the fault of Hamas, who has for years been pilfering Western food aid and is using starvation as an important part of its human shield strategy. Whenever Israel detains or kills a Hamas member, he always looks so well fed, sometimes obese, you may of noticed. Of course you didn't.\nwallace\nThe Trump administration admits there is starvation and famine in Gaza. The US president's comments come after Israel's prime minister said claims of hunger were a \"lie\".\nWoodyLee\nThe Palestinians are the most resilient people in modern history facing one of the most Brutal and Savage Zionist war mongers ever.\nWoodyLee\n\"\" This war which Hamas started could be over immediately if they release all the hostages.\"\"\nThis war which Hamas did NOT start could be over immediately if the Zionists end their land theft and Occupation of Palestine.\nmax-velocity\nThe Gaza Arabs are the victims of Hamas, Israel, and the US.\nJeffLee\nGood point, Wallace. The Trump administration is always right.\nbtfkuri\nDo they look good currently invading West Bank and Golan ? There are no hostages, no Hamas.\nlincolnman\nThe daily death toll of innocent Palestinian women and children continues to mount - yet Trump still supplies the guns, bombs, and missiles that allow it to continue...\nHe's an accessory to a war crime - and deserves his time in the dock at the World Court as much as Netanyahu...\nbass4funk\nYes, Hamas has to be eliminated, no exceptions\nNo, he’s not\nYeah, that just won’t happen, seriously.\ntheFu\nWhen you start a war, you need to be prepared to finish it victorious. Hamas knew they couldn't win. All they have for fighting, since they clearly misread the furiosity their actions against Israel brought, non-Hamas people. This is terrible for the innocents who don't know Hamas is the cause nor can they turn over members of Hamas because they don't know them. Using civilians as humans shields is wrong, but terrorist don't care.\nI'm not anti-Palestinian any more than the Arab nations in the region are - all of which refuse to allow them to enter their countries.\nI'm 100% anti-Hamas. They are terrorists. Organizations and countries who support terrorist are a huge concern, so Yemen and Iran are a problem.\nWhoever starts a war without clear cause deserves whatever they get. Israel isn't blameless. Every time they put up settlements on land owned by Palestinians (or anyone else), that's wrong and needed to be stopped. When Hamas invaded Israel, killed men, women, children and took hostages, they were wrong too.\nWhen Russia invaded and attacked Ukraine in a completely unnecessary move in 2014 and again in 2022, they were wrong.\nWhen Russia invaded Georgia, they were wrong again.\nWhen Iraq invaded Kuwait, they were wrong.\nWhen the US invaded Iraq in 2002, the US was wrong.\nWhen China invaded Philippine territory in 2014. This was wrong.\nThe initial attackers are always wrong.\nYrral\nThe best punishment for Isrealis is to deny flyover of Israelis inbound outbound flights\nHello Kitty 321\n@theFu\n\"This war which Hamas started\"\nNo, Israel started it in 1948 and it has continued without a break in the murder, expulsion and incarceration of Palestinians ever since.\nSanjinosebleed\nIsrael as usual has started using influencers to try and turn night to day! You know the western world has lost its moral compass in allowing these sadistic war criminals carte Blanche to slaughter and destroy at will and then try to white wash it with paid influencers…absolutely disgusting! These war criminals should be in jail not walking the streets!\nhttps://www.haaretz.com/israel-news/2025-08-21/ty-article/.premium/israel-brings-social-media-influencers-to-gaza-aid-sites-to-fight-hamas-hunger-campaign/00000198-cced-d15a-a3bd-dfed82530000"
    },
    {
      "news_title": "Palestinians searching for food killed by Israeli strikes amid famine in Gaza",
      "news_link": "https://metro.co.uk/2025/08/23/palestinians-searching-for-food-killed-by-israeli-strikes-after-famine-in-gaza-declared-23983369/",
      "bias": "Lean Left",
      "text": "Palestinians sheltering in tents and seeking food were among at least 33 people killed by Israeli strikes and shootings in Gaza today, after a famine was announced.\nIt comes after warnings from aid groups for months that Israel’s restrictions on food into Gaza are causing starvation among civilians.\nYet, Israel is still dismissing the famine declaration as false, as its military presses ahead with plans to seize Gaza City.\nIsraeli strikes killed at least 17 people in the southern Gaza Strip early on Saturday, according to morgue records and health officials at Nasser Hospital.\nThe strikes targeted tents sheltering displaced people in Khan Younis, which is home to hundreds of thousands who were forced to flee from elsewhere in Gaza. More than half of the dead are women and children.\nIn northern Gaza, Israeli gunfire killed at least five aid-seekers near the Zikim crossing with Israel, where the UN and other agencies’ convoys enter the enclave, health officials at the Sheikh Radwan field hospital said.\nEleven people were killed in other attacks on Gaza elsewhere on Saturday, according to hospitals and the Palestinian Red Crescent.\nIsrael’s military claimed they were not aware of a strike in Khan Younis at that location and was ‘looking into’ the other incidents.\nYesterday, a famine was officially been declared in Gaza for the first time in history since Israel launched its full-scale war on Palestinians 22 months ago.\nWith United Nations food distribution centres shut down, bakeries bombed and humanitarian access throttled by Israel, more than 271 people – 121 of them children – have died from hunger so far.\nMetro previously spoke with Philippe Lazzarini, commissioner-general of UNRWA, the UN agency which supports Palestinian refugees, who warned that Israel is using hunger as a weapon of war in the Palestinian territory.\nAlmost three months later, the UN-backed Integrated Food Security Phase Classification (IPC) has now declared famine in Gaza.\nMore than half a million people in Gaza are facing catastrophic conditions characterised by starvation, destitution and death.\nAnother 1.07 million people are in Emergency (IPC Phase 4), and 396,000 people are in Crisis (IPC Phase 3), a report by the IPC said.\nConditions are only expected to further worsen by the end of September, with famine projected to expand to Deir al-Balah and Khan Younis.\nMore Trending\nNearly a third of Gaza’s population (641,000 people) is expected to face catastrophic conditions (IPC Phase 5), while those in Emergency (IPC Phase 4) will likely rise to 1.14 million.\nIn response to global outrage over images of emaciated children, Israel in recent weeks has allowed airdrops and a new influx of aid entering by land, but UN and other aid agencies say the food reaching Gaza is still not nearly enough.\nFollow Metro on WhatsApp to be the first to get all the latest news\nMetro’s on Whatsapp! Join our community for breaking news and juicy stories.\nJournalists have reported chaos and security problems on roads leading to aid deliveries, and there have been reports of Israeli troops firing towards people seeking aid.\nIsrael’s military says warning shots are fired if individuals approach the troops or pose a threat to soldiers.\nGet in touch with our news team by emailing us at webnews@metro.co.uk.\nFor more stories like this, check our news page.\nMORE: Several bands boycott UK festival after act cut off for ‘displaying Palestinian flag’\nMORE: Man arrested at pro-Palestine protest after police misread ‘Plasticine Action’ T-shirt\nMORE: Normal People author ‘risks being arrested after support for proscribed terrorist group’"
    },
    {
      "news_title": "Deadly Israeli strikes hit Gaza as famine announcement raises pressure",
      "news_link": "https://www.salisburyjournal.co.uk/news/national/25412798.deadly-israeli-strikes-hit-gaza-famine-announcement-raises-pressure/",
      "bias": "Center",
      "text": "Palestinians sheltering in tents or seeking food were among at least 33 people killed by Israeli strikes and shootings in Gaza, medics said, as the world confronts an exceptional announcement that famine is now gripping its largest city.\nThe famine determination by the world’s leading authority on food crises galvanised governments and aid groups to intensify their pleas for Israel to halt its 22-month offensive on Gaza, prompted by Hamas’ attacks on October 7 2023.\nAid groups have warned for months that the war and Israel’s restrictions of food into Gaza are causing starvation among civilians.\nIsrael denounced the famine declaration as lies and the military is pressing ahead with preparations to seize Gaza City.\nEfforts toward a ceasefire that could forestall the offensive are on hold as mediators await Israel’s next steps.\nIsraeli strikes killed at least 17 people in the southern Gaza Strip early on Saturday, according to morgue records and health officials at Nasser Hospital.\nThe officials said the strikes targeted tents sheltering displaced people in Khan Younis, which became home to hundreds of thousands who had fled from elsewhere in Gaza. More than half of the dead were women and children.\nIn northern Gaza, Israeli gunfire killed at least five aid-seekers on Saturday near the Zikim crossing with Israel, where the UN and other agencies’ convoys enter the enclave, health officials at the Sheikh Radwan field hospital said.\nThe Palestinian Journalists Syndicate said cameraman Khaled al-Madhoun was killed while covering events at the Zikim crossing, and said that he was targeted by Israeli troops.\nThe local Palestine TV confirmed his death.\nEleven people were killed in other attacks on Gaza elsewhere on Saturday, according to hospitals and the Palestinian Red Crescent.\nIsrael’s military said it was not aware of a strike in Khan Younis at that location and was looking into the other incidents.\nAP journalists have seen chaos on roads leading to aid deliveries, and there have been almost daily reports of Israeli troops firing towards aid-seekers.\nIsrael’s military says it fires warning shots if people approach troops or pose a threat.\nOn Friday, a report by the Integrated Food Security Phase Classification (IPC) said Gaza City is gripped by famine that is likely to spread if fighting and restrictions on humanitarian aid continue.\nIt was a rare pronouncement by the group, its first in the Middle East, and came after Israel imposed a two-and-a-half-month blockade on Gaza earlier this year, then eased access with a focus on a new US-backed private aid supplier, the Gaza Humanitarian Foundation (GHF).\nIn response to global outrage over images of emaciated children, Israel in recent weeks has allowed airdrops and a new influx of aid entering by land, but UN and other aid agencies say the food reaching Gaza is still not nearly enough.\nJournalists have seen chaos and security problems on roads leading to aid deliveries, and there have been reports of Israeli troops firing towards people seeking aid.\nIsrael’s military says warning shots are fired if individuals approach the troops or pose a threat to soldiers.\nThe IPC said nearly half a million people in Gaza, about a quarter of the population, face catastrophic hunger that leaves many at risk of dying. It said hunger has been magnified by widespread displacement and the collapse of food production.\nIsraeli prime minister Benjamin Netanyahu’s office denounced the IPC report as “an outright lie”, and accuses Hamas of starving the hostages. Israel says it has allowed enough aid to enter during the war.\nWith ground troops already active in strategic areas, the widescale operation in Gaza City could start within days.\nAid group Doctors without Borders (MSF) said on Saturday its clinics around Gaza City are seeing high numbers of patients as people flee recent bombardments.\nThe group said in a statement that “strikes are forcing people, including MSF staff, to flee their homes once again, and we are seeing displacement across Gaza City″.\nThe Israeli military has said troops are operating on the outskirts of Gaza City and in the city’s Zeitoun area."
    },
    {
      "news_title": "‘This is too much for children to bear’ – charity worker on Gaza City famine",
      "news_link": "https://www.channel4.com/news/this-is-too-much-for-children-to-bear-charity-worker-on-gaza-city-famine",
      "bias": "Lean Left",
      "text": "Yousra Abu Sharekh: Family with the children, live in a tent in the streets, beside sewage and near the garbage. And there is a high probability of having skin diseases. Meanwhile, they don’t have access to clean drinking water, so they have diarrhoea as well. In addition, they do not have any food to support their immunity to deal and to survive these kinds of diseases. And even us as the humanitarian aid workers, we felt the starvation, we felt the famine.\nCathy Newman: How have you been able to find food in the last few days? What have you been able to eat and your colleagues there?\nYousra Abu Sharekh: People in Gaza Strip are 100% relying on aid. They don’t have any source of income. They cannot afford any kind of a crisis, especially these high prices. It’s catastrophic on the ground. We witness mothers who come to the clinic and cry for just baby formula for their infants.\n“It’s catastrophic on the ground. We witness mothers who come to the clinic and cry for just baby formula for their infants.”\n– Yousra Abu Sharekh\nCathy Newman: So when Israel says that the idea of famine is a lie and a modern blood libel, could you spell out the examples that you’ve seen of people you’ve treated with starvation?\nYousra Abu Sharekh: We witnessed an increasing rate of malnutrition come to the clinic and in the streets as well, in the tents. Not only the people we support, but also ourselves. When I count the bites that my children eat, when I split the one bread we have in between the two children I have. When we don’t eat, me and their dad, in order to prepare them not to feel full, but at least to have something in their stomach.\nCathy Newman: The IDF is telling people to flee Gaza City because of the forthcoming bombardment. How many people are doing that now?\nYousra Abu Sharekh: People are so upset with these plans because they don’t want to experience a new round of displacement, knowing that they are already internally displaced in tents and in the streets. The majority of people in Gaza City prefer to die over living and experiencing displacement again. It’s a multilayered trauma and not with only the families and the parents but also the children. They lost already their educational system and the academic year, their normal life they used to have and they live in the street. They line up for water and they accumulate to get the very basic of the food from the community kitchen and this is too much for children to afford and bear with.\n“The majority of people in Gaza City prefer to die over living and experiencing displacement again.” – Yousra Abu Sharekh\nCathy Newman: And you’ve lived and worked there since the start of this conflict. Can you describe your state of mind after all that time?\nYousra Abu Sharekh: Most of the times I wanted to need and I am in dire need for only like being alone, just crying, maybe shouting, but I didn’t have the privilege to leave everything and stop and to have this moment. Even if you have your own problems and you are overwhelmed, but still, we as humanitarian organisations and workers are the only source of hope for those desperate people in the Gaza Strip.\nGaza: 34 killed as Israel ramp up attacks on Gaza City suburbs\nGaza doctor: ‘No place is safe – you have to choose your way to die’\n‘Most Israelis live in denial’ about Gaza – Israeli columnist"
    },
    {
      "news_title": "Israeli strikes kill at least 25 Palestinians in Gaza",
      "news_link": "https://www.irishtimes.com/world/middle-east/2025/08/23/israeli-strikes-kill-at-least-25-palestinians-in-gaza/",
      "bias": "Lean Left",
      "text": "Palestinians sheltering in tents or seeking food were among at least 25 people killed by Israeli strikes and shootings in Gaza, medics have said.\nThe deaths come a day after a UN-backed global hunger monitor said Gaza City and its surrounding areas are officially suffering from famine. The announcement by the world’s leading authority on food crises has galvanised governments and aid groups to intensify their pleas for Israel to halt its 22-month offensive on Gaza following the Hamas attacks on October 7th, 2023.\nAid groups have warned for months that the war and Israel’s restrictions of food into Gaza are causing starvation among civilians.\nIsrael denounced the famine declaration as lies and the military is pressing ahead with preparations to seize Gaza City.\nREAD MORE\nEfforts toward a ceasefire that could forestall the offensive are on hold as mediators await Israel’s next steps.\nIsraeli strikes killed at least 14 people in the southern Gaza Strip early Saturday, according to morgue records and health officials at Nasser Hospital.\nThe officials said the strikes targeted tents sheltering displaced people in Khan Younis, which became home to hundreds of thousands who had fled from elsewhere in Gaza. More than half of the dead were women and children.\nIn northern Gaza Israeli gunfire killed at least five aid-seekers on Saturday near the Zikim crossing with Israel, where the UN and other agencies’ convoys enter the enclave, health officials at the Sheikh Radwan field hospital said.\nSix people were killed in other attacks on Gaza elsewhere on Saturday, according to hospitals and the Palestinian Red Crescent.\nIsrael’s military said it was not aware of a strike in Khan Younis at that location and was looking into the other incidents.\nOn Friday, a report by the Integrated Food Security Phase Classification (IPC) said Gaza City is gripped by famine that is likely to spread if fighting and restrictions on humanitarian aid continue.\nIt was a rare pronouncement by the group, its first in the Middle East, and came after Israel imposed a two-and-a-half-month blockade on Gaza earlier this year, then eased access with a focus on a new US-backed private aid supplier, the Gaza Humanitarian Foundation (GHF).\nIn response to global outrage over images of emaciated children, Israel in recent weeks has allowed airdrops and a new influx of aid entering by land, but UN and other aid agencies say the food reaching Gaza is still not nearly enough.\nJournalists have seen chaos and security problems on roads leading to aid deliveries, and there have been reports of Israeli troops firing towards people seeking aid.\nIsrael’s military says warning shots are fired if individuals approach the troops or pose a threat to soldiers.\nThe IPC said nearly half a million people in Gaza, about a quarter of the population, face catastrophic hunger that leaves many at risk of dying. It said hunger has been magnified by widespread displacement and the collapse of food production.\nIsraeli prime minister Binyamin Netanyahu’s office denounced the IPC report as “an outright lie”, and accuses Hamas of starving the hostages. Israel says it has allowed enough aid to enter during the war.\nWith ground troops already active in strategic areas, the wide-scale operation in Gaza City could start within days.\n[ How the IPC global hunger monitor determines famineOpens in new window ]\nAid group Doctors without Borders (MSF) said on Saturday its clinics around Gaza City are seeing high numbers of patients as people flee recent bombardments.\nThe group said in a statement that “strikes are forcing people, including MSF staff, to flee their homes once again, and we are seeing displacement across Gaza City″.\nThe Israeli military has said troops are operating on the outskirts of Gaza City and in the city’s Zeitoun area. – AP"
    },
    {
      "news_title": "33 people killed as Gaza becomes focus of famine report and military offensive",
      "news_link": "https://spectrumlocalnews.com/nyc/all-boroughs/international/2025/08/23/israel-hamas-war-gaza",
      "bias": "Center",
      "text": "KHAN YOUNIS, Gaza Strip — Israeli strikes and gunfire killed at least 33 Palestinians in Gaza on Saturday, including people sheltering in tents or seeking scarce food, local hospitals said as a famine in Gaza's largest city puts new pressure on Israel over its 22-month offensive.\nIsrael's defense minister has warned that Gaza City could be destroyed in a new military operation perhaps just days away, even as famine spreads there.\nAid groups have long warned that the war, sparked by Hamas' Oct. 7, 2023, attack, and months of Israeli restrictions on food and medical supplies entering Gaza are causing starvation.\nIsrael has rejected the data-based famine declaration as \"an outright lie.\" Ceasefire efforts are on hold as mediators await Israel's next steps.\nIsraeli strikes killed at least 17 people in southern Gaza, more than half of them women and children, according to morgue records and health officials at Nasser Hospital. The officials said the strikes targeted tents sheltering displaced people in Khan Younis.\n\"Awad, why did you leave me?\" a small boy asked his brother's plastic-wrapped body.\nAnother grieving relative, Hekmat Foujo, pleaded for a truce.\n\"We want to rest,\" Foujo said through her tears. ''Have some mercy on us.\"\nIn northern Gaza, Israeli gunfire killed at least five aid-seekers near the Zikim crossing with Israel, where U.N. and other truck convoys enter the territory, health officials at Sheikh Radwan field hospital told the AP.\nThe Palestinian Journalists Syndicate said cameraman Khaled al-Madhoun was killed while covering events at the Zikim crossing, and asserted that he was targeted by Israeli troops. The local Palestine TV confirmed his death.\nEleven people were killed in attacks elsewhere, according to hospitals and the Palestinian Red Crescent.\nIsrael's military said it was not aware of a strike in Khan Younis at that location and was looking into the other incidents.\nAP journalists have seen chaos on roads leading to aid deliveries, and there have been almost daily reports of Israeli troops firing toward aid-seekers. Israel's military says it fires warning shots if people approach troops or pose a threat.\nMohamed Saada was among thousands seeking food in the Zikim area — and one of many who left empty-handed. He cited the \"huge numbers of people,\" the shootings and \"trucks running over people.\"\nSome carried sacks of food like lentils and flour. Others carried the wounded, including on a wooden pallet. They navigated fetid puddles and the rubble of war as temperatures reached above 92 degrees Fahrenheit.\nFriday's famine report by the Integrated Food Security Phase Classification said nearly half a million people — about one-fourth of Gaza's population — face catastrophic hunger.\nThe rare pronouncement came after Israel imposed a 2 1/2-month blockade on Gaza earlier this year, then resumed some access with a focus on a new U.S.-backed private aid supplier, the Gaza Humanitarian Foundation.\nIn response to global outrage over images of emaciated children, Israel has also allowed airdrops and new deliveries by land, but the U.N. and others say it's far from enough.\nIsraeli Prime Minister Benjamin Netanyahu's office asserts it has allowed enough aid to enter during the war, while accusing Hamas of starving the hostages it holds.\nWith ground troops already active in Gaza City's outskirts, the military operation could start within days in an area with hundreds of thousands of civilians. Israel says Gaza City is still a Hamas stronghold, with a network of militant tunnels.\nAid group Doctors without Borders, or MSF, said its clinics around Gaza City see high numbers of patients as people flee. Caroline Willemen, MSF project coordinator there, noted a marked increase in airstrikes since early August.\n\"Those who have not moved are wondering what they should do,\" she told the AP. \"People want to stay, they have been displaced endlessly before, but they also know that at some point it will become very dangerous to remain.\"\nMany Israelis fear the assault on Gaza City could doom the 20 hostages who are believed to have survived since 2023. Another 30 are thought to be dead. Hundreds of thousands of Israelis protested a week ago for a deal to end the fighting and bring everyone home.\n\"Anyone who truly wants to bring the hostages home does not launch a ground invasion of Gaza,\" Yotam Cohen, brother of hostage Nimrod Cohen, said ahead of a weekly rally in Tel Aviv.\nNetanyahu said Thursday he had instructed officials to begin immediate negotiations to release hostages and end the war on Israel's terms. It was unclear if Israel would return to talks mediated by the United States, Egypt and Qatar after Hamas said it accepted a new proposal from Arab mediators.\nHamas has said it will release hostages in exchange for ending the war, but rejects disarming without the creation of a Palestinian state.\nU.S. President Donald Trump has expressed frustration with Hamas' stance, suggesting the militant group is less interested in making deals with few hostages left alive.\n\"I actually think (the hostages are) safer in many ways if you went in and you really went in fast and you did it,\" Trump told reporters Friday.\nGaza's Health Ministry said at least 62,622 Palestinians have been killed in the war, including missing people now confirmed dead by a special ministry judicial committee.\nThe number of malnutrition-related deaths rose by eight to 281, the ministry said.\nA small group of Israelis protested against the far-right national security minister, Itamar Ben-Gvir, as he walked to a synagogue in Kfar Malal, north of Tel Aviv. Videos showed the minister arguing with the protesters.\n\"We don't want him in our village. Our message is to bring back the hostages,\" one of the protesters, Boaz Levinstein, told the AP.\nBen-Gvir is a key partner in Netanyahu's political coalition and a staunch opponent of reaching a deal with Hamas, which hostages' families see as the only way to secure the release of loved ones."
    },
    {
      "news_title": "Israeli strikes kill 25 in Gaza as famine announcement raises pressure",
      "news_link": "https://www.wdsu.com/article/israeli-strikes-gaza-famine-announcement-pressure/65877329",
      "bias": "Center",
      "text": "Israeli strikes kill 33 in Gaza as famine announcement raises pressure\nIsraeli strikes and gunfire killed at least 33 Palestinians in Gaza on Saturday, including people sheltering in tents or seeking scarce food, local hospitals said as a famine in Gaza’s largest city sparks new pressure on Israel over its 22-month offensive.\nIsrael's defense minister has warned that Gaza City could be destroyed in a new military operation perhaps just days away, even as famine spreads there.\nAid groups have long warned that the war, sparked by Hamas’ Oct. 7, 2023, attack, and months of Israeli restrictions on food and medical supplies entering Gaza are causing starvation.\nIsrael has rejected the data-based famine declaration as “an outright lie.\"\nHamas recently agreed to the terms for a six-week ceasefire, but hopes for a ceasefire that could forestall the offensive are on hold as mediators await Israel's next steps.\nWomen and children struck and killed in tents\nIsraeli strikes killed at least 17 people in southern Gaza, more than half of them women and children, according to morgue records and health officials at Nasser Hospital. The officials said the strikes targeted tents sheltering displaced people in Khan Younis.\n“Awad, why did you leave me?” a small boy asked his brother's plastic-wrapped body.\nAnother grieving relative, Hekmat Foujo, pleaded for a truce.\n“We want to rest,” Foujo said through her tears. ‘’Have some mercy on us.\"\nIn northern Gaza, Israeli gunfire killed at least five aid-seekers near the Zikim crossing with Israel, where U.N. and other agencies' truck convoys enter the territory, health officials at the Sheikh Radwan field hospital told the AP.\nSix people were killed in attacks elsewhere, according to hospitals and the Palestinian Red Crescent.\nIsrael's military said it was not aware of a strike in Khan Younis at that location and was looking into the other incidents.\nBraving gunfire and crowds for food\nMohamed Saada was among thousands of people who sought food from a delivery in the Zikim area on Saturday — and one of many who left empty-handed.\n“I came here to bring food for my children but couldn’t get anything, due to the huge numbers of people and the difficulty of the situation between the shootings and the trucks running over people,” he said.\nSome carried sacks of food like lentils and flour. Others carried the wounded, including on a wooden pallet. They navigated fetid puddles and the rubble of war as temperatures reached above 92 degrees Fahrenheit.\nFriday's report by the Integrated Food Security Phase Classification said Gaza City is gripped by famine that is likely to spread if fighting and restrictions on aid continue. It said nearly half a million people in Gaza — about one-fourth of the population — face catastrophic hunger.\nThe rare pronouncement came after Israel imposed a 2 1/2-month total blockade on Gaza earlier this year, then resumed some access with a focus on a new U.S.-backed private aid supplier, the Gaza Humanitarian Foundation. Over 1,000 people have been killed near GHF distribution sites.\nIn response to global outrage over images of emaciated children, Israel has also allowed airdrops and a new influx of aid by land, but the U.N. and others say it's still far from enough.\nAP journalists have seen chaos on roads leading to aid deliveries, and there have been almost daily reports of Israeli troops firing toward aid-seekers. Israel's military says it fires warning shots if people approach troops or pose a threat.\nIsraeli Prime Minister Benjamin Netanyahu’s office asserts it has allowed enough aid to enter during the war. It also accuses Hamas of starving the Israeli hostages it holds.\nAn increase in Israeli airstrikes this month\nWith ground troops already active in strategic areas, the military operation in Gaza City could start within days in an area that has hundreds of thousands of civilians.\nAid group Doctors without Borders, or MSF, said its clinics around Gaza City are seeing high numbers of patients as people flee. Caroline Willemen, MSF project coordinator in the city, noted a marked increase in airstrikes since early August.\n“Those who have not moved are wondering what they should do,” she told the AP. “People want to stay; they have been displaced endlessly before, but they also know that at some point, it will become very dangerous to remain.”\nIsrael's military has said troops are operating on the outskirts of Gaza City and in the city’s Zeitoun neighborhood. Israel says Gaza City is still a Hamas stronghold, with a network of militant tunnels.\nCeasefire efforts await Israel's response\nMany Israelis fear the assault on Gaza City could doom the 20 hostages who are believed to have survived captivity since 2023. A further 30 are thought to be dead. Hundreds of thousands of Israelis protested a week ago for a deal to end the war and bring everyone home.\nNetanyahu said Thursday he had instructed officials to begin immediate negotiations to release hostages and end the war on Israel’s terms. It was unclear if Israel would return to talks mediated by the United States, Egypt and Qatar after Hamas said earlier this week it accepted a new proposal from Arab mediators.\nHamas has said it will release hostages in exchange for ending the war, but rejects disarming without the creation of a Palestinian state.\nU.S. President Donald Trump has expressed frustration with Hamas’ stance, suggesting the militant group is less interested in making deals with few hostages left alive.\n“I actually think (the hostages are) safer in many ways if you went in and you really went in fast and you did it,\" Trump told reporters Friday.\nGaza's Health Ministry said at least 62,622 Palestinians have been killed in the war, including missing people now confirmed dead by a special ministry judicial committee.\nThe total number of malnutrition-related deaths rose by eight to 281, the ministry said.\nIsraeli protest against far-right security minister\nA small group of Israelis protested against the far-right national security minister, Itamar Ben-Gvir, as he walked to a synagogue in Kfar Malal, north of Tel Aviv. Videos showed the minister arguing with the protesters.\n“We don’t want him in our village. Our message is to bring back the hostages,” one of the protesters, Boaz Levinstein, told the AP.\nBen-Gvir is a key partner in Netanyahu’s political coalition and a staunch opponent of reaching a deal with Hamas, which hostages’ families see as the only way to secure the release of loved ones.\nMagdy reported from Cairo. Sam Mednick in Jerusalem and Michelle Price in Washington contributed."
    },
    {
      "news_title": "Israeli attacks kill 63 across Gaza as troops push deeper into Gaza City",
      "news_link": "https://www.aljazeera.com/news/2025/8/23/israeli-attacks-kill-37-in-gaza-as-more-palestinians-die-from-starvation",
      "bias": "Lean Left",
      "text": "Israeli attacks kill 63 across Gaza as troops push deeper into Gaza City\nHealth authorities say eight more Palestinians, including two children, die of starvation after famine declared in Gaza.\nAt least 63 Palestinians have been killed in Israeli attacks across Gaza, medical sources tell Al Jazeera, as Israeli forces push deeper into Gaza City as part of their effort to seize the city and forcibly displace about one million people.\nAl Jazeera Arabic obtained footage on Saturday showing Israeli tanks advancing into the Sabra neighbourhood of Gaza City, signalling an expansion of the military’s ground invasion of the area.\nRecommended Stories\nlist of 3 itemsFamine in Gaza is a “war crime of starvation”\nDutch foreign minister resigns over Israel sanctions deadlock\nSabra is near the besieged Zeitoun neighbourhood, which has been increasingly targeted by the Israeli army over the past week.\nA source at Gaza City’s al-Ahli Hospital told Al Jazeera that a child was killed in the latest Israeli bombardment of Sabra.\nEarlier on Saturday, Israel fired artillery at tents sheltering displaced families in the Asdaa area northwest of Khan Younis in southern Gaza, killing 16 people, including six children, medical sources said.\nAt least 22 Palestinians were killed while seeking humanitarian aid throughout the day, including a Palestinian who was shot dead by Israeli forces near a distribution point close to the so-called “Morag axis”, southeast of Khan Younis.\nAnother civilian seeking aid was shot dead near the Israeli-controlled Netzarim Corridor.\nStarvation deaths\nPalestinian health authorities said on Saturday that eight more Palestinians, including two children, died from malnutrition over the past 24 hours, raising the total death toll to 281 since Israel’s war on Gaza began nearly two years ago.\nMunir al-Bursh, the director-general of Gaza’s Health Ministry, said on social media that 114 children were among the victims.\n“The famine is silently ravaging the bodies of civilians, depriving children of their right to life, and turning tents and hospitals into daily scenes of tragedy,” he added.\nThe United Nations on Friday officially declared a famine in Gaza – the first such designation ever announced in the Middle East – with experts warning 500,000 people face “catastrophic” hunger.\nThe UN has accused Israel of “systematic obstruction” of aid deliveries to the war-ravaged Palestinian territory, and Secretary-General Antonio Guterres described the famine as a “man-made disaster”.\nThe Integrated Food Security Phase Classification (IPC) system, a global hunger monitor, said 514,000 people – close to a quarter of Palestinians in Gaza – are experiencing famine, with the number due to rise to 641,000 by the end of September.\nReporting from Deir el-Balah, Al Jazeera’s Hind Khoudary said many other Palestinians in Gaza were at risk from malnutrition.\n“The UN famine report has been very late, according to Palestinians. They have been witnessing weeks and months of this ongoing starvation,” she said.\n‘Engineering of starvation’\nThe Palestinian Health Ministry in Gaza said on Saturday that it “appreciates” the declaration of famine in the enclave, although it believes the announcement was late.\n“We emphasise that the engineering of starvation is one aspect of the chapters of genocide, which also include the systematic destruction of the health sector and other sectors, mass killing, and the policy of exterminating generations,” the ministry wrote in a statement on Telegram.\nSince May 27, Israel has enforced a unilateral aid delivery mechanism through the so-called GHF, backed by Israel and the US.\nThe setup has been rejected by the UN and major relief groups as illegitimate and failing to adhere to humanitarian principles such as independence and neutrality.\nAccording to Gaza’s Health Ministry, more than 2,076 Palestinians have been killed and more than 15,300 people wounded while seeking aid since the GHF scheme was launched.\nIsrael has killed more than 62,600 Palestinians in Gaza since the Hamas-led October 2023 attack on southern Israel."
    },
    {
      "news_title": "Israel kills at least 25 Palestinians after Gaza City declared to be in 'famine'",
      "news_link": "https://www.heraldscotland.com/news/25412866.least-25-palestinians-killed-gaza-amid-famine-crisis/",
      "bias": "Lean Left",
      "text": "Palestinians sheltering in tents or seeking food were among at least 25 people killed by Israeli strikes and shootings in Gaza, medics said, as the world confronts an exceptional announcement that famine is now gripping its largest city.\nThe famine determination by the world’s leading authority on food crises galvanised governments and aid groups to intensify their pleas for Israel to halt its 22-month offensive on Gaza, prompted by Hamas’ attacks on October 7 2023.\nAid groups have warned for months that the war and Israel’s restrictions of food into Gaza are causing starvation among civilians.\nIsrael denounced the famine declaration as lies and the military is pressing ahead with preparations to seize Gaza City.\nRead More:\n-\nSwinney calls for recall of parliament to impose 'toughest' sanctions on Israel\n-\nRoss Greer calls for Royal Navy to sail to Gaza to end siege and deliver aid\n-\nThe absurdity and horror of everyday life in a time of genocide\nEfforts toward a ceasefire that could forestall the offensive are on hold as mediators await Israel’s next steps.\nIsraeli strikes killed at least 14 people in the southern Gaza Strip early Saturday, according to morgue records and health officials at Nasser Hospital.\nThe officials said the strikes targeted tents sheltering displaced people in Khan Younis, which became home to hundreds of thousands who had fled from elsewhere in Gaza. More than half of the dead were women and children.\nIn northern Gaza, Israeli gunfire killed at least five aid-seekers Saturday near the Zikim crossing with Israel, where the UN and other agencies’ convoys enter the enclave, health officials at the Sheikh Radwan field hospital said.\nSix people were killed in other attacks on Gaza elsewhere on Saturday, according to hospitals and the Palestinian Red Crescent.\nThe Israeli military did not immediately respond to questions about the deaths.\nOn Friday, a report by the Integrated Food Security Phase Classification (IPC) said Gaza City is gripped by famine that is likely to spread if fighting and restrictions on humanitarian aid continue.\nIt was a rare pronouncement by the group, its first in the Middle East, and came after Israel imposed a two-and-a-half-month blockade on Gaza earlier this year, then eased access with a focus on a new US-backed private aid supplier, the Gaza Humanitarian Foundation (GHF).\nIn response to global outrage over images of emaciated children, Israel in recent weeks has allowed airdrops and a new influx of aid entering by land, but UN and other aid agencies say the food reaching Gaza is still not nearly enough.\nJournalists have seen chaos and security problems on roads leading to aid deliveries, and there have been reports of Israeli troops firing towards people seeking aid.\nIsrael’s military says warning shots are fired if individuals approach the troops or pose a threat to soldiers.\nThe IPC said nearly half a million people in Gaza, about a quarter of the population, face catastrophic hunger that leaves many at risk of dying. It said hunger has been magnified by widespread displacement and the collapse of food production.\nIsraeli prime minister Benjamin Netanyahu’s office denounced the IPC report as “an outright lie”, and accuses Hamas of starving the hostages. Israel says it has allowed enough aid to enter during the war.\nWith ground troops already active in strategic areas, the widescale operation in Gaza City could start within days.\nAid group Doctors without Borders (MSF) said on Saturday its clinics around Gaza City are seeing high numbers of patients as people flee recent bombardments.\nThe group said in a statement that “strikes are forcing people, including MSF staff, to flee their homes once again, and we are seeing displacement across Gaza City″.\nThe Israeli military has said troops are operating on the outskirts of Gaza City and in the city’s Zeitoun area."
    },
    {
      "news_title": "Gaza crisis deepens: 25 killed in Israeli strikes as famine declared amid ongoing blockade",
      "news_link": "https://www.indiatvnews.com/news/world/gaza-crisis-deepens-25-killed-in-israeli-strikes-as-famine-declared-amid-ongoing-blockade-2025-08-23-1004837",
      "bias": "Lean Right",
      "text": "In yet another tragic escalation of violence, at least 25 Palestinians were killed on Saturday as Israeli airstrikes and gunfire targeted people on their way to aid centres and makeshift shelters. Among the dead were women and children who had been seeking refuge in tents. The information was confirmed by local hospitals, painting a grim picture of the humanitarian crisis unfolding in the region.\nHunger confirmed by global food crisis agency\nThe violence comes as global alarm grows over the deepening food crisis in Gaza. The Integrated Food Security Phase Classification (IPC), the world’s leading food crisis assessment agency, has officially declared a famine in Gaza City—the first ever recorded in the Middle East.\nThe declaration comes after 2.5 months of near-total blockade imposed by Israel on Gaza. Although some aid is now being allowed through the U.S.-backed Gaza Humanitarian Foundation (GHF), it is insufficient to meet the urgent needs of the population.\nIsraeli airstrikes kill women and children\nAccording to Nasser Hospital, early morning Israeli strikes in southern Gaza claimed at least 14 lives, most of them women and children. The attacks targeted displacement tents in Khan Younis, where families had taken shelter after fleeing from other bombed-out areas.\nAvad Abu Agala, a grieving relative who lost two nephews in the strike, said: “There is no safe place left in Gaza—bombing is happening in the north, in the south, everywhere.”\nThe Sheikh Radwan Field Hospital reported 5 more deaths from Israeli gunfire near the Zikim crossing, where civilians had gathered in hopes of receiving aid. Another 6 people were confirmed dead in separate incidents across Gaza, as per hospital sources and the Palestinian Red Crescent.\nInternational pressure mounts over famine\nThe IPC report has added substantial pressure on the international community, revealing that one-fourth of Gaza’s population—about 500,000 people—are facing catastrophic hunger and are on the brink of starvation.\nIsrael has rejected the report, calling it “false.” Prime Minister Benjamin Netanyahu’s office claimed that Hamas is deliberately withholding food from hostages and civilians to fuel international outrage. Israeli officials insisted that they have allowed sufficient humanitarian aid into Gaza during the ongoing conflict.\nMilitary campaign in Gaza city intensifies\nThe Israeli Defence Forces (IDF) have confirmed that their troops are operating in several areas of Gaza City, including the Zaytoun neighbourhood, and hinted at the launch of a major ground offensive in the coming days.\nInternational medical NGO Doctors Without Borders (MSF) reported that their clinics are seeing a surge in patient numbers, as fresh waves of civilians are displaced due to continued bombings.\nAs the conflict grinds on and famine tightens its grip on Gaza, aid organisations and global leaders are calling for an immediate ceasefire and full humanitarian access to avert further catastrophe."
    },
    {
      "news_title": "New Israeli strikes around Gaza kill at least 33 as famine announcement raises pressure",
      "news_link": "https://www.cbsnews.com/news/israel-gaza-strikes-famine-announcement/",
      "bias": "Lean Left",
      "text": "New Israeli strikes around Gaza kill at least 33 as famine announcement raises pressure\nPalestinians sheltering in tents or seeking scarce food aid were among at least 33 people killed by Israeli strikes and shootings Saturday in Gaza, according to local hospitals, as the world confronted an exceptional announcement that famine is now gripping Gaza's largest city.\nThe famine determination by the world's leading authority on food crises galvanized governments and aid groups to intensify pleas for Israel to halt its 22-month offensive on Gaza, prompted by Hamas' Oct. 7, 2023, attacks. Aid groups have warned for months that the war and Israel's restrictions of food into Gaza are causing starvation among civilians.\nIsrael denounced the famine declaration as lies and the military is pressing ahead with preparations to seize Gaza City. Efforts toward a ceasefire that could forestall the offensive are on hold as mediators await Israel's next steps.\nIsraeli strikes killed at least 17 people in the southern Gaza Strip early Saturday, according to morgue records and health officials at Nasser Hospital. The officials said the strikes targeted tents sheltering displaced people in Khan Younis, which became home to hundreds of thousands who had fled from elsewhere in Gaza. More than half of the dead were women and children.\nAwad Abu Agala, uncle of two children who died, said no place in Gaza is now safe.\n\"The entire Gaza Strip is being bombed ... In the south. In the north. Everywhere,\" Abu Agala told The Associated Press, saying the children were targeted overnight while in their tents.\nA grieving relative, Hekmat Foujo, pleaded for a truce.\n\"We want to rest,\" Foujo said, fighting through her tears. ''Have some mercy on us.''\nIn northern Gaza, Israeli gunfire killed at least five aid-seekers Saturday near the Zikim crossing with Israel, where U.N. and other agencies' convoys enter the enclave, health officials at the Sheikh Radwan field hospital told the AP.\nSix people were killed in other attacks on Gaza elsewhere Saturday, according to hospitals and the Palestinian Red Crescent.\nThe Israeli military did not immediately respond to questions about the deaths.\nA famine announcement ups the pressure\nA report by the Integrated Food Security Phase Classification, or IPC, said Friday that Gaza City is gripped by famine that is likely to spread if fighting and restrictions on humanitarian aid continue.\nIt was a highly rare pronouncement by the group, its first in the Middle East, and came after Israel imposed a 2 1/2-month blockade on Gaza earlier this year, then eased access with a focus on a new U.S.-backed private aid supplier, the Gaza Humanitarian Foundation, or GHF.\nIn response to global outrage over images of emaciated children, Israel in recent weeks has allowed airdrops and a new influx of aid entering by land, but U.N. and other aid agencies say the quantity of food reaching Gaza is still insufficient.\nAP journalists have seen chaos and security problems on roads leading to aid delivery points, and there have been reports of Israeli troops firing toward aid-seekers. Israel's military says they fire warning shots if individuals approach the troops or pose a threat to soldiers.\nThe IPC said nearly half a million people in Gaza, about one-fourth of the population, face catastrophic hunger that leaves many at risk of dying. It said hunger has been magnified by widespread displacement and the collapse of food production.\nNetanyahu's office denounced the IPC report as \"an outright lie,'' and accuses Hamas of starving the hostages. Israel says it has allowed enough aid to enter during the war.\nActivity is escalating ahead of Gaza City offensive\nWith ground troops already active on the edges of Gaza City, a wide-scale operation there could start within days.\nAid group Doctors without Borders, or MSF, said Saturday its clinics around Gaza City are seeing high numbers of patients as people flee recent bombardments. The group said in a statement that \"strikes are forcing people, including MSF staff, to flee their homes once again, and we are seeing displacement across Gaza City.\"\nThe Israeli military has said troops are operating on the outskirts of Gaza City and in the city's Zeitoun neighborhood.\nIsrael says Gaza City is still a Hamas stronghold, with a network of militant tunnels. The city also is home to hundreds of thousands of civilians, some of whom have fled from elsewhere.\nCeasefire efforts await Israel's response\nMany Israelis fear the assault on Gaza City could doom the roughly 20 hostages who have survived captivity since 2023.\nNetanyahu said Thursday he had instructed officials to begin immediate negotiations to release hostages and end the war on Israel's terms. It is unclear if Israel will return to long-running talks mediated by the United States, Egypt and Qatar after Hamas said earlier this week that it accepted a new proposal from the Arab mediators.\nHamas has said it would release captives in exchange for ending the war, but rejects disarmament without the creation of a Palestinian state.\nU.S. President Donald Trump expressed frustration with Hamas' stance, suggesting the militant group was less interested in making deals to release hostages with so few left alive.\n\"The situation has to end. It's extortion, and it has to end,\" Trump told reporters Friday. \"I actually think (the hostages are) safer in many ways if you went in and you really went in fast and you did it.\"\nGaza's Health Ministry said Saturday that at least 62,622 people have been killed since the war began, including missing people now confirmed dead by a special ministry judicial committee.\nThe total number of malnutrition-related deaths rose by eight to 281, the ministry said.\nIsraeli protest against far-right security minister\nA small group of Israelis protested against the far-right national security minister, Itamar Ben-Gvir, as he walked to a synagogue in Kfar Malal, north of Tel Aviv. Videos showed the minister arguing with the protesters.\n\"We don't want him in our village. Our message is to bring back the hostages,\" one of the protesters, Boaz Levinstein, told the AP.\nBen-Gvir is a key partner in Netanyahu's political coalition and a staunch opponent of reaching a deal with Hamas, which hostages' families see as the only way to secure the release of loved ones."
    },
    {
      "news_title": "Israeli strikes in Gaza kill 25; famine announcement raises pressure",
      "news_link": "https://dnyuz.com/2025/08/23/israeli-strikes-in-gaza-kill-25-famine-announcement-raises-pressure/",
      "bias": "Lean Right",
      "text": "Palestinians sheltering in tents or seeking scarce food aid were among at least 25 people killed by Israeli strikes and shootings Saturday in Gaza, according to local hospitals, as the world confronted an exceptional announcement that famine is now gripping Gaza’s largest city.\nThe famine determination by the world’s leading authority on food crises galvanized governments and aid groups to intensify pleas for Israel to halt its 22-month offensive on Gaza, prompted by Hamas’ Oct. 7, 2023, attacks. Aid groups have warned for months that the war and Israel’s restrictions of food into Gaza are causing starvation among civilians.\nIsrael denounced the famine declaration as lies and the military is pressing ahead with preparations to seize Gaza City. Efforts toward a ceasefire that could forestall the offensive are on hold as mediators await Israel’s next steps.\nIsraeli strikes killed at least 14 people in the southern Gaza Strip early Saturday, according to morgue records and health officials at Nasser Hospital. The officials said the strikes targeted tents sheltering displaced people in Khan Younis, which became home to hundreds of thousands who had fled from elsewhere in Gaza. More than half of the dead were women and children.\nAwad Abu Agala, uncle of two children who died, said no place in Gaza is now safe.\n“The entire Gaza Strip is being bombed … In the south. In the north. Everywhere,” Abu Agala told The Associated Press, saying the children were targeted overnight while in their tents.\nA grieving relative, Hekmat Foujo, pleaded for a truce.\n“We want to rest,” Foujo said, fighting through her tears. ”Have some mercy on us.”\nIn northern Gaza, Israeli gunfire killed at least five aid-seekers Saturday near the Zikim crossing with Israel, where U.N. and other agencies’ convoys enter the enclave, health officials at the Sheikh Radwan field hospital told the AP.\nSix people were killed in other attacks on Gaza elsewhere Saturday, according to hospitals and the Palestinian Red Crescent.\nThe Israeli military did not immediately respond to questions about the deaths.\nA famine announcement ups the pressure\nA report by the Integrated Food Security Phase Classification, or IPC, said Friday that Gaza City is gripped by famine that is likely to spread if fighting and restrictions on humanitarian aid continue.\nIt was a highly rare pronouncement by the group, its first in the Middle East, and came after Israel imposed a 2 1/2-month blockade on Gaza earlier this year, then eased access with a focus on a new U.S.-backed private aid supplier, the Gaza Humanitarian Foundation, or GHF.\nIn response to global outrage over images of emaciated children, Israel in recent weeks has allowed airdrops and a new influx of aid entering by land, but U.N. and other aid agencies say the quantity of food reaching Gaza is still insufficient.\nAP journalists have seen chaos and security problems on roads leading to aid delivery points, and there have been reports of Israeli troops firing toward aid-seekers. Israel’s military says they fire warning shots if individuals approach the troops or pose a threat to soldiers.\nThe IPC said nearly half a million people in Gaza, about one-fourth of the population, face catastrophic hunger that leaves many at risk of dying. It said hunger has been magnified by widespread displacement and the collapse of food production.\nNetanyahu’s office denounced the IPC report as “an outright lie,” and accuses Hamas of starving the hostages. Israel says it has allowed enough aid to enter during the war.\nActivity is escalating ahead of Gaza City offensive\nWith ground troops already active on the edges of Gaza City, a wide-scale operation there could start within days.\nAid group Doctors without Borders, or MSF, said Saturday its clinics around Gaza City are seeing high numbers of patients as people flee recent bombardments. The group said in a statement that “strikes are forcing people, including MSF staff, to flee their homes once again, and we are seeing displacement across Gaza City.”\nThe Israeli military has said troops are operating on the outskirts of Gaza City and in the city’s Zeitoun neighborhood.\nIsrael says Gaza City is still a Hamas stronghold, with a network of militant tunnels. The city also is home to hundreds of thousands of civilians, some of whom have fled from elsewhere.\nCeasefire efforts await Israel’s response\nMany Israelis fear the assault on Gaza City could doom the roughly 20 hostages who have survived captivity since 2023.\nNetanyahu said Thursday he had instructed officials to begin immediate negotiations to release hostages and end the war on Israel’s terms. It is unclear if Israel will return to long-running talks mediated by the United States, Egypt and Qatar after Hamas said earlier this week that it accepted a new proposal from the Arab mediators.\nHamas has said it would release captives in exchange for ending the war, but rejects disarmament without the creation of a Palestinian state.\nU.S. President Donald Trump expressed frustration with Hamas’ stance, suggesting the militant group was less interested in making deals to release hostages with so few left alive.\n“The situation has to end. It’s extortion, and it has to end,” Trump told reporters Friday. “I actually think (the hostages are) safer in many ways if you went in and you really went in fast and you did it.”\nThe post Israeli strikes in Gaza kill 25; famine announcement raises pressure appeared first on CBS News."
    },
    {
      "news_title": "Latest Israeli strikes kill 25 around Gaza as famine announcement raises pressure",
      "news_link": "https://www.stuff.co.nz/world-news/360801037/latest-israeli-strikes-kill-25-around-gaza-famine-announcement-raises-pressure",
      "bias": "Lean Left",
      "text": null
    },
    {
      "news_title": "Israeli strikes in Gaza as famine call raises pressure",
      "news_link": "https://www.canberratimes.com.au/story/9048179/israeli-strikes-in-gaza-as-famine-call-raises-pressure/",
      "bias": "Lean Left",
      "text": "Palestinians sheltering in tents or seeking scarce food aid are among at least 25 people killed by Israeli strikes and shootings in Gaza, according to local hospitals, as the world confronts an exceptional announcement that famine now grips Gaza's largest city.\nSubscribe today for the news that matters\nor signup to continue reading\nThe famine determination by the world's leading authority on food crises galvanised governments and aid groups to intensify pleas for Israel to halt its 22-month offensive on Gaza, prompted by Hamas's October 7, 2023, attacks.\nAid groups have warned for months that the war and Israel's restrictions of food into Gaza are causing starvation among civilians.\nIsrael denounced the famine declaration as lies and the military is pressing ahead with preparations to seize Gaza City.\nEfforts towards a ceasefire that could forestall the offensive are on hold as mediators await Israel's next steps.\nIsraeli strikes killed at least 14 people in the southern Gaza Strip early on Saturday, according to morgue records and health officials at Nasser Hospital.\nThe officials said the strikes targeted tents sheltering displaced people in Khan Younis, which became home to hundreds of thousands who had fled from elsewhere in Gaza.\nMore than half of the dead were women and children.\nIn northern Gaza, Israeli gunfire killed at least five aid-seekers on Saturday near the Zikim crossing with Israel, where UN and other agencies' convoys enter the enclave, health officials at the Sheikh Radwan field hospital told the AP.\nSix people were killed in other attacks on Gaza elsewhere on Saturday, according to hospitals and the Palestinian Red Crescent.\nThe Israeli military did not immediately respond to questions about the deaths.\nA report by the Integrated Food Security Phase Classification, or IPC, said on Friday that Gaza City was gripped by famine that was likely to spread if fighting and restrictions on humanitarian aid continued.\nIt was a highly rare pronouncement by the group, its first in the Middle East.\nIt came after Israel imposed a two-and-a-half-month blockade on Gaza earlier in 2025, then eased access with a focus on a new US-backed private aid supplier, the Gaza Humanitarian Foundation, or GHF.\nIn response to global outrage over images of emaciated children, Israel in recent weeks has allowed airdrops and a new influx of aid entering by land, but UN and other aid agencies say the food reaching Gaza is still not nearly enough.\nThe IPC said nearly half a million people in Gaza, about a quarter of the population, face catastrophic hunger that leaves many at risk of dying.\nHunger had been magnified by widespread displacement and the collapse of food production, it said.\nNetanyahu's office denounced the IPC report as \"an outright lie\", and accuses Hamas of starving the hostages.\nIsrael says it has allowed enough aid to enter during the war.\nWith ground troops already active in strategic areas, the wide-scale operation in Gaza City could start within days.\nThe Israeli military has said troops are operating on the outskirts of Gaza City and in the city's Zeitoun neighbourhood.\nIsrael says Gaza City is still a Hamas stronghold, with a network of militant tunnels.\nThe city also is home to hundreds of thousands of civilians, some of whom have fled from elsewhere.\nMany Israelis fear the assault on Gaza City could doom the roughly 20 hostages who have survived captivity since 2023.\nNetanyahu said on Thursday he had instructed officials to begin immediate negotiations to release hostages and end the war on Israel's terms.\nIt is unclear if Israel will return to long-running talks mediated by the United States, Egypt and Qatar after Hamas said earlier this week that it accepted a new proposal from the Arab mediators.\nHamas has said it would release captives in exchange for ending the war, but rejects disarmament without the creation of a Palestinian state.\nAustralian Associated Press"
    },
    {
      "news_title": "New Israeli strikes kill Palestinians seeking food aid, as Israel denounces famine declaration",
      "news_link": "https://www.theglobeandmail.com/world/article-israeli-strikes-palestinians-seeking-food-famine-declaration/",
      "bias": "Center",
      "text": "Israeli strikes and gunfire killed at least 33 Palestinians in Gaza on Saturday, including people sheltering in tents or seeking scarce food, local hospitals said as a famine in Gaza’s largest city puts new pressure on Israel over its 22-month offensive.\nIsrael’s defense minister has warned that Gaza City could be destroyed in a new military operation perhaps just days away, even as famine spreads there.\nAid groups have long warned that the war, sparked by Hamas’ Oct. 7, 2023, attack, and months of Israeli restrictions on food and medical supplies entering Gaza are causing starvation.\nIsrael has rejected the data-based famine declaration as “an outright lie.” Ceasefire efforts are on hold as mediators await Israel’s next steps.\nIsraeli strikes killed at least 17 people in southern Gaza, more than half of them women and children, according to morgue records and health officials at Nasser Hospital. The officials said the strikes targeted tents sheltering displaced people in Khan Younis.\n“Awad, why did you leave me?” a small boy asked his brother’s plastic-wrapped body.\nFamine grips Gaza City, driven by war and aid restrictions, food crises authority says\nAnother grieving relative, Hekmat Foujo, pleaded for a truce.\n“We want to rest,” Foujo said through her tears. “Have some mercy on us.”\nIn northern Gaza, Israeli gunfire killed at least five aid-seekers near the Zikim crossing with Israel, where UN and other truck convoys enter the territory, health officials at Sheikh Radwan field hospital told the AP.\nThe Palestinian Journalists Syndicate said cameraman Khaled al-Madhoun was killed while covering events at the Zikim crossing, and asserted that he was targeted by Israeli troops. The local Palestine TV confirmed his death.\nEleven people were killed in attacks elsewhere, according to hospitals and the Palestinian Red Crescent.\nIsrael’s military said it was not aware of a strike in Khan Younis at that location and was looking into the other incidents.\nAP journalists have seen chaos on roads leading to aid deliveries, and there have been almost daily reports of Israeli troops firing toward aid-seekers. Israel’s military says it fires warning shots if people approach troops or pose a threat.\nMohamed Saada was among thousands seeking food in the Zikim area – and one of many who left empty-handed. He cited the “huge numbers of people,” the shootings and “trucks running over people.”\nSome carried sacks of food like lentils and flour. Others carried the wounded, including on a wooden pallet. They navigated fetid puddles and the rubble of war as temperatures reached above 33 Celsius.\nExplainer: What we know so far as Israel prepares its Gaza City offensive\nFriday’s famine report by the Integrated Food Security Phase Classification said nearly half a million people – about one-fourth of Gaza’s population – face catastrophic hunger.\nThe rare pronouncement came after Israel imposed a 2 1/2-month blockade on Gaza earlier this year, then resumed some access with a focus on a new U.S.-backed private aid supplier, the Gaza Humanitarian Foundation.\nIn response to global outrage over images of emaciated children, Israel has also allowed airdrops and new deliveries by land, but the UN and others say it’s far from enough.\nIsraeli Prime Minister Benjamin Netanyahu’s office asserts it has allowed enough aid to enter during the war, while accusing Hamas of starving the hostages it holds.\nWith ground troops already active in Gaza City’s outskirts, the military operation could start within days in an area with hundreds of thousands of civilians. Israel says Gaza City is still a Hamas stronghold, with a network of militant tunnels.\nAid group Doctors without Borders, or MSF, said its clinics around Gaza City see high numbers of patients as people flee. Caroline Willemen, MSF project coordinator there, noted a marked increase in airstrikes since early August.\n“Those who have not moved are wondering what they should do,” she told the AP. “People want to stay, they have been displaced endlessly before, but they also know that at some point it will become very dangerous to remain.”\nOpinion: Inside Israel, the movement to stop Netanyahu’s Gaza war is gaining momentum\nMany Israelis fear the assault on Gaza City could doom the 20 hostages who are believed to have survived since 2023. Another 30 are thought to be dead. Hundreds of thousands of Israelis protested a week ago for a deal to end the fighting and bring everyone home.\n“Anyone who truly wants to bring the hostages home does not launch a ground invasion of Gaza,” Yotam Cohen, brother of hostage Nimrod Cohen, said ahead of a weekly rally in Tel Aviv.\nNetanyahu said Thursday he had instructed officials to begin immediate negotiations to release hostages and end the war on Israel’s terms. It was unclear if Israel would return to talks mediated by the United States, Egypt and Qatar after Hamas said it accepted a new proposal from Arab mediators.\nHamas has said it will release hostages in exchange for ending the war, but rejects disarming without the creation of a Palestinian state.\nAt Gaza’s Nasser Hospital, doctors treat malnourished children daily\nU.S. President Donald Trump has expressed frustration with Hamas’ stance, suggesting the militant group is less interested in making deals with few hostages left alive.\n“I actually think (the hostages are) safer in many ways if you went in and you really went in fast and you did it,” Trump told reporters Friday.\nGaza’s Health Ministry said at least 62,622 Palestinians have been killed in the war, including missing people now confirmed dead by a special ministry judicial committee.\nThe number of malnutrition-related deaths rose by eight to 281, the ministry said.\nA small group of Israelis protested against the far-right national security minister, Itamar Ben-Gvir, as he walked to a synagogue in Kfar Malal, north of Tel Aviv. Videos showed the minister arguing with the protesters.\n“We don’t want him in our village. Our message is to bring back the hostages,” one of the protesters, Boaz Levinstein, told the AP.\nBen-Gvir is a key partner in Netanyahu’s political coalition and a staunch opponent of reaching a deal with Hamas, which hostages’ families see as the only way to secure the release of loved ones."
    },
    {
      "news_title": "25 killed in new Israeli strikes as famine threatens Gaza",
      "news_link": "https://www.scmp.com/news/world/middle-east/article/3322928/israel-launches-deadly-strikes-across-gaza-killing-25-famine-threatens-enclave",
      "bias": "Center",
      "text": "Israel launches deadly strikes across Gaza, killing 25 as famine threatens enclave\nThe military escalation comes as mediators await a response from Israel to a ceasefire proposal that Hamas has already accepted\nPalestinians sheltering in tents or seeking scarce food aid were among at least 25 people killed by Israeli strikes and shootings on Saturday in Gaza, according to local hospitals, as the world confronted an exceptional announcement that famine is now gripping Gaza’s largest city.\nThe famine determination by the world’s leading authority on food crises galvanised governments and aid groups to intensify pleas for Israel to halt its 22-month offensive on Gaza, prompted by Hamas’ October 7, 2023, attacks. Aid groups have warned for months that the war and Israel’s restrictions on food into Gaza are causing starvation among civilians.\nIsrael denounced the famine declaration as lies, and the military is pressing ahead with preparations to seize Gaza City. Efforts towards a ceasefire that could forestall the offensive are on hold as mediators await Israel’s next steps.\nGaza hospitals take in new dead and wounded\nIsraeli strikes killed at least 14 people in the southern Gaza Strip early on Saturday, according to morgue records and health officials at Nasser Hospital. The officials said the strikes targeted tents sheltering displaced people in Khan Younis, which became home to hundreds of thousands who had fled from elsewhere in Gaza. More than half of the dead were women and children.\nAwad Abu Agala, uncle of two children who died, said no place in Gaza is now safe.\n“The entire Gaza Strip is being bombed … In the south. In the north. Everywhere,” Abu Agala said, adding that children were targeted overnight while in their tents.\nA grieving relative, Hekmat Foujo, pleaded for a truce."
    },
    {
      "news_title": "Israeli strikes and gunfire kill 33 as Gaza City becomes focus of famine and a military offensive",
      "news_link": "https://apnews.com/article/israel-palestinians-hamas-gaza-war-hostages-08-23-2025-7b138340106e247f9da13293ef8cf8e7",
      "bias": "Lean Left",
      "text": "Israeli strikes and gunfire kill 33 as Gaza City becomes focus of famine and a military offensive\nIsraeli strikes and gunfire kill 33 as Gaza City becomes focus of famine and a military offensive\nKHAN YOUNIS, Gaza Strip (AP) — Israeli strikes and gunfire killed at least 33 Palestinians in Gaza on Saturday, including people sheltering in tents or seeking scarce food, local hospitals said as a famine in Gaza’s largest city puts new pressure on Israel over its 22-month offensive.\nIsrael’s defense minister has warned that Gaza City could be destroyed in a new military operation perhaps just days away, even as famine spreads there.\nAid groups have long warned that the war, sparked by Hamas’ Oct. 7, 2023, attack, and months of Israeli restrictions on food and medical supplies entering Gaza are causing starvation.\nIsrael has rejected the data-based famine declaration as “an outright lie.” Ceasefire efforts are on hold as mediators await Israel’s next steps.\nWomen and children struck and killed in tents\nIsraeli strikes killed at least 17 people in southern Gaza, more than half of them women and children, according to morgue records and health officials at Nasser Hospital. The officials said the strikes targeted tents sheltering displaced people in Khan Younis.\n“Awad, why did you leave me?” a small boy asked his brother’s plastic-wrapped body.\nAnother grieving relative, Hekmat Foujo, pleaded for a truce.\n“We want to rest,” Foujo said through her tears. ‘’Have some mercy on us.”\nIn northern Gaza, Israeli gunfire killed at least five aid-seekers near the Zikim crossing with Israel, where U.N. and other truck convoys enter the territory, health officials at Sheikh Radwan field hospital told the AP.\nThe Palestinian Journalists Syndicate said cameraman Khaled al-Madhoun was killed while covering events at the Zikim crossing, and asserted that he was targeted by Israeli troops. The local Palestine TV confirmed his death.\nEleven people were killed in attacks elsewhere, according to hospitals and the Palestinian Red Crescent.\nIsrael’s military said it was not aware of a strike in Khan Younis at that location and was looking into the other incidents.\nAP journalists have seen chaos on roads leading to aid deliveries, and there have been almost daily reports of Israeli troops firing toward aid-seekers. Israel’s military says it fires warning shots if people approach troops or pose a threat.\nBraving gunfire and crowds for food\nMohamed Saada was among thousands seeking food in the Zikim area — and one of many who left empty-handed. He cited the “huge numbers of people,” the shootings and “trucks running over people.”\nSome carried sacks of food like lentils and flour. Others carried the wounded, including on a wooden pallet. They navigated fetid puddles and the rubble of war as temperatures reached above 92 degrees Fahrenheit (33 Celsius).\nFriday’s famine report by the Integrated Food Security Phase Classification said nearly half a million people — about one-fourth of Gaza’s population — face catastrophic hunger.\nThe rare pronouncement came after Israel imposed a 2 1/2-month blockade on Gaza earlier this year, then resumed some access with a focus on a new U.S.-backed private aid supplier, the Gaza Humanitarian Foundation.\nIn response to global outrage over images of emaciated children, Israel has also allowed airdrops and new deliveries by land, but the U.N. and others say it’s far from enough.\nIsraeli Prime Minister Benjamin Netanyahu’s office asserts it has allowed enough aid to enter during the war, while accusing Hamas of starving the hostages it holds.\nAn increase in Israeli airstrikes this month\nWith ground troops already active in Gaza City’s outskirts, the military operation could start within days in an area with hundreds of thousands of civilians. Israel says Gaza City is still a Hamas stronghold, with a network of militant tunnels.\nAid group Doctors without Borders, or MSF, said its clinics around Gaza City see high numbers of patients as people flee. Caroline Willemen, MSF project coordinator there, noted a marked increase in airstrikes since early August.\n“Those who have not moved are wondering what they should do,” she told the AP. “People want to stay, they have been displaced endlessly before, but they also know that at some point it will become very dangerous to remain.”\nCeasefire efforts await Israel’s response\nMany Israelis fear the assault on Gaza City could doom the 20 hostages who are believed to have survived since 2023. Another 30 are thought to be dead. Hundreds of thousands of Israelis protested a week ago for a deal to end the fighting and bring everyone home.\n“Anyone who truly wants to bring the hostages home does not launch a ground invasion of Gaza,” Yotam Cohen, brother of hostage Nimrod Cohen, said ahead of a weekly rally in Tel Aviv.\nNetanyahu said Thursday he had instructed officials to begin immediate negotiations to release hostages and end the war on Israel’s terms. It was unclear if Israel would return to talks mediated by the United States, Egypt and Qatar after Hamas said it accepted a new proposal from Arab mediators.\nHamas has said it will release hostages in exchange for ending the war, but rejects disarming without the creation of a Palestinian state.\nU.S. President Donald Trump has expressed frustration with Hamas’ stance, suggesting the militant group is less interested in making deals with few hostages left alive.\n“I actually think (the hostages are) safer in many ways if you went in and you really went in fast and you did it,” Trump told reporters Friday.\nGaza’s Health Ministry said at least 62,622 Palestinians have been killed in the war, including missing people now confirmed dead by a special ministry judicial committee.\nThe number of malnutrition-related deaths rose by eight to 281, the ministry said.\nIsraeli protest against far-right security minister\nA small group of Israelis protested against the far-right national security minister, Itamar Ben-Gvir, as he walked to a synagogue in Kfar Malal, north of Tel Aviv. Videos showed the minister arguing with the protesters.\n“We don’t want him in our village. Our message is to bring back the hostages,” one of the protesters, Boaz Levinstein, told the AP.\nBen-Gvir is a key partner in Netanyahu’s political coalition and a staunch opponent of reaching a deal with Hamas, which hostages’ families see as the only way to secure the release of loved ones.\n___\nMagdy reported from Cairo. Associated Press writers Sam Mednick in Jerusalem and Michelle Price in Washington contributed to this report.\n___\nFollow AP’s war coverage at https://apnews.com/hub/israel-hamas-war"
    },
    {
      "news_title": "Gaza famine claims 8 more lives in 24 hours, including 2 children",
      "news_link": "https://www.aa.com.tr/en/middle-east/gaza-famine-claims-8-more-lives-in-24-hours-including-2-children/3667079",
      "bias": "Right",
      "text": "Gaza famine claims 8 more lives in 24 hours, including 2 children\nDeath toll from Israeli-imposed famine rises to 281, including 114 children, since start of crisis, says Health Ministry\nANKARA\nEight more Palestinians, including two children, died from malnutrition caused by the Israeli blockade in Gaza over the past 24 hours, raising the total death toll to 281 since the onset of the humanitarian crisis, local sources reported on Saturday.\nMunir al-Bursh, the director general of Gaza’s Health Ministry, said on the US social media company X that among the victims, 114 are children.\n“The famine is silently ravaging the bodies of civilians, depriving children of their right to life, and turning tents and hospitals into daily scenes of tragedy,” he added.\nIsrael has killed nearly 62,300 Palestinians in Gaza since October 2023. The military campaign has devastated the enclave, which is facing famine.\nLast November, the International Criminal Court issued arrest warrants for Netanyahu and his former Defense Minister Yoav Gallant for war crimes and crimes against humanity in Gaza.\nIsrael also faces a genocide case at the International Court of Justice for its war on the enclave.\nAnadolu Agency website contains only a portion of the news stories offered to subscribers in the AA News Broadcasting System (HAS), and in summarized form. Please contact us for subscription options."
    },
    {
      "news_title": "Gaza famine claims 8 more lives as Israeli strikes kill 25 across Strip",
      "news_link": "https://www.dailysabah.com/world/mid-east/gaza-famine-claims-8-more-lives-as-israeli-strikes-kill-25-across-strip",
      "bias": "Right",
      "text": "Eight more Palestinians, including two children, died from malnutrition caused by the Israeli blockade in Gaza over the past 24 hours, raising the total famine-related death toll to 281 since the onset of the humanitarian crisis, local health officials said Saturday.\nMunir al-Bursh, director general of Gaza’s Health Ministry, said in a post on X that 114 of those killed by starvation are children. “The famine is silently ravaging the bodies of civilians, depriving children of their right to life, and turning tents and hospitals into daily scenes of tragedy,” he said.\nAt the same time, at least 25 Palestinians were killed in a new wave of Israeli attacks across the Gaza Strip, according to medical sources.\nArtillery fire struck tents sheltering displaced families in the Asdaa area northwest of Khan Younis, killing 16 people, including six children and an infant. Several others were injured.\nIsraeli drones also hit homes in the Maghazi and Nuseirat refugee camps in central Gaza, leaving multiple casualties, while two civilians waiting for aid were shot dead in separate incidents near Khan Younis and the Israeli-controlled Netzarim corridor.\nGaza’s Health Ministry said Israel’s controversial unilateral “Gaza Humanitarian Foundation” aid mechanism has turned distribution points into “death traps,” with at least 2,060 people killed and more than 15,000 wounded while waiting for aid since late May.\nIsrael has killed nearly 62,300 Palestinians in Gaza since October 2023, according to the ministry. The military campaign has devastated the enclave, which faces a worsening famine alongside relentless bombardment.\nLast November, the International Criminal Court issued arrest warrants for Israeli Prime Minister Benjamin Netanyahu and former Defense Minister Yoav Gallant on war crimes and crimes against humanity charges. Israel also faces a genocide case at the International Court of Justice over its conduct in Gaza."
    },
    {
      "news_title": "Israel escalates war in Gaza; Trump keeps focus on Ukraine",
      "news_link": "https://thehill.com/policy/international/5466145-trump-netanyahu-gaza-war-famine/",
      "bias": "Center",
      "text": null
    },
    {
      "news_title": "Israeli airstrikes hit Gaza amid worsening humanitarian crisis",
      "news_link": "http://www.ecns.cn/news/politics/2025-08-25/detail-iheummsh1690239.shtml",
      "bias": "unknown",
      "text": "Israeli strikes and gunfire killed at least 33 Palestinians in Gaza on Saturday, including people sheltering in tents and searching for food, as the enclave faces the risk of famine 22 months into Israel's offensive.\nAnalyst warned that Israel's military campaign in Gaza is unlikely to ease anytime soon, as its ultimate objective is to gain full control of the Gaza Strip.\nIsrael's defense minister has said that Gaza City could be destroyed in a new military operation perhaps just days away.\nAid groups have long warned that the war, which began on Oct 7, 2023, and months of Israeli restrictions on food and medical supplies entering Gaza are causing starvation.\nIn southern Gaza, Israeli strikes killed at least 17 people, more than half of them women and children, according to morgue records and health officials at Nasser Hospital in Khan Younis, where officials said the strikes hit tents sheltering displaced people.\nEleven people were killed in attacks elsewhere, according to hospitals and the Palestinian Red Crescent.\nGaza's Health Ministry said at least 62,686 Palestinians have been killed in the war, including missing people now confirmed dead by a special ministry judicial committee. The number of malnutrition-related deaths has exceeded 300, the ministry said.\nChaos was seen on roads leading to aid delivery sites, and there have been almost daily reports of Israeli troops firing in the vicinity of aid-seekers. Israel's military says it fires warning shots if people approach troops or pose a threat.\nThe Integrated Food Security Phase Classification, a network of United Nations agencies and NGOs, released a famine report on Friday, saying that nearly half a million people — about one-fourth of Gaza's population — face catastrophic hunger.\nThe pronouncement came after Israel imposed a blockade on Gaza earlier this year, then resumed some access with a focus on the Gaza Humanitarian Foundation, a new private aid supplier backed by the United States.\nThousands of people have protested in cities around the world after the UN network officially declared famine in northern Gaza.\nIn response to global outrage over images of emaciated children, Israel has also allowed airdrops and new deliveries by land, but the UN and others say it is far from enough.\nIsrael has rejected the famine report, with Prime Minister Benjamin Netanyahu's office calling it \"an outright lie\", saying that Israel \"does not have a policy of starvation\" but rather \"a policy of preventing starvation\".\nCeasefire efforts are on hold as mediators await Israel's next steps.\nMany Israelis fear that the assault on Gaza City could doom the 20 hostages who are believed to have survived since 2023. Another 30 hostages are thought to be dead. Hundreds of thousands of Israelis protested a week ago for a deal to end the fighting and bring everyone home.\nDing Long, a professor at the Middle East Studies Institute of Shanghai International Studies University, said the ultimate objective for Israel is to gain full control of the Gaza Strip, a goal it links to the elimination or removal of Hamas.\nHe said that Israel's military campaign in Gaza is unlikely to ease in the short term, with operations expected to continue until its stated objectives are met. Casualties on both sides are expected to rise, and the humanitarian crisis is likely to deepen.\n\"Prospects for a ceasefire in Gaza remain slim, with the pace of the conflict largely shaped by Israel's domestic politics and regional ambitions,\" Ding said, adding that he believes that even if Hamas signaled readiness for a truce, Israel would be unlikely to agree.\nOn Thursday, the United Kingdom, Australia and Japan were among 21 countries that condemned Israel's plan to build a settlement in the occupied West Bank, warning that the move undermines prospects for a two-state solution.\nDing said that an increasing number of Western countries are shifting their stance on the conflict in Gaza, openly criticizing Israel and voicing support for Palestinian statehood.\n\"Israel, however, with firm backing from the US, has shown little regard for international opinion and continues its campaign to eliminate Hamas and reassert control over Gaza,\" he said.\n\"The immediate priority is to de-escalate the conflict and work toward a ceasefire,\" Ding said, adding that peace talks can help bring the matter back to the path of a two-state solution, he said."
    },
    {
      "news_title": "Israeli forces push deeper into Gaza City with intensifying bombardment",
      "news_link": "https://www.dailyfinland.fi/worldwide/44848/Israeli-forces-push-deeper-into-Gaza-City-with-intensifying-bombardment",
      "bias": "unknown",
      "text": "Israeli forces push deeper into Gaza City with intensifying bombardment\nPublished : 25 Aug 2025, 00:03\nThe Israeli army on Sunday expanded its ground operations in and around Gaza City, pushing tanks into residential neighborhoods under the cover of airstrikes and artillery fire, heightening fears of a full-scale invasion of the densely populated enclave, reported Xinhua.\nResidents said Israeli armor rolled into the Zeitoun and al-Sabra districts south of Gaza City, and into Jabalia in the north, as warplanes pounded buildings and homes. Explosions and \"fire belts\" -- strips of land set ablaze by incendiary munitions -- were reported, forcing dozens of families to flee westward and southward in search of safety.\nMahmoud Basal, spokesman for Gaza's Civil Defense, said air and drone strikes hit homes, apartments, a school and tents for displaced people across the Strip. He said Israeli forces also opened fire on Palestinians gathering near two aid centers in central and southern Gaza. At least 25 people were killed and dozens wounded since dawn, he said.\nPalestinian officials said high-rise buildings were hit in Zeitoun, Sabra and Jabalia, leaving many families trapped. Hospitals, already badly damaged and short of supplies, were struggling to cope. \"The displaced do not know where to go. There are no safe areas left,\" Basal said.\nThe Hamas-run Gaza government media office condemned Israel's threats to invade Gaza City, home to more than 1 million people. It called the plan a \"dangerous escalation\" and warned an assault would amount to \"a major war crime\" given the collapse of the health system.\nThe Palestinian Foreign Ministry urged \"decisive international action\" to halt \"Israel's deliberate policy\" of famine. It said Gaza's hunger crisis was not caused by lack of resources but by blockade and bombardment, and vowed to press its case through diplomatic and legal channels.\nThe Israeli military said its forces had re-entered Jabalia to \"further degrade Hamas' military capabilities,\" dismantling infrastructure above and below ground and preventing fighters from returning. \"The troops' activity enables the expansion of combat into additional areas,\" it said in a statement.\nMeanwhile, Hamas said it had agreed to a partial prisoner exchange and was ready for a full truce, but accused Israeli Prime Minister Benjamin Netanyahu of blocking a deal despite mediation by Egypt and Qatar. Hamas said only a ceasefire could secure the release of all Israeli hostages and held Netanyahu responsible for their fate.\nHealth authorities in Gaza said at least 10,842 Palestinians had been killed and 45,910 wounded since Israel stepped up its offensive on March 18. That brought the total death toll since the war began in October 2023 to 62,686, with 157,951 others injured. Officials said 289 people, including 115 children, had died from malnutrition or starvation, eight of them in the past 24 hours."
    },
    {
      "news_title": "Gaza famine declared as Israeli strikes escalate, world pressure grows - Dailynewsegypt",
      "news_link": "https://www.dailynewsegypt.com/2025/08/23/gaza-famine-declared-as-israeli-strikes-escalate-world-pressure-grows/",
      "bias": "unknown",
      "text": "Gaza plunged deeper into crisis on Saturday as Israeli airstrikes pounded Gaza City for a third straight day and the United Nations confirmed famine had taken hold in the Strip—the first such declaration in the Middle East.\nThick smoke billowed over several neighbourhoods as the Israeli army pressed its offensive to seize the city. Local sources said at least 39 Palestinians were killed, including 16 people in an artillery strike that hit tents sheltering displaced families north of Khan Younis.\nThe UN said nearly half a million people now face catastrophic hunger. “The famine in Gaza is not a mystery but a man-made catastrophe,” UN Secretary-General António Guterres warned, calling the crisis “a moral indictment and a failure of humanity itself.” He demanded an immediate ceasefire and unfettered humanitarian access.\nPhilippe Lazzarini, head of UNRWA, urged Israel to stop “denying the famine it has caused,” warning that “every hour counts.” Gaza’s Health Ministry said the announcement came too late but confirmed Israel was pursuing a policy of “systematic starvation.”\nInside hospitals, the toll is stark. Ahmad Al-Farra, director of Al-Tahrir Hospital for Children and Maternity, said the malnutrition clinic at Nasser Medical Complex was now treating up to four times the expected number of patients, diagnosing more than 50 new cases daily. He described the situation as “catastrophic” and warned the Strip had entered “a decisive stage of famine.”\nThe Health Ministry reported 61 people killed and 308 injured in the past 24 hours, bringing the death toll since October 7, 2023, to more than 62,600, with over 157,000 wounded. Since mid-March alone, more than 10,000 have died and 45,000 have been injured. Over 2,000 Palestinians have been killed while trying to access aid.\nThe International Organization for Migration rejected Israeli claims that the UN famine declaration relied on “Hamas lies,” stressing the findings were based on established global methodology.\nThe crisis is also fuelling political turmoil abroad. In the Netherlands, Foreign Minister Kaspar Veldkamp resigned Friday amid disputes over sanctions on Israel, saying he could no longer take meaningful steps to pressure Tel Aviv.\nMeanwhile, The Atlantic quoted an Israeli security official as saying Hamas still has about 20,000 fighters and that “war is the strategy” in Gaza—a policy that serves Prime Minister Benjamin Netanyahu’s government but “no one else.” The official added that settler violence against Palestinians has more than doubled this year, rising from under 90 incidents a month to over 200.\nIsraeli media also reported a “serious security incident” in Khan Younis, a phrase often used for resistance attacks that inflict casualties on Israeli troops. No details were provided.\nWith strikes intensifying and aid supplies dwindling, international appeals for a ceasefire are growing louder. But aid agencies warn that time is running out to prevent hundreds of thousands from succumbing to hunger and disease."
    },
    {
      "news_title": "Israeli attacks kill 37 in Gaza as more Palestinians die from starvation – Monkey Viral",
      "news_link": "https://monkeyviral.com/israeli-attacks-kill-37-in-gaza-as-more-palestinians-die-from-starvation/",
      "bias": "unknown",
      "text": "Israeli attacks kill 37 in Gaza as more Palestinians die from starvation\nHealth authorities say eight more people, including two children, die from malnutrition after famine declared in Gaza.\nHealth authorities say eight more people, including two children, die from malnutrition after famine declared in Gaza."
    },
    {
      "news_title": "Israeli strikes around Gaza kill 25 amid famine warning",
      "news_link": "https://www.awazthevoice.in/world-news/israeli-strikes-around-gaza-kill-amid-famine-warning-40769.html",
      "bias": "unknown",
      "text": "Khan Younis\nPalestinians sheltering in tents or seeking scarce food aid were among at least 25 people killed by Israeli strikes and shootings Saturday in Gaza, according to local hospitals, as the world confronted an exceptional announcement that famine is now gripping Gaza's largest city.\nThe famine determination by the world's leading authority on food crises galvanised governments and aid groups to intensify pleas for Israel to halt its 22-month offensive on Gaza, prompted by Hamas' October 7, 2023 attacks.\nAid groups have warned for months that the war and Israel's restrictions of food into Gaza are causing starvation among civilians.\nIsrael denounced the famine declaration as lies and the military is pressing ahead with preparations to seize Gaza City. Efforts toward a ceasefire that could forestall the offensive are on hold as mediators await Israel's next steps.\nGaza hospitals take in new dead and wounded\nIsraeli strikes killed at least 14 people in the southern Gaza Strip early Saturday, according to morgue records and health officials at Nasser Hospital. The officials said the strikes targeted tents sheltering displaced people in Khan Younis, which became home to hundreds of thousands who had fled from elsewhere in Gaza.\nMore than half of the dead were women and children.\nAwad Abu Agala, uncle of two children who died, said no place in Gaza is now safe.\n“The entire Gaza Strip is being bombed ... In the south. In the north. Everywhere,” Abu Agala told The Associated Press, saying the children were targeted overnight while in their tents.\nA grieving relative, Hekmat Foujo, pleaded for a truce.\n“We want to rest,” Foujo said, fighting through her tears. “Have some mercy on us.”\nIn northern Gaza, Israeli gunfire killed at least five aid-seekers Saturday near the Zikim crossing with Israel, where UN and other agencies' convoys enter the enclave, health officials at the Sheikh Radwan field hospital told the AP.\nSix people were killed in other attacks on Gaza elsewhere Saturday, according to hospitals and the Palestinian Red Crescent.\nThe Israeli military did not immediately respond to questions about the deaths.\nA famine announcement ups the pressure\nA report by the Integrated Food Security Phase Classification, or IPC, said Friday that Gaza City is gripped by famine that is likely to spread if fighting and restrictions on humanitarian aid continue.\nIt was a highly rare pronouncement by the group, its first in the Middle East, and came after Israel imposed a 2 1/2-month blockade on Gaza earlier this year, then eased access with a focus on a new US-backed private aid supplier, the Gaza Humanitarian Foundation, or GHF.\nIn response to global outrage over images of emaciated children, Israel in recent weeks has allowed airdrops and a new influx of aid entering by land, but UN and other aid agencies say the food reaching Gaza is still not nearly enough.\nAP journalists have seen chaos and security problems on roads leading to aid deliveries, and there have been reports of Israeli troops firing toward aid-seekers. Israel's military says they fire warning shots if individuals approach the troops or pose a threat to soldiers.\nThe IPC said nearly half a million people in Gaza, about one-fourth of the population, face catastrophic hunger that leaves many at risk of dying. It said hunger has been magnified by widespread displacement and the collapse of food production.\nNetanyahu's office denounced the IPC report as “an outright lie,” and accuses Hamas of starving the hostages. Israel says it has allowed enough aid to enter during the war.\nActivity is escalating ahead of Gaza City offensive\nWith ground troops already active in strategic areas, the widescale operation in Gaza City could start within days.\nAid group Doctors without Borders, or MSF, said Saturday its clinics around Gaza City are seeing high numbers of patients as people flee recent bombardments. The group said in a statement that “strikes are forcing people, including MSF staff, to flee their homes once again, and we are seeing displacement across Gaza City.\nThe Israeli military has said troops are operating on the outskirts of Gaza City and in the city's Zeitoun neighbourhood.\nIsrael says Gaza City is still a Hamas stronghold, with a network of militant tunnels. The city also is home to hundreds of thousands of civilians, some of whom have fled from elsewhere.\nCeasefire efforts await Israel's response\nMany Israelis fear the assault on Gaza City could doom the roughly 20 hostages who have survived captivity since 2023.\nNetanyahu said Thursday he had instructed officials to begin immediate negotiations to release hostages and end the war on Israel's terms. It is unclear if Israel will return to long-running talks mediated by the United States, Egypt and Qatar after Hamas said earlier this week that it accepted a new proposal from the Arab mediators.\nHamas has said it would release captives in exchange for ending the war, but rejects disarmament without the creation of a Palestinian state.\nUS President Donald Trump expressed frustration with Hamas' stance, suggesting the militant group was less interested in making deals to release hostages with so few left alive.\nREAD MORE: C Shukkur and Sheena set off a quiet 'remarriage' tsunami among Muslims\n“The situation has to end. It's extortion, and it has to end,” Trump told reporters Friday. “I actually think (the hostages are) safer in many ways if you went in and you really went in fast and you did it.”"
    },
    {
      "news_title": "Israeli Attacks on Gaza Kill at Least 65 Palestinians",
      "news_link": "https://daynews.tv/2025/08/23/israeli-attacks-kill-65-palestinians/",
      "bias": "unknown",
      "text": "Israeli Attacks on Gaza Kill at Least 65 Palestinians, Including 37 in Gaza City\nAt least 65 Palestinians have been killed in Israeli attacks on Gaza since dawn, medical sources told Al Jazeera. Among the victims, 37 were killed in Gaza City, where Israel has escalated strikes in preparation for a broader planned offensive. The latest escalation marks one of the deadliest days in recent weeks as civilians continue to face bombardments across residential neighborhoods.\nIsraeli warplanes and artillery struck multiple areas overnight and into the morning, with medics reporting mounting casualties as emergency teams struggled to retrieve bodies from the rubble. Gaza’s Ministry of Health confirmed that entire families were wiped out in some of the strikes.\nIsraeli Strike Hits School in Sheikh Radwan\nA deadly air strike struck a school in the Sheikh Radwan neighborhood of Gaza City, where dozens of Palestinians had taken shelter. At least 12 civilians were killed in the attack, according to Gaza’s Ministry of Health. Survivors reported that people were sleeping in makeshift tents inside the schoolyard when the missiles struck, leaving no time to escape.\nFootage circulating on social media and verified by Al Jazeera showed an Israeli quadcopter hovering above a building in Sheikh Radwan. Residents looked on anxiously before the drone dropped an explosive on its target. Moments later, thick smoke billowed from the site, confirming the devastation.\nThe attack further deepened fears among displaced families who had sought refuge in schools, mosques, and open spaces after fleeing their homes amid relentless bombardments.\nMore Civilian Casualties Reported\nElsewhere in Gaza City, Israeli forces killed another person in the Tuffah neighborhood, a medical source at al-Ahli Hospital told Al Jazeera. Residents said the victim was targeted while walking near his home.\nThe series of attacks comes as the humanitarian crisis in Gaza worsens. Hospitals are overwhelmed, morgues are running out of space, and food and water shortages have left thousands at risk. Aid agencies warn that the intensifying strikes could push the already dire situation into total collapse.\nIsraeli Leadership Warns of Wider Offensive\nIsraeli Defence Minister Israel Katz warned that Gaza City would face total destruction unless Hamas agreed to Israel’s conditions for ending the war. “The gates of hell will soon open on the heads of Hamas’ murderers and rapists in Gaza – until they agree to Israel’s conditions for ending the war,” Katz wrote in a post on X.\nThe demands include the release of all Israeli captives and the full disarmament of Hamas. Katz reiterated that no ceasefire would be accepted without these terms being met.\nPrime Minister Benjamin Netanyahu also confirmed that the military was preparing to launch a major ground operation in Gaza City. According to Israeli officials, the operation could begin within days.\nHamas Rejects Disarmament Without Statehood\nHamas has responded by rejecting Israel’s terms, saying it is willing to release captives only in exchange for an end to the war. However, the group has made clear that it will not disarm without the establishment of an independent Palestinian state.\nThe standoff leaves little room for negotiation as the civilian death toll continues to rise. Netanyahu insists that the offensive is the only way to free captives and achieve the stated objective of destroying Hamas. Critics, however, warn that a large-scale assault could endanger the lives of captives still believed to be alive in Gaza.\nRead more: Pakistan Shaheens edge Nepal in last-ball thriller to enter semi-finals\nGrowing Concerns Over Civilian Suffering\nHuman rights groups and international organizations have expressed alarm over the escalating violence in Gaza. They argue that Israel’s air strikes on schools and densely populated neighborhoods amount to collective punishment of civilians.\nWith more than 65 Palestinians killed since dawn, including dozens of women and children, aid workers are warning of a worsening humanitarian catastrophe. Residents say nowhere feels safe, as shelters, hospitals, and schools remain under constant threat of bombardment.\nAs Israel signals a full-scale assault on Gaza City, the civilian population braces for more destruction, raising fears that the death toll could rise even further in the coming days.\nFollow us on Instagram, YouTube, Facebook,, X and TikTok for latest updates"
    }
  ]
}