{
  "story_id": "GN_20250823_191208_67f6d450",
  "metadata": {
    "title": "Top officials of Amazon nations meet in Colombia to push joint rainforest protection plan",
    "timestamp": "2025-08-23T19:12:08.306082",
    "url": "https://ground.news/article/top-officials-of-amazon-nations-meet-in-colombia-to-push-joint-rainforest-protection-plan"
  },
  "bias_distribution": {
    "total_sources": "11",
    "leaning_left": "4",
    "center": "5",
    "leaning_right": "0"
  },
  "perspective_summaries": {
    "left": [
      "Presidents from Colombia, Brazil, and Bolivia met with Indigenous leaders in Bogota to discuss a joint plan for rainforest protection, which was seen as crucial to combating global warming.",
      "They signed the 'Declaration of Bogota,' focusing on cooperation among Amazon nations to protect the rainforest, covering over 2.5 million square miles.",
      "Ecuador’s Vice President María José Pinto emphasized the need for 'concrete actions' beyond good intentions to safeguard the Amazon's legacy.",
      "Colombian Indigenous leader Oswaldo Muca urged for real actions beyond speeches, advocating for direct financing for Indigenous peoples to prevent further destruction of the Amazon."
    ],
    "center": [
      "Presidents from Colombia, Brazil, and Bolivia met with Indigenous leaders in Bogota to discuss a joint plan for rainforest protection, which was seen as crucial to combating global warming.",
      "They signed the 'Declaration of Bogota,' focusing on cooperation among Amazon nations to protect the rainforest, covering over 2.5 million square miles.",
      "Ecuador’s Vice President María José Pinto emphasized the need for 'concrete actions' beyond good intentions to safeguard the Amazon's legacy.",
      "Colombian Indigenous leader Oswaldo Muca urged for real actions beyond speeches, advocating for direct financing for Indigenous peoples to prevent further destruction of the Amazon."
    ],
    "right": [
      "Presidents from Colombia, Brazil, and Bolivia met with Indigenous leaders in Bogota to discuss a joint plan for rainforest protection, which was seen as crucial to combating global warming.",
      "They signed the 'Declaration of Bogota,' focusing on cooperation among Amazon nations to protect the rainforest, covering over 2.5 million square miles.",
      "Ecuador’s Vice President María José Pinto emphasized the need for 'concrete actions' beyond good intentions to safeguard the Amazon's legacy.",
      "Colombian Indigenous leader Oswaldo Muca urged for real actions beyond speeches, advocating for direct financing for Indigenous peoples to prevent further destruction of the Amazon."
    ]
  },
  "sources": [
    {
      "news_title": "Top officials of Amazon nations meet in Colombia to push joint rainforest protection plan",
      "news_link": "https://apnews.com/article/rainforest-amazon-summit-bogota-indigenous-db565767f1431dd5817d1a7d00f15673",
      "bias": "Lean Left",
      "text": "Top officials of Amazon nations meet in Colombia to push joint rainforest protection plan\nThe foreign ministers of the countries that share the Amazon rainforest in South America met on Thursday in Bogota, ahead of a meeting of heads of state on Friday. (AP Video: Marko Alvarez)\nBOGOTA, Colombia (AP) — Presidents from South America’s Amazon nations gathered Friday alongside Indigenous leaders to agree on a joint plan to safeguard the world’s largest rainforest — a vast region seen as crucial to slowing global warming.\nGathering in Colombia’s capital of Bogota, the presidents of Colombia, Brazil and Bolivia joined the vice president of Ecuador and other top officials from Amazon nations.\n“There is no individual exit from the climate crisis,” Brazil’s President Luiz Inácio Lula da Silva said during his declaration. “We need a new global governance with the authority to make countries keep their promises.”\nThey signed off on the “Declaration of Bogota,” a political blueprint to be formally adopted by Amazon nations, setting out a common vision for deeper cooperation across the region, which sprawls over more than 2.5 million square miles (6.7 million square kilometers).\nEcuador’s Vice President María José Pinto urged leaders to move beyond “good intentions” to “concrete actions” to protect the Amazon, calling it both the region’s responsibility and its legacy to the world. She said work must be led from the territories, listening to communities and respecting ancestral knowledge, and stressed the rainforest should be central to the global agenda because “what happens here determines the future of everyone.”\n“In Ecuador, we believe solutions are not built from the capitals, but from the territories, listening to and working alongside our people,” Pinto said. “We must keep the Amazon at the center of the global conversation.”\nOn the eve of the gathering, foreign ministers from the eight members of the Amazon Cooperation Treaty Organization — a little-known, decades-old intergovernmental body linking all the countries of the Amazon basin — approved 20 resolutions. They range from a new regional Indigenous Peoples’ Mechanism to initiatives on food security, climate risk and institutional strengthening.\nScientists say the Amazon acts as a massive carbon sink absorbing more carbon dioxide than it releases and plays a key role in regulating rainfall patterns far beyond South America. Its loss could accelerate global warming and disrupt agriculture as far away as the U.S. Midwest and parts of Europe, while threatening the survival of thousands of species found nowhere else on Earth.\nTop officials also met on Thursday to review progress on commitments made at the Belem Declaration, a 2023 agreement signed in Brazil that pledged closer coordination on protecting the Amazon, including policies on deforestation, climate change and Indigenous rights.\nEach ACTO country will appoint two government delegates and two Indigenous delegates to the body, which will meet annually and can convene extraordinary sessions. Decisions must be made unanimously.\nOswaldo Muca, who represents Colombia’s Indigenous Amazon communities, told The Associated Press on the sidelines of Friday’s event that his community is “committed to safeguarding our territory and the Amazon, protecting it and caring for it.” He said they oppose mining and oil exploration because “it destroys our territory, destroys humanity and destroys life.”\nMuca welcomed the ministers’ approval of a direct financing mechanism for Indigenous peoples, calling it “the only way to avoid reaching the point of no return” and noting that “we are now part of that treaty mechanism.”\nAsked if he believed the heads of state would follow through, Muca said they had “talked a lot about saving the Amazon,” but insisted that “our words must be more than political speeches … they must be real, concrete actions.”\nACTO Secretary-General Martín von Hildebrand said that political will and unity among member countries are essential to protecting the basin’s forests, rivers and biodiversity — resources that store vast amounts of carbon and help regulate the planet’s climate.\nPeruvian Indigenous leader Julio Cusurichi, attending the event, said: “We are asking countries to take immediate action because deforestation and pollution are advancing, and the impacts of climate change are severe.”\n___\nThe Associated Press’ climate and environmental coverage receives financial support from multiple private foundations. AP is solely responsible for all content. Find AP’s standards for working with philanthropies, a list of supporters and funded coverage areas at AP.org.\n____\nFollow AP’s coverage of Latin America and the Caribbean at https://apnews.com/hub/latin-america"
    }
  ]
}