{
  "story_id": "GN_20250825_223530_9b71f2de",
  "metadata": {
    "title": "Germany Indicts American Ex-Defense Contractor Over Alleged Offers of US Military Secrets to China",
    "timestamp": "2025-08-25T22:35:30.462104",
    "url": "https://ground.news/article/american-accused-of-offering-sensitive-information-on-us-military-to-china-indicted-in-germany"
  },
  "bias_distribution": {
    "total_sources": "31",
    "leaning_left": "6",
    "center": "7",
    "leaning_right": "4"
  },
  "perspective_summaries": {
    "left": [
      "An American man, identified as Martin D., has been indicted on espionage charges in Germany for allegedly offering sensitive information to China.",
      "Martin D. worked for a U.S. Defense Department contractor and was employed at a military facility in Germany between 2020 and early 2023, according to prosecutors.",
      "He is accused of contacting Chinese authorities multiple times in the summer of 2024 for military data, as stated by German prosecutors.",
      "The Koblenz court will decide whether to proceed to trial regarding the charges against Martin D., the prosecution stated."
    ],
    "center": [
      "An American man who worked at a U.S. military facility in Germany was indicted on espionage charges for allegedly offering to supply sensitive information to China.",
      "The suspect, identified only as Martin D., was arrested in Frankfurt in early November and charged with willingness to engage in espionage for a foreign intelligence service.",
      "German media reported that the suspect apparently didn't manage to transfer any data to Chinese authorities before his arrest."
    ],
    "right": [
      "An American citizen, identified as Martin D., has been charged with attempting to provide sensitive U.S. military information to China, according to Germany's Federal Prosecutor General.",
      "Martin D. worked as a contractor for the U.S. Department of Defense from 2017 to 2023 and attempted to contact Chinese agencies to offer military data since summer 2024, as reported by German authorities.",
      "Martin D. was arrested in November 2024 and has remained in custody since his arrest.",
      "No sensitive military information was reportedly transferred to China before Martin D.'s arrest in November 2024, as noted by local German media."
    ]
  },
  "sources": [
    {
      "news_title": "U.S. military contractor accused of trying to spy for China charged with espionage in Germany",
      "news_link": "https://www.cbsnews.com/news/us-military-contractor-spying-china-espionage-charges-germany/",
      "bias": "Lean Left",
      "text": "U.S. military contractor accused of trying to spy for China charged with espionage in Germany\nBerlin — An American man who worked at a U.S. military facility in Germany and allegedly offered to supply sensitive information to China has been indicted on espionage charges, German prosecutors said Monday.\nThe suspect, identified only as Martin D. in line with German privacy rules, was arrested in Frankfurt in early November. In an indictment sent to the state court in Koblenz earlier this month, he is charged with having declared his willingness to engage in espionage for a foreign intelligence service, federal prosecutors said.\nThe man, in his late thirties, worked between 2017 and early 2023 for a civilian contractor of the U.S. Defense Department, and worked at an unidentified U.S. military facility in Germany from at least 2020 onward, prosecutors said in a statement.\nHe is accused of contacting Chinese authorities repeatedly in the summer of 2024 and offering to provide sensitive U.S. military information for Chinese intelligence.\nGerman media have reported that the suspect apparently didn't manage to transfer any data to Chinese authorities before his arrest.\nThe court in Koblenz will now have to decide whether to send the case to trial and, if so, when.\nThe case has been investigated by the federal prosecutor's office, which ordered the arrest on a warrant issued on Oct. 30, 2024.\n\"Due to a pressing suspicion, the accused stands charged with offering himself as an agent to a foreign intelligence service,\" the prosecutor's office said in a statement at the time of the arrest.\nMartin D. is accused of offering to share confidential information he acquired during his work with the U.S. military in Germany, which involved working as a contractor for a private firm that provided services to American forces based in the central state of Hessen.\nHis arrest came amid growing concern in Western capitals about espionage and sabotage activities by foreign powers, particularly China and Russia. Just days earlier, a source familiar with the matter told CBS News that American and European law enforcement agencies were jointly investigating whether incendiary devices that detonated in July 2024 at DHL logistics hubs in Germany and the U.K. were part of a larger operation directed by Russia's military intelligence agency."
    },
    {
      "news_title": "Germany Charges US Citizen For Offering Military Secrets To China",
      "news_link": "https://dailycaller.com/2025/08/25/germany-us-citizen-military-secrets-china/",
      "bias": "Right",
      "text": "German prosecutors on Monday announced that they had charged an American citizen with allegedly attempting to provide sensitive U.S. military information to China.\nGermany’s Federal Prosecutor General said that the man, identified only as Martin D. in line with Germany’s privacy laws, faced charges on Aug. 13 for willingness to serve as a foreign intelligence agent “in a particularly serious case,” according to multiple reports. The suspect notably served as a former contractor for the U.S. Department of Defense from 2017 to 2023, The New York Times (NYT) reported Monday.\nLocal German media reported that the man was apparently not able to provide any military data to Chinese authorities before he was arrested, according to the Associated Press. (RELATED: China Finds Way To Quietly Keep Its Forced Labor System Alive)\nThe office of Germany’s federal prosecutor announced in April 2024 the arrest of an aide to an European Union (EU) lawmaker on suspicion of spying on behalf of China, the NYT reported. German authorities during the same month also arrested three people in the west of the country after they were suspected of leaking sensitive naval data and exporting a high-powered laser to China, according to the NYT. (RELATED: EXCLUSIVE: Meet The Chinese ‘Congressman’ Accused Of Abusing 21 Kids In US Surrogacy Scheme)\nAdditionally, a U.S. Navy sailor was convicted in federal court for selling military secrets to China, the Department of Justice (DOJ) announced on Aug. 20. Concerns about the Chinese government posing a major threat to American national security have been growing in recent years due to Beijing’s expanding influence across the globe. Moreover, a variety of reports have shown that Beijing has attempted to steal intellectual property from the United States.\nThe Federal Prosecutor General’s office referred the Daily Caller News Foundation to its press release when reached for comment.\nAll content created by the Daily Caller News Foundation, an independent and nonpartisan newswire service, is available without charge to any legitimate news publisher that can provide a large audience. All republished articles must include our logo, our reporter’s byline and their DCNF affiliation. For any questions about our guidelines or partnering with us, please contact licensing@dailycallernewsfoundation.org."
    },
    {
      "news_title": "Germany charges US citizen with offering military intelligence to China",
      "news_link": "https://www.reuters.com/world/china/germany-charges-us-citizen-with-offering-military-intelligence-china-2025-08-25/",
      "bias": "Center",
      "text": null
    },
    {
      "news_title": "Germany Charges US Citizen with Offering Military Intelligence to China",
      "news_link": "https://english.aawsat.com/world/5178846-germany-charges-us-citizen-offering-military-intelligence-china",
      "bias": "Lean Right",
      "text": "German federal prosecutors said on Monday that they have charged a US citizen they accuse of offering to pass sensitive US military information to Chinese intelligence.\nThe man, identified as Martin D. under German privacy law, is accused of contacting Chinese state bodies in summer 2024 while working for a US military contractor on a US base in Germany, the prosecutors said in a statement.\nHe has been in pre-trial detention since his arrest in November, according to Reuters."
    },
    {
      "news_title": "Germany charges US citizen with spying for China",
      "news_link": "https://www.politico.eu/article/germany-charges-u-s-citizen-with-spying-for-china/",
      "bias": "Lean Left",
      "text": "BERLIN — German prosecutors have charged an American national with offering sensitive U.S. military information to Chinese intelligence, nearly a year after his arrest in Frankfurt.\nThe Federal Prosecutor General announced Monday that Martin D., a former contractor for the U.S. Department of Defense, faces charges of acting as an agent for a foreign intelligence service in a “particularly serious case.”\nThe indictment was filed with the State Security Senate of the Higher Regional Court in Koblenz."
    },
    {
      "news_title": "American accused of offering sensitive information on US military to China indicted",
      "news_link": "https://abcnews.go.com/International/wireStory/american-accused-offering-sensitive-information-us-military-china-124944856",
      "bias": "Lean Left",
      "text": "American accused of offering sensitive information on US military to China indicted\nGerman prosecutors say an American man who worked at a U.S. military facility in Germany and allegedly offered to supply sensitive information to China has been indicted on espionage charges\nBERLIN -- An American man who worked at a U.S. military facility in Germany and allegedly offered to supply sensitive information to China has been indicted on espionage charges, German prosecutors said Monday.\nThe suspect, identified only as Martin D. in line with German privacy rules, was arrested in Frankfurt in early November. In an indictment sent to the state court in Koblenz earlier this month, he is charged with having declared his willingness to engage in espionage for a foreign intelligence service, federal prosecutors said.\nThe man worked between 2017 and early 2023 for a civilian contractor of the U.S. Defense Department, and worked at an unidentified U.S. military facility in Germany from at least 2020 onward, prosecutors said in a statement.\nHe is accused of contacting Chinese authorities repeatedly in the summer of 2024 and offering to provide sensitive U.S. military information for Chinese intelligence.\nGerman media have reported that the suspect apparently didn't manage to transfer any data to Chinese authorities before his arrest.\nThe court in Koblenz will now have to decide whether to send the case to trial and, if so, when."
    },
    {
      "news_title": "U.S. Citizen Charged with Espionage: Military Secrets Exposed to China?",
      "news_link": "https://www.devdiscourse.com/article/law-order/3602247-us-citizen-charged-with-espionage-military-secrets-exposed-to-china",
      "bias": "Center",
      "text": "U.S. Citizen Charged with Espionage: Military Secrets Exposed to China?\nA U.S. citizen has been charged by German prosecutors for allegedly offering to supply sensitive U.S. military information to Chinese intelligence. Identified as Martin D., he reportedly contacted Chinese state entities in 2024, while employed by a U.S. military contractor based in Germany. He remains in pre-trial detention.\n- Country:\n- Germany\nGerman federal prosecutors charged a U.S. citizen on Monday, alleging he offered sensitive military information to Chinese intelligence. The individual, identified as Martin D. due to German privacy laws, reportedly reached out to Chinese state bodies in the summer of 2024.\nAt the time of the alleged espionage, Martin D. was employed by a U.S. military contractor at a base in Germany, according to a statement released by the prosecutors.\nHe has been held in pre-trial detention since his arrest in November, as the investigation into his supposed activities continues.\nAdvertisement\nALSO READ\nArrest of Transwoman Reveals Shocking Infant Sale Plot\nDramatic Arrest Sparks Political Conflict in West Bengal\nReal Estate Director Arrested in Massive Rs 117 Crore Bank Fraud\nMajor Marijuana Smuggling Ring Dismantled by Police, 13 Arrested\nDramatic Scam Unveiled: Delhi Police Arrest 'Confidence Trickster' Duo"
    },
    {
      "news_title": "American accused of offering sensitive information on US military to China indicted in Germany",
      "news_link": "https://www.winnipegfreepress.com/breakingnews/2025/08/25/american-accused-of-offering-sensitive-information-on-us-military-to-china-indicted-in-germany",
      "bias": "Center",
      "text": "American accused of offering sensitive information on US military to China indicted in Germany\nAdvertisement\nRead this article for free:\nor\nAlready have an account? Log in here »\nTo continue reading, please subscribe:\nMonthly Digital Subscription\n$1 per week for 24 weeks*\n- Enjoy unlimited reading on winnipegfreepress.com\n- Read the E-Edition, our digital replica newspaper\n- Access News Break, our award-winning app\n- Play interactive puzzles\n*Billed as $4.00 plus GST every four weeks. After 24 weeks, price increases to the regular rate of $19.00 plus GST every four weeks. Offer available to new and qualified returning subscribers only. Cancel any time.\nMonthly Digital Subscription\n$4.75/week*\n- Enjoy unlimited reading on winnipegfreepress.com\n- Read the E-Edition, our digital replica newspaper\n- Access News Break, our award-winning app\n- Play interactive puzzles\n*Billed as $19 plus GST every four weeks. Cancel any time.\nTo continue reading, please subscribe:\nAdd Winnipeg Free Press access to your Brandon Sun subscription for only\n$1 for the first 4 weeks*\n*$1 will be added to your next bill. After your 4 weeks access is complete your rate will increase by $0.00 a X percent off the regular rate.\nRead unlimited articles for free today:\nor\nAlready have an account? Log in here »\nBERLIN (AP) — An American man who worked at a U.S. military facility in Germany and allegedly offered to supply sensitive information to China has been indicted on espionage charges, German prosecutors said Monday.\nThe suspect, identified only as Martin D. in line with German privacy rules, was arrested in Frankfurt in early November. In an indictment sent to the state court in Koblenz earlier this month, he is charged with having declared his willingness to engage in espionage for a foreign intelligence service, federal prosecutors said.\nThe man worked between 2017 and early 2023 for a civilian contractor of the U.S. Defense Department, and worked at an unidentified U.S. military facility in Germany from at least 2020 onward, prosecutors said in a statement.\nHe is accused of contacting Chinese authorities repeatedly in the summer of 2024 and offering to provide sensitive U.S. military information for Chinese intelligence.\nGerman media have reported that the suspect apparently didn’t manage to transfer any data to Chinese authorities before his arrest.\nThe court in Koblenz will now have to decide whether to send the case to trial and, if so, when."
    },
    {
      "news_title": "US Contractor Charged With Trying To Spy For China",
      "news_link": "https://www.iheart.com/content/2025-08-25-us-contractor-charged-with-trying-to-spy-for-china/",
      "bias": "Lean Left",
      "text": "US Contractor Charged With Trying To Spy For China\nBy iHeartRadio\nAugust 25, 2025\nGerman federal prosecutors have charged an American former Defense Department contractor with attempting to sell sensitive U.S. military information to China. The individual, identified only as Martin D. due to German privacy laws, worked at a U.S. military base in Germany since 2020. Prosecutors allege that he repeatedly contacted Chinese officials last summer to offer classified information for forwarding to a Chinese intelligence service, according to The New York Times.\nMartin D. was a contractor for the U.S. Department of Defense from 2017 until spring 2023. He was arrested in November 2024 at Frankfurt airport and has been in pretrial detention since then. The charges were filed with the State Security Senate of the Higher Regional Court in Koblenz, as reported by Politico.\nThe case is part of a broader concern in Germany over potential Chinese espionage activities. In recent years, there have been multiple investigations into Chinese spies operating in the country. These include the arrest of a Chinese man suspected of gathering information on Chinese dissident groups and a Chinese woman accused of feeding sensitive logistics information to the Chinese government.\nThe German Press Agency suggested that Martin D. may have been motivated by dissatisfaction with his former employer. The charges against him highlight ongoing tensions and security concerns related to espionage activities in Europe."
    },
    {
      "news_title": "Spying for China with the US military? Indictment in Germany",
      "news_link": "https://www.bluewin.ch/en/news/international/spying-for-china-with-the-us-military-indictment-in-germany-2839419.html",
      "bias": "unknown",
      "text": "PoliticsUS military spying for China? Prosecution in Germany\nSDA\n25.8.2025 - 12:14\nA US-American who worked at a military base in Germany has been charged with alleged espionage for China. The German federal prosecutor's office accuses the man of offering sensitive US military information to a Chinese intelligence service.\nKeystone-SDA\n25.08.2025, 12:14\nSDA\n\"The accused is sufficiently suspected of having agreed to act as an intelligence agent for a foreign intelligence service in a particularly serious case,\" it said in a statement. The State Security Senate of the Koblenz Higher Regional Court must decide whether to admit the charges and schedule a trial.\nThe man is alleged to have worked for a civilian contractor of the US Department of Defense between 2017 and spring 2023, the highest prosecuting authority announced. \"He had been working at a US military base in Germany since 2020 at the latest.\" In the summer of 2024, the man had contacted Chinese government agencies on several occasions and offered to transmit sensitive information from the US military to a Chinese intelligence service.\nDissatisfied with employer?\nAccording to initial findings, however, no data was transferred to Chinese authorities at the time. According to the German Press Agency, the man is said to have been dissatisfied with his former employer. The investigation should clarify whether this was possibly a motive of the US-American.\nThe man was arrested in Frankfurt am Main at the beginning of November. The accused's home was also searched. He has been in custody since then. The Federal Public Prosecutor's Office worked closely with the Federal Office for the Protection of the Constitution during the investigation, it was reported at the time.\nNot an isolated case\nIn recent months, the Federal Public Prosecutor's Office had several people arrested for allegedly spying for a Chinese secret service. In April 2024, the arrest of an ex-employee of AfD MEP Maximilian Krah in particular caused a stir. He is alleged to have transmitted information from the EU Parliament and spied on Chinese opposition members in Germany. The trial is ongoing."
    }
  ]
}