{
  "story_id": "GN_20250825_222539_f3791076",
  "metadata": {
    "title": "French police hold suspect after bodies of four men found in River Seine",
    "timestamp": "2025-08-25T22:25:39.504002",
    "url": "https://ground.news/article/french-police-hold-suspect-after-bodies-of-four-men-found-in-river-seine"
  },
  "bias_distribution": {
    "total_sources": "9",
    "leaning_left": "2",
    "center": "1",
    "leaning_right": "3"
  },
  "perspective_summaries": {
    "left": [
      "French police arrested a suspect believed to be targeting gay men after four bodies were found in the River Seine, a known gay cruising area.",
      "The victims include a 48-year-old French citizen and two men, one Algerian and one Tunisian, both aged 21 and 26.",
      "Prosecutors have initiated the first stage in a criminal trial for a man in his 20s of 'unidentified nationality.'",
      "The murders are thought to involve serial crimes linked to the victims' perceived sexual orientation."
    ],
    "center": [
      "French police arrested a suspect believed to be targeting gay men after four bodies were found in the River Seine, a known gay cruising area.",
      "The victims include a 48-year-old French citizen and two men, one Algerian and one Tunisian, both aged 21 and 26.",
      "Prosecutors have initiated the first stage in a criminal trial for a man in his 20s of 'unidentified nationality.'",
      "The murders are thought to involve serial crimes linked to the victims' perceived sexual orientation."
    ],
    "right": [
      "French police arrested a suspect believed to be targeting gay men after four bodies were found in the River Seine, a known gay cruising area.",
      "The victims include a 48-year-old French citizen and two men, one Algerian and one Tunisian, both aged 21 and 26.",
      "Prosecutors have initiated the first stage in a criminal trial for a man in his 20s of 'unidentified nationality.'",
      "The murders are thought to involve serial crimes linked to the victims' perceived sexual orientation."
    ]
  },
  "sources": [
    {
      "news_title": "French Police Hold Suspect after Bodies of Four Men Found in River Seine",
      "news_link": "https://english.aawsat.com/world/5178954-french-police-hold-suspect-after-bodies-four-men-found-river-seine",
      "bias": "Lean Right",
      "text": "Ukraine has stepped up drone attacks on Russian oil refineries and exporting infrastructure, striking the most important sector of President Vladimir Putin's economy to show it can fight back as the United States seeks to broker a peace deal.\nThe attacks disrupted Moscow's oil processing and exports, created gasoline shortages in some parts of Russia and came in response to Moscow's advances on the front lines and its pounding of Ukraine’s gas and power facilities.\nKyiv's move is an attempt to raise the stakes in possible peace talks and challenge the idea that Ukraine has already lost the war after US President Donald Trump and Putin met in Alaska this month, analysts have said.\nUkrainian attacks on 10 plants disrupted at least 17% of Russia's refinery capacity, or 1.1 million barrels per day, according to Reuters calculations.\nThe drone war has pushed more crude towards exports from the world's No.2 oil exporter at a time Washington is pressing China and India to reduce purchases of Russian oil.\nThe refinery hits come as Russia's seasonal demand for gasoline from tourists and farmers peaks.\nRussia had tightened its gasoline export ban in July to deal with a spike in domestic demand even before the attacks.\nThere were shortages of gasoline in some areas of Russian-controlled Ukraine, southern Russia and even the Far East, forcing motorists to switch to more expensive petrol due to shortages of the regular A-95 grade.\n\"We will endure, but this is a big hit to our family budget, a big hit. It's really noticeable,\" said Svetlana Bazhanova, a resident of Sevastopol, the largest city in Crimea which Russia annexed in 2014.\nTOURISM DEMAND\nRussia's far eastern port of Vladivostok saw long car queues at gasoline stations, according to a Reuters reporter. The shortages are due to a seasonal influx of tourists, local authorities said.\nThe affected refineries have lost only part of their capacity but this could still create problems with domestic fuel supplies, said Sergei Vakulenko, a senior fellow at the Carnegie Russia Eurasia Center, who previously worked at Russian oil major Gazprom Neft.\nRussia relies on oil and gas exports for a quarter of its budget revenues, which are funding a 25% rise in defence spending this year to the highest levels since the Cold War.\nWestern sanctions have forced Moscow to sell oil at discounts and stop gas sales in most of Europe. This has not deterred Moscow from producing record numbers of artillery and weapons, according to US military generals.\nThe war in Ukraine has become a battle of attrition with both Russia and Ukraine using drones and missiles to strike far behind the front lines to damage each other's economies.\nSo far, Russia's economy has coped with the sanctions but growth has slowed raising concern in the Kremlin.\nIn the past month, Ukraine has attacked Lukoil's Volgograd, Rosneft's Ryazan and a host of other plants in the Rostov, Samara, Saratov and Krasnodar regions.\nA fire at Russia's Novoshakhtinsk refinery was still burning on Monday after a Ukrainian drone strike.\nUkrainian drones also attacked the Druzhba pipeline and Novatek's Ust-Luga export terminal and fuel processing complex on the Baltic."
    },
    {
      "news_title": "French Police Hold Suspect After Bodies of Four Men Found in River Seine",
      "news_link": "https://www.usnews.com/news/world/articles/2025-08-25/french-police-hold-suspect-after-four-bodies-found-in-river-seine",
      "bias": "Lean Left",
      "text": null
    },
    {
      "news_title": "French police hold suspect after bodies of four men found in River Seine",
      "news_link": "https://www.reuters.com/world/french-police-hold-suspect-after-bodies-four-men-found-river-seine-2025-08-25/",
      "bias": "Center",
      "text": null
    },
    {
      "news_title": "French police hold suspect after four bodies found in River Seine",
      "news_link": "https://www.straitstimes.com/world/europe/french-police-hold-suspect-after-four-bodies-found-in-river-seine",
      "bias": "Lean Right",
      "text": "French police hold suspect after four bodies found in River Seine\nSign up now: Get ST's newsletters delivered to your inbox\nFollow topic:\nPARIS - French police have detained a man on suspicion of murder following the discovery of four bodies in the River Seine on the outskirts of Paris earlier this month, the man's lawyer said on Monday.\n\"My client is being questioned in relation to these four murders and is being held in custody. He has maintained his right to silence during his questioning, in front of the investigating magistrate,\" lawyer Antoine Ory said.\nFor legal reasons, Ory said he could not name his client, who was arrested last week and put under investigation on suspicion of the murders on Sunday.\nThe four bodies were found close to one another in the Seine near Choisy-Le-Roi, which lies in the southeastern suburbs of the French capital, according to local newspaper reports.\nTwo of the victims were homeless. Another victim was a 48-year-old French man, while the fourth victim was a 21-year-old Algerian, who both lived nearby, the media reports said.\nThe case is being investigated by the prosecutor's office for the Paris suburb of Creteil, which did not provide further comment on the matter when contacted. REUTERS"
    },
    {
      "news_title": "French police arrest suspected serial killer after bodies dumped in Seine",
      "news_link": "https://www.telegraph.co.uk/world-news/2025/08/24/police-arrest-suspected-serial-killer-bodies-in-seine/",
      "bias": "Lean Right",
      "text": "French police hunting a serial killer thought to be targeting gay men in a suburb of Paris have arrested a man.\nAuthorities detained the man, who has not been officially named, after four bodies were pulled from the Seine earlier this month in an area of Choisy-Le-Roi known as a gay cruising ground.\nOn Sunday, the local prosecutor’s office requested the indictment of a man in his 20s of “unidentified nationality”, initiating the first stage in a criminal trial.\nLe Parisien newspaper reported that the suspect was a homeless Muslim man of Tunisian origin, who may have been motivated by homophobia.\nThe authorities were first alerted to the case when a passenger on a regional train saw a body floating in the river on Aug 13. Police found three more bodies later that day.\nOne body ‘nearly mummified’\nThe victims were a 48-year-old French citizen, a 21-year-old who lived in Choisy-Le-Roi and a 21-year-old Algerian and a 26-year-old Tunisian, both of whom were homeless.\nWhile two of the bodies were in advanced stages of decay, the oldest being nearly mummified, the other two showed signs of violence and strangulation.\nAlthough details from the public prosecutor are sparse, Le Parisien reported that the case centres on a young Tunisian man known as Monji, who arrived in France three years ago and has been living in a squat, not far from the site where the bodies were recovered, for the last eight months.\nThe two homeless victims, Abdallah and Amir, were reported to be friends of the suspect, but he did not appear to have connections with the other two men. They went missing from July 26 to Aug 11.\nOne victim, named only as Franz, was a French gay man who frequented the area where the bodies were found, the prosecution said.\n“The most plausible theory is that of serial crimes committed because of the victims’ real or perceived sexual orientation –homosexuality,” Le Parisien reported, adding that the suspect’s own repressed sexuality could also be a motive.\n“A possible hatred toward this community, the motives of which could be linked to the suspect’s thwarted sexuality, but also to his rigorous practice of Islam, was discovered during the investigations,” it added.\nLink ‘established from earlier arrest’\nPolice were able to establish a link between the suspect and two of the victims from an earlier arrest, separate from the murder investigation.\nOn Aug 5, a police brigade entered the squat where the suspect was living to conduct routine checks, and found him smoking cannabis, according to Le Parisien.\nPolice searched the suspect and became suspicious when he could not unlock two cell phones or explain the origins of identity papers and bank cards that were not his own. The man falsely identified himself as Ahmed Ben Ali from Algeria.\nUnknown to police at the time, the documents belonged to two of the victims, whose disappearances had not yet been reported. The suspect allegedly used one of the victim’s SIM cards to place a call and another victim’s bank card to make a purchase.\nHe was taken into police custody, where they found that he was due to appear in court in September on charges of theft with damage to a vehicle.\nLe Parisien also reported that, after DNA tests had confirmed the identity of the victims, police were able to establish a link between the suspect and the dead. Traces of blood from Franz were also allegedly found on the suspect’s trousers. Autopsy reports confirmed that Franz died of strangulation.\nWhile in police custody, the suspect has refused to co-operate or answer any questions. Antoine Ory, his lawyer, told Le Parisien: “My client exercised his right to remain silent as the law allows during his police custody and will explain the charges against him later.”"
    },
    {
      "news_title": "Arrest of a suspect in the murder of four men in France. | Ukraine news - EUROPE SAYS",
      "news_link": "https://www.europesays.com/2357957/",
      "bias": "unknown",
      "text": "In France, a man has been detained on suspicion of murder after four bodies were found in the Seine near Paris at the beginning of the month.\nThe detainee is described by investigators as tailless in his twenties, and he appeared before a court on Sunday, the Créteil Prosecutor’s Office said.\nHe is being investigated for multiple serious murders of four men, all of whom were men, according to the prosecutor’s office.\nOn August 13, the bodies of four men were found in the commune of Choisy-le-Roi in various stages of decomposition.\nThe alarm was raised after a train passenger looking toward the river spotted a body on the surface of the water, France Info reported.\nOne man’s body, later identified as a 48-year-old French citizen, was found in a “nearly intact” condition. The autopsy revealed injuries indicating strangulation. He was wearing a T-shirt, but the lower part of his body was naked.\nThe other bodies were in a state of “very advanced decomposition,” making it difficult to determine the cause of death, according to the prosecutor.\nThe second body – a 21-year-old Algerian citizen – showed injuries characteristic of suffocation. His disappearance was reported by his relatives a week before the body was found.\nTwo of the other victims were homeless people who regularly visited the area near where the bodies were found. One man was a 21-year-old Algerian citizen, the other a 26-year-old Tunisian, the Créteil Prosecutor’s Office said.\nInvestigation and links between the suspect and the victims\nInvestigators have not yet been able to determine definitively whether all four men knew each other, but they are linked to the area where the bodies were found, according to the prosecutor’s office.\nThe area was frequented by homeless people, and it is also known as a site for casual same-sex encounters, the prosecutor’s office notes.\nAfter reviewing surveillance footage and analyzing phone data, investigators focused on the suspect, who “was often in this area,” the prosecutor added.\nBefore the bodies were found, he was arrested while in possession of documents belonging to one of the victims. On the day the bodies were first found, police stopped him, and a week later he was arrested.\nInvestigators were able to confirm a link between the suspect and each of the victims at the time of their disappearance, according to the prosecutor’s office.\nThe suspect refused to answer questions about the crimes with which he is charged, replying briefly to other questions, according to the Créteil prosecutor’s office.\nThe investigation into these crimes will continue, the office says."
    }
  ]
}