{
  "story_id": "GN_20250825_221820_31034508",
  "metadata": {
    "title": "Man appears in court over Palestine Action RAF Brize Norton break-in",
    "timestamp": "2025-08-25T22:18:20.666376",
    "url": "https://ground.news/article/man-appears-in-court-over-palestine-action-raf-brize-norton-break-in_2f5cf6"
  },
  "bias_distribution": {
    "total_sources": "8",
    "leaning_left": "2",
    "center": "4",
    "leaning_right": "0"
  },
  "perspective_summaries": {
    "left": [],
    "center": [],
    "right": []
  },
  "sources": [
    {
      "news_title": "Alleged Palestine Action break-in accused face 18-month wait for trial",
      "news_link": "https://www.bristolpost.co.uk/news/bristol-news/alleged-palestine-action-break-accused-10448379",
      "bias": "Center",
      "text": "Alleged Palestine Action break-in accused face 18-month wait for trial\nThey will remain in custody for a long time\nSix alleged Palestine Action protesters accused of smashing into an Israeli-owned defence firm and causing more than one million pounds’ worth of damage could wait in custody for 18 months before their trial.\nMembers of the organisation were allegedly armed with sledgehammers and whips when they broke into the Elbit Systems site near Patchway, outside of Bristol, in the early hours of August 6, 2024.\nProsecutors have said the alleged offences had a “terrorist connection”.\nOn Friday, six defendants appeared at the Old Bailey charged with aggravated burglary, criminal damage and violent disorder.\nThey are:\n- Finn Collins, 19, from Whitstable in Kent\n- Harland Archer, 20, from Whitstable\n- Salaam Mahmood, 19, from Southmere Drive in Abbey Wood, south-east London\n- Moiz Ibrahim, 27, from Kilburn Lane in West Kilburn, north-west London\n- Louie Adams, 33, from Hornsey, north London\n- Liam Mullany, 33, from Poole in Dorset\nThe defendants were detained following a series of raids by Counter Terrorism Policing South East and are the latest to be charged over the incident.\nThey appeared at the Old Bailey on Friday in the dock and variously from Lewes, Elmley and Chelmsford prisons.\nMrs Justice Cheema-Grubb said the case would be listed for a plea hearing at Woolwich Crown Court on December 12 with a provisional trial from February 1, 2027.\nThe next hearing would be heard by Mr Justice Johnson who is presiding over the first of three other linked trials from November 17 at Woolwich Crown Court.\nIn all, 18 other people have been charged in relation to the same incident and are awaiting trials split into three tranches.\nMrs Justice Cheema-Grubb explained that the Crown Court did not have the capacity to conduct a trial with more than six co-defendants in custody at the same time.\nThis meant that the earliest date for a fourth trial was in 2027, but efforts would be made to find a fixture sooner, she said.\nPalestine Action was proscribed by the Government on July 5 this year.\nOn Friday, a group of protesters had gathered outside the Old Bailey as the case was being heard."
    },
    {
      "news_title": "Man appears in court over Palestine Action RAF Brize Norton break-in",
      "news_link": "https://www.bbc.com/news/articles/cwyp2xx1wkqo",
      "bias": "Center",
      "text": "Man appears in court over Palestine Action RAF break-in\nA man has appeared in court charged with offences relating to a break-in at RAF Brize Norton, which was claimed by Palestine Action.\nMuhammad Umer Khalid, 22, is accused of conspiracy to commit criminal damage and conspiracy to enter a prohibited place knowingly for purposes prejudicial to the safety or interests of the UK.\nThe incident on 20 June saw a group of protesters break into the air base and spray-paint two RAF Voyager planes. Police say the act caused £7m of damage.\nMr Khalid, who appeared in court via video link from Wormwood Scrubs, has been remanded in custody and will next appear in court to enter a plea in January.\nPalestine Action has claimed the incident, saying it was a protest against the UK's support of Israel's war in Gaza.\nThe British government proscribed Palestine Action as a terrorist organisation soon after.\nProsecutor Jonathan Polnay KC told the court the break-in was a \"sophisticated and carefully planned attack\" with a \"terrorist connection\".\nMr Khalid, of Stockport, Greater Manchester, is the fifth person to be charged in connection with the break-in.\nHe will next appear in court for a plea hearing on 16 January 2026, and a provisional trial date is set for 18 January 2027.\nAmy Gardiner-Gibson, 29, Jony Cink, 24, Daniel Jeronymides-Norie, 36, and Lewis Chiaramello, 22, who are all also in custody, will appear on the same dates."
    },
    {
      "news_title": "Man in court over ‘sophisticated’ Palestine Action paint attack on RAF aircraft",
      "news_link": "https://www.oxfordmail.co.uk/news/25411718.trial-date-set-sophisticated-raf-brize-norton-attack/",
      "bias": "Center",
      "text": "A man has appeared at the Old Bailey for allegedly taking part in a “sophisticated” Palestine Action attack on two aircraft at RAF Brize Norton.\nTwo Voyager planes sustained £7 million worth of damage during the incident at the RAF base in Oxfordshire on June 20.\nIn an early morning raid, protesters on two e-scooters broke into the military base and used fire extinguishers to spray the aircraft with red paint and also threw crowbars into the engine rotors, it is alleged.\nREAD MORE: Anger over 'massive' leak in Bicester amid hosepipe ban\nAs a result, the planes were taken out of action and the turbines needed to be replaced at a cost of £2 million each, the court was told.\nFire extinguishers marked with the words Palestine Action and Palestinian flags were recovered at the scene.\nPalestine Action went on to claim responsibility for the attack in a YouTube video which included footage of the incident.\nThe Government subsequently moved to proscribe the group under anti-terror laws on July 5.\nHelp support trusted local news\nSign up for a digital subscription now: https://www.oxfordmail.co.uk/subscribe/\nAs a digital subscriber you will get:\n- Unlimited access to the Oxford Mail website\n- Advert-light access\n- Reader rewards\n- Full access to our app\nAlleged group member Muhammad Umer Khalid, 22, was arrested on August 1 at an address in Bedford.\nOn Friday, he appeared at the Old Bailey charged with two offences relating to the RAF Brize Norton incident.\nProsecutor Jonathan Polnay KC told the court it was a “sophisticated and carefully planned attack” with a “terrorist connection”.\nREAD MORE: Delays on A40 in Oxford as lane blocked by incident\nKhalid is charged with conspiracy to commit criminal damage and conspiracy to enter a prohibited place knowingly for purposes prejudicial to the safety or interests of the United Kingdom.\nThe defendant appeared by video-link from Wormwood Scrubs as Mr Polnay set out a proposed timetable for the case.\nMrs Justice Cheema-Grubb remanded Khalid into custody ahead of a plea hearing on January 16, 2026.\nA provisional trial date at the Old Bailey was set for six to eight weeks from January 18, 2027.\nREAD MORE: Oxfordshire MP against use of hotels for asylum seekers\nKhalid, of Stockport, Greater Manchester, is the fifth person to be charged in connection with the incident.\nCo-accused Amy Gardiner-Gibson, 29, Jony Cink, 24, Daniel Jeronymides-Norie, 36, and Lewis Chiaramello, 22, will appear on the same dates.\nThey are each likewise charged with conspiracy to enter a prohibited place “knowingly for a purpose prejudicial to the safety or interests of the United Kingdom”, and conspiracy to commit criminal damage.\nThe defendants appeared at the Old Bailey on Friday, July 15, for a hearing to set a timetable for the case amid heightened security outside the central London court.\nREAD MORE: Person tried to evade police twice during Oxford operation\nThe two female defendants appeared by video-link from Bronzefield jail with the two male defendants in the dock in court.\nWatched by members of the public in a packed public gallery, the defendants spoke only to confirm their identities.\nGardiner-Gibson and Cink, both of no fixed address, Jeronymides-Norie, of Barnet, north London, and Chiaramello, of Brent, north London, were remanded into custody."
    },
    {
      "news_title": "Protesters charged over alleged Palestine Action raid face 18-month wait for trial",
      "news_link": "https://www.independent.co.uk/news/uk/crime/palestine-action-elbit-systems-raid-military-b2812404.html",
      "bias": "Lean Left",
      "text": "Protesters charged over alleged Palestine Action defence firm raid face 18-month wait for trial\nThe alleged attack on Elbit Systems UK is estimated to have caused £1m worth of damage\nSix protesters accused of breaking into an Israeli-linked defence firm as part of a Palestine Action raid face an 18-month wait in prison before their trial.\nThe alleged attack was estimated to cause £1m worth of damage to property at Elbit Systems UK’s Bristol site in August 2024.\nThe defendants were allegedly armed with sledgehammers when they broke into the defence firm’s site in the early hours of 6 August. Elbit Systems UK is a subsidiary of the Israeli defence company Elbit Systems.\nFinn Collins, 19, Harland Archer, 20, Salaam Mahmood, 19, Moiz Ibrahim, 27, Louie Adams, 33, and Liam Mullany, 33, appeared at the Old Bailey on Friday, charged with aggravated burglary, criminal damage and violent disorder. They were told they could have to wait until February 2027 for their case to be tried.\nMrs Justice Cheema-Grubb told the court that Woolwich Crown Court, where the case will be heard, does not have the capacity for a trial of over six people at the same time, and so a date in 2027 has provisionally been fixed.\nSome 24 people have now been charged in connection with the incident.\nElbit Systems UK could be close to winning a £2bn defence contract for the Army Collective Training Service, it has been reported. The UK defence programme would overhaul army training, and Elbit is one of a consortium of defence companies bidding for the 15-year contract, The Times reported.\nMuhammad Umer Khalid, 22, also appeared in court on Friday in connection with a separate incident linked to Palestine Action. Khalid allegedly took part in an attack on two aircraft at RAF Brize Norton, resulting in an estimated £7m worth of damage to the Voyager planes.\nOn 20 June 2025, protesters on e-scooters allegedly broke into the military base and used fire extinguishers to spray red paint and threw metal crowbars into the engines.\nFollowing the Brize Norton incident, Palestine Action was proscribed as a terrorist group, making it an offence to be part of or express support for the group.\nKhalid is charged with conspiracy to commit criminal damage and conspiracy to enter a prohibited place knowingly for purposes prejudicial to the UK’s national security.\nHe was remanded into custody, with a provision trial date set for January 2027. Khalid, from Stockport, Greater Manchester, is the fifth person to be charged in connection with the incident."
    },
    {
      "news_title": "Palestinian activists appear in court to appeal over conviction for harassment of minister",
      "news_link": "https://nation.cymru/news/palestinian-activists-appear-in-court-to-appeal-over-conviction-for-harassment-of-minister/",
      "bias": "unknown",
      "text": "Palestinian activists appear in court to appeal over conviction for harassment of minister\nTwo pro-Palestinian activists found guilty of harassing a UK Government minister have appeared in court to appeal against their convictions.\nAyeshah Behit, 31, and Hiba Ahmed, 26, were found guilty of the charge against Alex Davies-Jones, the Labour MP for Pontypridd, at Cardiff Magistrates’ Court in June.\nBoth women are challenging the ruling, denying they harassed Ms Davies-Jones, a justice minister, at an appeal hearing before Merthyr Crown Court on Friday.\nThe pair had filmed a confrontation with Ms Davies-Jones, who had been campaigning in the village of Treforest, Rhondda Cynon Taf, in the lead-up to the general election, on June 26 last year.\nAs she made her way to the campaign meeting place, she saw Behit and Ahmed with leaflets which suggested she was a “full-blown supporter of this genocide” – referring to the Israel-Hamas conflict.\nPosters\nLater, Behit and Ahmed put posters on the Labour office in Pontypridd – the base of Ms Davies-Jones’ campaign for the general election – that referred to politicians “enabling genocide”.\nThey also placed stickers reading “Alex Davies-Jones how many murdered children is too many?” on the office, and a poster reading “Alex Davies-Jones supports genocide” on a bus stop – while a video of the confrontation was uploaded onto social media.\nAhmed, a final year architecture student at Cardiff University with no previous convictions, was handed a 12-month conditional discharge in June.\nBehit, who had a previous conviction relating to a protest in Cardiff last year, received an 18-month conditional discharge.\nMs Davies-Jones told the court on Friday she was aware of what was on the leaflets and had initially approached the defendants to try to defuse the situation.\nVoting record\nShe said the defendants quizzed her on her voting record, with them asking why she had abstained on a ceasefire vote in the Commons.\nMs Davies-Jones told them she had not abstained and instead had been out of the country at the time.\nThe MP ended the conversation with the pair, telling the court it was clear that they were not going to be satisfied with her answers, describing the situation as “quite confrontational”.\n“They started to follow us down the street, shouting quite awful things at us,” she said.\n“’Why do you support genocide Alex Davies-Jones’ was repeated a number of times, ‘why are you happy for babies to be murdered’.”\nShe described feeling “scared, intimidated, threatened”, and she and her team hid in a university building to get away from them.\nThe two women later saw the MP and her team while door knocking on the campaign trail.\nMs Davies-Jones said they were following her down the street, knocking on doors that canvassers had previously visited and could be heard loudly telling residents that she supported genocide.\n‘Fearful’\nMs Davies-Jones said they decided to stop the session, conscious of what had happened to other MPs, including the murder of Jo Cox, with her team having become “fearful”.\nAn edited video of her interaction with the pair was later posted on social media, with suggestions that she is Islamophobic.\n“The consequences of that (video) were severe and still are,” she said.\n“There has been relentless targeting with abuse, harassment, threats.\n“I have had to increase security at my home, office, when I’m out in public.\n“It’s constant – it’s changed everything, it’s changed the entire way in which I work.”\nBehit insisted they had only been there that day to hand out leaflets, and were not “at all” aware Ms Davies-Jones was due to be there.\nShe said: “I wanted people who were planning to vote, who had the Palestinian cause in mind, to know what their local candidate stood for and believed in.”\nBehit did not deny shouting after the MP, but insisted they had not continued following Ms Davies-Jones and her team.\nShe also denied having knocked on doors after the canvassers, insisting they had only put leaflets through letterboxes and talked to people in the street.\nHowever, she admitted to placing leaflets under the windscreen wipers of a vehicle owned by a canvasser, as well as posters and stickers on a bus stop and on Ms Davies-Jones’ office.\n‘Insane coincidence’\nShe dismissed the argument from Nik Strobl, appearing for the prosecution, that they had been deliberately targeting Ms Davies-Jones.\n“It was an insane coincidence,” she said.\n“That is why we were shocked we bumped into her, it was a shocking coincidence because we were handing out leaflets with her name on and then she happened to walk up to us.”\nJudge Tracey Lloyd-Clarke, the Record of Cardiff, adjourned the appeal until next Friday, when Ahmed will give evidence.\nSupport our Nation today\nFor the price of a cup of coffee a month you can help us create an independent, not-for-profit, national news service for the people of Wales, by the people of Wales.\nIt sounds to me that these two are being economical with the truth. Hopefully the court will find them out. I would not be surprised if in depth examination of PA has shown Iranian funding and possibly occult links with Hamas. The activism is too disruptive to benefit any Palestinians and suspiciously like the way Communists used to infiltrate legitimate bodies during the time of the Soviet Union.\nThey filmed much of their protesting and questioning of the MP and in the case of the canvassing, many of the local residents would have been witnesses to the events. So, what are they being ‘economical’ about. Furthermore, your accusation that they are either like or actually are Communists is laughable 😂😂\nHere’s a serious question though which current political movement in the UK do you support? See the difference here? I’m asking you, where as you accused these women of being like Communists or actually Communists.\nAny proof at all of these ‘occult’ Hamas links Evan? Because if not, and PA get unproscribed, that sounds a lot like a libel case to me. But please don’t delete the accusations, it would be very funny to see Palestine Action take your house and give it to Palestinian refugees.\nI am struggling to find where in the article the 2 women initially approached the minister . It seems the minister approached them first. This seems blown out of proportion if that is the case.\nI mean if I didn’t want to be accused of supporting a genocide I would simply not be part of a political party that is part of a genocide, its quite simple. If she was ‘out of the country’ then she could have paired with an MP that was going to vote against the ceasefire. There are plenty of them in the Labour Party."
    }
  ]
}