{
  "story_id": "GN_20250825_215731_68aac61e",
  "metadata": {
    "title": "Canada joins call to protect Gaza journalists, allow foreign media",
    "timestamp": "2025-08-25T21:57:31.918410",
    "url": "https://ground.news/article/canada-joins-call-to-protect-gaza-journalists-allow-foreign-media"
  },
  "bias_distribution": {
    "total_sources": "7",
    "leaning_left": "2",
    "center": "3",
    "leaning_right": "0"
  },
  "perspective_summaries": {
    "left": [
      "Canada has joined a multi-country statement demanding that Israel stop banning foreign journalists from entering Gaza and protect local journalists in Palestinian territories.",
      "Canada was not part of 27 countries calling for independent foreign media access into Gaza.",
      "The demand for journalist protection followed the condemnation of Israel for killing journalist Anas Al-Sharif.",
      "Canada is a co-founder of the Media Freedom Coalition and has signed multiple statements on media issues since 2020."
    ],
    "center": [
      "Canada has joined a multi-country statement demanding that Israel stop banning foreign journalists from entering Gaza and protect local journalists in Palestinian territories.",
      "Canada was not part of 27 countries calling for independent foreign media access into Gaza.",
      "The demand for journalist protection followed the condemnation of Israel for killing journalist Anas Al-Sharif.",
      "Canada is a co-founder of the Media Freedom Coalition and has signed multiple statements on media issues since 2020."
    ],
    "right": [
      "Canada has joined a multi-country statement demanding that Israel stop banning foreign journalists from entering Gaza and protect local journalists in Palestinian territories.",
      "Canada was not part of 27 countries calling for independent foreign media access into Gaza.",
      "The demand for journalist protection followed the condemnation of Israel for killing journalist Anas Al-Sharif.",
      "Canada is a co-founder of the Media Freedom Coalition and has signed multiple statements on media issues since 2020."
    ]
  },
  "sources": [
    {
      "news_title": "Canada joins international call to protect Gaza journalists, allow foreign media",
      "news_link": "https://www.theglobeandmail.com/canada/article-canada-statement-gaza-israel-journalists-foreign-media/",
      "bias": "Center",
      "text": "Canada has signed onto a multi-country statement that demands Israel stop banning foreign journalists from entering Gaza and that local journalists be protected in the Palestinian territories.\nCanada co-founded the Media Freedom Coalition in 2020 and has signed dozens of statements on issues in Hong Kong, Sudan and previously the West Bank.\nOttawa was not among the 27 countries who signed a call Thursday for Israel to allow “independent foreign media access” into Gaza, and for journalists to be protect across Israel and the Palestinian territories.\nWhat we know so far as Israel prepares its offensive against Gaza City\nGlobal Affairs Canada said Thursday it would provide a statement to The Canadian Press but did not do so, and Canada was added onto the statement that evening following media coverage.\nThe statement came after Canada and others condemned Israel for deliberately killing Al Jazeera journalist Anas Al-Sharif, after claiming he had led a cell of Hamas.\nThe only other time Canada had not signed a multi-country statement from the coalition was during the 2021 election campaign."
    },
    {
      "news_title": "Canada joins call to protect Gaza journalists, allow foreign media",
      "news_link": "https://www.ctvnews.ca/politics/article/canada-joins-call-to-protect-gaza-journalists-allow-foreign-media/",
      "bias": "Center",
      "text": "Canada joins call to protect Gaza journalists, allow foreign media\nPublished:\nI Tried It: To Help You Get the Best Sleep Of Your Life, I Tested Two Popular Pillows\n11 Organization Products That'll Help Keep Your Skincare And Beauty Products From Cluttering Up Your Bathroom\n20 Useful Amazon Canada Finds That Ring In Under $15\nLittle Luxuries Are Important, So Let Me Introduce You To A Few Of Our Favourite Tinted Lip Balms From Canadian Brands\nLittle Luxuries Are Important, So Let Me Introduce You To A Few Of Our Favourite Hair Oils From Canadian Brands\nThe Absolute Best False Eyelashes You Can Get In Canada Right Now\n10 Of The Best Back-To-School Deals And Discounts You'll Find On Amazon Canada Right Now\nFYI: This Brightening Moisturizer From Laneige Is 22% Off Today\nThis Wearable Fan Will Keep You Cool On The Hottest Of Days, And It’s Over 40% Off Right Now\nThe Best Kids’ Water Bottles For Back To School 2025\nThe Shopping Trends team is independent of the journalists at CTV News. We may earn a commission when you use our links to shop. Read about us."
    },
    {
      "news_title": "Global Coalition Demands Israel End Media Blackout in Gaza, Investigate Journalist Deaths",
      "news_link": "https://thehindustangazette.com/election/media-freedom-coalition-israel-gaza-journalists-38883",
      "bias": "unknown",
      "text": "August 22, 2025:A growing international outcry is mounting against Israel’s media restrictions in Gaza, as a coalition of democracies has demanded open access for journalists and accountability for attacks on the press.\nThe Media Freedom Coalition, which includes countries such as Germany, Japan, Canada, Ireland, and the UK, said in a joint statement on Thursday that journalists must be allowed to operate freely in conflict zones. The group emphasized that reporting from Gaza is essential for the world to understand the humanitarian and political consequences of the war.\nSince October 2023, when Israel launched its offensive on Gaza, conditions for reporters have become increasingly perilous. Press groups estimate more than 270 journalists have been killed in the enclave over the past 22 months — one of the deadliest periods for the profession on record. Many others face detention and intimidation across Gaza, the West Bank, and East Jerusalem.\nThe coalition condemned the deaths and harassment of media workers and warned that targeting journalists violates international humanitarian law. It called for full investigations into all cases and for those responsible to be held to account.\nAlongside press freedom, the statement also urged a ceasefire, safe passage of aid, and a path toward a two-state peace settlement, echoing growing demands from humanitarian organizations.\nIsrael has justified its restrictions on international media entry as security measures, but critics argue the blackout is designed to suppress scrutiny of military actions in Gaza.\nMeanwhile, the humanitarian crisis deepens. According to local health officials, Israeli air and ground operations have killed over 62,000 Palestinians and wounded more than 157,000. Thousands remain missing under collapsed buildings as bombardments continue.\nThe coalition’s statement reflects mounting pressure on Israel to not only protect civilians but also safeguard the press — a demand that has so far gone unanswered."
    }
  ]
}