{
  "story_id": "GN_20250825_213458_7d8bdd73",
  "metadata": {
    "title": "Trump Administration Sanctions ICC Officials for Efforts to Arrest Americans, Israelis",
    "timestamp": "2025-08-25T21:34:58.299378",
    "url": "https://ground.news/article/trump-administration-sanctions-icc-officials-for-efforts-to-arrest-americans-israelis_06e367"
  },
  "bias_distribution": {
    "total_sources": "168",
    "leaning_left": "38",
    "center": "45",
    "leaning_right": "23"
  },
  "perspective_summaries": {
    "left": [
      "The Trump administration announced new sanctions on four International Criminal Court officials for pursuing investigations into U.S. and Israeli officials for alleged war crimes.",
      "The sanctions target two judges and two prosecutors who engaged in prosecuting nationals without consent, according to the U.S. State Department.",
      "The International Criminal Court denounced the sanctions, calling them 'a flagrant attack against the independence of an impartial judicial institution.'",
      "United Nations spokesman Stephane Dujarric affirmed that the ICC has the full support of the world body to carry out its work."
    ],
    "center": [
      "On August 20, 2025, the United States implemented new sanctions against four officials associated with the International Criminal Court, including judges and prosecutors from Canada and France.",
      "The sanctions follow U.S. objections to ICC investigations into alleged war crimes by U.S. and Israeli nationals without the consent of either country, escalating earlier Trump administration measures.",
      "The targeted officials include French judge Nicolas Guillou, who presided over a pre-trial panel issuing an arrest warrant for Israeli Prime Minister Netanyahu, Canadian judge Kimberly Prost, and two deputy prosecutors from Fiji and Senegal.",
      "Secretary of State Rubio characterized the Court as a threat to national security, accusing it of being used to pursue legal actions against the United States and its key ally Israel, while Netanyahu praised the sanctions as a firm response to what he called a campaign of false accusations targeting Israel.",
      "The U.S. barred these ICC officials from entering the country and blocked their assets, intensifying its pressure campaign to impede investigations especially related to Israel and U.S. personnel in Afghanistan."
    ],
    "right": [
      "The Trump administration imposed sanctions on four International Criminal Court officials, including judges and prosecutors, amid ongoing tensions regarding their investigations into Israeli leaders.",
      "The International Criminal Court denounced the sanctions, calling them a \"flagrant attack against the independence of an impartial judicial institution\".",
      "U.S. sanctions targeted International Criminal Court officials, including judges Kimberly Prost and Nicolas Guillou, for their roles in investigations involving Israel.",
      "The sanctions freeze U.S. assets of the targeted officials and bar them from the U.S. financial system."
    ]
  },
  "sources": [
    {
      "news_title": "Trump Sanctions More ICC Officials",
      "news_link": "https://foreignpolicy.com/2025/08/21/trump-sanctions-icc-international-criminal-court-israel/",
      "bias": "Center",
      "text": "Trump Sanctions More ICC Officials\nThe U.S. leader’s beef with the top international court dates back to his first term in office.\nWelcome back to World Brief, where we’re looking at expanding U.S. sanctions against the International Criminal Court, Chinese President Xi Jinping’s rare trip to Tibet, and the terms of the EU-U.S. trade deal.\n‘Flagrant Attack’\nThe Trump administration on Wednesday intensified its crusade against the International Criminal Court (ICC) by imposing sanctions on four officials, including two prosecutors and two judges.\nWelcome back to World Brief, where we’re looking at expanding U.S. sanctions against the International Criminal Court, Chinese President Xi Jinping’s rare trip to Tibet, and the terms of the EU-U.S. trade deal.\n‘Flagrant Attack’\nThe Trump administration on Wednesday intensified its crusade against the International Criminal Court (ICC) by imposing sanctions on four officials, including two prosecutors and two judges.\nThe new U.S. sanctions amount to an expansion of the Trump administration’s ongoing campaign against the Hague-based court, which is the world’s first global war crimes tribunal.\nIn its announcement of the sanctions, the State Department railed against what it described as the ICC’s “transgressions” against the United States and Israel, citing the court’s prior investigation into U.S. personnel in Afghanistan and its decision to issue arrest warrants for top Israeli officials.\nThe ICC “continues to disregard national sovereignty and facilitate lawfare through efforts to investigate, arrest, detain, and prosecute American and Israeli nationals,” U.S. Secretary of State Marco Rubio said in a post on X on Wednesday. “We will continue to hold accountable those responsible for the ICC’s morally bankrupt and legally baseless actions against Americans and Israelis.”\nThe four targeted individuals aren’t the first ICC officials to face U.S. sanctions since Trump’s return to office. Earlier this year, the United States also sanctioned the court’s chief prosecutor and four other judges, freezing any of their U.S. assets and prohibiting them from entering the United States.\nU.S. President Donald Trump’s beef with the U.N.-backed court stretches back to his first term in office. During the first Trump presidency, the ICC launched an investigation into alleged war crimes committed by U.S. troops and intelligence officers in Afghanistan—infuriating Trump and sparking an initial round of U.S. sanctions.\nThe ICC’s recent actions against Israeli Prime Minister Benjamin Netanyahu have only added more fuel to the fire. Last year, the court issued arrest warrants for top Israeli and Hamas officials—including Netanyahu—citing alleged war crimes and crimes against humanity. Netanyahu, for his part, called the allegations “absurd and false.”\nSince neither the United States nor Israel have ratified the 2002 Rome Statute, which underpins the ICC, the Trump administration has accused the court of attempting to infringe upon U.S. sovereignty. But both Afghanistan and the Palestinian territories are party to the Rome Statute, which the ICC says authorizes it to investigate alleged crimes in their borders.\nThe ICC condemned the latest sanctions, calling them “a flagrant attack against the independence of an impartial judicial institution.”\n“The relentless intensification of U.S. reprisals against international institutions and their personnel must stop,” U.N. human rights chief Volker Türk said on Thursday. “Sanctioning judges and prosecutors at national, regional or international levels, for fulfilling their mandate in accordance with international law standards, is an assault on the rule of law and corrodes justice.”\nToday’s Most Read\n- Trump Has No Idea How to Do Diplomacy by Stephen M. Walt\n- Can India and the U.S. Repair Their Relationship? by Rudra Chaudhuri\n- Why Steve Witkoff Is Trump’s Master of Disaster by Christian Caryl\nWhat We’re Following\nTightening grip. Chinese President Xi Jinping made a rare trip to Tibet this week to mark the 60th anniversary of Tibet’s contested establishment as a Chinese autonomous region. The two-day trip was designed to tighten Beijing’s grip at a pivotal moment: The 14th Dalai Lama, the exiled Buddhist and spiritual leader of Tibet, recently turned 90 and confirmed that he will have a successor “in accordance with tradition.” That will likely pave the way for a succession fight with Beijing, which argues that only China can select the next Tibetan Buddhist leader.\nIn Lhasa, Xi told officials that Tibetan Buddhism must be tailored to China’s socialist system and said that Tibetans must use more standard Chinese. “Tibetan affairs are China’s internal affairs, and no external forces are permitted to interfere,” senior Chinese Communist Party leader Wang Huning declared to a crowd in Lhasa. “All schemes to split the motherland and undermine stability in Tibet are doomed to fail.”\nNew trade terms. Nearly one month after the United States and the European Union announced they struck a trade deal, the agreement’s exact terms are coming to light. In July, both parties agreed that the EU would broadly face a 15 percent tariff rate, commit at least $600 billion in investments, and make $750 billion worth of U.S. energy purchases.\nOn Thursday, after further negotiations, U.S. and European officials announced more details. Tariffs on Europe’s pharmaceutical sector, for example, will not exceed 15 percent or add onto other EU-wide tariffs. Once Brussels introduces legislation to lower the rate of industrial tariffs, a 15 percent tariff for European autos and U.S.-bound auto parts will also kick in.\n“This is the most favorable trade deal the U.S. has extended to any partner,” EU Trade Commissioner Maros Sefcovic told reporters on Thursday. “A wide range of sectors—including strategic industries, such as cars, pharmaceuticals, semiconductors, and lumber—will benefit from this cap.”\nSeeking refuge. Guatemala on Wednesday issued temporary humanitarian status to 161 people fleeing organized crime and cartel violence in Mexico. The 161 Mexicans include 39 families and 69 children, according to the Guatemalan Immigration Institute, and will be housed in rented homes, temporary shelters, or by relatives. Guatemala has long been a destination for Mexicans seeking refuge and safety abroad; last July, almost 600 Mexicans fled their home country for Guatemala.\nSome Mexican officials have rebuffed the idea that those individuals are fleeing the country as a result of crime. In a post on X, Eduardo Ramírez, the governor of the Mexican border state of Chiapas, claimed, without offering evidence, that the 161 Mexicans are related to arrested individuals who are facing criminal charges.\n“The organized crime that operates in the neighboring country of Guatemala wants to discredit our public safety strategy that has given tranquility and social peace in Chiapas,” Ramírez wrote. “I categorically deny that fact.”\nOdds and Ends\nDuring last week’s highly watched Trump-Putin summit in Anchorage, Russia gifted one Alaska man an unusual present: a $22,000 Ural motorcycle. Mark Warren, a retired fire inspector, was running errands on his own Ural bike earlier in August when he encountered a Russian television crew. After Warren shared how tough it was to purchase new parts, his interview went viral in Russia—and he later learned that he would soon receive a brand-new bike. The news baffled Warren, who thought it might be a scam. “I dropped my jaw,” he said. “I went, ‘You’ve got to be joking me.’” But they were serious—so long as he agreed to a photograph, interview, and having a cameraman document his first ride.\nChristina Lu is a staff writer at Foreign Policy. Bluesky: @christinalu.bsky.social X: @christinafei\nJoin the Conversation\nCommenting is a benefit of a Foreign Policy subscription.\nSubscribe Subscribe\nAlready a subscriber?\n.View Comments\nJoin the Conversation\nJoin the conversation on this and other recent Foreign Policy articles when you subscribe now.\nSubscribe Subscribe\nNot your account?\nView Comments\nJoin the Conversation\nPlease follow our comment guidelines, stay on topic, and be civil, courteous, and respectful of others’ beliefs.\nView Comments"
    },
    {
      "news_title": "UK Government refuses to comment as Donald Trump sanctions senior ICC judges",
      "news_link": "https://www.thenational.scot/news/25408281.uk-government-refuse-comment-donald-trump-sanctions-icc-judges/",
      "bias": "Lean Left",
      "text": "THE UK Government has refused to comment on the US imposing sanctions on two judges and two prosecutors at the International Criminal Court (ICC).\nThe move, which saw US secretary of state Marco Rubio accuse the top international court of “lawfare” against Israel, was widely condemned.\nFrance’s government expressed “dismay” that a French judge was among those sanctioned, saying the US actions were \"in contradiction to the principle of an independent judiciary\".\nUnited Nations spokesperson Stephane Dujarric said the sanctions undermine the foundation of international justice, adding: \"The [US] decision imposes severe impediments on the functioning of the office of the prosecutor.\"\nREAD MORE: ‘Let’s pick a fight’: Ross Greer pitches alternative Scottish independence strategy\nAnd the ICC itself said it “deplores” the sanctions, calling them \"a flagrant attack\" against the independence of an impartial judicial institution.\nHowever, the UK Labour Government has refused to say anything at all.\nAsked for a statement in response to the US sanctions, the Foreign Office declined to say anything on the record.\nDonald Trump’s administration has targeted Nicolas Yann Guillou of France, Nazhat Shameem Khan of Fiji, Mame Mandiaye Niang of Senegal, and Kimberly Prost of Canada, all of whom have been involved in cases linked to Israel and the United States.\nThe designations freeze any US assets the individuals may have and essentially cut them off from the US financial system.\n\"United States has been clear and steadfast in our opposition to the ICC’s politicisation, abuse of power, disregard for our national sovereignty, and illegitimate judicial overreach,\" Rubio said.\nBenjamin Netanyahu. Khan and Niang are the court's two deputy prosecutors.\nGuillou is an ICC judge who presided over a pre-trial panel that issued the arrest warrant for Israeli prime ministerCanadian Judge Prost served on an ICC appeals chamber that, in March 2020, unanimously authorized the ICC prosecutor to investigate alleged war crimes and crimes against humanity committed in Afghanistan since 2003, including examining the role of US service members.\nIn February, when Trump threatened to sanction ICC officials who worked on cases against the US, the UK was one of 79 countries to sign a statement in support of the court’s independence.\n\"We reaffirm our continued and unwavering support for the independence, impartiality and integrity of the ICC,\" the statement said.\nREAD MORE: UK Government-owned non-profit has over £1.4m contract with IDF-linked firm\n\"The court serves as a vital pillar of the international justice system by ensuring accountability for the most serious international crimes, and justice for victims.\"\nAt the time, the US also sanctioned British lawyer Karim Khan, the ICC’s chief prosecutor.\nKhan had successfully sought an arrest warrant for Netanyahu over allegations of war crimes and crimes against humanity.\nNetanyahu, who is also accused of spearheading genocide in Palestine by international experts, has been defended by Trump’s administration.\nThe US president accused the ICC of having “abused its power by issuing baseless warrants” against Israeli ministers.\nNetanyahu welcomed the US decision to sanction four further ICC officials.\nNeither Israel nor the US are signatories to the Rome Statute which established the ICC."
    },
    {
      "news_title": "Israel bombs displacement camp and neighborhood in central Gaza, Russia launches massive drone barrage at Ukraine, Trump sanctions ICC judges",
      "news_link": "https://www.dropsitenews.com/p/israel-attacks-central-gaza-russia-ukraine-drone-barrage",
      "bias": "Left",
      "text": "Israel bombs displacement camp and neighborhood in central Gaza, Russia launches massive drone barrage at Ukraine, Trump sanctions ICC judges\nDrop Site Daily: August 21, 2025\nSeventy people are confirmed killed in Gaza over the past 24 hours, including two who died of starvation and 18 who were seeking aid. Over 2,000 people have died seeking aid. Fighting intensifies in Gaza City and central Gaza, with Israel continuing to bomb neighborhoods full of civilians. Top Israeli minister Ron Dermer heads to Paris for Gaza discussions. Russia carries out massive strike in Ukraine, reportedly striking 11 sites, including a U.S. company, with a barrage of over 500 drones and 40 missiles. Trump admin imposes sanctions on ICC judges for rulings on Israel. Former Brazilian President Jair Bolsonaro attempted to enlist Javier Milei in an aborted effort to evade prosecution in his native country.\nThis is Drop Site Daily, our new, free daily news recap. We’ll be sending it Monday through Friday. If you want to continue getting this newsletter, you don’t have to do anything. But if this is too much—we do try to be mindful of your inbox—you can unsubscribe from this newsletter while continuing to get the rest of our reporting. Just go into your account here at this link, scroll down, and toggle the button next to “Drop Site Daily” to the off setting. It looks like this:\nThe Genocide in Gaza\nAt least 20 people have been killed in Israeli attacks across Gaza since dawn, including eight seeking aid, according to Al Jazeera. Seventy deaths and 356 injuries have been reported in Gaza over the past 24 hours, according to Gaza’s Ministry of Health, bringing the total confirmed toll to 62,192 dead and 157,114 injuries. Eighteen people were killed while seeking aid and 117 injured; 2,036 have died seeking aid with more than 15,064 injuries reported.18 martyrs and 117 injuries, bringing the total number of livelihood victims who arrived at hospitals to 2,036 martyrs and more than 15,064 injuries. Two people died of starvation in the past 24 hours, bringing the confirmed total to 271, including 112 children.\nIsraeli warplanes completely destroyed a displacement camp sheltering families in Deir al-Balah, central Gaza, firing three missiles that leveled the site, leaving a massive crater and causing total devastation. Footage verified by Al Jazeera shows the destruction.\nHamas’s Qassam Brigades launched a major raid on a new Israeli military site southeast of Khan Younis on Wednesday, attempting to capture soldiers, striking tanks with Yasin-105 shells, and engaging troops in hours of close combat. Israel confirmed the attack, acknowledging three soldiers injured and claiming 10 Qassam fighters had been killed, while media described it as a rare breach of army defenses. The raid comes as Defense Minister Israel Katz prepares a massive Gaza City assault, called “Operation Gideon’s Chariot II,” which is expected to displace up to one million Palestinians.\nIsrael struck Gaza City’s northwestern Sheikh Radwan neighborhood around 6 p.m. local time on Wednesday, leaving total carnage on a city street. Bodies lay in pools of blood, some still gasping for breath, with devastating injuries and body parts strewn across the street.\nDr. Mimi Syed, a U.S. emergency physician who has been vocal about Israel’s destruction of Gaza’s health system, was denied entry while attempting her third medical mission. She was carrying baby formula and medical equipment to treat malnourished children and a surge of cases of Guillain-Barré syndrome. Syed, who has previously worked in Gaza, testified at the Gaza Tribunal, met with UN Secretary-General António Guterres, and briefed U.S. senators, was blocked as Israel continues to prevent medical workers and supplies from reaching the already devastated health system. See our previous coverage of Israel’s increasing denial of doctors and aid workers into Gaza.\nBetween August 3 and 16, UNICEF delivered therapeutic food for 30,000 malnourished children, infant formula for 1,250 babies, 3,500 cartons of high-energy biscuits, and over 30 truckloads of medicines into Gaza. However, the UN reports malnutrition prevention stocks are almost completely depleted after months of total blockade and only limited entry since May. In Gaza City, nearly 1 in 3 children is now malnourished—six times higher than before the ceasefire collapsed, according to UNRWA data from over 100,000 children screened since March.\nDespite Israel’s claims of lifted restrictions, UN OCHA reports that shelter materials for some 1.4 million displaced Palestinians in Gaza are still not entering the territory, with 86,000 tents and one million tarps stuck outside. Since Israel blocked all shelter equipment on March 2, at least 750,000 Palestinians have been newly displaced, and the UN warns that meeting current needs requires 3,500 truckloads of tents, tarpaulins, and household items, with another 1 million potentially at risk if Gaza City offensives continue.\nCeasefire Negotiations\nIsrael’s Strategic Affairs Minister Ron Dermer met with senior Qatari officials in Paris to discuss the Gaza ceasefire deal approved by Hamas, reportedly emphasizing Israel’s demand for the release of all captives and Hamas’s defeat on Israel’s terms. Those terms are sweeping demands that amount to surrendering the Palestinian cause of liberation: release all captives, fully disarm Hamas, demilitarize Gaza, and maintain Israeli security control. Hamas has already agreed to the transfer of civilian administration in Gaza to a Palestinian-led committee.\nEgypt’s Foreign Minister Badr Abdelatty told U.S. envoy Steve Witkoff that Israel should respond positively to a proposal aimed at protecting captives, easing Palestinian suffering, and ensuring adequate aid amid what he called a deliberate starvation policy. He emphasized using the 60-day truce—accepted by Hamas—as an opportunity to end the nearly two-year war and negotiate a just settlement for the Palestinian cause.\nU.S. News\nThe Trump administration has imposed sanctions on four senior International Criminal Court officials—two judges and two deputy prosecutors—citing “illegitimate” actions against the U.S. and Israel. The sanctions freeze their U.S. assets and block access to the American financial system, a move widely criticized by UN officials as undermining judicial independence, and comes in response to ICC warrants targeting Israeli prime minister Benjamin Netanyahu and former defense minister Yoav Gallant for war crimes and crimes against humanity.\nPresident Donald Trump has directed his lawyers to review Smithsonian museums, claiming they present U.S. history too negatively and overemphasize slavery. He compared this effort to his university reviews, aiming to make the Smithsonian less “woke” and more “accountable.”\nElon Musk is reportedly stepping back from launching his “America Party” to focus on his businesses and maintain ties with presidential hopeful JD Vance (shown here being heckled at a “cookie and burger” event for National Guardsmen at D.C.’s Union Station). Musk spent nearly $300 million supporting Trump and Republicans in 2024 before saying he would cut back on political spending.\nThe State Department has dismissed its top press officer for Israeli-Palestinian affairs following internal disputes over Israel policy, including whether to offer condolences for journalists killed in Gaza and to publicly oppose the forced displacement of Palestinians, according to internal documents. More from WaPo.\nSeventeen Democratic senators, led by Hawaii’s Brian Schatz, sent a letter to Secretary of State Marco Rubio demanding accountability for Israel’s systematic targeting of journalists in Gaza and calling for international reporters to be granted independent access. Citing the Israeli strike that killed six journalists, including Al Jazeera’s Anas al-Sharif, they pressed the administration on whether the U.S. was consulted, if it supports an independent investigation, and what steps it will take to stop Israel from killing or detaining journalists—warning Israel’s repression of the press suggests an effort to hide the war’s consequences.\nThe Washington Post reports Defense Secretary Pete Hegseth’s sweeping security demands are straining the Army’s Criminal Investigation Division (CID), which has diverted hundreds of agents from criminal probes to guard multiple family residences in Minnesota, Tennessee, and D.C. CID staff describe the multimillion-dollar operation as unprecedented, with one official saying: “I’ve never seen this many security teams for one guy. Nobody has.” The burden—extending even to former spouses’ homes—has fueled staffing shortages and canceled investigations, leaving insiders to warn that the agency now has a “complete inability to achieve our most basic missions.”\nAndrew Cuomo is privately banking on Donald Trump and top Republicans to help him win back City Hall, urging them to sideline New York City GOP nominee for mayor Curtis Sliwa to block democratic socialist Zohran Mamdani. At a Hamptons fundraiser, Cuomo reportedly told donors “Trump himself… will say the goal is to stop Mamdani,” even as he publicly denies seeking Trump’s backing. Mamdani’s campaign blasted him as “Donald Trump’s choice for mayor,” while Adams and Sliwa mocked him as a failed candidate cutting backroom deals.\nProtesters with No Azure for Apartheid set up an encampment for a second day at Microsoft’s Redmond headquarters, despite police breaking up their protest yesterday, resulting in the arrest of several participants, including at least one current and one former employee. The site, called the “Liberated Zone” at the “Martyred Palestinian Children’s Plaza,” features a media tent honoring slain Gaza journalist Anas Al-Sharif, with organizers demanding Microsoft end its complicity in what they call the genocide of the Palestinian people.\nMaine Sen. Susan Collins hits newly minted challenger, Graham Platner, over his criticism of Israel. Ryan Grim suggests that this might not be the best idea.\nInternational News\nRussia carried out a massive strike in Ukraine overnight, reportedly striking 11 sites with a barrage of over 500 drones and 40 missiles. The targets included a U.S. electronics company Flex Ltd, which is headquartered in Austin, Texas, and registered in Singapore. The attack, which was the largest aerial bombardment targeting Ukraine in weeks, came after this week’s meeting with Ukrainian President Volodymyr Zelenksyy at the White House. On Monday, Trump announced plans to arrange a face-to-face meeting between Russian President Vladimir Putin and Zelenskyy to negotiate an end to Russia’s invasion of Ukraine, while affirming U.S. support for European security guarantees to prevent future Russian aggression.\nIn the wake of the high-profile peace summit between Russian and U.S. leaders in Alaska, Russian Foreign Minister Sergey Lavrov stated that any serious discussions on Ukraine’s security without Moscow’s involvement would be “a road to nowhere,” and suggested that Moscow would need to have a veto over any security guarantees provided to Ukraine as a means of ending the war. The comment suggested that deep divisions remained in negotiations between the two sides, and cast doubt on the viability of Europe’s “coalition of the willing” — a U.K.- and France-led framework intended to safeguard postwar Ukraine via potential Western military deployments.\nIsrael carried out airstrikes in southern Lebanon Wednesday, hitting areas near Ansar in Nabatieh and al-Housh outside Tyre, where at least four people were wounded. Near-daily attacks continue despite a ceasefire reached late last year, amid U.S. pressure on Lebanon’s government to disarm Hezbollah. The Israeli army claimed it struck Hezbollah positions, including a weapons depot and rocket launcher.\nBrazilian federal police found that former President Jair Bolsonaro drafted a request for political asylum from Argentina in February 2024, just days after authorities searched his home over an alleged coup plot. The revelation comes as Bolsonaro awaits a Supreme Court ruling on the case, and faces obstruction of justice charges alongside his son. Bolsonaro also recently drew scrutiny for briefly staying at the Hungarian Embassy in Brasília to evade arrest.\nIranian Foreign Minister Abbas Araghchi said Wednesday that negotiations with the U.S. and European governments remain stalled, with “no basis” for talks at present. He expressed more optimism about restoring cooperation with the International Atomic Energy Agency, noting inspectors may eventually return under the Supreme National Security Council’s approval—a step seen as crucial to preventing another war over Iran’s nuclear program.\nAustralia hit back at Netanyahu after he accused PM Albanese of “betraying Israel and Australia’s Jews” and called him “weak” over recognizing Palestine. Home Affairs Minister Tony Burke replied: “Strength is not measured by how many people you can blow up or how many children you can leave hungry.”\nFrench President Emmanuel Macron said, after a call with leaders of Jordan and Egypt, that the “military attack Israel is preparing in the Gaza Strip will only lead to a real catastrophe for both peoples and drag the region into perpetual war.”\nNorth Korea has built a covert missile base in Sinpung-dong, roughly 17 miles from the Chinese border, which may house six to nine nuclear-capable intercontinental ballistic missiles, according to revelations from a new report by the Center for Strategic and International Studies. The facility—one of an estimated 15-20 undeclared missile and warhead storage sites—has never been part of U.S.-North Korea denuclearization negotiations. The report notes that Pyongyang has accelerated its nuclear weapons program since a failed 2019 U.S. peace summit, with Kim Jong-un recently calling for the “rapid expansion” of the country’s nuclear capabilities.\nMore from Drop Site\nPalestinian businessman Samir Hulileh told Drop Site News he was approached by the Biden administration in 2024 as a potential “post-war” governor of Gaza, though neither the PA nor Hamas has publicly endorsed him. Hulileh, who has a history of roles in the Palestinian Authority and private sector, has been working with lobbyist Ari Ben-Menashe to secure support for a Gaza administration plan involving U.S. and Arab involvement, new infrastructure, and minimal Hamas participation. While the PA publicly condemned his statements, Hulileh says he has been in detailed discussions with PA leadership. Analysts warn that Israel’s current strategy aims to displace Palestinians and prevent unified Palestinian governance, leaving external powers to dictate Gaza’s future. Read the full article at Drop Site.\nIn comments last night, Israel Defense Minister Yisrael Katz discussed Operation Gideon's Chariot II with senior rabbis from the Torat Haaretz Tova organization and promised: \"Gaza City will look like Beit Hanoun.\" Younis Tirawi reported for Drop Site about the strategy of pure destruction in Beit Hanoun.\nJoin the Arab Center of Washington DC on August 22 at 12 p.m. ET for a panel, “What Comes Next in Gaza?,” featuring Yara Asi, Diana Buttu, Mouin Rabbani, and Jeremy Scahill, moderated by Yousef Munayyer. More information here.\nEvery empire that turns a blind eye to slaughter eventually pays the price. If Israel continues its brutal campaign against Palestinians and the United States remains complicit through silence or aid, the blowback won’t just be moral—it will be geopolitical, generational, and unforgiving. The day will come when America wishes it had never tethered its legacy to the name “Israel.”\nIsrael's blood lust is beyond anything i thought I would ever witness first hand and beyond anything I thought would be allowed and ignored by the civilized (!) world. I am visiting a Jewish friend soon and much to my own horror, I vowed to keep my mouth shut to preserve the friendship\nbut if she starts telling me about the anti-semitism she is experiencing and the security guards which are patrolling her synagogue in order to protect the worshippers, i am not sure what I will do."
    },
    {
      "news_title": "US Sanctions Four ICC Officials After Arrest Warrants Issued for Israel’s Netanyahu and Far-Right Ministers - Quds News Network",
      "news_link": "https://qudsnen.co/us-sanctions-four-icc-officials-after-arrest-warrants-issued-for-israels-netanyahu-and-far-right-ministers/",
      "bias": "Lean Left",
      "text": "US Sanctions Four ICC Officials After Arrest Warrants Issued for Israel’s Netanyahu and Far-Right Ministers\nWashington (Quds News Network)- The US imposed new sanctions on Wednesday against four International Criminal Court (ICC) officials on the basis that any attempt to “investigate, arrest, detain or prosecute” American or Israeli officials constitutes a threat to the national security and foreign policy of the United States in what the ICC has denounced as a “flagrant attack against the independence of an impartial judicial institution”.\nThe new sanctions target the ICC judges Kimberly Prost of Canada and Nicolas Guillou of France and prosecutors Nazhat Shameem Khan of Fiji and Mame Mandiaye Niang of Senegal.\n“These individuals are foreign persons who directly engaged in efforts by the international criminal court to investigate, arrest, detain or prosecute nationals of the United States or Israel, without the consent of either nation,” the secretary of state, Marco Rubio, said.\nHe added that the administration would continue “to take whatever actions we deem necessary to protect our troops, our sovereignty and our allies from the ICC’s illegitimate and baseless actions”.\nIn a separate statement, the state department said Prost was sanctioned for a ruling to authorize an ICC investigation into personnel in Afghanistan, which was later dropped. Guillou was sanctioned for ruling to authorize the ICC’s issuance of arrest warrants for Benjamin Netanyahu and Israel’s former minister of defense Yoav Gallant over war crimes and crimes against humanity in Gaza.\nKhan and Niang were penalized for continuing Karim Khan’s investigation into Israel’s genocide in Gaza, including upholding the ICC’s arrest warrants for Netanyahu and Gallant, according to the statement.\nKhan and Niang had also prepared arrest warrants for Israeli National Security Minister Itamar Ben Gvir and Finance Minister Bezalel Smotrich on apartheid charges.\nICC Response\nThe ICC issued a statement calling the sanctions “a flagrant attack against the independence of an impartial judicial institution” and “an affront against the Court’s states parties, the rules-based international order and, above all, millions of innocent victims across the world”.\nA UN spokesperson, Stéphane Dujarric, said the ICC had the full support of the world body to carry out its work. The UN was “very concerned” about the US continuing to target the international court, he said.\n“We firmly believe that the ICC is a key pillar of international criminal justice, and we respect their work,” Dujarric said. “The decision imposes severe impediments on the functioning of the office of the prosecutor in respect for all the situations that are currently before the court.”\nThe sanctions are the latest attack on the ICC. Since President Donald Trump’s executive order was issued in February, the US has now sanctioned nine individuals at the ICC.\nThe US administration sanctioned ICC Chief Prosecutor Karim Khan in February because of his role in pursuing the arrest warrants for Netanyahu and Gallant.\nDuring the first Trump administration in 2020, Washington imposed sanctions on then-prosecutor Fatou Bensouda and one of her top aides over the court’s work on Afghanistan.\nJames Goldston, executive director of the Open Society’s justice initiative and former ICC prosecutor, said: “As a court of last resort, the ICC is the one place victims of the most serious crimes can turn to when other avenues have failed them in their search for truth and justice. These new designations of ICC judges threaten their hopes and embolden the perpetrators.”\n“Sanctions against ICC officials are a betrayal of America’s proud commitment to the rule of law and international justice.”"
    },
    {
      "news_title": "US slaps sanctions on ICC judges probing Netanyahu, France expresses dismay - The Statesman",
      "news_link": "https://www.thestatesman.com/world/us-slaps-sanctions-on-icc-judges-probing-netanyahu-france-expresses-dismay-1503474503.html",
      "bias": "Center",
      "text": "The United States has widened its measures against the International Criminal Court (ICC) over its prosecution of Israeli Prime Minister Benjamin Netanyahu, announcing sanctions on a French judge and several others linked to the court’s investigations.\nUS Secretary of State Marco Rubio on Wednesday (local time) declared sanctions against Judge Nicolas Guillou of France, who is presiding over the case in which the ICC has issued an arrest warrant for Netanyahu.\nAdvertisement\nIn addition, Canadian judge Kimberly Prost was sanctioned in connection with a separate case involving alleged war crimes committed in Afghanistan.\nTwo deputy prosecutors, Nazhat Shameem Khan of Fiji and Mame Mandiaye Niang of Senegal, were also targeted under the new restrictions.\nFrance, whose President Emmanuel Macron had been in Washington just two days before the announcement, reacted sharply, saying it was “dismayed” by the move. A foreign ministry spokesman said the decision was “in contradiction to the principle of an independent judiciary.”\nThe ICC also denounced the sanctions, describing them as a “flagrant attack against the independence of an impartial judicial institution.”\nThe ICC has accused Netanyahu of war crimes and crimes against humanity during Israel’s military operations in Gaza.\nNetanyahu expressed gratitude to Rubio, thanking him for what he called a “decisive act against a smear campaign of lies against the State of Israel” and its military.\nThe ICC has also issued arrest warrants for former Israeli Defence Minister Yoav Gallant and Hamas commander Mohammed Deif, who has since been confirmed killed by Israel.\nJudge Guillou, who now faces US sanctions, has a long record of judicial service, having previously participated in trials connected to Kosovo and Lebanon.\nHe also worked in the United States for several years, assisting the Justice Department with judicial cooperation during the Obama administration.\nThe sanctions imposed by Washington will prevent him from entering the country and freeze any assets he may hold there.\nThe move mirrors actions taken under the Trump administration, which had previously imposed sanctions on ICC officials and dismissed the court’s authority.\nRubio had already sanctioned four other ICC judges earlier in June. The State Department explained that the two deputy prosecutors were penalised for backing “illegitimate ICC actions against Israel,” including their support for the arrest warrants against Netanyahu and Gallant.\nJudge Prost, the Canadian official now sanctioned, had been involved in a case authorising an ICC investigation into alleged crimes committed during the Afghanistan war, including by US forces.\nNeither the United States, Russia, nor Israel is a member of the ICC. The latest measures come against the backdrop of former President Donald Trump recently hosting Russian President Vladimir Putin in Alaska, despite the ICC’s outstanding arrest warrant against him for the invasion of Ukraine.\nThe administration of former President Joe Biden had also opposed ICC proceedings against Israel, though it lifted earlier sanctions and permitted limited cooperation with the court, including in investigations linked to Ukraine."
    },
    {
      "news_title": "US ramps up attack on ICC over Israel",
      "news_link": "https://www.dawn.com/news/1932193",
      "bias": "Lean Left",
      "text": "WASHINGTON/AMSTERDAM: The United States on Wednesday imposed sanctions on four more International Criminal Court judges or prosecutors, including from allies France and Canada, in a new effort to hobble the tribunal particularly over actions against Israel.\n“The Court is a national security threat that has been an instrument for lawfare against the United States and our close ally Israel,” Secretary of State Marco Rubio said in a statement, using a term popular with President Donald Trump’s supporters.\nRubio said that the four people targeted from the tribunal based in The Hague had sought to investigate or prosecute nationals from the United States or Israel “without the consent of either nation.” The four include Judge Nicolas Guillou of France, who is presiding over a case in which an arrest warrant was issued for Israeli Prime Minister Benjamin Netanyahu.\nThe case was brought forward by the State of Palestine, which is not recognised by Washington but, unlike Israel or the United States, has acceded to the statute that set up the tribunal in The Hague.\nGuillou, a veteran jurist, had worked for several years in the United States assisting the Justice Department with judicial cooperation during Barack Obama’s presidency.\nAlso targeted in the latest US sanctions was a Canadian judge, Kimberly Prost, who was involved in a case that authorised an investigation into alleged crimes committed during the war in Afghanistan, including by US forces.\nUnder the sanctions, the United States will bar entry of the ICC judges to the United States and block any property they have in the world’s largest economy — measures more often taken against US adversaries than individuals from close allies.\nRubio also slapped sanctions on two deputy prosecutors — Nazhat Shameem Khan of Fiji and Mame Mandiaye Niang of Senegal.\nThe State Department said the two were punished by the United States for supporting “illegitimate ICC actions against Israel,” including by supporting the arrest warrants against Netanyahu and former defense minister Yoav Gallant. The Trump administration has roundly rejected the authority of the court, which is backed by almost all European democracies and was set up as a court of last resort when national systems do not allow for justice.\nTrump on Friday welcomed Russian President Vladimir Putin to Alaska even though Putin faces an ICC arrest warrant, a factor that has stopped him from traveling more widely since he ordered the invasion of Ukraine. Rubio slapped sanctions on four other ICC judges in June.\nICC deplores sanctions\nThe International Criminal Court (ICC) said on Wednesday it deplored the announcement by President Donald Trump’s administration of new US sanctions against another four of its staff members — two judges and two deputy prosecutors.\n“These sanctions are a flagrant attack against the independence of an impartial judicial institution which operates under the mandate from 125 states parties from all regions,” the ICC said in a statement.\n“They constitute also an affront against the Court’s States Parties, the rules-based international order and, above all, millions of innocent victims across the world,” the court added. “The ICC will continue fulfilling mandates in strict accordance with its legal framework, without regard to any pressure or threat.”\nPublished in Dawn, August 21st, 2025"
    },
    {
      "news_title": "US expands attack on ICC with new round of sanctions",
      "news_link": "https://www.newarab.com/news/us-expands-attack-icc-new-round-sanctions",
      "bias": "Lean Left",
      "text": "Breadcrumb\nUS expands attack on ICC with new round of sanctions\nThe United States on Wednesday imposed sanctions on four more International Criminal Court judges or prosecutors, including from allies France and Canada, in a new effort to hobble the tribunal particularly over actions against Israel.\n\"The Court is a national security threat that has been an instrument for lawfare against the United States and our close ally Israel,\" Secretary of State Marco Rubio said in a statement, using a term popular with President Donald Trump's supporters.\nRubio said that the four people targeted from the tribunal based in The Hague had sought to investigate or prosecute nationals from the United States or Israel \"without the consent of either nation.\"\nThe ICC last year indicted Israeli prime minister Benjamin Netanyahu and former defence minister Yoav Gallant for war crimes and crimes against humanity.\nThe four include Judge Nicolas Guillou of France, who is presiding over a case in which an arrest warrant was issued for Israeli Prime Minister Benjamin Netanyahu.\nThe case was brought forward by the State of Palestine, which is not recognized by Washington but, unlike Israel or the United States, has acceded to the statute that set up the tribunal in The Hague.\nGuillou, a veteran jurist, had worked for several years in the United States assisting the Justice Department with judicial cooperation during Barack Obama's presidency.\nAlso targeted in the latest US sanctions was a Canadian judge, Kimberly Prost, who was involved in a case that authorised an investigation into alleged crimes committed during the war in Afghanistan, including by US forces.\nUnder the sanctions, the United States will bar entry of the ICC judges to the United States and block any property they have in the world's largest economy - measures more often taken against US adversaries than individuals from close allies.\nRubio also slapped sanctions on two deputy prosecutors - Nazhat Shameem Khan of Fiji and Mame Mandiaye Niang of Senegal.\nThe State Department said the two were punished by the United States for supporting \"illegitimate ICC actions against Israel,\" including by supporting the arrest warrants against Netanyahu and former defense minister Yoav Gallant.\nThe Trump administration has roundly rejected the authority of the court, which is backed by almost all European democracies and was set up as a court of last resort when national systems do not allow for justice.\nTrump on Friday welcomed Russian President Vladimir Putin to Alaska even though Putin faces an ICC arrest warrant, a factor that has stopped him from traveling more widely since he ordered the invasion of Ukraine.\nRubio slapped sanctions on four other ICC judges in June.\n(AFP)"
    },
    {
      "news_title": "US Sanctions Canadian International Criminal Court Judge",
      "news_link": "https://www.theepochtimes.com/world/us-sanctions-canadian-international-criminal-court-judge-5903761",
      "bias": "Lean Right",
      "text": "The United States has placed sanctions on a Canadian judge and three other judges who sit on the International Criminal Court (ICC), saying they authorized ICC investigations into U.S. personnel in Afghanistan.\nThe U.S. State Department said in an Aug. 20 statement that judge Kimberly Prost was sanctioned after authorizing an ICC investigation into potential alleged war crimes and crimes against humanity by U.S. soldiers in Afghanistan since 2003. The Appeals Chamber of the ICC decided unanimously to authorize the investigation in March 2020."
    },
    {
      "news_title": "US sanctions ICC judges for probes into alleged American, Israeli war crimes",
      "news_link": "https://www.scmp.com/news/world/united-states-canada/article/3322575/us-sanctions-icc-judges-prosecutors-probes-alleged-american-israeli-war-crimes",
      "bias": "Center",
      "text": "US sanctions ICC judges, prosecutors for probes into alleged American, Israeli war crimes\nThe sanctions, announced by Secretary of State Rubio, are the latest steps the US has taken against the international war crimes tribunal\nThe Trump administration is ramping up pressure on the International Criminal Court (ICC) for pursuing investigations into US and Israeli officials for alleged war crimes.\nThe State Department on Wednesday announced new sanctions on four ICC officials, including two judges and two prosecutors, who it said had been instrumental in efforts to prosecute Americans and Israelis.\nAs a result of the sanctions, any assets the targets hold in US jurisdictions are frozen.\nThe sanctions are just the latest in a series of steps the administration has taken against The Hague-based court, the world’s first international war crimes tribunal."
    },
    {
      "news_title": "Canadian judge among 4 ICC officials sanctioned by U.S. over ‘lawfare’ - National",
      "news_link": "https://globalnews.ca/news/11342379/us-icc-sanctions-canada-afghanistan-israel/",
      "bias": "Lean Left",
      "text": "The Trump administration said Wednesday it was sanctioning a Canadian judge on the International Criminal Court, along with three other jurists and prosecutors engaged in what the U.S. calls “lawfare” against Americans and Israelis.\nThe U.S. State Department said Kimberly Prost, a Canadian who has served on the court since 2018, was sanctioned for ruling to authorize the ICC’s investigation into U.S. military personnel in Afghanistan.\nAn ICC judge from France and two deputy prosecutors from Fiji and Senegal were also sanctioned in connection with the ICC’s investigation into Israel’s actions in Gaza and the West Bank.\nThe French jurist, Nicolas Guillou, authorized the arrest warrants issued last year against Israeli Prime Minister Benjamin Netanyahu and former Israeli defence minister Yoav Gallant for alleged war crimes in Gaza.\nU.S. Secretary of State Marco Rubio said on X that the ICC “continues to disregard national sovereignty and facilitate lawfare through efforts to investigate, arrest, detain, and prosecute American and Israeli nationals.”\n“We will continue to hold accountable those responsible for the ICC’s morally bankrupt and legally baseless actions against Americans and Israelis,” he said.\nThe U.S. and Israel are not signatories to the ICC and do not recognize its authority. Israel has accused the ICC, which also issued arrest warrants against senior Hamas officials last year, of antisemitism.\nIn 2020, Prost and her fellow jurists on an ICC appeals bench authorized an investigation into crimes allegedly committed in Afghanistan since 2003.\nGet breaking National news\nThe ruling says the investigation will look into alleged war crimes committed by “the armed forces of the United States of America” and the CIA, as well as war crimes and crimes against humanity allegedly committed by the Taliban and Afghan security forces.\nThe sanctions announced Wednesday block the ICC officials from financial transactions and property owned in the U.S.\nProst joins a growing list of ICC judges that have been hit with similar actions. Other jurists involved in authorizing the Afghanistan investigation were sanctioned by the U.S. in June.\nU.S. President Donald Trump issued an executive order in February that declared the ICC’s actions against the U.S. and Israel a national security threat worthy of a national emergency.\nIt directed Rubio to identify individuals involved in those investigations and to impose “tangible and significant consequences on those responsible for the ICC’s transgressions.”\nThe order noted Congress passed legislation in 2002 to protect U.S. officials and military personnel from criminal prosecution by international courts that the U.S. is not a signatory to.\nThat law was enacted less than a year after the U.S. invaded Afghanistan in response to the Sept. 11, 2001, terrorist attacks.\nThe ICC has condemned the actions of the Trump administration, calling them an attempt to undermine the independence of an international judicial institution.\n- With retaliatory tariffs removed, a look at items that will be cheaper for Canadians\n- Survey finds border agents among least satisfied public servants in Canada\n- Canada Post and union are set to resume labour talks after delay\n- Drones, armoured vehicles part of Canada’s $2B military aid package for Ukraine\nComments"
    },
    {
      "news_title": "US imposes sanctions on four ICC judges, prosecutors over 'threat to Israel'",
      "news_link": "https://www.presstv.ir/Detail/2025/08/20/753464/US-imposes-new-sanctions-on-four-ICC-judges,-prosecutors",
      "bias": "Right",
      "text": "The United States has imposed sanctions on four International Criminal Court (ICC) judges and prosecutors in a new effort to undermine the court over its actions against Israel.\nIn a statement on Wednesday, the US State Department said the sanctions were issued “in response to the [court’s] ongoing threat to Americans and Israelis.”\nSecretary of State Marco Rubio described the ICC as “a national security threat” and an instrument of “lawfare” against Israel and the United States, echoing the rhetoric used by US President Donald Trump.\nRubio said that the four individuals sanctioned by the State Department had sought to investigate or prosecute individuals from Israel or the US “without the consent of either.”\nAmong the sanctioned is French judge Nicolas Guillou, who presided over a pre-trial panel that issued arrest warrants for Israeli prime minister Benjamin Netanyahu and his former war minister Yoav Gallant last November.\nThe ICC stated that there was “reasonable ground” to believe Netanyahu and Gallant bore criminal responsibility for war crimes, including using starvation as a method of warfare, and perpetrating crimes against humanity in Gaza.\nThe Israeli regime also faces a genocide case at the International Court of Justice (ICJ) for its genocidal war in Gaza.\nThe ICC is also probing possible war crimes by US forces in Afghanistan.\nCanadian judge Kimberly Prost has also been sanctioned for “ruling to authorize the ICC’s investigation into US personnel in Afghanistan”, the US State Department said.\nTwo deputy prosecutors of the ICC, Nazhat Shameem Khan of Fiji and Mame Mandiaye Niang of Senegal, have also been sanctioned for supporting arrest warrants against Netanyahu and Gallant.\nBoth Israel and the US have rejected the authority of the ICC, but the court has maintained that it can issue arrest warrants because the places in which the alleged crimes took place are parties to the court.\nOn February 13, 2025, the US Department of the Treasury added the Court's chief prosecutor, Karim Khan, to its \"Specially Designated Nationals and Blocked Persons List,\" barring him from entering the US and freezing his assets in the country.\nUS sanctions undermine the foundation of international justice, UN spokesperson Stephane Dujarric said, adding: “The decision imposes severe impediments on the functioning of the office of the prosecutor.”"
    },
    {
      "news_title": "US hits ICC with more sanctions, targets French judge involved in ...",
      "news_link": "https://www.france24.com/en/americas/20250820-us-hits-icc-with-more-sanctions-targets-french-judge-involved-in-netanyahu-arrest-warrant",
      "bias": "Center",
      "text": "US hits ICC with more sanctions, targets French judge involved in Netanyahu arrest warrant\nUS Secretary of State Marco Rubio on Wednesday announced more sanctions on International Criminal Court judges, saying that the court was a \"national security threat\" because it had sought to prosecute US or Israeli nationals. Judge Nicolas Guillou of France, who is presiding over a case in which an arrest warrant was issued for Israeli Prime Minister Benjamin Netanyahu, was among those sanctioned.\nTo display this content from YouTube, you must enable advertisement tracking and audience measurement.\nOne of your browser extensions seems to be blocking the video player from loading. To watch this content, you may need to disable it on this site.\nThe United States on Wednesday imposed sanctions on four more International Criminal Court judges or prosecutors, including from allies France and Canada, in a new effort to hobble the tribunal particularly over actions against Israel.\n“The Court is a national security threat that has been an instrument for lawfare against the United States and our close ally Israel,” Secretary of State Marco Rubio said in a statement, using a term popular with President Donald Trump’s supporters.\nRubio said that the four people targeted from the tribunal based in The Hague had sought to investigate or prosecute nationals from the United States or Israel “without the consent of either nation\".\nThe four include Judge Nicolas Guillou of France, who is presiding over a case in which an arrest warrant was issued for Israeli Prime Minister Benjamin Netanyahu.\nRead moreEU backs 'cornerstone of international justice' after US sanctions ICC judges\nThe case was brought forward by the State of Palestine, which is not recognised by Washington but, unlike Israel or the United States, has acceded to the statute that set up the tribunal in The Hague.\nGuillou, a veteran jurist, had worked for several years in the United States assisting the Justice Department with judicial cooperation during Barack Obama’s presidency.\nAlso targeted in the latest US sanctions was a Canadian judge, Kimberly Prost, who was involved in a case that authorized an investigation into alleged crimes committed during the war in Afghanistan, including by US forces.\nUnder the sanctions, the United States will bar entry of the ICC judges to the United States and block any property they have in the world’s largest economy – measures more often taken against US adversaries than individuals from close allies.\nTo display this content from YouTube, you must enable advertisement tracking and audience measurement.\nOne of your browser extensions seems to be blocking the video player from loading. To watch this content, you may need to disable it on this site.\nRubio also slapped sanctions on two deputy prosecutors – Nazhat Shameem Khan of Fiji and Mame Mandiaye Niang of Senegal.\nThe State Department said the two were punished by the United States for supporting “illegitimate ICC actions against Israel\", including by supporting the arrest warrants against Netanyahu and former defence minister Yoav Gallant.\nThe Trump administration has roundly rejected the authority of the court, which is backed by almost all European democracies and was set up as a court of last resort when national systems do not allow for justice.\nTrump on Friday welcomed Russian President Vladimir Putin to Alaska even though Putin faces an ICC arrest warrant, a factor that has stopped him from traveling more widely since he ordered the invasion of Ukraine.\nRubio slapped sanctions on four other ICC judges in June.\n(FRANCE 24 with AFP)"
    },
    {
      "news_title": "ICC rejects new US sanctions on judges, deputy prosecutors",
      "news_link": "https://www.aa.com.tr/en/americas/icc-rejects-new-us-sanctions-on-judges-deputy-prosecutors/3664910",
      "bias": "Right",
      "text": "ICC rejects new US sanctions on judges, deputy prosecutors\nCourt calls measures 'flagrant attack' on judicial independence, international order\nGENEVA\nThe International Criminal Court (ICC) on Wednesday strongly rejected new US sanctions targeting four of its judges and deputy prosecutors, calling the measures an assault on judicial independence and the rules-based international order.\n\"The International Criminal Court deplores the announcement of new designations for sanctions by the US administration against ICC Judges Kimberly Prost (Canada), Judge Nicolas Guillou (France), Deputy Prosecutor Nazhat Shameem Khan (Fiji) and Deputy Prosecutor Mame Mandiaye Niang (Senegal),” the court said in a statement.\nThe additional designations follow the earlier designation of four other judges and the ICC prosecutor.\n\"These sanctions are a flagrant attack against the independence of an impartial judicial institution which operates under the mandate from 125 States Parties from all regions. They constitute also an affront against the Court’s States Parties, the rules-based international order and, above all, millions of innocent victims across the world,\" it added.\nThe ICC stressed that it will continue fulfilling its mandate in strict accordance with its legal framework as adopted by the states parties and \"without regard to any restriction, pressure or threat.\"\nIt further urged governments to back the court’s mission, saying: \"The Court calls upon States Parties and all those who share the values of humanity and the rule of law to provide firm and consistent support to the Court and its work carried out in the sole interest of victims of international crimes.\"\nThe US sanctioned four ICC officials on Wednesday, including a judge who authorized the arrest warrants for Israeli Prime Minister Benjamin Netanyahu and former Defense Minister Yoav Gallant.\nIsrael has killed more than 62,000 Palestinians in Gaza since October 2023, devastating the enclave, which faces famine. Israel also faces a genocide case at the International Court of Justice for its war on the enclave.\nAnadolu Agency website contains only a portion of the news stories offered to subscribers in the AA News Broadcasting System (HAS), and in summarized form. Please contact us for subscription options."
    },
    {
      "news_title": "US imposes further sanctions on ICC judges and prosecutors",
      "news_link": "https://www.iol.co.za/news/world/us-imposes-further-sanctions-on-icc-judges-and-prosecutors-ad5d6979-ee9f-472c-9454-8a1c7efcf5c7",
      "bias": "Center",
      "text": null
    },
    {
      "news_title": "Four more World Court officials hit with US sanctions",
      "news_link": "https://www.businesslive.co.za/bd/world/americas/2025-08-20-four-more-world-court-officials-hit-with-us-sanctions/",
      "bias": "Lean Right",
      "text": "Four more World Court officials hit with US sanctions\nWashington puts pressure on two judges and two prosecutors at the International Criminal Court\n20 August 2025 - 17:59\nUPDATED 20 August 2025 - 20:19\nbyHumeyra Pamuk\nSupport our award-winning journalism. The Premium package (digital only) is R30 for the first month and thereafter you pay R129 p/m now ad-free for all subscribers.\nThe International Criminal Court in The Hague, the Netherlands, March 12 2025. Picture: WOLFGANG RATTAY/REUTERS\nWashington — President Donald Trump’s administration on Wednesday imposed sanctions on two judges and two prosecutors at the International Criminal Court (ICC), as Washington kept up its pressure on the war tribunal over its targeting of Israeli leaders.\nWashington designated Nicolas Yann Guillou of France, Nazhat Shameem Khan of Fiji, Mame Mandiaye Niang of Senegal and Kimberley Prost of Canada, according to the US treasury and state department.\nIn a statement, US secretary of state Marco Rubio called the court “a national security threat that has been an instrument for lawfare” against the US and Israel.\n“United States has been clear and steadfast in our opposition to the ICC’s politicisation, abuse of power, disregard for our national sovereignty, and illegitimate judicial overreach”, Rubio said.\nThe ICC said on Wednesday it deplored the move. “These sanctions are a flagrant attack against the independence of an impartial judicial institution which operates under the mandate from 125 states parties from all regions. They constitute also an affront against the court’s states parties, the rules-based international order and, above all, millions of innocent victims across the world. The ICC will continue fulfilling mandates in strict accordance with its legal framework, without regard to any pressure or threat,” its statement said.\nICC judges issued arrest warrants for Israeli Prime Minister Benjamin Netanyahu, former Israeli defence chief Yoav Gallant and Hamas leader Ibrahim al-Masri last November for alleged war crimes and crimes against humanity during the Gaza conflict.\nGuillou is an ICC judge who presided over a pretrial panel that issued the arrest warrant for Netanyahu. Khan and Niang are the court’s two deputy prosecutors.\nThe move comes less than three months after the administration took the unprecedented step of slapping sanctions on four separate ICC judges, saying they have engaged in ICC’s “illegitimate and baseless actions” targeting the US and close ally Israel.\nThe ICC, which had slammed the move in June, describing it as an attempt to undermine the independence of the judicial institution, did not immediately respond to a request for comment.\nThe new sanctions represent a serious escalation that will likely impede the functioning of the court and the prosecutor's office as they deal with major cases, including war crime allegations against Russia over its invasion of Ukraine.\nIn March 2020, prosecutors opened an investigation in Afghanistan that included looking into possible crimes by US troops, but since 2021, it has deprioritised the role of the US and focused on alleged crimes committed by the Afghan government and the Taliban forces.\nThe ICC, which was established in 2002, has international jurisdiction to prosecute genocide, crimes against humanity and war crimes in member states or if a situation is referred by the UN Security Council.\nThough the ICC has jurisdiction over war crimes, crimes against humanity, and genocide in its 125 member countries, some nations, including the US, China, Russia, and Israel, do not recognise its authority. I\nIt has high-profile war crimes investigations under way into the Israel-Hamas conflict and Russia’s war in Ukraine, as well as in Sudan, Myanmar, the Philippines, and Venezuela.\nThe sanctions freeze any US assets the individuals may have and essentially cut them off from the US financial system.\nNetanyahu’s office issued a statement welcoming the US sanctions.\nThe Trump administration’s dislike of the court goes back to his first term. In 2020, Washington imposed sanctions on then-prosecutor Fatou Bensouda and one of her top aides over the courts work on Afghanistan.\nUpdate: August 20 2025 This story has more reaction and background information.\nSupport our award-winning journalism. The Premium package (digital only) is R30 for the first month and thereafter you pay R129 p/m now ad-free for all subscribers.\nFour more World Court officials hit with US sanctions\nWashington puts pressure on two judges and two prosecutors at the International Criminal Court\nWashington — President Donald Trump’s administration on Wednesday imposed sanctions on two judges and two prosecutors at the International Criminal Court (ICC), as Washington kept up its pressure on the war tribunal over its targeting of Israeli leaders.\nWashington designated Nicolas Yann Guillou of France, Nazhat Shameem Khan of Fiji, Mame Mandiaye Niang of Senegal and Kimberley Prost of Canada, according to the US treasury and state department.\nIn a statement, US secretary of state Marco Rubio called the court “a national security threat that has been an instrument for lawfare” against the US and Israel.\n“United States has been clear and steadfast in our opposition to the ICC’s politicisation, abuse of power, disregard for our national sovereignty, and illegitimate judicial overreach”, Rubio said.\nThe ICC said on Wednesday it deplored the move. “These sanctions are a flagrant attack against the independence of an impartial judicial institution which operates under the mandate from 125 states parties from all regions. They constitute also an affront against the court’s states parties, the rules-based international order and, above all, millions of innocent victims across the world. The ICC will continue fulfilling mandates in strict accordance with its legal framework, without regard to any pressure or threat,” its statement said.\nICC judges issued arrest warrants for Israeli Prime Minister Benjamin Netanyahu, former Israeli defence chief Yoav Gallant and Hamas leader Ibrahim al-Masri last November for alleged war crimes and crimes against humanity during the Gaza conflict.\nGuillou is an ICC judge who presided over a pretrial panel that issued the arrest warrant for Netanyahu. Khan and Niang are the court’s two deputy prosecutors.\nThe move comes less than three months after the administration took the unprecedented step of slapping sanctions on four separate ICC judges, saying they have engaged in ICC’s “illegitimate and baseless actions” targeting the US and close ally Israel.\nThe ICC, which had slammed the move in June, describing it as an attempt to undermine the independence of the judicial institution, did not immediately respond to a request for comment.\nThe new sanctions represent a serious escalation that will likely impede the functioning of the court and the prosecutor's office as they deal with major cases, including war crime allegations against Russia over its invasion of Ukraine.\nIn March 2020, prosecutors opened an investigation in Afghanistan that included looking into possible crimes by US troops, but since 2021, it has deprioritised the role of the US and focused on alleged crimes committed by the Afghan government and the Taliban forces.\nThe ICC, which was established in 2002, has international jurisdiction to prosecute genocide, crimes against humanity and war crimes in member states or if a situation is referred by the UN Security Council.\nThough the ICC has jurisdiction over war crimes, crimes against humanity, and genocide in its 125 member countries, some nations, including the US, China, Russia, and Israel, do not recognise its authority. I\nIt has high-profile war crimes investigations under way into the Israel-Hamas conflict and Russia’s war in Ukraine, as well as in Sudan, Myanmar, the Philippines, and Venezuela.\nThe sanctions freeze any US assets the individuals may have and essentially cut them off from the US financial system.\nNetanyahu’s office issued a statement welcoming the US sanctions.\nThe Trump administration’s dislike of the court goes back to his first term. In 2020, Washington imposed sanctions on then-prosecutor Fatou Bensouda and one of her top aides over the courts work on Afghanistan.\nUpdate: August 20 2025\nThis story has more reaction and background information.\nReuters\nNetanyahu heads to Hungary, defying ICC arrest warrant\nTrump punishes people involved in ICC probes of US citizens and allies\nICC’s governing body concerned by US sanction moves\nSA grants diplomatic immunity to ICC staff\nWould you like to comment on this article?\nSign up (it's quick and free) or sign in now.\nPlease read our Comment Policy before commenting.\nMost Read\nPublished by Arena Holdings and distributed with the Financial Mail on the last Thursday of every month except December and January."
    },
    {
      "news_title": "U.S. sanctions more ICC judges, prosecutors for probes into alleged American, Israeli war crimes",
      "news_link": "https://www.tribdem.com/news/u-s-sanctions-more-icc-judges-prosecutors-for-probes-into-alleged-american-israeli-war-crimes/article_ed41aa21-986f-510c-b75a-aa19e44a0f19.html",
      "bias": "Lean Left",
      "text": "WASHINGTON – The Trump administration is ramping up pressure on the International Criminal Court for pursuing investigations into U.S. and Israeli officials for alleged war crimes.\nThe State Department on Wednesday announced new sanctions on four ICC officials , including two judges and two prosecutors, saying they had been instrumental in efforts to prosecute Americans and Israelis. As a result of the sanctions, any assets that the targets hold in U.S. jurisdictions are frozen.\n×\nJavascript is required for you to be able to read premium content. Please enable it in your browser settings.\nkAm%96 D2?4E:@?D H6C6 :>>65:2E6=J 56?@F?465 3J 3@E9 E96 xrr 2?5 E96 &?:E65 }2E:@?D[ H9:=6 xDC26= H6=4@>65 E96 >@G6 2??@F?465 3J $64C6E2CJ @7 $E2E6 |2C4@ #F3:@]k^Am\nkAmxE :D ;FDE E96 =2E6DE :? 2 D6C:6D @7 DE6AD E96 %CF>A 25>:?:DEC2E:@? 92D E2<6? 282:?DE %96 w28F6\\32D65 4@FCE[ E96 H@C=5’D 7:CDE :?E6C?2E:@?2= H2C 4C:>6D EC:3F?2=] %96 &]$][ H9:49 :D ?@E 2 >6>36C @7 E96 4@FCE[ 92D 2=C625J :>A@D65 A6?2=E:6D @? E96 xrr’D 7@C>6C k2 9C67lQ9EEADi^^2A?6HD]4@>^2CE:4=6^ECF>A\\:?E6C?2E:@?2=\\4C:>:?2=\\4@FCE\\D2?4E:@?D\\F?\\c2ffaah6c6245agg5e574bb`3h7d`64dQm49:67 AC@D64FE@C[ z2C:> z92?k^2m[ H9@ k2 9C67lQ9EEADi^^2A?6HD]4@>^2CE:4=6^F?\\:44\\AC@D64FE@C\\<92?\\D6IF2=\\>:D4@?5F4E\\5gae6eh2373652467a3af_776c`_e`_5QmDE6AA65 2D:56 :? |2Jk^2m A6?5:?8 2? :?G6DE:82E:@? :?E@ 2==682E:@?D @7 D6IF2= >:D4@?5F4E[ 2?5 7@FC @E96C EC:3F?2= ;F586D]k^Am\nkAm%96 ?6H A6?2=E:6D E2C86E xrr ;F586D z:>36C=J !C@FDE @7 r2?252 2?5 }:4@=2D vF:==@F @7 uC2?46 2?5 AC@D64FE@CD }2K92E $92>66> z92? @7 u:;: 2?5 |2>6 |2?5:2J6 }:2?8 @7 $6?682=]k^Am\nkAm“%96D6 :?5:G:5F2=D 2C6 7@C6:8? A6CD@?D H9@ 5:C64E=J 6?82865 :? 677@CED 3J E96 x?E6C?2E:@?2= rC:>:?2= r@FCE E@ :?G6DE:82E6[ 2CC6DE[ 56E2:?[ @C AC@D64FE6 ?2E:@?2=D @7 E96 &?:E65 $E2E6D @C xDC26=[ H:E9@FE E96 4@?D6?E @7 6:E96C ?2E:@?[” #F3:@ D2:5]k^Am\nkAmw6 25565 E92E E96 25>:?:DEC2E:@? H@F=5 4@?E:?F6 “E@ E2<6 H92E6G6C 24E:@?D H6 566> ?646DD2CJ E@ AC@E64E @FC EC@@AD[ @FC D@G6C6:8?EJ[ 2?5 @FC 2==:6D 7C@> E96 xrr’D :==68:E:>2E6 2?5 32D6=6DD 24E:@?D]”k^Am\nkAmx? 2 D6A2C2E6 DE2E6>6?E[ E96 $E2E6 s6A2CE>6?E D2:5 !C@DE H2D 9:E 7@C 2 CF=:?8 E@ 2FE9@C:K6 2? xrr :?G6DE:82E:@? :?E@ &]$] A6CD@??6= :? p7892?:DE2?[ H9:49 H2D =2E6C 5C@AA65] vF:==@F H2D D2?4E:@?65 7@C CF=:?8 E@ 2FE9@C:K6 E96 xrr’D :DDF2?46 @7 k2 9C67lQ9EEADi^^2A?6HD]4@>^2CE:4=6^:44\\:DC26=\\92>2D\\H2CC2?ED\\?6E2?J29F\\A2=6DE:?:2?\\2CC6DE\\fb4gdc5_fa6_2`2c`3`h3a43a455_f72Qm2CC6DE H2CC2?ED 7@C xDC26=: !C:>6 |:?:DE6C q6?;2>:? }6E2?J29Fk^2m 2?5 7@C>6C |:?:DE6C @7 s676?D6 *@2G v2==2?E C6=2E65 E@ k2 9C67lQ9EEADi^^2A?6HD]4@>^9F3^:DC26=\\92>2D\\H2CQmxDC26=’D H2C 282:?DE w2>2Dk^2m :? v2K2]k^Am\nkAm}2K92E $92>66> z92? 2?5 }:2?8 H6C6 A6?2=:K65 7@C 4@?E:?F:?8 z2C:> z92?’D :?G6DE:82E:@? :?E@ xDC26=’D 24E:@?D :? v2K2[ :?4=F5:?8 FA9@=5:?8 E96 xrr’D 2CC6DE H2CC2?ED 7@C }6E2?J29F 2?5 v2==2?E[ 244@C5:?8 E@ E96 DE2E6>6?E]k^Am\nkAmx? C6DA@?D6[ E96 xrr :DDF65 2 DE2E6>6?E 42==:?8 E96 D2?4E:@?D “2 7=28C2?E 2EE24< 282:?DE E96 :?56A6?56?46 @7 2? :>A2CE:2= ;F5:4:2= :?DE:EFE:@?” 2?5 “2? 277C@?E 282:?DE E96 r@FCE’D DE2E6D A2CE:6D[ E96 CF=6D\\32D65 :?E6C?2E:@?2= @C56C 2?5[ 23@G6 2==[ >:==:@?D @7 :??@46?E G:4E:>D 24C@DD E96 H@C=5]”k^Am\nkAm&]}] DA@<6D>2? $E6A92?6 sF;2CC:4 D2:5 E96 xrr 92D E96 7F== DFAA@CE @7 E96 H@C=5 3@5J E@ 42CCJ @FE :ED H@C<] %96 &]}] :D “G6CJ 4@?46C?65” 23@FE E96 &]$] 4@?E:?F:?8 E@ E2C86E E96 :?E6C?2E:@?2= 4@FCE[ 96 D2:5]k^Am\nkAm“(6 7:C>=J 36=:6G6 E92E E96 xrr :D 2 <6J A:==2C @7 :?E6C?2E:@?2= 4C:>:?2= ;FDE:46[ 2?5 H6 C6DA64E E96:C H@C<[” sF;2CC:4 D2:5] “%96 564:D:@? :>A@D6D D6G6C6 :>A65:>6?ED @? E96 7F?4E:@?:?8 @7 E96 @77:46 @7 E96 AC@D64FE@C :? C6DA64E 7@C 2== E96 D:EF2E:@?D E92E 2C6 4FCC6?E=J 367@C6 E96 4@FCE]”k^Am\nkAm}6E2?J29F H6=4@>65 E96 &]$] DE6A]k^Am\nkAm“%9:D :D 2 7:C> >62DFC6 282:?DE E96 >6?524:@FD D>62C 42>A2:8? 282:?DE E96 $E2E6 @7 xDC26= 2?5 E96 xsu[ 2?5 7@C ECFE9 2?5 ;FDE:46[” 96 D2:5 :? 2 DE2E6>6?E[ FD:?8 2? 24C@?J> 7@C E96 xDC26=: >:=:E2CJ]k^Am\nkAm(65?6D52J’D >@G6 42CC:6D @? 2 9:DE@CJ @7 %CF>A 25>:?:DEC2E:@? 24E:@?D 282:?DE E96 xrr 52E:?8 324< E@ 9:D 7:CDE E6C> :? @77:46]k^Am\nkAmsFC:?8 %CF>A’D 7:CDE E6C>[ E96 &]$] 9:E E96 xrr H:E9 D2?4E:@?D[ 3FE E9@D6 H6C6 C6D4:?565 3J !C6D:56?E y@6 q:56?’D 25>:?:DEC2E:@? :? 62C=J a_a`]k^Am\nk9C ^m\nkAmpDD@4:2E65 !C6DD HC:E6CD |:<6 r@C56C :? %96 w28F6 2?5 u2C?@FD9 p>:C: 2E E96 &?:E65 }2E:@?D 4@?EC:3FE65 E@ E9:D C6A@CE]k^Am\nCopyright 2025 The Associated Press. All rights reserved. This material may not be published, broadcast, rewritten or redistributed without permission.\nCommented\nSorry, there are no recent results for popular commented articles."
    },
    {
      "news_title": "US ramps up attack on international court over Israel",
      "news_link": "https://www.heraldpalladium.com/news/national/us-ramps-up-attack-on-international-court-over-israel/article_e5fbba9e-f8be-5964-b6de-46076bf0065c.html",
      "bias": "Lean Right",
      "text": "Country\nUnited States of America US Virgin Islands United States Minor Outlying Islands Canada Mexico, United Mexican States Bahamas, Commonwealth of the Cuba, Republic of Dominican Republic Haiti, Republic of Jamaica Afghanistan Albania, People's Socialist Republic of Algeria, People's Democratic Republic of American Samoa Andorra, Principality of Angola, Republic of Anguilla Antarctica (the territory South of 60 deg S) Antigua and Barbuda Argentina, Argentine Republic Armenia Aruba Australia, Commonwealth of Austria, Republic of Azerbaijan, Republic of Bahrain, Kingdom of Bangladesh, People's Republic of Barbados Belarus Belgium, Kingdom of Belize Benin, People's Republic of Bermuda Bhutan, Kingdom of Bolivia, Republic of Bosnia and Herzegovina Botswana, Republic of Bouvet Island (Bouvetoya) Brazil, Federative Republic of British Indian Ocean Territory (Chagos Archipelago) British Virgin Islands Brunei Darussalam Bulgaria, People's Republic of Burkina Faso Burundi, Republic of Cambodia, Kingdom of Cameroon, United Republic of Cape Verde, Republic of Cayman Islands Central African Republic Chad, Republic of Chile, Republic of China, People's Republic of Christmas Island Cocos (Keeling) Islands Colombia, Republic of Comoros, Union of the Congo, Democratic Republic of Congo, People's Republic of Cook Islands Costa Rica, Republic of Cote D'Ivoire, Ivory Coast, Republic of the Cyprus, Republic of Czech Republic Denmark, Kingdom of Djibouti, Republic of Dominica, Commonwealth of Ecuador, Republic of Egypt, Arab Republic of El Salvador, Republic of Equatorial Guinea, Republic of Eritrea Estonia Ethiopia Faeroe Islands Falkland Islands (Malvinas) Fiji, Republic of the Fiji Islands Finland, Republic of France, French Republic French Guiana French Polynesia French Southern Territories Gabon, Gabonese Republic Gambia, Republic of the Georgia Germany Ghana, Republic of Gibraltar Greece, Hellenic Republic Greenland Grenada Guadaloupe Guam Guatemala, Republic of Guinea, Revolutionary\nPeople's Rep'c of Guinea-Bissau, Republic of Guyana, Republic of Heard and McDonald Islands Holy See (Vatican City State) Honduras, Republic of Hong Kong, Special Administrative Region of China Hrvatska (Croatia) Hungary, Hungarian People's Republic Iceland, Republic of India, Republic of Indonesia, Republic of Iran, Islamic Republic of Iraq, Republic of Ireland Israel, State of Italy, Italian Republic Japan Jordan, Hashemite Kingdom of Kazakhstan, Republic of Kenya, Republic of Kiribati, Republic of Korea, Democratic People's Republic of Korea, Republic of Kuwait, State of Kyrgyz Republic Lao People's Democratic Republic Latvia Lebanon, Lebanese Republic Lesotho, Kingdom of Liberia, Republic of Libyan Arab Jamahiriya Liechtenstein, Principality of Lithuania Luxembourg, Grand Duchy of Macao, Special Administrative Region of China Macedonia, the former Yugoslav Republic of Madagascar, Republic of Malawi, Republic of Malaysia Maldives, Republic of Mali, Republic of Malta, Republic of Marshall Islands Martinique Mauritania, Islamic Republic of Mauritius Mayotte Micronesia, Federated States of Moldova, Republic of Monaco, Principality of Mongolia, Mongolian People's Republic Montserrat Morocco, Kingdom of Mozambique, People's Republic of Myanmar Namibia Nauru, Republic of Nepal, Kingdom of Netherlands Antilles Netherlands, Kingdom of the New Caledonia New Zealand Nicaragua, Republic of Niger, Republic of the Nigeria, Federal Republic of Niue, Republic of Norfolk Island Northern Mariana Islands Norway, Kingdom of Oman, Sultanate of Pakistan, Islamic Republic of Palau Palestinian Territory, Occupied Panama, Republic of Papua New Guinea Paraguay, Republic of Peru, Republic of Philippines, Republic of the Pitcairn Island Poland, Polish People's Republic Portugal, Portuguese Republic Puerto Rico Qatar, State of Reunion Romania, Socialist Republic of Russian Federation Rwanda, Rwandese Republic Samoa, Independent State of San Marino, Republic of Sao Tome and Principe, Democratic Republic of Saudi Arabia, Kingdom of Senegal, Republic of Serbia and Montenegro Seychelles, Republic of Sierra Leone, Republic of Singapore, Republic of Slovakia (Slovak Republic) Slovenia Solomon Islands Somalia, Somali Republic South Africa, Republic of South Georgia and the South Sandwich Islands Spain, Spanish State Sri Lanka, Democratic Socialist Republic of St. Helena St. Kitts and Nevis St. Lucia St. Pierre and Miquelon St. Vincent and the Grenadines Sudan, Democratic Republic of the Suriname, Republic of Svalbard & Jan Mayen Islands Swaziland, Kingdom of Sweden, Kingdom of Switzerland, Swiss Confederation Syrian Arab Republic Taiwan, Province of China Tajikistan Tanzania, United Republic of Thailand, Kingdom of Timor-Leste, Democratic Republic of Togo, Togolese Republic Tokelau (Tokelau Islands) Tonga, Kingdom of Trinidad and Tobago, Republic of Tunisia, Republic of Turkey, Republic of Turkmenistan Turks and Caicos Islands Tuvalu Uganda, Republic of Ukraine United Arab Emirates United Kingdom of Great Britain & N. Ireland Uruguay, Eastern Republic of Uzbekistan Vanuatu Venezuela, Bolivarian Republic of Viet Nam, Socialist Republic of Wallis and Futuna Islands Western Sahara Yemen Zambia, Republic of Zimbabwe"
    },
    {
      "news_title": "ICC condemns new US sanctions as France voices outrage",
      "news_link": "https://www.dailysabah.com/world/mid-east/icc-condemns-new-us-sanctions-as-france-voices-outrage",
      "bias": "Right",
      "text": "The International Criminal Court (ICC) on Wednesday denounced fresh U.S. sanctions imposed by President Donald Trump’s administration on four of its officials, including two judges who authorized arrest warrants for Israeli Prime Minister Benjamin Netanyahu and former Defense Minister Yoav Gallant over their war crimes in Gaza.\nCalling the measures “a flagrant attack against the independence of an impartial judicial institution,” the ICC said in a statement that the sanctions were an affront to the court’s 125 member states, the rules-based international order and “millions of innocent victims across the world.” The court vowed to continue fulfilling its mandate “without regard to any pressure or threat.”\nThe move drew swift condemnation from France, which said it had “learned with dismay” of the sanctions, including those targeting French Judge Nicolas Guillou. Paris urged Washington to withdraw all penalties imposed under the Feb. 6, 2025 presidential decree, stressing that they undermine judicial independence and constitute “an attack on the Court and all 125 States Parties to the Rome Statute.” France expressed solidarity with the sanctioned judges and reaffirmed its “unwavering support” for the ICC in its fight against impunity.\nU.S. Secretary of State Marco Rubio said the sanctions were aimed at judges Kimberly Prost of Canada and Nicolas Guillou of France, along with prosecutors Nazhat Shameem Khan of Fiji and Mame Mandiaye Niang of Senegal. Rubio accused the officials of attempting to prosecute Americans and Israelis “without the consent of either nation” and pledged further action to “protect our troops, our sovereignty, and our allies.”\nThe State Department said Prost was sanctioned for previously authorizing an investigation into U.S. personnel in Afghanistan, while Guillou was penalized for his ruling that authorized the ICC’s arrest warrants for Netanyahu and Gallant. Khan and Niang were targeted for continuing investigations into Israel’s assault on Gaza.\nIsrael’s war on Gaza, which began in October 2023, has killed more than 62,000 Palestinians, most of them women and children. The enclave has been devastated by continuous Israeli bombardment, blockade-induced famine, and the collapse of its health system. Israel is facing a genocide case at the International Court of Justice over its campaign in Gaza, which rights groups have repeatedly denounced as collective punishment and a violation of international law.\nThe U.S., which is not a member of the ICC, has long opposed the court’s efforts to hold American or Israeli officials accountable, dating back to sanctions during Trump’s first term that were later rescinded by President Joe Biden. The latest measures mark an escalation in Washington’s attempts to shield Israeli leaders from international justice as global pressure mounts over war crimes allegations."
    },
    {
      "news_title": "Exclusive-Brazil judge targeted by US sanctions confident of Trump reversal",
      "news_link": "https://gazette.com/news/us-world/exclusive-brazil-judge-targeted-by-us-sanctions-confident-of-trump-reversal/article_b60d11c4-4563-5494-a12e-2b62fd650114.html",
      "bias": "Center",
      "text": "By Brad Haynes and Ricardo Brito\nBRASILIA (Reuters) -The judge at the center of escalating tensions between Brazil and the United States told Reuters he is counting on a change of heart from President Donald Trump to unwind sanctions against him, which he said lack consensus within the U.S. government.\nBrazilian Supreme Court Justice Alexandre de Moraes has ratcheted up restraining orders against former President Jair Bolsonaro during his trial for an alleged 2022 coup plot. Trump demanded an end to the case that he calls a \"witch hunt\" as he slapped a 50% tariff on Brazilian goods and hit Moraes with financial sanctions that are putting Brazil's banks on edge.\nDespite fears of a spiraling crisis for bilateral relations, the judge expressed confidence in a late Tuesday interview at his Brasilia office that sanctions would be unwound against him via diplomatic channels or an eventual challenge in U.S. courts.\n\"A judicial challenge is possible and I have not yet found a U.S. or Brazilian lawyer or scholar who doubts the courts would overturn. But at this moment, I've chosen to wait. That's my choice. It's a diplomatic matter for the country,\" said Moraes.\nThe standoff with Trump is the highest-profile test yet for the 56-year-old jurist, whose bald visage and muscular frame have come to define the Brazilian high court he joined eight years ago. He has taken the lead on many of the court's most prominent cases, cowing Elon Musk in a showdown over his social media platform, sending hundreds of right-wing rioters in the capital to prison and barring Bolsonaro from running for office.\nNavigating the U.S. crackdown on his personal finances and bilateral trade with Brazil has done little to change his routine, he said, which includes boxing, martial arts and a new favorite book: Henry Kissinger's \"Leadership,\" the late U.S. diplomat's final volume on 20th century statecraft.\nMoraes said he trusts diplomacy will restore his standing in Washington. He said prosecutors blamed the current fallout on a campaign by allies of Bolsonaro, including the former president's lawmaker son Eduardo, who is in the U.S. and under investigation in Brazil for courting Trump's intervention in his father's case.\n\"Once the correct information has been passed along, as is being done now, and the documented information reaches the U.S. authorities, I believe it won't even require any legal action to reverse (the sanctions). I believe that the U.S. executive branch itself, the president, will reverse them,\" Moraes said.\nPressed on the reason for that confidence, Moraes said he was aware of internal divisions in the U.S. government that had slowed the sanctions and could still undermine them.\n\"There was reluctance in the State Department and great reluctance in the Treasury Department,\" he said, without elaborating or explaining how he received that information.\nA State Department official with knowledge of the matter told Reuters separately that the sanctions against Moraes had faced substantial pushback from career officials.\nThe actions against Moraes were \"completely, legally inappropriate,\" said the source on condition of anonymity, adding that officials from the Treasury's Office of Foreign Assets Control had initially said no but were overruled.\nA Treasury spokesperson said: \"The Treasury Department and Office of Foreign Assets Control, along with the entire Trump administration, is in lockstep that Alexandre de Moraes has engaged in serious human rights abuse. Rather than concocting a fantasy fiction, de Moraes should stop carrying out arbitrary detentions and politicized prosecutions.\"\nAsked about the sanctions against Moraes, the State Department cited comments from Deputy Secretary of State Christopher Landau on Wednesday reiterating criticism of the judge for alleged censorship of U.S. citizens and companies.\n\"The United States remains steadfast in its commitment to holding human rights abusers accountable through measures such as Global Magnitsky sanctions,\" said a State Department spokesperson.\nBrazil's courts could punish Brazilian financial institutions for seizing or blocking domestic assets in response to U.S. orders, Moraes also said in the interview.\n(Reporting by Brad Haynes and Ricardo Brito in BrasiliaAdditional reporting by Gabriel Stargardter and David LawderEditing by Rosalba O'Brien and Diane Craft)"
    },
    {
      "news_title": "Trump administration imposes new sanctions on four ICC judges, prosecutors",
      "news_link": "https://www.reuters.com/world/asia-pacific/trump-administration-imposes-new-sanctions-four-icc-judges-prosecutors-2025-08-20/",
      "bias": "Center",
      "text": null
    },
    {
      "news_title": "Trump administration sanctions Canadian judge who sits on International Criminal Court",
      "news_link": "https://www.cbc.ca/news/world/canadian-judge-icc-trump-1.7613704",
      "bias": "Lean Left",
      "text": null
    },
    {
      "news_title": "US expands sanctions targeting International Criminal Court",
      "news_link": "https://www.aljazeera.com/news/2025/8/20/us-expands-sanctions-targeting-international-criminal-court",
      "bias": "Lean Left",
      "text": "US expands sanctions targeting International Criminal Court\nUnited States expands attacks on International Criminal Court amid growing scrutiny over Israeli abuses in Gaza.\nThe United States has announced a new round of sanctions targeting members of the International Criminal Court, the latest instance of a pressure campaign against the court that previously issued arrest warrants for Israeli leaders over alleged war crimes in Gaza.\nIn a statement on Wednesday, US Secretary of State Marco Rubio said that two judges and two prosecutors were being added to a list of ICC members sanctioned by the administration of President Donald Trump.\nRecommended Stories\nlist of 3 itemsBelgium refers war crimes complaint against Israeli soldiers to ICC\nTrump administration sanctions International Criminal Court judges\n“The Court is a national security threat that has been an instrument for lawfare against the United States and our close ally Israel,” Rubio said in a statement.\nThe ICC previously issued arrest warrants for Israeli Prime Minister Benjamin Netanyahu and former Defence Minister Yoav Gallant for alleged war crimes and crimes against humanity.\nFollowing the US State Department announcement, the court on Wednesday denounced the expanded US sanctions as a “flagrant attack against the independence of an impartial judicial institution” and the victims of war crimes around the world and said it would continue its work “without regard to any restriction, pressure or threat”.\nNetanyahu, meanwhile, welcomed Rubio’s move as a “decisive act against a smear campaign of lies against the State of Israel”.\nThe new sanctions target Kimberly Prost of Canada, Nicolas Guillou of France, Nazhat Shameem Khan of Fiji and Mame Mandiaye Niang of Senegal.\nGuillou is an ICC judge who oversaw a pre-trial panel that issued the arrest warrant for Netanyahu, while Khan and Niang are the court’s two deputy prosecutors. The US Department of State cites the role all three played in issuing and upholding the Israeli arrest warrants.\nThe ICC is also probing possible war crimes by US forces in Afghanistan, although it said it will prioritise abuses by the Taliban and ISIL (ISIS) in that investigation after fierce US pushback.\nProst, according to the State Department announcement, is being sanctioned for “ruling to authorize the ICC’s investigation into US personnel in Afghanistan”.\nNeither the US nor Israel is a party to the ICC, but the court maintains it can issue arrest warrants for citizens of such countries because the places in which the alleged crimes took place are parties to the court.\nThe US has been a longtime critic of the ICC and has bristled at the prospect that its own officials could someday face prosecution for alleged war crimes, but under previous administrations had stopped short of extreme steps, such as sanctions.\nAn initial round of sanctions targeting several ICC officials by the Trump administration earlier this year met widespread condemnation and criticism that the US was undermining international law to protect a close ally. The US accused those officials of taking part in “illegitimate and baseless actions” against Israel and the US.\nTwo of the individuals sanctioned on Wednesday are from France and Canada, two countries among several that recently announced that they would recognise a Palestinian state in response to Israel’s abuses in Gaza and continuous efforts to seize lands in the occupied West Bank through the expulsion of Palestinian residents.\nBoth France and the United Nations said the judges’ work is crucial for international justice.\n“Their role is essential in the fight against impunity,” a statement from the French Foreign Ministry said.\nThe US sanctions undermine the foundation of international justice, UN spokesperson Stephane Dujarric said, adding: “The decision imposes severe impediments on the functioning of the office of the prosecutor.”"
    },
    {
      "news_title": "US sanctions more ICC judges, prosecutors for probes into alleged American, Israeli war crimes",
      "news_link": "https://www.capitalgazette.com/2025/08/20/trump-sanctions-icc/",
      "bias": "Center",
      "text": "By MATTHEW LEE, AP Diplomatic Writer\nWASHINGTON (AP) — The Trump administration is ramping up pressure on the International Criminal Court for pursuing investigations into U.S. and Israeli officials for alleged war crimes.\nThe State Department on Wednesday announced new sanctions on four ICC officials, including two judges and two prosecutors, saying they had been instrumental in efforts to prosecute Americans and Israelis. As a result of the sanctions, any assets that the targets hold in U.S. jurisdictions are frozen.\nThe sanctions were immediately denounced by both the ICC and the United Nations, while Israel welcomed the move announced by Secretary of State Marco Rubio.\nIt is just the latest in a series of steps the Trump administration has taken against The Hague-based court, the world’s first international war crimes tribunal. The U.S., which is not a member of the court, has already imposed penalties on the ICC’s former chief prosecutor, Karim Khan, who stepped aside in May pending an investigation into allegations of sexual misconduct, and four other tribunal judges.\nThe new penalties target ICC judges Kimberly Proust of Canada and Nicolas Guillou of France and prosecutors Nazhat Shameem Khan of Fiji and Mame Mandiaye Niang of Senegal.\n“These individuals are foreign persons who directly engaged in efforts by the International Criminal Court to investigate, arrest, detain, or prosecute nationals of the United States or Israel, without the consent of either nation,” Rubio said.\nHe added that the administration would continue “to take whatever actions we deem necessary to protect our troops, our sovereignty, and our allies from the ICC’s illegitimate and baseless actions.”\nIn a separate statement, the State Department said Prost was hit for a ruling to authorize an ICC investigation into U.S. personnel in Afghanistan, which was later dropped. Guillou was sanctioned for ruling to authorize the ICC’s issuance of arrest warrants for Israeli Prime Minister Benjamin Netanyahu and former Minister of Defense Yoav Gallant related to Israel’s war against Hamas in Gaza. Hamas has been designated as a terrorist organization by the United States, Canada and the European Union.\nNazhat Shameem Khan and Niang were penalized for continuing Karim Khan’s investigation into Israel’s actions in Gaza, including upholding the ICC’s arrest warrants for Netanyahu and Gallant, according to the statement.\nIn response, the ICC issued a statement calling the sanctions “a flagrant attack against the independence of an impartial judicial institution” and “an affront against the Court’s states parties, the rules-based international order and, above all, millions of innocent victims across the world.”\nU.N. spokesman Stephane Dujarric said the ICC has the full support of the world body to carry out its work. The U.N. is “very concerned” about the U.S. continuing to target the international court, he said.\n“We firmly believe that the ICC is a key pillar of international criminal justice, and we respect their work,” Dujarric said. “The decision imposes severe impediments on the functioning of the office of the prosecutor in respect for all the situations that are currently before the court.”\nNetanyahu welcomed the U.S. step.\n“This is a firm measure against the mendacious smear campaign against the State of Israel and the IDF, and for truth and justice,” he said in a statement, using an acronym for the Israeli military.\nWednesday’s move carries on a history of Trump administration actions against the ICC dating back to his first term in office.\nDuring Trump’s first term, the U.S. hit the ICC with sanctions, but those were rescinded by President Joe Biden’s administration in early 2021.\nAssociated Press writers Mike Corder in The Hague and Farnoush Amiri at the United Nations contributed to this report."
    },
    {
      "news_title": "Trump administration sanctions ICC officials for efforts to arrest Americans, Israelis",
      "news_link": "https://thehill.com/homenews/administration/5461738-icc-judges-targeted-sanctions/",
      "bias": "Center",
      "text": null
    },
    {
      "news_title": "US slaps fresh sanctions on four ICC officials, citing actions against 'close ally' Israel",
      "news_link": "https://www.thejournal.ie/us-fresh-sanctions-international-criminal-court-israel-netanyahu-6795008-Aug2025/",
      "bias": "Lean Left",
      "text": "Support from readers like you keeps The Journal open.\nYou are visiting us because we have something you value. Independent, unbiased news that tells the truth. Advertising revenue goes some way to support our mission, but this year it has not been enough.\nIf you've seen value in our reporting, please contribute what you can, so we can continue to produce accurate and meaningful journalism. For everyone who needs it.\nhave your say"
    },
    {
      "news_title": "Trump Administration Slaps New Sanctions on Four ICC Officials over Targeting of Israeli Officials",
      "news_link": "https://english.aawsat.com/world/5177312-trump-administration-slaps-new-sanctions-four-icc-officials-over-targeting-israeli",
      "bias": "Lean Right",
      "text": "President Donald Trump's administration on Wednesday imposed sanctions on two judges and two prosecutors at the International Criminal Court, as Washington kept up its pressure on the war tribunal over its targeting of Israeli leaders.\nWashington designated Nicolas Yann Guillou of France, Nazhat Shameem Khan of Fiji, Mame Mandiaye Niang of Senegal, and Kimberly Prost of Canada, according to the US Treasury and State Department.\nICC judges issued arrest warrants for Israeli Prime Minister Benjamin Netanyahu, former Israeli defense chief Yoav Gallant, and Hamas leader Ibrahim al-Masri last November for alleged war crimes and crimes against humanity during the Gaza conflict.\nGuillou is an ICC judge who presided over a pre-trial panel that issued the arrest warrant for Netanyahu. Khan and Niang are the court's two deputy prosecutors.\nThe move comes less than three months after the administration took the unprecedented step of slapping sanctions on four separate ICC judges, saying they have engaged in ICC's \"illegitimate and baseless actions\" targeting the US and close ally Israel.\nICC, which had slammed the move in June, describing it as an attempt to undermine the independence of the judicial institution, deplored the latest sanctions.\n\"These sanctions are a flagrant attack against the independence of an impartial judicial institution which operates under the mandate from 125 states parties from all regions,\" the ICC said in a statement.\n\"They constitute also an affront against the Court's States Parties, the rules-based international order and, above all, millions of innocent victims across the world,\" the court added. \"The ICC will continue fulfilling mandates in strict accordance with its legal framework, without regard to any pressure or threat.\"\nThe ICC, which was established in 2002, has international jurisdiction to prosecute genocide, crimes against humanity, and war crimes in member states or if a situation is referred by the UN Security Council. The United States, China, Russia, and Israel are not members.\nIt has high-profile war crimes investigations under way into the Israel-Hamas conflict and Russia's war in Ukraine, as well as in Sudan, Myanmar, the Philippines, Venezuela, and Afghanistan.\nThe sanctions freeze any US assets the individuals may have and essentially cut them off from the US financial system."
    },
    {
      "news_title": "Trump admin imposes sanctions on more International Criminal Court officials",
      "news_link": "https://www.cnn.com/2025/08/20/politics/trump-international-criminal-court-sanctions",
      "bias": "Lean Left",
      "text": "The Trump administration escalated its fight against the International Criminal Court by imposing sanctions on four more court officials involved in work related to alleged Israeli and US war crimes.\nIn a statement Wednesday, Secretary of State Marco Rubio said the State Department was designating Kimberly Prost of Canada, Nicolas Guillou of France, Nazhat Shameem Khan of Fiji and Mame Mandiaye Niang of Senegal for their work in the ICC “to investigate, arrest, detain, or prosecute nationals of the United States or Israel, without the consent of either nation.”\nThe sanctions were imposed under an executive order issued by President Donald Trump in February that authorizes punitive measures like sanctions and possible entrance bans on ICC personnel because of its “illegitimate and baseless actions targeting America and our close ally Israel.” The executive order was already used to sanction ICC chief prosecutor Karim Khan and four ICC judges.\nAccording to a State Department fact sheet, Prost, an ICC judge “is being designated for ruling to authorize the ICC’s investigation into U.S. personnel in Afghanistan.”\nGuillou, another judge, “is being designated for ruling to authorize the ICC’s issuance of arrest warrants for Israeli Prime Minister Benjamin Netanyahu and former Minister of Defense Yoav Gallant,” the fact sheet said.\n“Deputy Prosecutors Shameem Khan and Niang are being designated for continuing to support illegitimate ICC actions against Israel, including upholding the ICC’s arrest warrants targeting Prime Minister Netanyahu and former Defense Minister Gallant since they assumed leadership for the ICC’s Office of the Prosecutor,” it said.\nThe ICC slammed the Trump administration for issuing the sanctions, warning the decision amounts to a “flagrant attack” on the institution.\n“The International Criminal Court deplores the announcement of new designations for sanctions by the US administration,” the ICC said in a statement.\n“These sanctions are a flagrant attack against the independence of an impartial judicial institution,” the ICC added. “The Court stands firmly behind its personnel and victims of unimaginable atrocities.\n“The ICC will continue fulfilling its mandates, undeterred, in strict accordance with its legal framework as adopted by the States Parties and without regard to any restriction, pressure or threat.”\nThe ICC issued arrest warrants for Netanyahu and former Defense Minister Gallant in November 2024 for alleged war crimes and crimes against humanity.\nTrump also signed an executive order authorizing sanctions and visa restrictions for members of the court during his first term in 2020, months after the ICC authorized a probe into alleged war crimes committed in Afghanistan by US and Afghan forces as well as alleged war crimes and crimes against humanity committed by the Taliban.\nNetanyahu lauded the sanctions, calling the move a step towards “truth and justice.”\n“This is a firm measure against the mendacious smear campaign against the State of Israel and the IDF, and for truth and justice,” Netanyahu said in a statement on Wednesday.\nBut France urged the US to drop the sanctions as it reaffirmed its “unwavering support” for the judicial institution.\n“France calls on the United States to withdraw all sanctions,” France’s foreign ministry said in a statement. “France expresses its solidarity with the judges targeted by this decision and reaffirms its unwavering support for the ICC and its staff. Their role is essential in the fight against impunity.”\nThis story has been updated with additional details.\nCNN’s Tamar Michaelis, Sana Noor Haq and Pierre Bairin contributed reporting."
    },
    {
      "news_title": "Trump admin. sanctions four more ICC officials",
      "news_link": "https://www.israelnationalnews.com/news/413592",
      "bias": "Lean Right",
      "text": null
    },
    {
      "news_title": "US targets more ICC judges including over Israel",
      "news_link": "https://www.arabnews.com/node/2612454/world",
      "bias": "Lean Right",
      "text": "WASHINGTON: The United States on Wednesday imposed sanctions on four more International Criminal Court judges or prosecutors, including from allies France and Canada, in a new effort to hobble the tribunal particularly over actions against Israel.\n“The Court is a national security threat that has been an instrument for lawfare against the United States and our close ally Israel,” Secretary of State Marco Rubio said in a statement, using a term popular with President Donald Trump’s supporters.\nRubio said that the four people targeted from the tribunal based in The Hague had sought to investigate or prosecute nationals from the United States or Israel “without the consent of either nation.”\nThe four include Judge Nicolas Guillou of France, who is presiding over a case in which an arrest warrant was issued for Israeli Prime Minister Benjamin Netanyahu.\nThe case was brought forward by the State of Palestine, which is not recognized by Washington but, unlike Israel or the United States, has acceded to the statute that set up the tribunal in The Hague.\nGuillou, a veteran jurist, had worked for several years in the United States assisting the Justice Department with judicial cooperation during Barack Obama’s presidency.\nAlso targeted in the latest US sanctions was a Canadian judge, Kimberly Prost, who was involved in a case that authorized an investigation into alleged crimes committed during the war in Afghanistan, including by US forces.\nUnder the sanctions, the United States will bar entry of the ICC judges to the United States and block any property they have in the world’s largest economy — measures more often taken against US adversaries than individuals from close allies.\nRubio also slapped sanctions on two deputy prosecutors — Nazhat Shameem Khan of Fiji and Mame Mandiaye Niang of Senegal.\nThe State Department said the two were punished by the United States for supporting “illegitimate ICC actions against Israel,” including by supporting the arrest warrants against Netanyahu and former defense minister Yoav Gallant.\nThe Trump administration has roundly rejected the authority of the court, which is backed by almost all European democracies and was set up as a court of last resort when national systems do not allow for justice.\nTrump on Friday welcomed Russian President Vladimir Putin to Alaska even though Putin faces an ICC arrest warrant, a factor that has stopped him from traveling more widely since he ordered the invasion of Ukraine.\nRubio slapped sanctions on four other ICC judges in June.\nUS targets more ICC judges including over Israel\nhttps://arab.news/mcfdg\nUS targets more ICC judges including over Israel\n- Rubio said the four people targeted from the tribunal had sought to investigate or prosecute nationals from the US or Israel “without the consent of either nation”"
    },
    {
      "news_title": "U.S. sanctions four ICC officials, citing actions against U.S. personnel and Israel",
      "news_link": "https://www.i24news.tv/en/news/international/americas/artc-u-s-sanctions-four-icc-officials-citing-actions-against-u-s-personnel-and-israel",
      "bias": "Lean Right",
      "text": null
    },
    {
      "news_title": "Trump administration imposes sanctions on four more ICC officials, including Canadian judge",
      "news_link": "https://www.theglobeandmail.com/world/article-trump-administration-international-criminal-court-sanctions-israel/",
      "bias": "Center",
      "text": "The United States has issued new sanctions against senior officials with the International Criminal Court, including against a Canadian jurist, threatening to increase friction between Ottawa and Washington as trade talks continue.\nThe U.S. sanctioned two of the court’s deputy prosecutors as well as two judges, a French jurist and Kimberly Prost, a University of Manitoba graduate who spent nearly two decades with Justice Canada before moving overseas.\nU.S. Secretary of State Marco Rubio called the court “a national security threat that has been an instrument for lawfare against the United States and our close ally Israel.” The ICC has 125 member countries, including Canada – but not the U.S. or Israel.\nOpinion: Canada must come off the sidelines of international justice\nNearly 150 Canadians held in ICE custody this year, including two toddlers, data show\nMr. Rubio faulted Ms. Prost for ruling in favour of an investigation into U.S. personnel in Afghanistan. She was one of five judges who decided unanimously in 2020 to authorize an investigation into war crimes committed in Afghanistan by the Taliban, Afghan forces and members of the U.S. military and Central Intelligence Agency, which operated secret detention facilities.\nCanada has been a leading supporter of The Hague-based court, with Canadians occupying pivotal roles in the negotiations toward its establishment in 2002. Ottawa has also provided considerable financial backing. Ms. Prost is the second Canadian to serve as a judge on the ICC.\nThe Donald Trump administration has criticized the court for overstepping its bounds by issuing a war crimes arrest warrant for Israeli President Benjamin Netanyahu and investigating U.S. military conduct.\nThe new U.S. measures, which build on sanctions against four ICC judges in June, raise a raft of potential issues for those named as well as institutional issues for the court in dealings with financial institutions, companies and groups with American ties.\nMr. Trump also directed sanctions toward the court in his first term, but the scope of his actions this year goes well beyond what he has done previously, by sanctioning judges in addition to prosecutors.\nPresident Donald Trump's administration imposed sanctions on two judges and two prosecutors at the International Criminal Court, including a Canadian jurist.\nReuters\n“This is incredibly disturbing,” said Sara Ochs, a legal scholar at Elon University who has written on the U.S. relationship with the ICC.\nThose judges “were merely following their judicial obligations and authorizing investigations pursuant to guidelines set forth in the Court’s governing legislation,” she said.\n“To me, this clearly shows the administration’s position on international criminal justice, which is that the powerful should be able to avoid accountability for even the worst crimes.”\nIt also raises a new set of complications for Canadian leadership, which is in the midst of trade talks with a Trump administration that has shown a willingness to respond with economic punishment to non-trade issues.\nPrime Minister Mark Carney “is going to have to be pretty careful here in how he responds,” said John Boscariol, an international trade lawyer with McCarthy Tétrault. Any reaction will need to be weighed against how it “might impact ongoing negotiations for a trade deal.”\nThe International Criminal Court is a permanent judicial body tasked with investigating and prosecuting some of humanity’s worst conduct, but its lofty ideals have often clashed with the interests of individual countries, including those who are signatories to the Rome Statute that established the court.\nEarlier this year, Hungary said it would withdraw from the court, after its Prime Minister, Viktor Orban, declared that the arrest warrant against Mr. Netanyahu would have “no effect” on Hungarian soil. Last year, too, Mongolia ignored an ICC arrest warrant for Russian President Vladimir Putin stemming from the invasion of Ukraine.\nEarlier this year, Italy did the same, freeing a Libyan wanted for war crimes.\n“States’ compliance with the International Criminal Court is poor at best. This is not only the United States,” said Mark Drumbl, director of the Transnational Law Institute at Washington and Lee University.\nICC president says threats facing institution ‘jeopardize its very existence’\nThose working with the ICC, meanwhile, should not have been surprised that powerful countries would respond to the court’s actions, said Prof. Drumbl, who is Canadian.\n“You’re a high-profile institution targeting national leaders and accusing them of war crimes. You don’t think this is going to have blowback?” he said.\n“To be shocked that this happened strikes me as a little bit of pearl-clutching.”\nMr. Rubio, on Wednesday urged other countries to oppose the work of the court, which he called a “bankrupt institution.” U.S. allies should keep in mind that for many, their “freedom was purchased at the price of great American sacrifices,” he said.\nFrance, however, declared its “unwavering support” for the ICC, while the court itself decried what it called an affront to “the rules-based international order and, above all, millions of innocent victims across the world.”\nNeither Ms. Prost nor Global Affairs Canada responded to requests for comment.\nCanada already has in place the Foreign Extraterritorial Measures Act which allows the Attorney-General, in tandem with the Foreign Minister, to prohibit people in Canada from abiding by certain foreign sanctions. That law has been most commonly used with companies connected to Cuba, which has spent decades under a U.S. economic embargo but remains a Canadian trading partner.\nThe ICC sanctions “should be interpreted as a really hostile act” to all countries that support the court, said Jens Iverson, an assistant professor in international legal studies at Leiden University who knows Ms. Prost. They should be seen as the U.S. “abusing the power it happens to have because in the past it’s been viewed as a rule of law country,” he said.\n“The question is what friends of the court are going to do,” he added, and whether those countries “have other priorities than defending the rule of law, the court and their own nationals.”"
    },
    {
      "news_title": "Trump Administration Just Went Nuclear on International Criminal Court Officials for Targeting Americans",
      "news_link": "https://townhall.com/tipsheet/jeff-charles/2025/08/20/trump-administration-sanctions-icc-officials-for-trying-to-arrest-israelis-and-americans-n2662098",
      "bias": "Right",
      "text": "The Trump administration is imposing sanctions on four members of the International Criminal Court (ICC) for targeting Israelis and Americans for prosecution.\nThe ICC last year issued warrants for the arrest of Israeli Prime Minister Benjamin Netanyahu and other officials. Secretary of State Marco Rubio announced the sanctions in a post on X in which he explained that the ICC “continues to disregard national sovereignty and facilitate lawfare through efforts to investigate, arrest, detain, and prosecute American and Israeli nationals.”\n“We will continue to hold accountable those responsible for the ICC’s morally bankrupt and legally baseless actions against Americans and Israelis,” Rubio added.\nThe @IntlCrimCourt continues to disregard national sovereignty and facilitate lawfare through efforts to investigate, arrest, detain, and prosecute American and Israeli nationals. In response, I am sanctioning four additional ICC officials. We will continue to hold accountable…\n— Secretary Marco Rubio (@SecRubio) August 20, 2025\nThe sanctions target Judges Kimberly Prost and Nicolas Guillou—who authorized probes of U.S. personnel in Afghanistan and issued arrest warrants for Israeli leaders, according to a press release. Deputy Prosecutors Nazhat Shameem Khan and Mame Mandiaye Niang will also face sanctions for continuing to support ICC actions against Israel.\nThe State Department stated that sanctions are in line with an executive order that President Donald Trump issued back in February, opening the door for sanctions on members of the court. The order “aims to impose tangible and significant consequences on those directly engaged in the ICC’s transgression against the United States and Israel.”\nThe announcement stated that “all property and interests in property of the sanctioned persons described above that are in the United States or in possession or control of U.S. persons are blocked and must be reported to the Department of the Treasury’s Office of Foreign Assets Control (OFAC).”\n“The United States has been clear and steadfast in our opposition to the ICC’s politicization, abuse of power, disregard for our national sovereignty, and illegitimate judicial overreach,’ Rubio wrote in a press statement. “The Court is a national security threat that has been an instrument for lawfare against the United States and our close ally Israel.”\nRecommended\nTrump’s executive order was retaliation for the ICC’s efforts to target Netanyahu. It states that the court “has engaged in illegitimate and baseless actions targeting America and our close ally Israel.”\nThe ICC launched an investigation in 2020 into alleged war crimes in Afghanistan involving the US military and CIA personnel. The investigation, which is still active, centers on the treatment of detainees and CIA “black sites” in other countries.\nThe court has not publicly named individual Americans it is investigating. However, the investigation has raised eyebrows because they are looking into American citizens without the federal government’s consent. To ICC jurisdiction.\nEditor’s Note: Do you enjoy Townhall's conservative reporting that takes on the radical left and woke media? Support our work so that we can continue to bring you the truth.\nJoin Townhall VIP and use the promo code FIGHT to get 60% off your VIP membership!\nJoin the conversation as a VIP Member"
    },
    {
      "news_title": "US sanctions 4 ICC officials over Israel case",
      "news_link": "https://www.al-monitor.com/originals/2025/08/us-sanctions-4-icc-officials-over-israel-case",
      "bias": "Lean Left",
      "text": "US sanctions 4 ICC officials over Israel case\nSubscribe for less than $9/month to access this story and all Al-Monitor reporting.\nOR\nCreate an account for a 7-day trial to access this article and all of AL-Monitor.\nBy entering your email, you agree to receive ALM's daily newsletter and occasional marketing messages."
    },
    {
      "news_title": "Trump Administration Imposes New Sanctions on Four ICC Judges, Prosecutors",
      "news_link": "https://www.usnews.com/news/world/articles/2025-08-20/trump-administration-imposes-fresh-sanctions-on-four-icc-officials",
      "bias": "Lean Left",
      "text": null
    },
    {
      "news_title": "Trump slaps sanctions on Canadian International Criminal Court judge",
      "news_link": "https://www.winnipegfreepress.com/canada/2025/08/20/trump-slaps-sanctions-on-canadian-international-criminal-court-judge",
      "bias": "Center",
      "text": "Trump slaps sanctions on Canadian International Criminal Court judge\nAdvertisement\nRead this article for free:\nor\nAlready have an account? Log in here »\nTo continue reading, please subscribe:\nMonthly Digital Subscription\n$1 per week for 24 weeks*\n- Enjoy unlimited reading on winnipegfreepress.com\n- Read the E-Edition, our digital replica newspaper\n- Access News Break, our award-winning app\n- Play interactive puzzles\n*Billed as $4.00 plus GST every four weeks. After 24 weeks, price increases to the regular rate of $19.00 plus GST every four weeks. Offer available to new and qualified returning subscribers only. Cancel any time.\nMonthly Digital Subscription\n$4.75/week*\n- Enjoy unlimited reading on winnipegfreepress.com\n- Read the E-Edition, our digital replica newspaper\n- Access News Break, our award-winning app\n- Play interactive puzzles\n*Billed as $19 plus GST every four weeks. Cancel any time.\nTo continue reading, please subscribe:\nAdd Winnipeg Free Press access to your Brandon Sun subscription for only\n$1 for the first 4 weeks*\n*$1 will be added to your next bill. After your 4 weeks access is complete your rate will increase by $0.00 a X percent off the regular rate.\nRead unlimited articles for free today:\nor\nAlready have an account? Log in here »\nWASHINGTON – The Trump administration slapped sanctions on a Canadian judge on the International Criminal Court as the U.S. State Department continues to push back on the tribunal.\nThe State Department said Wednesday that Kimberly Prost was sanctioned for “ruling to authorize the ICC’s investigation into U.S. personnel in Afghanistan.”\nThe ICC website says Prost has been a judge in the trial division since 2018, following a two-year stint as Chef de Cabinet for the ICC president. Before joining the court, she was the first Ombudsperson for the United Nations Security Council Al Qaida Sanctions Committee.\nShe also worked for the Canadian Department of Justice for nearly two decades.\nThe State Department also took action against other ICC officials from France, Fiji and Senegal linked it to the tribunal’s investigation into Israel’s actions in Gaza and the West Bank.\nThe department said French judge Nicolas Guillou was sanctioned for ruling to authorize the ICC’s issuance of arrest warrants for Israeli Prime Minister Benjamin Netanyahu and former Minister of Defense Yoav Gallant. Deputy prosecutors Nazhat Shameem Khan and Mame Mandiaye Niang were sanctioned for upholding the arrest warrants.\nThe State Department has sanctioned a growing list of ICC officials with similar actions since U.S. President Donald Trump signed an executive order targeting the international tribunal in February. The sanctions freeze any assets the officials have in U.S. jurisdictions.\n“We will continue to hold accountable those responsible for the ICC’s morally bankrupt and legally baseless actions against Americans and Israelis,” Secretary of State Marco Rubio posted on social media.\nThe ICC condemned the latest actions of the Trump administration in a statement on its website. It called the sanctions a “flagrant attack against the independence of an impartial judicial institution.”\nNeither the U.S. nor Israel is a member of the international court. The State Department alleged it is a “a national security threat that has been an instrument for lawfare against the United States and our close ally Israel.”\n“The United States has been clear and steadfast in our opposition to the ICC’s politicization, abuse of power, disregard for our national sovereignty, and illegitimate judicial overreach,” the State Department said.\nTrump also targeted the ICC during his first administration over its probes into Israel and complaints over the war in Afghanistan. The first Trump administration took significant efforts to block preliminary investigations into the Afghanistan situation, which eventually paused the court’s probe.\nTrump and other Republicans have criticized the court saying it could lead to warrants for American politicians, diplomats and military personnel. They say the ICC has no jurisdiction over Israel or the United States.\nTrump’s initial sanctions on officials were rescinded by President Joe Biden in 2021 and the ICC resumed its investigation into Afghanistan the following year. The court in July issued warrants for two senior Taliban leaders as part of the investigation.\nThis report by The Canadian Press was first published Aug. 20, 2025."
    },
    {
      "news_title": "Trump Steps Up Conflict with International Criminal Court",
      "news_link": "https://havanatimes.org/news/trump-steps-up-conflict-with-international-criminal-court/",
      "bias": "unknown",
      "text": "Trump Steps Up Conflict with International Criminal Court\nHAVANA TIMES – The confrontation between the US government and the International Criminal Court (ICC) intensified in recent days, following Washington’s announcement of new sanctions against judges and prosecutors of the court for their participation in investigations involving the United States and Israel.\nOn August 20, US Secretary of State Marco Rubio announced measures against two of the court judges, Canadian Kimberly Prost and Frenchman Nicolas Guillou, as well as two deputy prosecutors, Nazhat Shameem Khan of Fiji, and Mame Mandiaye Niang of Senegal.\nAccording to Rubio’s office, the sanctions were imposed due to “their direct involvement in the ICC’s efforts to investigate, arrest, detain, or prosecute US or Israeli nationals without the consent of either nation.”\nThe sanctions mean that the judges face the freezing of any assets they may have in the United States and a ban on transactions, including the receipt of funds, from US citizens or entities.\nThe ICC responded with a strong statement condemning “a flagrant attack on the independence of an impartial judicial institution established by 125 member states from all regions.”\nThe court said that the sanctions not only constitute an attack on its judges, but also “an affront to the Court’s member states, the rules-based international order, and, above all, to the millions of innocent victims around the world.”\nWashington’s measures are part of the foreign policy being implemented by US President Donald Trump, highlighted by his strong support for the actions of Israeli Prime Minister Benjamin Netanyahu in the conflictive situation in the Middle East.\nThe judges sanctioned this week are involved in investigations into crimes allegedly committed by US military personnel in Afghanistan, while the sanctioned prosecutors have been involved in inquiries into Israel’s responsibilities during the ongoing conflict in the Palestinian territories.\nThe recent sanctions join those already imposed on four other ICC judges and on prosecutor, Karim Khan, who issued an international arrest warrant against Netanyahu in November 2024 for charges of war crimes and crimes against humanity in the Palestinian Gaza Strip.\nKhan has currently stepped back from his duties while awaiting the outcome of an administrative investigation into accusations of sexual misconduct towards an employee, allegations that the prosecutor denies.\nThe ICC was not intimidated by Washington’s actions, stating in its declaration that it “will continue to fulfill its mandate, undeterred, in strict compliance with its legal framework, as adopted by the member states, and without fear of any restriction, pressure, or threat.”\nThe text called on “governments that share the values of humanity and the rule of law” to provide “firm and constant support to the Court and its work, which is carried out exclusively for the benefit of victims of international crimes.”\nFrom Geneva, Switzerland, the United Nations High Commissioner for Human Rights, Volker Türk, insisted on Thursday, August 21: “the relentless escalation of reprisals by the United States against international institutions and their staff must cease.”\n“Sanctioning judges and prosecutors—whether they work at the national, regional, or international level—for fulfilling their mandates in accordance with international law constitutes an attack on the rule of law and undermines justice,” Türk asserted.\nHe also called for the complete withdrawal of sanctions against judges and prosecutors, as well as against Francesca Albanese, the UN Special Rapporteur on the situation in the occupied Palestinian territories, who was also sanctioned by Washington last month.\nThe ICC, created at the initiative of the UN General Assembly, has been in operation since 2002. It is governed by the Rome Statute, and has the mission of trying individuals accused of genocide, war, aggression, and crimes against humanity.\nAlthough 125 states are parties to the Rome Statute— including most of the Americas, Europe, Africa, and Oceania—countries including the United States, Russia, China, India, Israel, Cuba, and Iraq are not.\nFirst published in Spanish by IPS and translated and posted in English by Havana Times."
    },
    {
      "news_title": "UN rights chief decries ‘relentless intensification’ of US sanctions against International Criminal Court staff",
      "news_link": "https://news.un.org/en/story/2025/08/1165696",
      "bias": "unknown",
      "text": "UN rights chief decries ‘relentless intensification’ of US sanctions against International Criminal Court staff\nThe United States must stop ramping up sanctions against officials with the International Criminal Court (ICC), UN High Commissioner for Human Rights Volker Türk said on Thursday.\nHis call comes a day after four more Court personnel – two judges and two deputy prosecutors – were slapped with sanctions in connection with efforts to investigate alleged war crimes committed by the US and Israel.\nThis follows sanctions imposed earlier on four other judges and the ICC Prosecutor. Measures imposed could include blocking financial access to property or assets in the US, as well as travel bans.\n‘Assault on the rule of law’\n“The relentless intensification of US reprisals against international institutions and their personnel must stop,” said Mr. Türk.\n“Sanctioning judges and prosecutors at national, regional or international levels, for fulfilling their mandate in accordance with international law standards, is an assault on the rule of law and corrodes justice.”\nThe sanctions stem from an executive order signed by US President Donald Trump in February in response to the UN-backed Court issuing arrest warrants for Israeli Prime Minister Benjamin Netanyahu and former defense minister Yoav Gallant for alleged war crimes and crimes against humanity in Gaza.\nThe ICC is also probing war crimes allegedly committed in Afghanistan by all sides during years of conflict, including the US, following the allied invasion of the country in October 2001.\nNeither the US nor Israel are party to the Rome Statute, the treaty that established the ICC.\nIt’s time countries step up\nMr. Türk called for the withdrawal of the sanctions against the ICC personnel and those targeting the Special Rapporteur on the human rights situation in the Occupied Palestinian Territory.\nThe independent expert, Francesca Albanese, receives her mandate from the UN Human Rights Council in Geneva. For more details, read our story here.\n“In the meantime, I call on States to take immediate steps to protect all of them, including by taking measures to encourage corporations operating within their jurisdiction not to implement the sanctions against these individuals,” Mr. Türk said.\n“States need to step up to defend the institutions they have created to uphold and defend human rights and the rule of law. Those working to document, investigate and prosecute serious violations of international law should not have to work in fear.”\nAbout the International Criminal Court\nThe ICC investigates and tries individuals charged with genocide, war crimes, crimes against humanity and the crime of aggression. Read our explainer here.\nSome of the cases include situations in Sudan, the Democratic Republic of the Congo and Libya.\nIn March 2023, the Court issued an arrest warrant for Russian President Vladimir Putin in connection with alleged war crimes concerning the deportation and “illegal transfer” of children from occupied Ukraine.\nThe ICC was established in 2002 and is based in The Hague, in the Netherlands."
    },
    {
      "news_title": "Iran: US 'complicity in war crimes' in ICC sanctions",
      "news_link": "https://biztoc.com/x/0ce3fd2dbe61c05c",
      "bias": "unknown",
      "text": "Why is Keurig Dr Pepper buying JDE Peet’s?\nHow did Powell’s dovish tone boost the dollar?\nWhy was Evergrande delisted from Hong Kong?\nWhat risks does a US recession pose now?\nHow will Nvidia earnings impact the tech rally?\nWhy are US consumers with prime credit slipping on payments?\nWhat caused the recent bitcoin flash crash?\nIran: US 'complicity in war crimes' in ICC sanctions\nbreakingthenews.net/Article/Iran:-US-'complicity-in-war-crimes'-in-ICC-sanctions/64690232Iran's Foreign Ministry spokesman Esmaeil Baqaei strongly criticized Washington on Thursday after the United States imposed sanctions on four judges of the International Criminal Court (ICC). The targ...\nThis story appeared on breakingthenews.net, 2025-08-21 13:58:00."
    },
    {
      "news_title": "ICC case against Netanyahu and US: Trump Admin imposes sanctions on ICC officials",
      "news_link": "https://madhyamamonline.com/world/icc-case-against-netanyahu-and-us-trump-admin-imposes-sanctions-on-icc-officials-1439747",
      "bias": "unknown",
      "text": "ICC case against Netanyahu and US: Trump Admin imposes sanctions on ICC officials\ntext_fieldsThe Trump administration, which has been a staunch supporter of Israel in its ongoing war in Gaza whereupon the International Criminal Court had issued arrest warrants against Prime Minister Benjamin Netanyahu and far-right defence minister Yoav Gallant for war crimes, has imposed sanctions on senior ICC officials even though the United States is not a member of the court, and the move has drawn strong criticism from the ICC, the United Nations and governments including France.\nThe United States announced sanctions on four ICC officials, namely two judges and two prosecutors, accusing them of advancing investigations into American and Israeli nationals without the consent of their countries, and the penalties include the freezing of assets within US jurisdiction as well as restrictions on dealings with American entities, The Guardian reported.\nThe new targets of the measures are Canadian judge Kimberly Prost, French judge Nicolas Guillou, Fijian prosecutor Nazhat Shameem Khan and Senegalese prosecutor Mame Mandiaye Niang, who are all linked to authorising or pursuing cases related to alleged crimes in Afghanistan and Gaza.\nAccording to the State Department, Prost was penalised for authorising a probe into US conduct in Afghanistan that was later abandoned, while Guillou was targeted for supporting arrest warrants for Netanyahu and Gallant, and Khan together with Niang were sanctioned for pursuing investigations into Israel’s military actions in Gaza under the office of the prosecutor following Karim Khan’s departure.\nThe measures extend a long campaign by the Trump administration against the Hague-based tribunal, which had earlier seen sanctions placed on Karim Khan himself and several other judges before being lifted by the Biden administration in 2021.\nThe ICC denounced the move as an unprecedented assault on the independence of an impartial judicial body and said it represented a blow to the rights of victims worldwide, while the United Nations expressed deep concern and reiterated its support for the court as a key institution of international criminal justice.\nFrance reacted with dismay, declaring that the sanctions contradicted the fundamental principle of an independent judiciary, while Israel welcomed the American action as a defence against what it characterised as unfounded accusations against its military and leadership.\nHuman rights organisations also condemned the escalation, warning that the sanctions amounted to a blatant attempt to intimidate judicial officials and undermine the pursuit of accountability for atrocity crimes, and they urged the ICC’s 125 member states to defend the court’s autonomy against pressure from powerful non-member countries."
    },
    {
      "news_title": "US sanctions international court judges over prosecution of Israeli PM, Netanyahu",
      "news_link": "https://www.tvcnews.tv/us-sanctions-international-court-judges-over-prosecution-of-israeli-pm-netanyahu/",
      "bias": "unknown",
      "text": "The United States has increased its pressure on the International Criminal Court (ICC) over its prosecution of Israeli Prime Minister Benjamin Netanyahu, placing penalties on a French judge and others involved in the court’s investigations.\nUS Secretary of State Marco Rubio imposed sanctions on French Judge Nicolas Guillou, who is presided over a case in which the International Criminal Court has issued an arrest order for Netanyahu.\nKimberly Prost, a Canadian judge, was also sanctioned in a separate case involving alleged war crimes in Afghanistan.\nTwo deputy prosecutors, Nazhat Shameem Khan of Fiji and Mame Mandiaye Niang of Senegal, were also disciplined.\nRubio referred to the ICC as “a national security threat” and claimed it had become “an instrument for lawfare against the United States and our close ally Israel.” He criticized the court for examining US and Israeli people without the agreement of either government.\nFrance, whose President Emmanuel Macron had visited Washington two days before, voiced “dismay” at the measures. A foreign ministry official stated that the move was “in contradiction to the principle of an independent judiciary.”\nThe ICC described the sanctions as a “flagrant attack against the independence of an impartial judicial institution.”\nThe court has alleged that Netanyahu is responsible for war crimes and crimes against humanity in Israel’s offensive in Gaza, including by intentionally targeting civilians and using starvation as a method of war.\nRead Also\nIsrael launched its military campaign in response to a Hamas attack in which mostly civilians were killed.\nThe ICC has also sought the arrest of former Israeli Defence Minister Yoav Gallant and Hamas commander Mohammed Deif, who has since been confirmed killed by Israel.\nJudge Guillou has previously taken part in trials related to Kosovo and Lebanon.\nHe also worked for several years in the United States assisting the Justice Department with judicial cooperation during the Obama administration.\nUnder the US sanctions, Guillou will be barred from entering the United States and any assets he holds in the country will be blocked.\nThe Trump administration had also imposed sanctions on ICC officials and rejected the court’s authority. Rubio had earlier imposed sanctions on four other ICC judges in June.\nThe State Department said the two deputy prosecutors were sanctioned for supporting “illegitimate ICC actions against Israel,” including supporting the arrest warrants for Netanyahu and Gallant.\nJudge Prost of Canada was involved in a case that authorized an investigation into suspected crimes committed during the Afghan war, notably by US troops.\nThe United States, Russia, and Israel are not parties to the International Criminal Court. Trump recently welcomed Russian President Vladimir Putin to Alaska, despite an arrest order issued by the International Criminal Court for his role in the Ukraine invasion.\nFormer President Joe Biden’s administration has also resisted ICC action against Israel, eased previous restrictions, and permitted limited cooperation with the court, including the acquisition of evidence relating to Ukraine."
    },
    {
      "news_title": "United States Imposes Sanctions on Four International Criminal Court Officials - Khaama Press",
      "news_link": "https://www.khaama.com/united-states-imposes-sanctions-on-four-international-criminal-court-officials/",
      "bias": "unknown",
      "text": "The United States sanctioned four International Criminal Court officials, drawing condemnation from France and the UN, while Washington defended its move as protecting national sovereignty and allies.\nThe Trump administration has imposed sanctions on two judges and two prosecutors of the International Criminal Court (ICC), calling the body a “threat to national security” and an illegitimate tool against the U.S. and Israel.\nThe U.S. State and Treasury Departments said the sanctions target Nicolas Guillou (France), Nazhat Shameem Khan (Fiji), Mamé Mandiaye Niang (Senegal), and Kimberley Prost (Canada). Washington claims they were involved in cases related to American and Israeli conduct.\nFrance condemned the sanctions and urged their removal, while the UN described them as an “attack” on judicial independence that undermines international justice. Israel welcomed Washington’s move.\nThis marks the second round of U.S. sanctions on ICC officials in three months, escalating pressure after the court issued arrest warrants for Israeli leaders, Taliban figures, and Russian President Vladimir Putin over alleged war crimes.\nUnder the sanctions, the officials’ U.S. assets will be frozen and access to the American financial system blocked. Critics warn the move risks weakening global accountability at a time of rising conflicts."
    },
    {
      "news_title": "ICC rejects US sanctions, calls them an assault on Global justice",
      "news_link": "https://easternherald.com/2025/08/21/icc-slams-us-sanctions/",
      "bias": "unknown",
      "text": null
    },
    {
      "news_title": "U.S. sanctions four more members of ICC",
      "news_link": "https://www.independent.co.ug/u-s-sanctions-four-more-members-of-icc/",
      "bias": "unknown",
      "text": "WASHINGTON, the United States | TASS | The United States is imposing sanctions on four more representatives of the International Criminal Court (ICC), the US Department of State and Treasury said.\nAccording to US Secretary of State Marco Rubio, sanctions were imposed on Judges Kimberly Prost (Canada) and Nicolas Guillou (France), as well as deputy prosecutors Shamim Khan (Fiji) and Mam· Mandiaye Niang (Senegal) for their attempts to investigate the actions of US or Israeli citizens, arrest or detain them, and bring them to justice without the consent of the governments of these two countries.\nHe described the ICC as a bankrupt institution.\nThe current American administration, led by President Donald Trump, has already imposed sanctions on the ICC several times.\nTrump signed a decree imposing sanctions against ICC officials on February 6. The American government has accused the ICC of misconduct against Washington and its allies, such as Israel.\nFor instance, the United States believes that the court abused its powers by issuing unjustified arrest warrants for Israeli Prime Minister Benjamin Netanyahu and former Defense Minister Yoav Gallant. The decree allows for the application of financial and visa restrictions against the ICC employees involved in investigations against American citizens or their allies, as well as their family members.\n******\nSOURCE: TASS"
    },
    {
      "news_title": "US imposes new sanctions on four ICC judges, prosecutors",
      "news_link": "https://www.thedailystar.net/news/world/news/us-imposes-new-sanctions-four-icc-judges-prosecutors-3967456",
      "bias": "unknown",
      "text": "US imposes new sanctions on four ICC judges, prosecutors\nUS President Donald Trump's administration on Wednesday imposed sanctions on two judges and two prosecutors at the International Criminal Court, as Washington ramped up its pressure on the war tribunal over its targeting of Israeli leaders and a past decision to investigate US officials.\nIn a statement, US Secretary of State Marco Rubio called the court \"a national security threat that has been an instrument for lawfare\" against the United States and Israel.\nThe move drew ire from France and the United Nations. Paris urged Washington to withdraw the sanctions, while the ICC said it deplored the designations, calling them \"a flagrant attack\" against the independence of an impartial judicial institution.\nWashington designated Nicolas Yann Guillou of France, Nazhat Shameem Khan of Fiji, Mame Mandiaye Niang of Senegal, and Kimberly Prost of Canada, according to the US Treasury and State Department. All officials have been involved in cases linked to Israel and the United States.\n\"United States has been clear and steadfast in our opposition to the ICC's politicization, abuse of power, disregard for our national sovereignty, and illegitimate judicial overreach,\" Rubio said.\n\"I urge countries that still support the ICC, many of whose freedom was purchased at the price of great American sacrifices, to resist the claims of this bankrupt institution.\"\nThe second round of sanctions comes less than three months after the administration took the unprecedented step of slapping sanctions on four separate ICC judges. The escalation will likely impede the functioning of the court and the prosecutor's office as they deal with major cases, including war crime allegations against Russia over its invasion of Ukraine.\nICC judges issued arrest warrants for Israeli Prime Minister Benjamin Netanyahu, former Israeli defense chief Yoav Gallant, and Hamas leader Ibrahim al-Masri last November for alleged war crimes and crimes against humanity during the Gaza conflict.\nIn March 2020, prosecutors opened an investigation in Afghanistan that included looking into possible crimes by US troops, but since 2021, it has deprioritized the role of the US and focused on alleged crimes committed by the Afghan government and the Taliban forces.\nThe ICC, which was established in 2002, has international jurisdiction to prosecute genocide, crimes against humanity, and war crimes in member states or if a situation is referred by the U.N. Security Council.\nAlthough the ICC has jurisdiction over war crimes, crimes against humanity, and genocide in its 125 member countries, some nations, including the US, China, Russia, and Israel, do not recognise its authority.\nIt has high-profile war crimes investigations under way into the Israel-Hamas conflict, as well as in Sudan, Myanmar, the Philippines, and Venezuela.\nUNDERMINING INTERNATIONAL JUSTICE\nBoth France and the United Nations said the judges' work is crucial for international justice.\n\"Their role is essential in the fight against impunity,\" a statement from the French Foreign Ministry said.\nThe US sanctions undermine the foundation of international justice, U.N. spokesperson Stephane Dujarric said, adding: \"The (US) decision imposes severe impediments on the functioning of the office of the prosecutor.\"\nNetanyahu's office issued a statement welcoming the US sanctions.\nThe designations freeze any US assets the individuals may have and essentially cut them off from the US financial system.\nGuillou is an ICC judge who presided over a pre-trial panel that issued the arrest warrant for Netanyahu. Khan and Niang are the court's two deputy prosecutors.\nCanadian Judge Kimberly Prost served on an ICC appeals chamber that, in March 2020, unanimously authorized the ICC prosecutor to investigate alleged war crimes and crimes against humanity committed in Afghanistan since 2003, including examining the role of US service members.\nThe Trump administration's dislike of the court goes back to his first term. In 2020, Washington imposed sanctions on then-prosecutor Fatou Bensouda and one of her top aides over the court's work on Afghanistan.\nCountering Rubio's call to other countries to oppose the ICC, the court urged member states to stand in solidarity.\n\"The Court calls upon States Parties and all those who share the values of humanity and the rule of law to provide firm and consistent support to the Court and its work carried out in the sole interest of victims of international crimes,\" it said.\nComments"
    },
    {
      "news_title": "ICC 'deplores' new US sanctions on judges and prosecutors",
      "news_link": "https://upstract.com/x/69cbfa3fd20172d2?ref=rss",
      "bias": "unknown",
      "text": null
    },
    {
      "news_title": "International Criminal Court Condemns New US Sanctions on Its Officials - The Global Herald",
      "news_link": "https://theglobalherald.com/news/international-criminal-court-condemns-new-us-sanctions-on-its-officials/",
      "bias": "unknown",
      "text": "Table of Contents\nOverview of Recent Sanctions\nThe International Criminal Court (ICC) has publicly expressed its disapproval regarding a new set of sanctions imposed by the United States on its judges and prosecutors. This announcement from the ICC follows the U.S. State Department declaring sanctions on four ICC officials due to their involvement in prosecuting U.S. and Israeli nationals.\nDetails of the Sanctions\nOn Wednesday, the sanctions were revealed, targeting two judges and two prosecutors associated with the ICC. U.S. Secretary of State Marco Rubio described the ICC as a “national security threat” and an entity engaged in “lawfare” against the United States and Israel.\nReactions from International Leaders\nIsraeli Prime Minister Benjamin Netanyahu praised the sanctions, stating that they represent a decisive measure against what he termed a “mendacious smear campaign” against Israel. The ICC has issued arrest warrants for Netanyahu and his former defense minister Yoav Gallant regarding allegations of war crimes and crimes against humanity related to the ongoing conflict in Gaza.\nInternational Response\nIn a demonstration of solidarity with the ICC, France’s government expressed its concern regarding the sanctions, particularly since one of its judges, Nicolas Guillou, has been included in the sanctions list.\nThe other ICC officials targeted include Canadian judge Kimberly Prost and deputy prosecutors Nazhat Shameem Khan from Fiji and Mame Mandiaye Niang from Senegal. Rubio criticized the court for what he termed its “politicisation, abuse of power, and illegitimate judicial overreach” when announcing these sanctions.\nICC’s Reaction\nThe ICC characterized the sanctions as a “flagrant attack” on its independence and impartiality, highlighting their adverse impact on the global principles of justice and the fundamental rights of countless victims worldwide.\nAdditionally, the court emphasized that these actions contradict the frameworks of the established international order and called for a reconsideration of the sanctions. France’s foreign ministry similarly condemned the sanctions as contradicting the principle of an independent judiciary.\nUS Justification for the Sanctions\nThe U.S. rationale for sanctioning Guillou is rooted in his authorization of arrest warrants against Netanyahu and Gallant. Meanwhile, Secretary Rubio stated that Judge Prost was sanctioned for her involvement in an investigation concerning U.S. personnel in Afghanistan, insinuating that Khan and Niang had executed “illegitimate actions” regarding Israel.\nAs a result of these sanctions, the affected individuals will have any property and economic interests within U.S. jurisdiction blocked.\nPrevious Sanctions and Global Implications\nThis recent imposition of sanctions represents a continuation of previous U.S. actions, where similar penalties were levied against the ICC’s chief prosecutor and additional judges. The United Nations’ human rights chief had previously urged the U.S. to lift its sanctions, remarking that such actions undermine the rule of law.\nIn a related context, U.S. authorities have targeted UN Human Rights Council representative Francesca Albanese due to her criticisms of Israel, framing her association with the ICC as a justification for action against her.\nLooking Ahead\nWith international officials, including Albanese, pledging to uphold justice in light of the criticisms, the situation remains contentious and complex. The ICC, an institution that plays a crucial role in addressing crimes against humanity, continues to advocate for its mandate in a challenging geopolitical landscape."
    },
    {
      "news_title": "US slaps sanctions on ICC judges probing Netanyahu, France expresses dismay",
      "news_link": "https://www.newsroomodisha.com/us-slaps-sanctions-on-icc-judges-probing-netanyahu-france-expresses-dismay/",
      "bias": "unknown",
      "text": "Washington: The United States has widened its measures against the International Criminal Court (ICC) over its prosecution of Israeli Prime Minister Benjamin Netanyahu, announcing sanctions on a French judge and several others linked to the court’s investigations.\nUS Secretary of State Marco Rubio on Wednesday (local time) declared sanctions against Judge Nicolas Guillou of France, who is presiding over the case in which the ICC has issued an arrest warrant for Netanyahu.\nIn addition, Canadian judge Kimberly Prost was sanctioned in connection with a separate case involving alleged war crimes committed in Afghanistan.\nTwo deputy prosecutors, Nazhat Shameem Khan of Fiji and Mame Mandiaye Niang of Senegal, were also targeted under the new restrictions.\nFrance, whose President Emmanuel Macron had been in Washington just two days before the announcement, reacted sharply, saying it was “dismayed” by the move. A foreign ministry spokesman said the decision was “in contradiction to the principle of an independent judiciary.”\nThe ICC also denounced the sanctions, describing them as a “flagrant attack against the independence of an impartial judicial institution.”\nThe ICC has accused Netanyahu of war crimes and crimes against humanity during Israel’s military operations in Gaza.\nNetanyahu expressed gratitude to Rubio, thanking him for what he called a “decisive act against a smear campaign of lies against the State of Israel” and its military.\nThe ICC has also issued arrest warrants for former Israeli Defence Minister Yoav Gallant and Hamas commander Mohammed Deif, who has since been confirmed killed by Israel.\nJudge Guillou, who now faces US sanctions, has a long record of judicial service, having previously participated in trials connected to Kosovo and Lebanon.\nHe also worked in the United States for several years, assisting the Justice Department with judicial cooperation during the Obama administration.\nThe sanctions imposed by Washington will prevent him from entering the country and freeze any assets he may hold there.\nThe move mirrors actions taken under the Trump administration, which had previously imposed sanctions on ICC officials and dismissed the court’s authority.\nRubio had already sanctioned four other ICC judges earlier in June. The State Department explained that the two deputy prosecutors were penalised for backing “illegitimate ICC actions against Israel,” including their support for the arrest warrants against Netanyahu and Gallant.\nJudge Prost, the Canadian official now sanctioned, had been involved in a case authorising an ICC investigation into alleged crimes committed during the Afghanistan war, including by US forces.\nNeither the United States, Russia, nor Israel is a member of the ICC. The latest measures come against the backdrop of former President Donald Trump recently hosting Russian President Vladimir Putin in Alaska, despite the ICC’s outstanding arrest warrant against him for the invasion of Ukraine.\nThe administration of former President Joe Biden had also opposed ICC proceedings against Israel, though it lifted earlier sanctions and permitted limited cooperation with the court, including in investigations linked to Ukraine.\n–IANS\nComments are closed, but trackbacks and pingbacks are open."
    },
    {
      "news_title": "US sanctions on ICC staffers draw criticism from ICC, France",
      "news_link": "https://www.dailyfinland.fi/worldwide/44789/US-sanctions-on-ICC-staffers-draw-criticism-from-ICC-France",
      "bias": "unknown",
      "text": "US sanctions on ICC staffers draw criticism from ICC, France\nPublished : 21 Aug 2025, 02:54\nThe U.S. Department of State on Wednesday imposed sanctions on four individuals currently serving on the International Criminal Court (ICC) for having directly engaged in actions by the ICC to investigate, arrest, detain or prosecute U.S. and Israeli personnel with no consent from the two countries, reported Xinhua.\nTwo ICC judges were designated for authorizing the ICC's investigation into U.S. personnel in Afghanistan, and authorizing the ICC's issuance of arrest warrants for Israeli Prime Minister Benjamin Netanyahu and former Defense Minister Yoav Gallant. Two ICC deputy prosecutors were designated for continuing to support illegitimate ICC actions against Israel, including upholding the ICC's arrest warrants targeting Netanyahu and Gallant, according to the State Department.\n\"As a result of today's sanctions-related actions, all property and interests in property of the sanctioned persons described above that are in the United States or in possession or control of U.S. persons are blocked and must be reported to the Department of the Treasury's Office of Foreign Assets Control (OFAC),\" said the State Department.\nThe ICC responded Wednesday by stating that \"these sanctions are a flagrant attack against the independence of an impartial judicial institution which operates under the mandate from 125 States Parties from all regions. They constitute also an affront against the Court's States Parties, the rules-based international order and, above all, millions of innocent victims across the world.\"\nFrance, on the same day, expressed dismay at the U.S. decision in a statement. It once again expressed solidarity with the judges targeted and reaffirmed unwavering support for the ICC and its staff.\nThe United States has previous records of sanctioning ICC judges. On June 5, four ICC judges were sanctioned."
    },
    {
      "news_title": "ICC rejects new U.S. sanctions against four personnel",
      "news_link": "https://freedomonline.com.ng/icc-rejects-new-u-s-sanctions-against-four-personnel/",
      "bias": "unknown",
      "text": "The International Criminal Court (ICC) has strongly rejected new sanctions announced by the United States (U.S.) on Wednesday targeting four of its personnel, marking a renewed escalation related to investigations involving U.S. and Israeli officials.\nThe sanctions are directed at judges Kimberly Prost of Canada and Nicolas Guillou of France, as well as two deputy prosecutors: Nazhat Shameem Khan of Fiji and Mame Mandiaye Niang of Senegal.\nThese measures follow earlier sanctions against four other judges and the ICC Prosecutor.\nThe United Nations emphasised the ICC’s crucial role in international criminal justice and expressed concern over the imposition of further sanctions.\n“The decision imposes severe impediments on the functioning of the Office of the Prosecutor and respect for all situations currently before the Court,” UN Spokesman Stéphane Dujarric told journalists in New York.\n“Judicial independence is a fundamental principle that must be respected, and these types of measures undermine the foundation of international justice.”\nIn a statement announcing the new sanctions, U.S. Secretary of State Marco Rubio described the ICC as “a national security threat that has been an instrument for lawfare against the United States and our close ally, Israel.”\nThe UN-backed court condemned the sanctions as “a flagrant attack against the independence of an impartial judicial institution.”\nThey further stated that the sanctions “constitute an affront against the Court’s States Parties, the rules-based international order, and, above all, millions of innocent victims across the world.”\nThe ICC investigates the gravest crimes of concern to the international community: genocide, war crimes, crimes against humanity, and the crime of aggression.\nIt was established under the 1998 Rome Statute treaty, which came into force in 2002.\nNeither the United States nor Israel are among the 125 States Parties to the treaty.\nIn November 2024, the ICC issued arrest warrants for Israeli Prime Minister Benjamin Netanyahu and former Defence Minister Yoav Gallant, along with a former Hamas commander.\nThe warrants are connected to the conflict in Gaza and cite allegations of war crimes and crimes against humanity.\nThe Court is also probing alleged war crimes committed in Afghanistan by all sides during years of conflict, including the U.S., following the allied invasion in May 2003.\nThe ICC reiterated that it “stands firmly behind its personnel and victims of unimaginable atrocities.”\nIt added that it “will continue fulfilling its mandates, undeterred, in strict accordance with its legal framework as adopted by the States Parties and without regard to any restriction, pressure, or threat.”\nThe Court called upon “States Parties and all those who share the values of humanity and the rule of law to provide firm and consistent support to the Court and its work, carried out in the sole interest of victims of international crimes”."
    },
    {
      "news_title": "Brazilian Supreme Court Justice Confident US Sanctions Will Be Reversed",
      "news_link": "https://stratnewsglobal.com/south-america/brazilian-supreme-court-justice-confident-us-sanctions-will-be-reversed/",
      "bias": "unknown",
      "text": "The judge at the centre of growing tensions between Brazil and the United States said he is relying on President Donald Trump to reconsider and lift the sanctions imposed on him, arguing they lack full consensus within the U.S. government.\nBrazilian Supreme Court Justice Alexandre de Moraes has ratcheted up restraining orders against former President Jair Bolsonaro during his trial for an alleged 2022 coup plot. Trump demanded an end to the case that he calls a “witch hunt” as he slapped a 50% tariff on Brazilian goods and hit Moraes with financial sanctions that are putting Brazil’s banks on edge.\n‘Confident’ Judge To Wait\nDespite fears of a spiralling crisis for bilateral relations, the judge expressed confidence in a late Tuesday interview at his Brasilia office that sanctions would be unwound against him via diplomatic channels or an eventual challenge in U.S. courts.\n“A judicial challenge is possible, and I have not yet found a U.S. or Brazilian lawyer or scholar who doubts the courts would overturn. But at this moment, I’ve chosen to wait. That’s my choice. It’s a diplomatic matter for the country,” said Moraes.\nThe standoff with Trump is the highest-profile test yet for the 56-year-old jurist, whose bald visage and muscular frame have come to define the Brazilian high court he joined eight years ago. He has taken the lead on many of the court’s most prominent cases, cowing Elon Musk in a showdown over his social media platform, sending hundreds of right-wing rioters in the capital to prison and barring Bolsonaro from running for office.\nSanctions Fail To Deter\nNavigating the U.S. crackdown on his personal finances and bilateral trade with Brazil has done little to change his routine, he said, which includes boxing, martial arts and a new favourite book: Henry Kissinger’s “Leadership,” the late U.S. diplomat’s final volume on 20th-century statecraft.\nMoraes said he trusts diplomacy will restore his standing in Washington. He said prosecutors blamed the current fallout on a campaign by allies of Bolsonaro, including the former president’s lawmaker son Eduardo, who is in the U.S. and under investigation in Brazil for courting Trump’s intervention in his father’s case.\n“Once the correct information has been passed along, as is being done now, and the documented information reaches the U.S. authorities, I believe it won’t even require any legal action to reverse (the sanctions). I believe that the U.S. executive branch itself, the president, will reverse them,” Moraes said.\nInternal Divisions\nPressed on the reason for that confidence, Moraes said he was aware of internal divisions in the U.S. government that had slowed the sanctions and could still undermine them.\n“There was reluctance in the State Department and great reluctance in the Treasury Department,” he said, without elaborating or explaining how he received that information.\nA State Department official with knowledge of the matter told Reuters separately that the sanctions against Moraes had faced substantial pushback from career officials.\n‘Legally Inappropriate’\nThe actions against Moraes were “completely, legally inappropriate,” said the source on condition of anonymity, adding that officials from the Treasury’s Office of Foreign Assets Control had initially said no but were overruled.\nA Treasury spokesperson said: “The Treasury Department and Office of Foreign Assets Control, along with the entire Trump administration, are in lockstep that Alexandre de Moraes has engaged in serious human rights abuse. Rather than concocting a fantasy fiction, de Moraes should stop carrying out arbitrary detentions and politicised prosecutions.”\nThe U.S. State Department did not immediately respond to a request for comment.\nBrazilian courts could punish Brazilian financial institutions for seizing or blocking domestic assets in response to U.S. orders, Moraes also said in the interview.\n(With inputs from Reuters)"
    },
    {
      "news_title": "International Criminal Court blasts new US sanctions",
      "news_link": "https://news.rthk.hk/rthk/en/component/k2/1819101-20250821.htm",
      "bias": "unknown",
      "text": "The International Criminal Court on Wednesday denounced new US sanctions against two more of its judges and two prosecutors, calling them a \"flagrant attack\" on its independence.\nThe four include Judge Nicolas Guillou of France, who is presiding over a case in which an arrest warrant was issued for Israeli Prime Minister Benjamin Netanyahu.\nCanadian judge Kimberly Prost and deputy prosecutors Nazhat Shameem Khan of Fiji and Mame Mandiaye Niang of Senegal were also hit.\nProst was involved in a case that authorised an investigation into alleged crimes committed during the war in Afghanistan, including by US forces.\n\"These sanctions are a flagrant attack against the independence of an impartial judicial institution,\" the court said in a statement.\nThe ICC said it stood \"firmly behind its personnel and victims of unimaginable atrocities\".\nIt said it would \"continue fulfilling its mandates, undeterred\" and \"without regard to any restriction, pressure or threat\".\nFour other judges and the court's prosecutor had already been placed under sanctions. (AFP)"
    },
    {
      "news_title": "Foreign Minister Mark Rubio announces new sanctions against judges of the International Criminal Court - World Stock Market",
      "news_link": "https://www.worldstockmarket.net/foreign-minister-mark-rubio-announces-new-sanctions-against-judges-of-the-international-criminal-court/",
      "bias": "unknown",
      "text": "The United States today announced new sanctions against two judges – one French and one Canadian – as well as two prosecutors, the international criminal court, which has become the black sheep of the Trump government. These sanctions are added to the sanctions announced in early June, targeted by four other Judges of the ICC. And in February, the US imposed sanctions on IMF prosecutor Karim Khan. “Today, I call Kimberly Prote from Canada, Nicolas Giyu from France, Nazat Samim Khan from Fiji and Mam Madiage Nyang from Senegal” for “their direct participation in the efforts made by the ICC to conduct a search for the ICT to conduct Consent of one country or another, “Foreign Minister Marco Rubio said in a statement. All four judges have been involved in cases related to Israel and the US. The […]\nSource: News Beast\nWith 6 years of experience, I bring to the table captivating and informative writing in the world news category. My expertise covers a range of industries, including tourism, technology, forex and stocks. From brief social media posts to in-depth articles, I am dedicated to creating compelling content for various platforms."
    },
    {
      "news_title": "Trump administration imposes fresh sanctions on four ICC officials",
      "news_link": "https://www.arabobserver.com/trump-administration-imposes-fresh-sanctions-on-four-icc-officials/",
      "bias": "unknown",
      "text": "Trump administration imposes fresh sanctions on four ICC officials\nPresident Donald Trump’s administration on Wednesday imposed sanctions on two judges and two prosecutors at the International Criminal Court, as Washington kept up its pressure on the war tribunal over its targeting of Israeli leaders.\nWashington designated Nicolas Yann Guillou of France, Nazhat Shameem Khan of Fiji, Mame Mandiaye Niang of Senegal, and Kimberly Prost of Canada, according to the U.S. Treasury and State Department.\nICC judges issued arrest warrants for Israeli Prime Minister Benjamin Netanyahu, former Israeli defense chief Yoav Gallant, and Hamas leader Ibrahim al-Masri last November for alleged war crimes and crimes against humanity during the Gaza conflict.\nGuillou is an ICC judge who presided over a pre-trial panel that issued the arrest warrant for Netanyahu. Khan and Niang are the court’s two deputy prosecutors.\nThe move comes less than three months after the administration took the unprecedented step of slapping sanctions on four separate ICC judges, saying they have engaged in ICC’s “illegitimate and baseless actions” targeting the U.S. and close ally Israel.\nICC, which had slammed the move in June, describing it as an attempt to undermine the independence of the judicial institution, did not immediately respond to a request for comment.\nThe ICC, which was established in 2002, has international jurisdiction to prosecute genocide, crimes against humanity, and war crimes in member states or if a situation is referred by the U.N. Security Council. The United States, China, Russia, and Israel are not members.\nIt has high-profile war crimes investigations under way into the Israel-Hamas conflict and Russia’s war in Ukraine, as well as in Sudan, Myanmar, the Philippines, Venezuela, and Afghanistan.\nThe sanctions freeze any U.S. assets the individuals may have and essentially cut them off from the U.S. financial system."
    }
  ]
}