{
  "story_id": "GN_20250823_203745_c58371ae",
  "metadata": {
    "title": "Body cam footage shows Milwaukee judge denying she hid an immigrant wanted by ICE",
    "timestamp": "2025-08-23T20:37:45.198575",
    "url": "https://ground.news/article/body-cam-footage-shows-milwaukee-judge-denying-she-hid-an-immigrant-wanted-by-ice"
  },
  "bias_distribution": {
    "total_sources": "41",
    "leaning_left": "5",
    "center": "31",
    "leaning_right": "0"
  },
  "perspective_summaries": {
    "left": [
      "A Milwaukee judge, Dugan, stated, 'I didn’t do anything that they’re saying,' regarding allegations of obstructing federal agents.",
      "Dugan is accused of concealing an immigrant wanted by ICE while denying any wrongdoing.",
      "She has pleaded not guilty and aims to dismiss the charges against her.",
      "Dugan denied knowledge of Flores-Ruiz’s immigration status and did not hide him from federal agents."
    ],
    "center": [
      "Body cam footage shows Milwaukee judge Gwen Dugan denying she hid an immigrant, Eduardo Flores-Ruiz, wanted by ICE, from being arrested in her courtroom.",
      "Dugan told police she escorted Flores-Ruiz and his attorney out a side door typically used only by court staff, but she claims she did not know Flores-Ruiz's immigration status.",
      "Dugan has pleaded not guilty to charges that could result in up to six years in prison and a $350,000 fine if convicted for hindering prosecution."
    ],
    "right": [
      "Body cam footage shows Milwaukee judge Gwen Dugan denying she hid an immigrant, Eduardo Flores-Ruiz, wanted by ICE, from being arrested in her courtroom.",
      "Dugan told police she escorted Flores-Ruiz and his attorney out a side door typically used only by court staff, but she claims she did not know Flores-Ruiz's immigration status.",
      "Dugan has pleaded not guilty to charges that could result in up to six years in prison and a $350,000 fine if convicted for hindering prosecution."
    ]
  },
  "sources": [
    {
      "news_title": "Milwaukee judge denied hiding immigrant wanted by ICE in body camera recording",
      "news_link": "https://madison.com/news/state-regional/crime-courts/article_ebd4bf05-5f76-48d1-ac03-f21cdac36ad1.html",
      "bias": "Center",
      "text": null
    },
    {
      "news_title": "New bodycam video shows Milwaukee Judge Dugan denying accusations against her",
      "news_link": "https://cbs58.com/news/new-bodycam-video-shows-milwaukee-judge-dugan-denying-accusations-against-her",
      "bias": "Center",
      "text": "New bodycam video shows Milwaukee Judge Dugan denying accusations against her\nMILWAUKEE (CBS 58) -- New video has been released by the Milwaukee Police Department, showing Milwaukee County Circuit Judge Hannah Dugan denying allegations she helped a man who is in the country illegally evade U.S. immigration agents seeking to arrest him.\nOn April 22, before her arrest, Dugan called police to her home to investigate suspicious materials left at her home, and the homes of her sister and mother. New body camera video shows Dugan's interaction with responding officers, where she said the allegations against her are \"all lies.\"\nDugan called Milwaukee police to her home April 22 because someone had left threatening materials at her home.\nShe told them, \"What I'm worried about is the whackos that will believe this story which is not true,\" Dugan said. \"I'm not being investigated by the feds. The FBI was not there. ICE was there. I directed them down the hall to the administrative offices. What happened after that is their business. I did not hide this migrant in the jury room or in my chambers.\"\nNote: The Milwaukee Police Department has redacted parts of the video to not disclose information that could identify where Dugan lives.\nDocuments were also found at Dugan's sister's home and her mother's home. They had to do with religion and knives.\nWhile talking with police, Dugan soon discussed the courthouse incident that happened a few days earlier.\nShe told them, \"I did not hide this migrant in the jury room or my chambers.\"\nRicardo Flores-Ruiz was in Dugan's courtroom April 18, and federal authorities arrested him that day after they alleged Dugan helped him leave the courthouse.\nShe told the officers she wasn't involved. \"A couple taxpayers are mad 'I hid this guy in the jury room.' I didn't do anything they're saying.\"\nShe told the officers it's not uncommon to let people leave through the back door of her courtroom. \"I had him leave out the back door, which I do when the circumstances warrant it,\" she said, adding, \"And these are the circumstances that warrant it: I had a room of 30 people. And I just sent him out the door.\"\nDugan also claimed she did not know Flores Ruiz's immigration status. \"I don't know he's an illegal immigrant, which is what they're claiming. I'm not supposed to know that. When they come in front of me, I'm not supposed to know that.\"\nDugan was arrested a few days after the police interaction, on April 25.\nShe was indicted on federal charges in May, where she's pleaded not guilty."
    },
    {
      "news_title": "Hannah Dugan caught on body cam denying that she hid an immigrant wanted by ICE",
      "news_link": "https://spectrumnews1.com/wi/milwaukee/news/2025/08/22/hannah-dugan--milwaukee-judge--immigrant--ice--body-cam-footage",
      "bias": "Center",
      "text": "MILWAUKEE — A Milwaukee judge charged with obstructing a federal agency and concealing a wanted person who was in the country illegally told police days after the incident in her courtroom that “I didn't do anything that they're saying.”\nThe comments were captured on body camera footage by Milwaukee police inside Milwaukee County Circuit Judge Hannah Dugan's home three days before her arrest in April. Dugan told officers she was not aware of a criminal investigation into her conduct.\nDugan was indicted in May and faces charges of concealing an individual to prevent arrest, a misdemeanor, and obstruction, which is a felony. Prosecutors say she escorted Eduardo Flores-Ruiz, 31, and his lawyer out of her courtroom through a back door April 18 after learning that U.S. Immigration and Customs Enforcement agents had arrived to arrest him for being in the country without permanent legal status.\nFour days later, on April 22, Dugan called police to her house about a flyer from an anti-government group family members had received at their homes and workplaces.\nHer conversation with officers, as captured on their body cameras, was released Friday by police to The Associated Press.\nDugan told police that she didn't know the person in her courtroom that day was in the country illegally and she denied giving him special treatment.\n“It’s all lies,” Dugan told officers. She later said, “I didn’t do anything that they’re saying.”\nDugan has pleaded not guilty and is fighting to have the charges against her thrown out. The charges against her underscore a clash between President Donald Trump’s administration and local authorities over the Republican president’s sweeping immigration crackdown.\nDemocrats have accused the Trump administration of trying to make an example of Dugan to chill judicial opposition.\nDugan has not publicly commented on the allegations.\nShe told police that she didn’t know Flores-Ruiz’s immigration status.\n“I don’t know if he’s an illegal immigrant, which is what they’re claiming,” Dugan said. “I’m not supposed to know that. When they come in front of me, I’m not supposed to know that.”\nDugan denied hiding Flores-Ruiz, who federal agents came into her courtroom to arrest.\n“I did not hide this migrant in the jury room or in my chambers,” she said. \"I had him leave out the back door, which I do when the circumstances warrant it.”\nVideo from the hallway showed Flores-Ruiz and his attorney leaving through a side door about 12 feet (3.6 meters) from the main entrance.\nAccording to an FBI affidavit, witnesses heard Dugan say something to the effect of “wait, come with me” before ushering Flores-Ruiz and his attorney out through the door typically used only by deputies, jurors, court staff and in-custody defendants, the affidavit alleges.\nIn her motion to dismiss, Dugan argued that her conduct amounted to directing people’s movement in and around her courtroom and that she enjoys legal immunity for official acts she performs as a judge.\nDugan told Milwaukee police that she directed federal agents \"down the hall to the administrative offices. What happened after that is their business.”\nAgents arrested Flores-Ruiz outside the courthouse after a brief foot chase.\n“We live in very difficult times,” Dugan told the officers. “We all know that. Very difficult.”\nDugan's defense attorneys released a statement noting that her comments to police came before she was aware of the criminal investigation.\n“Her comments reinforced that she did nothing wrong in this matter and treated the misdemeanor case like any other in her courtroom,” her attorneys said in the statement.\nDugan could face up to six years in prison and a $350,000 fine if convicted on both counts."
    },
    {
      "news_title": "Bodycam video shows Judge Dugan deny allegations against her",
      "news_link": "https://www.wisn.com/article/bodycam-video-shows-judge-dugan-deny-allegations-against-her/65872495",
      "bias": "Center",
      "text": "Bodycam video shows Judge Dugan deny allegations against her\nDays before her federal arrest, bodycam footage shows Milwaukee Judge Hannah Dugan telling officers she followed standard procedures and denying allegations of misconduct in defendant's case\nDays before her federal arrest, bodycam footage shows Milwaukee Judge Hannah Dugan telling officers she followed standard procedures and denying allegations of misconduct in defendant's case\nDays before her federal arrest, bodycam footage shows Milwaukee Judge Hannah Dugan telling officers she followed standard procedures and denying allegations of misconduct in defendant's case\nDays after being accused of helping an immigrant lacking permanent legal status evade federal immigration officials, police body camera video shows Milwaukee County Circuit Court Judge Hannah Dugan denying the allegations against her.\n\"It's all lies,\" Dugan told officers.\nPolice were called to Dugan's home to address an unrelated threat. Reporting at the time said Dugan was then under investigation by the FBI for the actions she took inside her courtroom, a claim that she denied. Three days later, FBI agents arrested Dugan inside the Milwaukee County Courthouse.\nThe case stems from events on April 18, when Immigration and Customs Enforcement agents attempted to arrest Eduardo Flores-Ruiz, a 30-year-old Mexican national who appeared in Dugan's courtroom on battery charges.\nDugan was arrested on April 25 by federal authorities and later indicted by a grand jury in May on charges of obstruction. She is accused of helping Flores-Ruiz evade ICE agents by allowing him to exit through the jury door.\nIn the newly released footage, recorded three days before her arrest and first obtained by the Milwaukee Journal Sentinel, Dugan discusses media reports she describes as \"lies\" about an incident involving an immigrant defendant in her courtroom.\nWATCH Bodycam: Judge Dugan describes courtroom incident days before arrest\n\"What I'm concerned about is the whackos believing this story is not true,\" Dugan told officers. \"I'm not being investigated by the feds. The FBI was not there. ICE was there. I directed him down the hall to the administrative offices. What happened after that is their business. I did not hide this migrant in my jury room or the chambers. I had him leave out the back door, which I do when the circumstances warrant it, and these are the circumstances that warrant. I had a room full of 30 people, and I just sent him out the door.\"\nIn a statement to WISN 12 News, Dugan's legal team said the video \"reinforces the facts that we have argued throughout this prosecution and shows what we believe to be the entire truth of the case.\"\n\"On the video, Judge Dugan highlights the outlandish misinformation that has been circulated about her courtroom and accurately states that she directed the defendant in her courtroom to a door that led directly to the public hallway outside her courtroom,\" the statement said.\nThe Wisconsin Supreme Court has suspended Dugan from her judicial duties following her arrest. She has pleaded not guilty to the federal charges.\nU.S. District Judge Lynn Adelman is currently weighing whether to dismiss the case and is expected to rule in the coming weeks. If Adelman orders the case to trial, both the defense and prosecution have said they would like a trial to begin before the end of the year.\nTop Headlines\nWisconsin measles outbreak grows to 14 cases in Oconto County\nMan sentenced in Waukesha crash that killed high school cheerleader\nChild accidentally shoots themselves with gun belonging to Kenosha PD member\nWATCH Wisconsin Dells water park pioneers chemical-free swimming experience"
    },
    {
      "news_title": "Body cam footage shows Milwaukee judge denying she hid an immigrant wanted by ICE",
      "news_link": "https://apnews.com/article/immigration-judge-arrested-milwaukee-trump-4c46809aad5aa3480ed21d54e32da2c3",
      "bias": "Lean Left",
      "text": "Body cam footage shows Milwaukee judge denying she hid an immigrant wanted by ICE\nBody cam footage shows Milwaukee judge denying she hid an immigrant wanted by ICE\nMILWAUKEE (AP) — A Milwaukee judge charged with obstructing a federal agency and concealing a wanted person who was in the country illegally told police days after the incident in her courtroom that “I didn’t do anything that they’re saying.”\nThe comments were captured on body camera footage by Milwaukee police inside Milwaukee County Circuit Judge Hannah Dugan’s home three days before her arrest in April. Dugan told officers she was not aware of a criminal investigation into her conduct.\nDugan was indicted in May and faces charges of concealing an individual to prevent arrest, a misdemeanor, and obstruction, which is a felony. Prosecutors say she escorted Eduardo Flores-Ruiz, 31, and his lawyer out of her courtroom through a back door on April 18 after learning that U.S. Immigration and Customs Enforcement agents had arrived to arrest him for being in the country without permanent legal status.\nFour days later, on April 22, Dugan called police to her house about a flyer from an anti-government group that she, her mother and her sister found at their homes. Police photographs of the flyer show it included a religious screed about how to pronounce the name of God and assertions that Wisconsin residents can legally carry concealed knives.\nHer conversation with officers, as captured on their body cameras, was released by police to The Associated Press on Friday. It was first reported by the Milwaukee Journal Sentinel.\nThe footage shows Dugan telling police that media reports had been swirling about how she supposedly “hid” Flores-Ruiz in her courtroom. She goes on to that she didn’t know the person in her courtroom that day was in the country illegally and she denied giving him special treatment.\n“It’s all lies,” Dugan told officers. She later said, “I didn’t do anything that they’re saying.”\nDugan has pleaded not guilty and is fighting to have the charges against her thrown out. The charges against her underscore a clash between Donald Trump’s administration and local authorities over the Republican president’s sweeping immigration crackdown.\nDemocrats have accused the Trump administration of trying to make an example of Dugan to chill judicial opposition.\nDugan has not publicly commented on the allegations.\nShe told police that she didn’t know Flores-Ruiz’s immigration status.\n“I don’t know if he’s an illegal immigrant, which is what they’re claiming,” Dugan said. “I’m not supposed to know that. When they come in front of me, I’m not supposed to know that.”\nDugan denied hiding Flores-Ruiz who federal agents came into her courtroom to arrest.\n“I did not hide this migrant in the jury room or in my chambers,” she said. “I had him leave out the back door, which I do when the circumstances warrant it.”\nVideo from the hallway showed Flores-Ruiz and his attorney leaving through a side door about 12 feet (3.6 meters) from the main entrance.\nAccording to an FBI affidavit, witnesses heard Dugan say something to the effect of “wait, come with me” before ushering Flores-Ruiz and his attorney out through the door typically used only by deputies, jurors, court staff and in-custody defendants, the affidavit alleges.\nIn her motion to dismiss, Dugan argued that her conduct amounted to directing people’s movement in and around her courtroom, and that she enjoys legal immunity for official acts she performs as a judge.\nDugan told Milwaukee police that she directed federal agents “down the hall to the administrative offices. What happened after that is their business.”\nAgents arrested Flores-Ruiz outside the courthouse after a brief foot chase.\n“We live in very difficult times,” Dugan told the officers. “We all know that. Very difficult.”\nDugan’s defense attorneys released a statement noting that her comments to police came before she was aware of the criminal investigation.\n“Her comments reinforced that she did nothing wrong in this matter and treated the misdemeanor case like any other in her courtroom,” her attorneys said in the statement.\nDugan could face up to six years in prison and a $350,000 fine if convicted on both counts."
    },
    {
      "news_title": "What Judge Hannah Dugan told police 3 days before her arrest by federal agents",
      "news_link": "https://www.jsonline.com/story/news/2025/08/22/what-judge-hannah-dugan-told-police-3-days-before-her-arrest/85748829007/",
      "bias": "Lean Left",
      "text": null
    },
    {
      "news_title": "Body cam: Milwaukee judge denies hiding an immigrant wanted by ICE",
      "news_link": "https://www.socialnews.xyz/2025/08/22/body-cam-milwaukee-judge-denies-hiding-an-immigrant-wanted-by-ice-video/",
      "bias": "unknown",
      "text": "A Milwaukee judge charged with obstructing a federal agency and concealing a wanted person who was in the country illegally told police days after the incident in her courtroom that I didnt do anything that theyre saying.\nSubscribe: http://smarturl.it/AssociatedPress\nRead more: https://apnews.com\nThis video may be available for archive licensing via https://newsroom.ap.org/home\nAbout SocialNewsXYZ\nAn Indo-American News website. It covers Gossips, Politics, Movies, Technolgy, and Sports News and Photo Galleries and Live Coverage of Events via Youtube. The website is established in 2015 and is owned by AGK FIRE INC.\nA Milwaukee judge charged with obstructing a federal agency and concealing a wanted person who was in the country illegally told police days after the incident in her courtroom that I didnt do anything that theyre saying. Subscribe: http://smarturl.it/AssociatedPress Read more: https://apnews.com This video may be available for archive licensing via https://newsroom.ap.org/home"
    }
  ]
}