{
  "story_id": "GN_20250825_232052_4371826f",
  "metadata": {
    "title": "Pennsylvania rejects DOJ request for voter rolls with personal data",
    "timestamp": "2025-08-25T23:20:52.999942",
    "url": "https://ground.news/article/pennsylvania-says-it-wont-give-voters-ssns-drivers-license-numbers-to-us-doj_2df31f"
  },
  "bias_distribution": {
    "total_sources": "24",
    "leaning_left": "3",
    "center": "11",
    "leaning_right": "7"
  },
  "perspective_summaries": {
    "left": [
      "On Thursday, Pennsylvania Secretary of the Commonwealth Al Schmidt rebuffed the U.S. Department of Justice, refusing to provide voter data with partial Social Security and driver's license numbers and offering a redacted file purchasable for $20 due to state privacy laws protecting 8.8 million voters.",
      "The U.S. Department of Justice Civil Rights Division sent two formal requests for Pennsylvania's November 2022 through November 2024 voter records and followed up last week for unredacted rolls including personal identifiers.",
      "Schmidt responded that `This request...represent a concerning attempt to expand the federal government’s role` and said the DOJ misused the national comparison statistic 12.7%.",
      "Earlier this month the ACLU of Pennsylvania threatened legal action if the state provided voter information to the federal government, while at least 19 other states received similar requests and the Committee of Seventy called these DOJ actions federal overreach.",
      "In recent months the Department of Justice has sought unredacted voter rolls from at least 15 states, fitting a Trump administration effort on noncitizen voting that may erode trust ahead of the 2026 midterm elections."
    ],
    "center": [
      "On Thursday, Pennsylvania Secretary of the Commonwealth Al Schmidt rebuffed the U.S. Department of Justice, refusing to provide voter data with partial Social Security and driver's license numbers and offering a redacted file purchasable for $20 due to state privacy laws protecting 8.8 million voters.",
      "The U.S. Department of Justice Civil Rights Division sent two formal requests for Pennsylvania's November 2022 through November 2024 voter records and followed up last week for unredacted rolls including personal identifiers.",
      "Schmidt responded that `This request...represent a concerning attempt to expand the federal government’s role` and said the DOJ misused the national comparison statistic 12.7%.",
      "Earlier this month the ACLU of Pennsylvania threatened legal action if the state provided voter information to the federal government, while at least 19 other states received similar requests and the Committee of Seventy called these DOJ actions federal overreach.",
      "In recent months the Department of Justice has sought unredacted voter rolls from at least 15 states, fitting a Trump administration effort on noncitizen voting that may erode trust ahead of the 2026 midterm elections."
    ],
    "right": [
      "Pennsylvania's top election official rejected a request from the Trump administration for sensitive voter data, leading to a conflict between state laws and federal scrutiny of voter rolls.",
      "Secretary of the Commonwealth Al Schmidt stated that releasing sensitive identifiers would violate Pennsylvania law.",
      "Schmidt characterized the DOJ's request as a concerning attempt to expand federal involvement in elections.",
      "Pennsylvania's top election official, Al Schmidt, rejected the Trump administration's request for sensitive voter information, stating it violates state law."
    ]
  },
  "sources": [
    {
      "news_title": "Pennsylvania Blocks DOJ Bid for Voter Data",
      "news_link": "https://www.997wpro.com/2025/08/22/pennsylvania-blocks-doj-bid-for-voter-data/",
      "bias": "Lean Right",
      "text": null
    },
    {
      "news_title": "Pennsylvania rejects DOJ request for voter rolls with personal data",
      "news_link": "https://thehill.com/homenews/state-watch/5466160-pennsylvania-voter-data-privacy-trump-request/",
      "bias": "Center",
      "text": null
    },
    {
      "news_title": "Pa. refuses to hand over voter registration list to DOJ",
      "news_link": "https://www.tiogapublishing.com/news/state/pa-refuses-to-hand-over-voter-registration-list-to-doj/article_9d37ba04-847b-57ee-ab4d-56c37d611a54.html",
      "bias": "Center",
      "text": null
    },
    {
      "news_title": "Pennsylvania Secretary of State rejects federal request to provide voter data that includes SSN numbers",
      "news_link": "https://www.wnep.com/article/news/politics/elections/state-rejects-federal-request-for-pennsylvania-voter-info-drivers-license-ssn-numbers/521-d1385f5f-ef4b-4cc5-9950-f04247338be0",
      "bias": "Center",
      "text": "HARRISBURG, Pa. — The Pennsylvania Department of State on Thursday rebuffed the U.S. Department of Justice's request to provide a list of voters that included partial Social Security and driver's license numbers.\nIn a letter sent to Assistant Attorney General Harmeet K. Dhillon and Deputy Assistant Attorney General Michael E. Gates on Thursday, Pennsylvania Secretary of State Al Schmidt wrote that the federal agency was free to request the publicly available index of registered voters that is available to the public for a $20 fee.\nSchmidt's letter was in response to multiple requests by the Department of Justice for Pennsylvania's voting records from November 2022 through November 2024, including a full electronic copy of the statewide voter registration list, descriptions of list maintenance procedures, and explanations for anomalies in Pennsylvania’s Election Assistance Commission survey data.\nThe Justice Department has sent two such requests to the Pennsylvania Department of State. The most recent, sent on August 14, gave Schmidt's department two weeks to respond.\nKey issues flagged by the DOJ in its requests included unusually low duplicate registration rates, minimal duplicate removal activity in most counties, unexplained registration categories, low registration activity from Armed Forces Recruitment Offices, and incomplete responses to federal survey questions.\nThe DOJ also asked for data on registered voters found to be non-citizens, adjudicated incompetent, or with felony convictions, along with their voting histories.\n\"This request, and reported efforts to collect broad data on millions of Americans, represent a concerning attempt to expand the federal government’s role in our country’s electoral process,\" Schmidt said in his response. \"Please know that the Department of State takes seriously its obligation to safeguard the integrity and accuracy of Pennsylvania’s voter rolls, as well as the security of Pennsylvanians’ personal information.\n\"Because your letters do not provide any legal justification for the Department to disregard this sacred obligation, we are unable to share such confidential information with you.\"\nAs Pennsylvania's chief election official, Schmidt said he takes his obligation to maintain county election roles seriously, and said his department works with all 67 counties \"In making every reasonable effort to ensure that all electoral processes are fully compliant with federal and Pennsylvania laws, including the National Voter Registration Act and the Help America Vote Act.\"\nSchmidt also said he takes his responsibility to protect the private information Pennsylvania voters \"entrust to the care of our county election officials.\"\nState laws do not permit the release of driver's license or Social Security numbers for Pennsylvania's 8.8 million registered voters, Schmidt added.\n\"None of the legal bases provided in your letter justify or authorize providing these fields and disregarding the strong protections on voter privacy enshrined in our Commonwealth’s laws,\" he said."
    },
    {
      "news_title": "Pennsylvania rejects DOJ request for voter data",
      "news_link": "https://www.audacy.com/wilknews/news/local/pennsylvania-rejects-doj-request-for-voter-data",
      "bias": "Center",
      "text": "HARRISBURG, PA – Pennsylvania officials have denied a request from the Department of Justice (DOJ) to hand over the state's electronic voter registration list, citing a lack of legal justification.\nThe request, sent in an August 4 letter, asked the office of Secretary of the Commonwealth Al Schmidt for the full voter roll, which includes confidential information like Social Security and driver’s license numbers. The DOJ did not provide a reason for its request, which also sought responses to a survey about election administration.\nIn response, Schmidt said his office could not comply without a clear legal basis for the demand. \"Because the department did not provide any legal justification for the confidential information,\" Schmidt stated, \"my office could not hand over confidential information.\"\nState officials confirmed that while some voter data is public, sensitive personal details are protected by law and cannot be shared without a specific, legally mandated reason."
    },
    {
      "news_title": "Pennsylvania rejects 'concerning attempt' by DOJ to access voter rolls",
      "news_link": "https://www.wtaj.com/news/regional-news/pennsylvania-rejects-concerning-attempt-by-doj-to-access-voter-rolls/",
      "bias": "Center",
      "text": null
    },
    {
      "news_title": "Pennsylvania says it won't give voters' SSNs, driver's license numbers to US DOJ",
      "news_link": "https://www.wgal.com/article/pennsylvania-says-it-wont-give-voters-ssns-drivers-license-numbers-to-us-doj/65866452",
      "bias": "Center",
      "text": "Pennsylvania says it won't give voters' SSNs, driver's license numbers to US DOJ\nPennsylvania's Secretary of the Commonwealth said in a letter to the U.S. Department of Justice it will not provide voters' driver's license numbers or partial Social Security numbers and that the agency was free to request the state's publicly available voter list through the normal process. The list, which includes information like names, addresses, and voting history is available to anyone in the public for $20.\nPennsylvania's Secretary of the Commonwealth said in a letter to the U.S. Department of Justice it will not provide voters' driver's license numbers or partial Social Security numbers and that the agency was free to request the state's publicly available voter list through the normal process. The list, which includes information like names, addresses, and voting history is available to anyone in the public for $20.\nPennsylvania's Department of State on Thursday told the U.S. Department of Justice that it will not provide a list of voters that included partial Social Security and driver's license numbers and that the federal agency was free to request the publicly available index of registered voters that is available for purchase by the public for $20.\nThe letter was in response to a request for information from the Justice Department's Civil Rights Division, which sought the information in connection with federal laws surrounding voting standards.\nThe move received some pushback from voting rights and government accountability organizations, which said it was an overstep by the Trump administration.\n\"There are strength and security built into the current system and it’s critical that we maintain those silos to protect the integrity of our elections and our democracy,\" said Pennsylvania's Committee of 70, a government watchdog organization.\n\"You have identified no basis or purpose for why the social security and driver's license numbers of all Pennsylvania's registered voters is necessary to enforce any relevant legal requirements, nor have you shown how such a request would satisfy the requirements of the Civil Rights Act,\" Schmidt wrote in his letter on Thursday, which served as a reply to a pair of letters regarding the matter sent by the Justice Department on Aug. 4 and Aug. 14.\nPennsylvania's full voter list, which includes names, addresses, voting history, and other information for the commonwealth's 8.8 million registered voters, is already available to the public for purchase from the Pennsylvania Department of State for $20."
    },
    {
      "news_title": "PA rebuffs U.S. request for voter rolls with personal data",
      "news_link": "https://www.spotlightpa.org/news/2025/08/pennsylvania-rejects-justice-department-voter-roll-data-schmidt-elections/",
      "bias": "Center",
      "text": "This article is made possible through Spotlight PA’s collaboration with Votebeat, a nonpartisan news organization covering local election administration and voting. Sign up for Votebeat's free newsletters here.\nPennsylvania told the U.S. Justice Department that it will not give federal officials a version of the state’s voter rolls that contains personal information, rebuffing a request from the agency.\n“This request, and reported efforts to collect broad data on millions of Americans, represent a concerning attempt to expand the federal government’s role in our country’s electoral process,” Secretary of the Commonwealth Al Schmidt said in a letter Thursday responding to the request.\nSchmidt, a Republican, said that his department could provide a public version of the voter rolls, known as the Full Voter Export, which contains information such as name, age, address, and vote history, but that it was prohibited by law from providing voters’ Social Security and driver’s license numbers.\nEarlier this month, the department asked Pennsylvania for a copy of its voter rolls, as well as for information on answers it provided to a national election survey. Last week, the Justice Department sent a follow-up letter to clarify that it was seeking the version of the rolls containing personally identifiable information.\nSuch letters have gone out to states around the country, and officials have specified recently that the requests include voters’ Social Security and driver’s license numbers.\nIt is unclear how far the Justice Department may be willing to press the issue. It recently sued Orange County, California, in part for redacting driver’s license and Social Security numbers when responding to a department request for voter registration information.\nSome local groups have criticized the requests. In a statement Tuesday, Lauren Cristella, president of the Philadelphia-based government watchdog group Committee of Seventy, said that the recent requests from the Justice Department, along with recent statements from President Donald Trump on mail voting clearly seem to be “an attempt to sow doubt in our elections ahead of the 2026 midterms.”\nThe original letter from federal officials also sought information about answers Pennsylvania gave to the Election Administration and Voting Survey, among other things.\nOn Monday the Department of State responded to those portions of the letter, in some cases saying the questions appeared to be based on misunderstandings or mistakes about the data.\nRead Votebeat and Spotlight PA’s previous coverage on the state’s communication with the Justice Department:\nJustice Department widens its request for Pennsylvania election information\nU.S. Justice Department presses Pennsylvania for answers on how it manages voter rolls\nCarter Walker is a reporter for Votebeat in partnership with Spotlight PA. Contact Carter at cwalker@votebeat.org."
    },
    {
      "news_title": "Pennsylvania rebuffs U.S. request for voter rolls containing personal data",
      "news_link": "https://penncapital-star.com/election-2025/pennsylvania-rebuffs-u-s-request-for-voter-rolls-containing-personal-data/",
      "bias": "Lean Left",
      "text": null
    },
    {
      "news_title": "Pennsylvania Department of State refuses to turn over full voter registration data to Trump administration",
      "news_link": "https://www.inquirer.com/politics/election/pennsylvania-voter-roll-trump-doj-20250821.html",
      "bias": "Lean Left",
      "text": "Pennsylvania Department of State refuses to turn over full voter registration data to Trump administration\nPennsylvania Secretary of State Al Schmidt called the federal inquiry a \"concerning attempt to expand the federal government's role in our country's electoral process.\"\nThe Pennsylvania Department of State will not turn over its voter registration database to the Trump administration, denying a request that has been sent to dozens of other states in an apparent inquiry into state voter roll maintenance.\nIn recent months the Department of Justice has sought unredacted voter rolls from at least 15 states, according to the Associated Press. None of the states has fully complied with the requests, as legal experts argue doing so would violate state and federal law. The inquiries appear to target mostly blue and swing states.\n“This request, and reported efforts to collect broad data on millions of Americans, represent a concerning attempt to expand the federal government’s role in our country’s electoral process,” Pennsylvania Secretary of State Al Schmidt said Thursday in his response to the DOJ.\nHe assured federal officials that his department takes its responsibility for voter roll maintenance and election security seriously, telling DOJ officials that “because your letters do not provide any legal justification for the Department to disregard this sacred obligation, we are unable to share such confidential information with you.”\nLast week, after several states sent redacted versions of their voter rolls, the DOJ followed up with letters demanding the unredacted dataset, which would include detailed personal identifying information about voters that is traditionally considered sealed. In its letter to Pennsylvania, the agency granted the state a three-day extension to respond to the data request.\nSchmidt offered the DOJ a copy of Pennsylvania’s redacted public voter file but said there was no precedent to justify the state turning over the sensitive information contained in the full dataset. In fact, he argued, state law barred him from releasing that information.\nVoting rights advocates and legal experts have decried the DOJ inquiries as illegal and an effort to sow doubt in election security ahead of the 2026 midterm elections. The inquiry has coincided with continued efforts by President Donald Trump to influence the midterms, including a push for mid-cycle redistricting in Republican-leaning states and a recent announcement that he would seek to ban mail voting.\nWhile voter rolls are public record, Pennsylvania law requires that officials strip personal identifying information, such as driver’s license numbers and Social Security numbers, when responding to public records requests. The Trump administration sought the full, unredacted document, along with details on any voters who had been removed from the rolls because of a felony conviction, lack of citizenship, or incompetency.\nEarlier this month, the ACLU of Pennsylvania threatened legal action if the state sought to provide that personal information to the federal government.\nThe Department of Justice did not immediately respond to a request for comment on Pennsylvania’s response. An agency spokesperson previously said that the DOJ “has a statutory mandate to enforce federal voting rights laws” but did not indicate there was a specific issue being investigated in Pennsylvania.\nIn a letter Monday, Schmidt responded to other questions in the DOJ’s request, explaining the state’s procedures for removing voters from rolls and responding to detailed questions from the DOJ about federal election data. The Department of Justice, Pennsylvania argued, had misinterpreted data and inaccurately sought to compare Pennsylvania’s response to other states.\nAmong the errors flagged in the Monday letter, Schmidt noted that the Department of Justice incorrectly asked about Pennsylvania’s 66 counties. The state has 67 counties."
    },
    {
      "news_title": "Pa. responds to second Justice Department letter seeking sensitive voter information",
      "news_link": "https://www.pennlive.com/politics/2025/08/pa-responds-to-second-justice-department-letter-seeking-sensitive-voter-information.html",
      "bias": "Center",
      "text": "The Pennsylvania Department of State declined to turn over election official information and clarified mathematical calculations and definitions in response to a second request from the Department of Justice.\nIn a new letter dated Aug. 14, the Justice Department requested the state’s voter list once again with personal information such as driver’s license numbers and the last four digits of Social Security numbers.\nUnder state law, the Department of State provides a full voter list, including voter ID numbers, dates of birth and voting history, for $20. This publicly available data does not include Social Security or driver’s license numbers.\nCraig Holman, an ethics expert from Public Citizen, called the multiple DOJ letters “an intimidation tactic.”\n“The Department of Justice is clearly operating on the assumption that there some kind of illegal behavior going on in Pennsylvania, and you can just sense it in the letters,” Holman said. “It seems like they’re trying to put the state on alert that they are being scrutinized.”\nAt least 19 other states have received similar requests from the Trump Justice Department, according to the Associated Press. The department’s efforts are part of a broader administration initiative to investigate past elections for voter fraud and noncitizen voting, issues for which there is no data showing widespread wrongdoing.\nThe Committee of Seventy, a nonpartisan good government organization in Philadelphia, released a statement Tuesday that these recent efforts by the Trump administration are “an overstep of the federal government’s jurisdiction over elections and an attempt to baselessly erode trust in our elections.”\nWhat did the DOJ ask for and how did the state respond?\nThe previous DOJ letter asked for more information about Pennsylvania’s answers to the Election Administration and Voting Survey (EAVS).\nElection official info: The State Department said it cannot turn over information about election officials because county voter registration commissions are ultimately responsible for hiring the employees who maintain voter lists.\n“Duplicate registrations”: One question focused on Pennsylvania’s low percentage of duplicate registrations compared with the rest of the country. Secretary of State, Al Schmidt, pointed out that the number the DOJ used for nationwide comparisons was misleading. Many states reported incomplete survey data, so Schmidt said the 12.7% national average cited by the DOJ “may not serve as a reliable interstate comparison.”\nHe also clarified that Pennsylvania’s actual rate of duplicate registrations is 9.4% and not 4.49%, as the Justice Department stated in its question.\nSchmidt pointed out that DOJ may have misunderstood what “duplicate registrations” could mean. It reflects duplicate applications, he said, not duplicate voters. Schmidt said Pennsylvania, like Oklahoma, addresses this through online voter registration, which also helps reduce tedious work for election staff.\nThe “other” category: The DOJ questioned around 40,000 Pennsylvania transactions listed “as “other,” which it said were provided “without further explanation.” Schmidt clarified that the Election Assistance Commission website showed those transactions were recorded as pending applications.\nThe letter also pushed for more information on Pennsylvania’s “other” response to a question about confirmation notices. Schmidt clarified that these notices were undeliverable or received no initial response from the voter. This information is publicly available in the 2024 EAVS comprehensive report.\nMilitary recruitment office participation: The Justice Department questioned the state’s efforts to ensure armed forces recruitment offices’ participation in voter registration. The department noted that those offices are required to report voting assistance data to the Federal Voter Assistance Program, not to Pennsylvania.\nMerged voter records: The last question alleged that the state “failed to respond” to a question on merged voter records. Schmidt said the state did respond, explaining it could not provide a figure because it is unable to accurately differentiate between merged and transferred records.\nNoncitizen voting: The state department noted that falsifying statements about applicant citizenship is a federal and state crime. The letter says counties may cancel noncitizen registrations and refer the matter to law enforcement. Schmidt clarified that the National Voter Registration Act of 1993 “does not govern” but “defers to state law,” meaning voters with felony convictions or adjudicated mental incompetency are not automatically removed under Pennsylvania law.\n“It sounds like these actions by the Department of Justice are just so opinionated and poorly thought out,” Holman said. “They are trying to go very public with trying to make Pennsylvania government officials feel very uncomfortable and under attack like they are doing something not legitimate.”\nIt can get personal, too. In 2020, when Donald Trump tweeted directly at Al Schmidt after his Pennsylvania loss in the presidential election, Schmidt’s family had to temporarily relocate due to threats.\nThe scrutiny continues but requests for voter lists with personal information are not new in Pennsylvania — although the state has historically resisted them.\n“Whether the intention is to lay the groundwork for rejecting results in the event of a loss, or to exploit states where one party controls all branches of government to push a federal agenda, the facts are the facts: our elections are secure, mail-in voting is secure, and election administration must remain in the hands of the states,” the Committee of Seventy statement said.\nThe department has until Friday, Aug. 22, to respond to the DOJ’s latest letter."
    },
    {
      "news_title": "Deep Dive: Justice Department demand for state voter lists underscores their importance",
      "news_link": "https://www.thedailynewsonline.com/news/deep-dive-justice-department-demand-for-state-voter-lists-underscores-their-importance/article_4607dbb1-64d2-46d7-b49b-a368b8568f75.html",
      "bias": "unknown",
      "text": null
    },
    {
      "news_title": "Pennsylvania Rebuffs Federal Request for Voter Rolls Containing Personal Data",
      "news_link": "https://www.statecollege.com/articles/elections/pennsylvania-rebuffs-federal-request-for-voter-rolls-containing-personal-data/",
      "bias": "unknown",
      "text": null
    }
  ]
}