{
  "story_id": "GN_20250822_191904_768a74ef",
  "metadata": {
    "title": "Famine in Gaza officially declared for first time by UN-backed monitor",
    "timestamp": "2025-08-22T19:19:04.567606",
    "url": "https://ground.news/article/fe938516-7b82-419c-af66-8de56b009dd3"
  },
  "bias_distribution": {
    "total_sources": "74",
    "leaning_left": "20",
    "center": "23",
    "leaning_right": "12"
  },
  "perspective_summaries": {
    "left": [
      "The Integrated Food Security Phase Classification has declared a famine in Gaza, with over half a million people at risk of starvation, indicating a worsening humanitarian crisis.",
      "The IPC report warns that acute malnutrition could lead to the death of 132,000 children under five in coming months, with conditions deteriorating drastically.",
      "Israeli restrictions on aid and military actions have contributed to the famine crisis, with humanitarian organizations reporting access issues and rising hunger levels.",
      "The United Nations Secretary-General described the situation as a 'man-made disaster', emphasizing the urgent need for humanitarian aid and support."
    ],
    "center": [
      "A UN-backed global hunger monitor confirmed famine in Gaza Governorate on Friday, affecting 514,000 people amid ongoing conflict.",
      "The famine follows nearly two years of war triggered by Hamas attacks on October 7, 2023, with Israel controlling all access to Gaza.",
      "Aid agencies warn conditions will worsen as famine is projected to spread to Deir al-Balah and Khan Younis, with many children suffering severe malnutrition.",
      "Antoine Renard, WFP's Palestine director, said without steady supply of specialised supplements, the crisis could become a widespread nutrition emergency.",
      "The famine designation increases calls for Israel to expand the flow of humanitarian assistance amid ongoing disagreements over the causes and delivery challenges of aid."
    ],
    "right": [
      "The United Nations-backed organization will declare a famine in Gaza City on Friday morning, according to documents obtained by The Daily Wire.",
      "The IPC states that over half a million people in the Gaza Strip face catastrophic conditions, characterized by starvation, destitution, and death.",
      "Another 1.07 million people in Gaza are facing emergency levels of food insecurity, as noted in the IPC briefing.",
      "This marks the fifth famine declaration by the IPC since 2004 and the first time it has classified two famines simultaneously, following Sudan in 2024."
    ]
  },
  "sources": [
    {
      "news_title": "Famine confirmed in Gaza for first time, says UN-backed report",
      "news_link": "https://ground.news/interest/swi-swissinfoch",
      "bias": "Lean Left"
    },
    {
      "news_title": "Famine in Gaza officially declared by UN-backed group monitoring world hunger",
      "news_link": "https://ground.news/interest/metro-news",
      "bias": "Lean Left"
    },
    {
      "news_title": "Famine has struck Gaza, will likely spread, says global hunger monitor",
      "news_link": "https://ground.news/interest/usa-today",
      "bias": "Lean Left"
    },
    {
      "news_title": "UN declares famine in Gaza and blames Israel for it",
      "news_link": "https://ground.news/interest/times-of-malta",
      "bias": "Center"
    },
    {
      "news_title": "Famine has struck Gaza: Global hunger monitor",
      "news_link": "https://ground.news/interest/channel-news-asia",
      "bias": "Center"
    },
    {
      "news_title": "UN chief decries ‘man-made disaster’ as experts confirm Gaza famine",
      "news_link": "https://ground.news/interest/al-jazeera_1a2e2c",
      "bias": "Lean Left"
    },
    {
      "news_title": "Famine officially declared in Gaza by global hunger monitor",
      "news_link": "https://ground.news/interest/middle-east-eye",
      "bias": "Left"
    },
    {
      "news_title": "UN-backed group officially declares famine in Gaza",
      "news_link": "https://ground.news/interest/deutsche-welle",
      "bias": "Center"
    },
    {
      "news_title": "Famine determined in parts of Gaza, 500,000 experiencing 'catastrophic' hunger: Report",
      "news_link": "https://ground.news/interest/abc-news_409efb",
      "bias": "Lean Left"
    },
    {
      "news_title": "Gaza City officially in famine: half a million people face starvation",
      "news_link": "https://ground.news/interest/the-journal_0d766b",
      "bias": "Lean Left"
    },
    {
      "news_title": "Grim milestone: Leading food crisis authority confirms Gaza City famine",
      "news_link": "https://ground.news/interest/9news",
      "bias": "Lean Right"
    },
    {
      "news_title": "Breaking: Famine officially declared in Gaza City for first time by UN-backed group",
      "news_link": "https://ground.news/interest/abc-australia",
      "bias": "Lean Left"
    },
    {
      "news_title": "Photos show Palestinians struggling for food as famine grips Gaza's largest city",
      "news_link": "https://ground.news/interest/ct-insider",
      "bias": "Lean Right"
    },
    {
      "news_title": "Famine confirmed in Gaza City, UN-backed initiative says",
      "news_link": "https://ground.news/interest/cnn",
      "bias": "Lean Left"
    },
    {
      "news_title": "Famine In Gaza Is Underway Amid Israel's US-Backed Siege, Experts Confirm",
      "news_link": "https://ground.news/interest/huffpost",
      "bias": "Left"
    },
    {
      "news_title": "Famine grips Gaza's largest city and is likely to spread, authority on food crises says",
      "news_link": "https://ground.news/interest/associated-press-news",
      "bias": "Lean Left"
    },
    {
      "news_title": "UN Declares Famine In Gaza, First Ever In Middle East",
      "news_link": "https://ground.news/interest/barrons",
      "bias": "Center"
    },
    {
      "news_title": "UN declares famine in Gaza, first ever in Middle East",
      "news_link": "https://ground.news/interest/al-arabiya",
      "bias": "Lean Right"
    },
    {
      "news_title": "UN-Backed Watchdog Set To Declare Famine in Gaza Amid Accusations of Flawed Data",
      "news_link": "https://ground.news/interest/the-daily-wire",
      "bias": "Right"
    },
    {
      "news_title": "Famine declared in Gaza City - and projected to expand to two other areas in the next month",
      "news_link": "https://ground.news/interest/sky-news",
      "bias": "Center"
    },
    {
      "news_title": "Famine has struck Gaza, says global hunger monitor",
      "news_link": "https://ground.news/interest/reuters_fa2539",
      "bias": "Center"
    },
    {
      "news_title": "Famine declared in Gaza City as Israel vows to open 'gates of hell' on besieged area",
      "news_link": "https://ground.news/interest/nbc-news",
      "bias": "Lean Left"
    },
    {
      "news_title": "UN-backed body confirms famine in Gaza",
      "news_link": "https://ground.news/interest/rte",
      "bias": "Center"
    },
    {
      "news_title": "U.N.-backed agency says famine exists in northern Gaza",
      "news_link": "https://ground.news/interest/npr",
      "bias": "Lean Left"
    },
    {
      "news_title": "IPC Declares Famine in Gaza Strip Amid Ongoing Military Offensive",
      "news_link": "https://ground.news/interest/chosuncom",
      "bias": "Lean Right"
    },
    {
      "news_title": "Experts warned that Gaza was at risk of famine. Here’s why they confirmed it for Gaza City",
      "news_link": "https://ground.news/interest/winnipeg-free-press",
      "bias": "Center"
    },
    {
      "news_title": "UN-backed organization officially declares famine in Gaza",
      "news_link": "https://ground.news/interest/presstv",
      "bias": "Right"
    },
    {
      "news_title": "Famine officially declared in Gaza for first time by UN-backed group",
      "news_link": "https://ground.news/interest/the-telegraph",
      "bias": "Lean Right"
    },
    {
      "news_title": "Famine has officially struck Gaza, says global hunger monitor",
      "news_link": "https://ground.news/interest/nationnews",
      "bias": "unknown"
    },
    {
      "news_title": "Famine in Gaza: ‘A failure of humanity itself’, says UN chief",
      "news_link": "https://ground.news/interest/un-news",
      "bias": "unknown"
    },
    {
      "news_title": "UN declares famine in Gaza, blames Israel",
      "news_link": "https://ground.news/interest/record-argus-serving-greenville-pa-since-1848",
      "bias": "unknown"
    },
    {
      "news_title": "Gaza famine deepens while the world watches in silence",
      "news_link": "https://ground.news/interest/libyan-express",
      "bias": "unknown"
    },
    {
      "news_title": "Gaza’s ‘man-made’ famine escalating at extraordinary speed - Workers Revolutionary Party",
      "news_link": "https://ground.news/interest/workers-revolutionary-party",
      "bias": "unknown"
    },
    {
      "news_title": "Two more Palestinians die of malnutrition in Gaza – Pakistan Times Today",
      "news_link": "https://ground.news/interest/pakistan-times-today",
      "bias": "unknown"
    }
  ]
}