{
  "story_id": "GN_20250825_230232_2bb38d26",
  "metadata": {
    "title": "Monitor visits jails in Georgia’s Fulton County and finds safety risks due to understaffing",
    "timestamp": "2025-08-25T23:02:32.320486",
    "url": "https://ground.news/article/monitor-visits-jails-in-georgias-fulton-county-and-finds-safety-risks-due-to-understaffing"
  },
  "bias_distribution": {
    "total_sources": "14",
    "leaning_left": "6",
    "center": "7",
    "leaning_right": "0"
  },
  "perspective_summaries": {
    "left": [
      "An independent monitor reports that significant understaffing in Fulton County jails creates 'serious safety risks for residents and staff.'",
      "The monitoring team identified a staffing crisis, noting that about 50% of posts were vacant during the 7 a.m. to 7 p.m. shift.",
      "The main jail is described as 'in an unacceptable condition and inadequately staffed,' which exacerbates safety issues.",
      "The sheriff criticized a recent vote, stating it does not tackle immediate safety issues within the jails."
    ],
    "center": [
      "An independent monitor reports that significant understaffing in Fulton County jails creates 'serious safety risks for residents and staff.'",
      "The monitoring team identified a staffing crisis, noting that about 50% of posts were vacant during the 7 a.m. to 7 p.m. shift.",
      "The main jail is described as 'in an unacceptable condition and inadequately staffed,' which exacerbates safety issues.",
      "The sheriff criticized a recent vote, stating it does not tackle immediate safety issues within the jails."
    ],
    "right": [
      "An independent monitor reports that significant understaffing in Fulton County jails creates 'serious safety risks for residents and staff.'",
      "The monitoring team identified a staffing crisis, noting that about 50% of posts were vacant during the 7 a.m. to 7 p.m. shift.",
      "The main jail is described as 'in an unacceptable condition and inadequately staffed,' which exacerbates safety issues.",
      "The sheriff criticized a recent vote, stating it does not tackle immediate safety issues within the jails."
    ]
  },
  "sources": [
    {
      "news_title": "Sheriff: Jail's population 'much sicker' than in the past",
      "news_link": "https://wreg.com/news/local/sheriff-jails-population-much-sicker-than-in-the-past/",
      "bias": "Center",
      "text": null
    },
    {
      "news_title": "Monitor visits jails in Georgia’s Fulton County and finds safety risks due to understaffing",
      "news_link": "https://wtop.com/national/2025/08/monitor-visits-jails-in-georgias-fulton-county-and-finds-safety-risks-due-to-understaffing/",
      "bias": "Center",
      "text": "ATLANTA (AP) — An independent monitor appointed to oversee an agreement meant to address dangerous and unhealthy jail conditions in Georgia’s most populous county said significant understaffing creates “serious safety risks for residents and staff.”\nKathleen Kenney was appointed in February to monitor the consent decree between the U.S. Department of Justice, Fulton County and county Sheriff Pat Labat. Her initial report filed Thursday provides an overview of her team’s baseline visit to the main jail and annexes in May and makes recommendations for the next six months.\nThe court-enforceable agreement was announced in January after a Justice Department civil rights investigation found that jail officials failed to protect detainees from violence, used excessive force and held people in “unconstitutional and illegal conditions.”\nThe monitor’s recommendations for the next six months include focusing on the resident classification and housing system, increasing staffing and supervision, ensuring that heating and air conditioning is working and fire suppression and alert systems are adequate, and improving suicide prevention measures.\nA sheriff’s spokesperson said Friday the office isn’t able to comment on the 40-page report yet, having received it late Thursday afternoon.\nA staffing crisis\nThe “single biggest takeaway” from the monitoring team’s initial visit was a staffing crisis, the report says. Most floors in the main jail in Atlanta were staffed by only one deputy or detention officer, responsible for about 200 residents across six separate housing areas. Security towers were often vacant, “exacerbating safety risks to the staff and incarcerated population.”\nFor the 7 a.m. to 7 p.m. shift, about 50% of the posts in the main jail housing units and 55% in the annexes were vacant. Vacancies were higher for the 7 p.m. to 7 a.m. shift, at 58% in the main jail, 59% in the annexes. Support operations such as intake, classification, food service and laundry were even more thinly staffed.\nThe report notes that jails and prisons around the country are grappling with significant staffing shortages, and that the sheriff’s office acknowledged its salary and benefits package isn’t competitive.\nDuring the monitoring team’s visit to the 1,900-bed capacity main jail, a total of 1,838 people were being held there. Because of environmental or maintenance issues, 731 beds were unavailable. Some of these were part of a “blitz,” surging resources area by area to make repairs. Good idea, the report says, but without more staff, the jail residents destroy the things that have just been repaired.\n“Unsupervised, idle residents will continue destroying the facilities until staff are able to adequately supervise them,” the report says.\nOvercrowded intake and security issues\nThe intake area includes three separate holding tanks where most people were packed in “so tightly that they could not sit or lie down” and many people had “been held in these inhumane conditions for five to seven days.” The sheriff’s office recognized the problems but “failed to take appropriate action and treat the situation with the urgency required,” the report says.\nThe lack of adequate supervision also means that doors that don’t lock and windows that can be breached give residents routine access to weapons, and drones are used to fly in drugs, weapons and other contraband, “virtually unabated and undetected.”\nOverall, the main jail is “in an unacceptable condition and inadequately staffed,” the report concluded. Similar problems to varying degrees were observed at the annexes.\nA bright spot monitors observed was the mental health competency restoration unit, a collaboration with Emory University School of Medicine. It treats only a small number of people with serious mental illnesses, but “is promising and appears to be functioning according to standard correctional practices.”\nWhat the staff and residents say\nIn conversations with the monitoring team, jail staff said they don’t feel safe and are concerned about environmental conditions. They said they don’t feel supported and fear firing or public humiliation if they make mistakes.\nJail residents told the monitoring team they also don’t feel safe, with some mentioning weapon and gang issues inside the jail. They said staff do not seem to care, and conduct rounds infrequently because of understaffing. The food is bad and there’s not enough of it, and sinks, showers and toilets often don’t work, they said.\nThe team also noted that the jails’ strategies for classification, restricted housing and population management don’t align with common practices. Emergency medical response procedures are unclear, equipment is lacking and residents on suicide watch aren’t consistently put in safe cells or monitored frequently enough.\nPlans for the future\nAt a meeting Wednesday, the Fulton County Board of Commissioners were presented with several options for the future of the jail. They voted to continue studying a nine-year, $1.2 billion option that includes building a new special purpose facility with about 1,800 beds and then renovating the existing main jail.\nThe sheriff, who has long advocated for a completely new jail, blasted the vote, saying it fails to address very immediate problems.\n“The vote is a political game of smoke and mirrors that flies in the face of the federal consent decree,” Labat said in an emailed statement.\nCopyright © 2025 The Associated Press. All rights reserved. This material may not be published, broadcast, written or redistributed."
    },
    {
      "news_title": "Monitor visits jails in Georgia's Fulton County and finds safety risks due to understaffing",
      "news_link": "https://apnews.com/article/justice-department-fulton-county-jail-investigation-monitor-d7d98e97710b77ce805c1dcad0a98437",
      "bias": "Lean Left",
      "text": "Monitor visits jails in Georgia’s Fulton County and finds safety risks due to understaffing\nATLANTA (AP) — An independent monitor appointed to oversee an agreement meant to address dangerous and unhealthy jail conditions in Georgia’s most populous county said significant understaffing creates “serious safety risks for residents and staff.”\nKathleen Kenney was appointed in February to monitor the consent decree between the U.S. Department of Justice, Fulton County and county Sheriff Pat Labat. Her initial report filed Thursday provides an overview of her team’s baseline visit to the main jail and annexes in May and makes recommendations for the next six months.\nThe court-enforceable agreement was announced in January after a Justice Department civil rights investigation found that jail officials failed to protect detainees from violence, used excessive force and held people in “unconstitutional and illegal conditions.”\nThe monitor’s recommendations for the next six months include focusing on the resident classification and housing system, increasing staffing and supervision, ensuring that heating and air conditioning is working and fire suppression and alert systems are adequate, and improving suicide prevention measures.\nA sheriff’s spokesperson said Friday the office isn’t able to comment on the 40-page report yet, having received it late Thursday afternoon.\nA staffing crisis\nThe “single biggest takeaway” from the monitoring team’s initial visit was a staffing crisis, the report says. Most floors in the main jail in Atlanta were staffed by only one deputy or detention officer, responsible for about 200 residents across six separate housing areas. Security towers were often vacant, “exacerbating safety risks to the staff and incarcerated population.”\nFor the 7 a.m. to 7 p.m. shift, about 50% of the posts in the main jail housing units and 55% in the annexes were vacant. Vacancies were higher for the 7 p.m. to 7 a.m. shift, at 58% in the main jail, 59% in the annexes. Support operations such as intake, classification, food service and laundry were even more thinly staffed.\nThe report notes that jails and prisons around the country are grappling with significant staffing shortages, and that the sheriff’s office acknowledged its salary and benefits package isn’t competitive.\nDuring the monitoring team’s visit to the 1,900-bed capacity main jail, a total of 1,838 people were being held there. Because of environmental or maintenance issues, 731 beds were unavailable. Some of these were part of a “blitz,” surging resources area by area to make repairs. Good idea, the report says, but without more staff, the jail residents destroy the things that have just been repaired.\n“Unsupervised, idle residents will continue destroying the facilities until staff are able to adequately supervise them,” the report says.\nOvercrowded intake and security issues\nThe intake area includes three separate holding tanks where most people were packed in “so tightly that they could not sit or lie down” and many people had “been held in these inhumane conditions for five to seven days.” The sheriff’s office recognized the problems but “failed to take appropriate action and treat the situation with the urgency required,” the report says.\nThe lack of adequate supervision also means that doors that don’t lock and windows that can be breached give residents routine access to weapons, and drones are used to fly in drugs, weapons and other contraband, “virtually unabated and undetected.”\nOverall, the main jail is “in an unacceptable condition and inadequately staffed,” the report concluded. Similar problems to varying degrees were observed at the annexes.\nA bright spot monitors observed was the mental health competency restoration unit, a collaboration with Emory University School of Medicine. It treats only a small number of people with serious mental illnesses, but “is promising and appears to be functioning according to standard correctional practices.”\nWhat the staff and residents say\nIn conversations with the monitoring team, jail staff said they don’t feel safe and are concerned about environmental conditions. They said they don’t feel supported and fear firing or public humiliation if they make mistakes.\nJail residents told the monitoring team they also don’t feel safe, with some mentioning weapon and gang issues inside the jail. They said staff do not seem to care, and conduct rounds infrequently because of understaffing. The food is bad and there’s not enough of it, and sinks, showers and toilets often don’t work, they said.\nThe team also noted that the jails’ strategies for classification, restricted housing and population management don’t align with common practices. Emergency medical response procedures are unclear, equipment is lacking and residents on suicide watch aren’t consistently put in safe cells or monitored frequently enough.\nPlans for the future\nAt a meeting Wednesday, the Fulton County Board of Commissioners were presented with several options for the future of the jail. They voted to continue studying a nine-year, $1.2 billion option that includes building a new special purpose facility with about 1,800 beds and then renovating the existing main jail.\nThe sheriff, who has long advocated for a completely new jail, blasted the vote, saying it fails to address very immediate problems.\n“The vote is a political game of smoke and mirrors that flies in the face of the federal consent decree,” Labat said in an emailed statement."
    },
    {
      "news_title": "Court finds Sheriff Patrick Labat in Breach for Second Time in Jail Conditions Case",
      "news_link": "https://atlantadailyworld.com/2025/08/23/court-finds-sheriff-patrick-labat-in-breach-for-second-time-in-jail-conditions-case/",
      "bias": "unknown",
      "text": "Lawsuit on behalf of women with serious mental illness who were left to languish in their cells under deplorable conditions\nOn August 7, 2025, U.S. Magistrate Judge Regina D. Cannon found Fulton County Sheriff Patrick Labat in breach of the settlement agreement in Georgia Advocacy Office, et al. v. Labat for a second time, stating that he “ultimately is responsible for his own noncompliance.”\nIn April 2019, the Southern Center for Human Rights and the Georgia Advocacy Office filed a lawsuit on behalf of women with serious mental illness held in torturous conditions of solitary confinement in the South Fulton Jail in Union City, Georgia. The law firm of Caplan Cobb LLC joined the lawsuit several months later on behalf of women detained at the jail. Plaintiffs presented photographs from an inspection by the Georgia Advocacy Office showing garbage-strewn cells, standing toilet water on the floor, a trail of urine flowing from a cell door, bloody clothes and underwear stained with fecal matter lying in the living areas, toilets full of garbage, and feces and blood on the walls. These women, most of whom were caged for petty offenses, sometimes remained in their squalid cells around the clock for weeks or months on end.\nAfter calling the conditions in the South Fulton Jail “repulsive,” U.S. District Court Judge William Ray II approved a settlement agreement in April 2022 aimed at remedying the human rights violations the women in this class action face daily. Among other things, the agreement required:\n- At least four hours of out-of-cell time, five days a week (one hour of which must be recreation time), with an hour of out-of-cell time offered on the other two days of the week for people with serious mental illness;\n- Opportunities for meaningful therapeutic activities;\n- Access to clean drinking water, personal hygiene items, reading materials, a sufficient supply of clothing and underwear, and a quality control process so that people are no longer served moldy, spoiled food;\n- Training for correctional staff supervising people with serious mental illness; and\n- A reliable tracking system to ensure people with serious mental illness are receiving required out-of-cell time.\nThree years later, an independent court monitor concluded the Sheriff’s compliance had worsened since the first breach finding. Through continued investigation the litigation team provided further evidence supporting a second filing of material breach, including hundreds of instances where jail staff improperly documented denials of out-of-cell time as refusals.\nOn August 7, 2025, Judge Cannon, citing the litigation team’s investigation, ruled that Sheriff Labat remains non-compliant with several critical requirements by failing to:\n-\nProvide accurate or consistent records to track compliance with the agreement;\n-\nAbide by the agreement’s tracking, reporting, and documentation requirements by failing to “maintain a record of the exact times” for each woman with respect to each form of out-of-cell time offered, denied, or refused;\n-\nMaintain or provide accurate lists of women with serious mental illness;\n-\nOffer access to reading material; and\n- Comply with the agreement’s staffing, training, and supervision requirements.\nLabat contended that he has complied with the settlement agreement; however, Judge Cannon called Sheriff Labat’s arguments “hollow.” In her order, she characterized his documentation practices as “suspect,” chided the Sheriff for claiming that the testimony and declarations of women in the jail are inherently unreliable, and called into question his claim on the one hand that he can’t comply with the agreement, while claiming on the other that he has sufficient resources to comply.\n“This ruling is more than a finding in favor of the Plaintiffs — it is a reminder that the women inside that jail are human beings whose voices matter. For too long, they have reported poor and degrading conditions, and those reports have been ignored,” said Devon Orland, Litigation Director at Georgia Advocacy Office. “The court’s order affirms what should never have been in question: these women have value, their experiences carry weight, and the Sheriff is not above the law when it comes to their treatment.”\n“The order is essential to holding the Sheriff accountable for his repeated disregard of the settlement agreement.” Jarred Klorfein, Partner at Caplan Cobb LLC.\nSheriff Labat has asked the U.S. District Court to review the magistrate’s order. Because this is the second finding of material breach, the U.S. District Court can convert the existing settlement agreement into a consent decree and order sanctions if he agrees with the magistrate’s findings.\n“Fulton County agreed to make meaningful changes in the lives of people with psychiatric disabilities, and it has failed to live up to its end of the bargain time after time. As long as we rely on jails to treat serious mental illness, we will continue to see the types of violations that have repeatedly been brought before the Court,” said Atteeyah Hollie, Deputy Director at the Southern Center for Human Rights.\nCase Timeline:\n- April 2019-Class-action filed, alleging conditions of confinement at the South Fulton Jail violated their constitutional rights\n- July 15-18, 2019-Evidentiary hearing, (July 23, 2019)-Court granted a preliminary injunction in favor of our clients\n- April 4, 2022-District Judge William Ray II issued a final order approving joint settlement\n- December 2022-Women with serious mental illness moved to Atlanta City Detention Center (ACDC) from South Fulton Jail\n- March 30, 2023-Plaintiffs filed a motion for material breach (contempt)\n- October 5, 2023– Hearing held for arguments on motion\n- January 2, 2024-Magistrate Court Order finding Defendant in material breach (contempt)\n- June 18, 2024– District Court Order affirming Defendant in material breach (contempt)\n- July 19, 2024-Independent Monitor Downgrading Defendant’s Compliance Rating-Supplemental Brief in Support of Plaintiff’s Motion for Second Finding of Material Breach (Contempt)\n- August 16, 2024– Reply Brief in Support of Plaintiff’s Motion for Second Finding of Material Breach\n- August 29, 2024-Oral argument on second motion for material breach\n- August 7, 2025– Magistrate Court Order finding Defendant in material breach for a second time\nTo read the pleadings, please visit www.schr.org\nFor additional information, contact Kathryn Hamoudah at 404/688-1202 or khamoudah@schr.org"
    }
  ]
}