{
  "story_id": "GN_20250825_215124_f298e697",
  "metadata": {
    "title": "Top officials of Amazon nations meet in Colombia to push joint rainforest protection plan",
    "timestamp": "2025-08-25T21:51:24.838264",
    "url": "https://ground.news/article/top-officials-of-amazon-nations-meet-in-colombia-to-push-joint-rainforest-protection-plan"
  },
  "bias_distribution": {
    "total_sources": "15",
    "leaning_left": "4",
    "center": "6",
    "leaning_right": "0"
  },
  "perspective_summaries": {
    "left": [
      "Presidents from Colombia, Brazil, and Bolivia met with Indigenous leaders in Bogota to discuss a joint plan for rainforest protection, which was seen as crucial to combating global warming.",
      "They signed the 'Declaration of Bogota,' focusing on cooperation among Amazon nations to protect the rainforest, covering over 2.5 million square miles.",
      "Ecuador’s Vice President María José Pinto emphasized the need for 'concrete actions' beyond good intentions to safeguard the Amazon's legacy.",
      "Colombian Indigenous leader Oswaldo Muca urged for real actions beyond speeches, advocating for direct financing for Indigenous peoples to prevent further destruction of the Amazon."
    ],
    "center": [
      "On Friday, presidents of Amazon countries met in Bogota, Colombia with Indigenous leaders from eight Amazon nations to approve the Declaration of Bogota, covering more than 2.5 million square miles.",
      "Scientists note the Amazon rainforest functions as a massive carbon sink absorbing more carbon dioxide than it emits, but unchecked deforestation, mining, and agribusiness threaten its collapse and global climate.",
      "Indigenous leaders at the summit pressed for binding protections and a halt to oil projects, while ministers of Amazon nations approved a direct financing mechanism to support Indigenous stewardship.",
      "The summit is set to end with a joint declaration guiding regional environmental policy, after Amazon Cooperation Treaty Organization foreign ministers approved 20 resolutions and emphasized political will as vital, ACTO Secretary-General Martín von Hildebrand said.",
      "Concerns remain that the summit's remote location risks sidelining smaller nations and civil society groups, while Indigenous communities defending territories face growing violence, prompting María José Pinto, Vice President of Ecuador, to urge concrete, locally led actions beyond 'good intentions'."
    ],
    "right": [
      "On Friday, presidents of Amazon countries met in Bogota, Colombia with Indigenous leaders from eight Amazon nations to approve the Declaration of Bogota, covering more than 2.5 million square miles.",
      "Scientists note the Amazon rainforest functions as a massive carbon sink absorbing more carbon dioxide than it emits, but unchecked deforestation, mining, and agribusiness threaten its collapse and global climate.",
      "Indigenous leaders at the summit pressed for binding protections and a halt to oil projects, while ministers of Amazon nations approved a direct financing mechanism to support Indigenous stewardship.",
      "The summit is set to end with a joint declaration guiding regional environmental policy, after Amazon Cooperation Treaty Organization foreign ministers approved 20 resolutions and emphasized political will as vital, ACTO Secretary-General Martín von Hildebrand said.",
      "Concerns remain that the summit's remote location risks sidelining smaller nations and civil society groups, while Indigenous communities defending territories face growing violence, prompting María José Pinto, Vice President of Ecuador, to urge concrete, locally led actions beyond 'good intentions'."
    ]
  },
  "sources": [
    {
      "news_title": "Tropical Gardening: Peru’s grasslands expanding as forests shrink - Hawaii Tribune-Herald",
      "news_link": "https://www.hawaiitribune-herald.com/2025/08/23/features/tropical-gardening-perus-grasslands-expanding-as-forests-shrink/",
      "bias": "Center",
      "text": "Tropical Gardening: Peru’s grasslands expanding as forests shrink\nA group of members of our local palm society along with others from around the tropical world are heading for the Peruvian Amazon.\nWe plan to study what is happening there in regard to forest conservation. I will be there, as well, with Voltaire Moise. We will be gathering photos and information to share when we return.\nADVERTISING\nMost folks don’t realize that Peru’s Amazonian forests are second in size only to Brazil’s Amazon. Unfortunately, agriculture and mining are rapidly destroying the forests. This is what happens to create deserts.\nDesertification is nothing new to the world, but global warming combined with human activities is accelerating this phenomenon. The old saying “Rain follows the forest and desert follows man” is rather depressing, but it doesn’t have to be if we understand how deserts are created and how we can reverse the process.\nThe Amazon forests covered almost twice the size it was when the first Europeans entered the scene. Now, vast grasslands that are prone to fires put more pressure on the remaining forests.\nIt is difficult to do much about another country, but we can learn from mistakes made in other places to make sure we don’t repeat them. Luckily, we live on a relatively big island. Our population is small, and we have a sense of malama aina, so let us focus on our own island and gardens.\nA garden planted with no thought given to dry spells will do well in rainy periods but deteriorates without irrigation in dry periods, even in East Hawaii. Fortunately, many garden plants in Hawaii are fairly hardy when it comes to short water supply, so we have a long list to call upon. It’s important to vegetate these areas so that our islands don’t look like Death Valley in years to come.\nThere are two factors that make these plants able to survive moisture stress.\nFirst, some plants are notably resistant to drought. This quality is centered largely in the cellular structure and has a bearing on the economy with which the plant functions. Some plants have the ability to carry through extended dry periods because of a happy faculty of closing the pores of the leaf against transpiration, or turn the leaf back or edge-on to the sun. Others root deeply to tap any accumulated moisture from sub-soil. Our native Acacia koa is an example.\nThe garden environment is the other critical factor. Water use is a process controlled by energy. The source of that energy is the sun. To move water out of the soil directly or through the plant and away into the atmosphere requires energy. The amount of energy available and the nature of the conducting medium determine how much water will be used in a given time.\nConsider the amount of energy available on a piece of the landscape. The total available is the solar radiation that reaches the earth’s surface, plus the heat in heated air radiation that reaches the earth’s surface by wind. The amount of energy reaching the earth’s surface is limited by the cloud cover and the dust in the atmosphere.\nAir that is heated in another and drier part of the landscape and moves across the area of land in which we have our plants growing also adds heat. The result is a larger amount of water evaporated than we would predict purely on the basis of solar radiation.\nThis is why the more shade and wind protection from trees we have in the garden, the less water is required to keep moisture levels up. And conversely, the more asphalt and concrete to heat up, the more rapidly our planted area dries up, even in high rainfall areas like Hilo.\nIt helps us understand the reason for the common observation that an inch of general rainfall is much more useful and long lasting than an inch of irrigation water.\nIn effect, when we irrigate a small area, we are creating an “oasis.” If we have low, relative humidity and enough wind to move hot air across our irrigated surface, we can have losses of water nearly double that we would expect from direct solar radiation.\nBesides the moisture of the soil and the plant, the nature of the plant itself has considerable effect on the amount of water lost into the air. The height of the plant and the roughness of the surface have an effect on the wind movement and mixing of air across the surface of the vegetation. A rough surface will cause more water loss than a smooth surface.\nThe amount of water conducted away from the soil and the plant surface depends on wind movement, wind speed, temperature of the air, and the vapor pressure or relative humidity of the atmosphere. If water is conducted away very rapidly by rapid wind movement or low relative humidity, we may have high rates of water use.\nPlants that are tolerant of salty beach conditions often use less water than many soft, luxuriant jungle plants because they are streamlined for water conservation. However, plants like the bird of paradise, autograph tree, beach heliotrope, monstera, pothos and naupaka give the luxuriant look and are still drought resistant. Many palms like the date and coconut also have this quality.\nThe overall conditions for a high rate of water use are rapid, air movement, high temperature and a low humidity and bright sun with no cloud cover or shade.\nWhat can we do in managing the soil to take advantage of our knowledge of the factors affecting water use rates? First of all, we can irrigate only when the soil moisture becomes low and plants begin to show evidence of wilt during the hottest part of the day. This forces deep rooting. Daily watering tends to promote shallow roots.\nWe can understand that we will have to irrigate sooner following a previous irrigation than following a general rainfall. And we can provide soil with good physical and chemical properties for deep rooting of plants.\nProper fertilization will help accomplish this. Also, poor soils should be improved with the necessary amendments to help the plants develop good root systems. Addition of well-rotted organic matter or compost often helps increase moisture and nutrient holding capacity.\nIn many Hawaiian soils, available phosphorus is lacking. This is essential to root growth, so addition of this element is particularly important with many plants. Exceptions to this are plants that evolved in low phosphorus soils like macadamia and many others in the protea group.\nThe use of mulches will also help conserve soil moisture.\nProper planning and maintenance of our gardens will help in the short run, but we must do something about the future of the islands, as well. Reforesting some of our Hawaiian grasslands will help restore the rainfall patterns, sequester carbon and supply oxygen. Our forests are the lungs of the planet.\nWe can mitigate global warming just a little bit by planting a tree. The more trees we plant, the better.\nNorman Bezona is professor emeritus, University of Hawaii College of Tropical Agriculture and Human Resources."
    },
    {
      "news_title": "Top officials of Amazon nations meet in Colombia to push joint rainforest protection plan",
      "news_link": "https://apnews.com/article/rainforest-amazon-summit-bogota-indigenous-db565767f1431dd5817d1a7d00f15673",
      "bias": "Lean Left",
      "text": "Top officials of Amazon nations meet in Colombia to push joint rainforest protection plan\nPresidents from South America’s Amazon nations gathered Friday alongside Indigenous leaders to agree on a joint plan to safeguard the world’s largest rainforest — a vast region seen as crucial to slowing global warming.\nBOGOTA, Colombia (AP) — Presidents from South America’s Amazon nations gathered Friday alongside Indigenous leaders to agree on a joint plan to safeguard the world’s largest rainforest — a vast region seen as crucial to slowing global warming.\nGathering in Colombia’s capital of Bogota, the presidents of Colombia, Brazil and Bolivia joined the vice president of Ecuador and other top officials from Amazon nations.\n“There is no individual exit from the climate crisis,” Brazil’s President Luiz Inácio Lula da Silva said during his declaration. “We need a new global governance with the authority to make countries keep their promises.”\nThey signed off on the “Declaration of Bogota,” a political blueprint to be formally adopted by Amazon nations, setting out a common vision for deeper cooperation across the region, which sprawls over more than 2.5 million square miles (6.7 million square kilometers).\nEcuador’s Vice President María José Pinto urged leaders to move beyond “good intentions” to “concrete actions” to protect the Amazon, calling it both the region’s responsibility and its legacy to the world. She said work must be led from the territories, listening to communities and respecting ancestral knowledge, and stressed the rainforest should be central to the global agenda because “what happens here determines the future of everyone.”\n“In Ecuador, we believe solutions are not built from the capitals, but from the territories, listening to and working alongside our people,” Pinto said. “We must keep the Amazon at the center of the global conversation.”\nOn the eve of the gathering, foreign ministers from the eight members of the Amazon Cooperation Treaty Organization — a little-known, decades-old intergovernmental body linking all the countries of the Amazon basin — approved 20 resolutions. They range from a new regional Indigenous Peoples’ Mechanism to initiatives on food security, climate risk and institutional strengthening.\nScientists say the Amazon acts as a massive carbon sink absorbing more carbon dioxide than it releases and plays a key role in regulating rainfall patterns far beyond South America. Its loss could accelerate global warming and disrupt agriculture as far away as the U.S. Midwest and parts of Europe, while threatening the survival of thousands of species found nowhere else on Earth.\nTop officials also met on Thursday to review progress on commitments made at the Belem Declaration, a 2023 agreement signed in Brazil that pledged closer coordination on protecting the Amazon, including policies on deforestation, climate change and Indigenous rights.\nEach ACTO country will appoint two government delegates and two Indigenous delegates to the body, which will meet annually and can convene extraordinary sessions. Decisions must be made unanimously.\nOswaldo Muca, who represents Colombia’s Indigenous Amazon communities, told The Associated Press on the sidelines of Friday’s event that his community is “committed to safeguarding our territory and the Amazon, protecting it and caring for it.” He said they oppose mining and oil exploration because “it destroys our territory, destroys humanity and destroys life.”\nMuca welcomed the ministers’ approval of a direct financing mechanism for Indigenous peoples, calling it “the only way to avoid reaching the point of no return” and noting that “we are now part of that treaty mechanism.”\nAsked if he believed the heads of state would follow through, Muca said they had “talked a lot about saving the Amazon,” but insisted that “our words must be more than political speeches … they must be real, concrete actions.”\nACTO Secretary-General Martín von Hildebrand said that political will and unity among member countries are essential to protecting the basin’s forests, rivers and biodiversity — resources that store vast amounts of carbon and help regulate the planet’s climate.\nPeruvian Indigenous leader Julio Cusurichi, attending the event, said: “We are asking countries to take immediate action because deforestation and pollution are advancing, and the impacts of climate change are severe.”\n___\nThe Associated Press’ climate and environmental coverage receives financial support from multiple private foundations. AP is solely responsible for all content. Find AP’s standards for working with philanthropies, a list of supporters and funded coverage areas at AP.org.\n____\nFollow AP’s coverage of Latin America and the Caribbean at https://apnews.com/hub/latin-america"
    }
  ]
}