{
  "story_id": "GN_20250826_002420_0da6da18",
  "metadata": {
    "title": "Trump says he’ll keep extending TikTok shutdown deadline",
    "timestamp": "2025-08-26T00:24:20.349563",
    "url": "https://ground.news/article/trump-says-hell-keep-extending-tiktok-shutdown-deadline_4e9222"
  },
  "bias_distribution": {
    "total_sources": "70",
    "leaning_left": "11",
    "center": "38",
    "leaning_right": "5"
  },
  "perspective_summaries": {
    "left": [
      "Trump has extended the TikTok shutdown deadline three times, with the next deadline set for September 17.",
      "The first extension occurred on January 20 after a national ban, followed by a second extension in April amid failed negotiations for a U.S.-owned company.",
      "A Pew Research Center survey shows support for a TikTok ban dropped to about one-third, down from 50% in March 2023.",
      "Trump described concerns over TikTok's security and privacy as 'highly overrated' and plans to extend the deadline until a buyer is found."
    ],
    "center": [
      "President Donald Trump has extended the deadline for TikTok's U.S. operations divestment until September 17, delaying a national ban.",
      "This extension follows a 2024 law requiring ByteDance to divest TikTok's U.S. assets, although the administration has delayed enforcement and the spin-off deal collapsed after China withdrew.",
      "Trump said they have American buyers lined up, will monitor security concerns, and plans to extend the deadline until the complex situation resolves.",
      "Trump called privacy and national security concerns about TikTok 'highly overrated' and noted he used TikTok in his campaign and is a fan of the platform.",
      "The ongoing extensions highlight political division, as a recent Pew survey showed about one-third of Americans support a TikTok ban, down from 50% in March 2023."
    ],
    "right": [
      "President Donald Trump has extended the deadline for TikTok's U.S. operations divestment until September 17, delaying a national ban.",
      "This extension follows a 2024 law requiring ByteDance to divest TikTok's U.S. assets, although the administration has delayed enforcement and the spin-off deal collapsed after China withdrew.",
      "Trump said they have American buyers lined up, will monitor security concerns, and plans to extend the deadline until the complex situation resolves.",
      "Trump called privacy and national security concerns about TikTok 'highly overrated' and noted he used TikTok in his campaign and is a fan of the platform.",
      "The ongoing extensions highlight political division, as a recent Pew survey showed about one-third of Americans support a TikTok ban, down from 50% in March 2023."
    ]
  },
  "sources": [
    {
      "news_title": "President Trump says he’ll keep extending TikTok shutdown deadline",
      "news_link": "https://www.chicagotribune.com/2025/08/23/trump-tiktok-shutdown-extension/",
      "bias": "Center",
      "text": "WASHINGTON — President Donald Trump is calling national security and privacy concerns related to TikTok and its Chinese parent company “highly overrated” and said Friday he’ll keep extending the deadline for the popular video-sharing platform until there’s a buyer.\nCongress approved a U.S. ban on TikTok unless its parent company, ByteDance, sold its controlling stake. But Trump has so far extended the deadline three times during his second term — with the next one coming up on Sept. 17.\n“We’re gonna watch the security concerns,” Trump told reporters, but added, “We have buyers, American-buyers,” and “until the complexity of things work out, we just extend a little bit longer.”\nThe first extension was through an executive order on Jan. 20, his first day in office, after the platform went dark briefly when a national ban — approved by Congress and upheld by the U.S. Supreme Court — took effect. The second was in April, when White House officials believed they were nearing a deal to spin off TikTok into a new company with U.S. ownership that fell apart after China backed out following Trump’s tariff announcement.\nHis comments follow the White House starting a TikTok account this week.\n“I used TikTok in the campaign,” Trump said.\n“I’m a fan of TikTok,” he said. “My kids like TikTok. Young people love TikTok. If we could keep it going.”\nAs the extensions continue, it appears less and less likely that TikTok will be banned in the U.S. any time soon. The decision to keep TikTok alive through an executive order has received some scrutiny, but the administration has not faced a legal challenge in court — unlike many of Trump’s other executive orders.\nAmericans are even more closely divided on what to do about TikTok than they were two years ago.\nA recent Pew Research Center survey found that about one-third of Americans said they supported a TikTok ban, down from 50% in March 2023. Roughly one-third said they would oppose a ban, and a similar percentage said they weren’t sure.\nAmong those who said they supported banning the social media platform, about 8 in 10 cited concerns over users’ data security being at risk as a major factor in their decision, according to the report."
    },
    {
      "news_title": "Trump on TikTok: 'We're gonna watch the security concerns' and keep extending deadline until 'things work out'",
      "news_link": "https://fortune.com/2025/08/23/trump-tiktok-deadline-security-concerns/",
      "bias": "Center",
      "text": "President Donald Trump is calling national security and privacy concerns related to TikTok and its Chinese parent company “highly overrated” and said Friday he’ll keep extending the deadline for the popular video-sharing platform until there’s a buyer.\nCongress approved a U.S. ban on TikTok unless its parent company, ByteDance, sold its controlling stake. But Trump has so far extended the deadline three times during his second term — with the next one coming up on Sept. 17.\n“We’re gonna watch the security concerns,” Trump told reporters, but added, “We have buyers, American-buyers,” and “until the complexity of things work out, we just extend a little bit longer.”\nThe first extension was through an executive order on Jan. 20, his first day in office, after the platform went dark briefly when a national ban — approved by Congress and upheld by the U.S. Supreme Court — took effect. The second was in April, when White House officials believed they were nearing a deal to spin off TikTok into a new company with U.S. ownership that fell apart after China backed out following Trump’s tariff announcement.\nHis comments follow the White House starting a TikTok account this week.\n“I used TikTok in the campaign,” Trump said.\n“I’m a fan of TikTok,” he said. “My kids like TikTok. Young people love TikTok. If we could keep it going.”\nAs the extensions continue, it appears less and less likely that TikTok will be banned in the U.S. any time soon. The decision to keep TikTok alive through an executive order has received some scrutiny, but the administration has not faced a legal challenge in court — unlike many of Trump’s other executive orders.\nAmericans are even more closely divided on what to do about TikTok than they were two years ago.\nA recent Pew Research Center survey found that about one-third of Americans said they supported a TikTok ban, down from 50% in March 2023. Roughly one-third said they would oppose a ban, and a similar percentage said they weren’t sure.\nAmong those who said they supported banning the social media platform, about 8 in 10 cited concerns over users’ data security being at risk as a major factor in their decision, according to the report."
    },
    {
      "news_title": "Trump calls TikTok concerns 'overrated'",
      "news_link": "https://buffalonews.com/article_b3f930d5-c940-5734-a1f6-718d9176cca4.html",
      "bias": "Center",
      "text": "Country\nUnited States of America US Virgin Islands United States Minor Outlying Islands Canada Mexico, United Mexican States Bahamas, Commonwealth of the Cuba, Republic of Dominican Republic Haiti, Republic of Jamaica Afghanistan Albania, People's Socialist Republic of Algeria, People's Democratic Republic of American Samoa Andorra, Principality of Angola, Republic of Anguilla Antarctica (the territory South of 60 deg S) Antigua and Barbuda Argentina, Argentine Republic Armenia Aruba Australia, Commonwealth of Austria, Republic of Azerbaijan, Republic of Bahrain, Kingdom of Bangladesh, People's Republic of Barbados Belarus Belgium, Kingdom of Belize Benin, People's Republic of Bermuda Bhutan, Kingdom of Bolivia, Republic of Bosnia and Herzegovina Botswana, Republic of Bouvet Island (Bouvetoya) Brazil, Federative Republic of British Indian Ocean Territory (Chagos Archipelago) British Virgin Islands Brunei Darussalam Bulgaria, People's Republic of Burkina Faso Burundi, Republic of Cambodia, Kingdom of Cameroon, United Republic of Cape Verde, Republic of Cayman Islands Central African Republic Chad, Republic of Chile, Republic of China, People's Republic of Christmas Island Cocos (Keeling) Islands Colombia, Republic of Comoros, Union of the Congo, Democratic Republic of Congo, People's Republic of Cook Islands Costa Rica, Republic of Cote D'Ivoire, Ivory Coast, Republic of the Cyprus, Republic of Czech Republic Denmark, Kingdom of Djibouti, Republic of Dominica, Commonwealth of Ecuador, Republic of Egypt, Arab Republic of El Salvador, Republic of Equatorial Guinea, Republic of Eritrea Estonia Ethiopia Faeroe Islands Falkland Islands (Malvinas) Fiji, Republic of the Fiji Islands Finland, Republic of France, French Republic French Guiana French Polynesia French Southern Territories Gabon, Gabonese Republic Gambia, Republic of the Georgia Germany Ghana, Republic of Gibraltar Greece, Hellenic Republic Greenland Grenada Guadaloupe Guam Guatemala, Republic of Guinea, Revolutionary\nPeople's Rep'c of Guinea-Bissau, Republic of Guyana, Republic of Heard and McDonald Islands Holy See (Vatican City State) Honduras, Republic of Hong Kong, Special Administrative Region of China Hrvatska (Croatia) Hungary, Hungarian People's Republic Iceland, Republic of India, Republic of Indonesia, Republic of Iran, Islamic Republic of Iraq, Republic of Ireland Israel, State of Italy, Italian Republic Japan Jordan, Hashemite Kingdom of Kazakhstan, Republic of Kenya, Republic of Kiribati, Republic of Korea, Democratic People's Republic of Korea, Republic of Kuwait, State of Kyrgyz Republic Lao People's Democratic Republic Latvia Lebanon, Lebanese Republic Lesotho, Kingdom of Liberia, Republic of Libyan Arab Jamahiriya Liechtenstein, Principality of Lithuania Luxembourg, Grand Duchy of Macao, Special Administrative Region of China Macedonia, the former Yugoslav Republic of Madagascar, Republic of Malawi, Republic of Malaysia Maldives, Republic of Mali, Republic of Malta, Republic of Marshall Islands Martinique Mauritania, Islamic Republic of Mauritius Mayotte Micronesia, Federated States of Moldova, Republic of Monaco, Principality of Mongolia, Mongolian People's Republic Montserrat Morocco, Kingdom of Mozambique, People's Republic of Myanmar Namibia Nauru, Republic of Nepal, Kingdom of Netherlands Antilles Netherlands, Kingdom of the New Caledonia New Zealand Nicaragua, Republic of Niger, Republic of the Nigeria, Federal Republic of Niue, Republic of Norfolk Island Northern Mariana Islands Norway, Kingdom of Oman, Sultanate of Pakistan, Islamic Republic of Palau Palestinian Territory, Occupied Panama, Republic of Papua New Guinea Paraguay, Republic of Peru, Republic of Philippines, Republic of the Pitcairn Island Poland, Polish People's Republic Portugal, Portuguese Republic Puerto Rico Qatar, State of Reunion Romania, Socialist Republic of Russian Federation Rwanda, Rwandese Republic Samoa, Independent State of San Marino, Republic of Sao Tome and Principe, Democratic Republic of Saudi Arabia, Kingdom of Senegal, Republic of Serbia and Montenegro Seychelles, Republic of Sierra Leone, Republic of Singapore, Republic of Slovakia (Slovak Republic) Slovenia Solomon Islands Somalia, Somali Republic South Africa, Republic of South Georgia and the South Sandwich Islands Spain, Spanish State Sri Lanka, Democratic Socialist Republic of St. Helena St. Kitts and Nevis St. Lucia St. Pierre and Miquelon St. Vincent and the Grenadines Sudan, Democratic Republic of the Suriname, Republic of Svalbard & Jan Mayen Islands Swaziland, Kingdom of Sweden, Kingdom of Switzerland, Swiss Confederation Syrian Arab Republic Taiwan, Province of China Tajikistan Tanzania, United Republic of Thailand, Kingdom of Timor-Leste, Democratic Republic of Togo, Togolese Republic Tokelau (Tokelau Islands) Tonga, Kingdom of Trinidad and Tobago, Republic of Tunisia, Republic of Turkey, Republic of Turkmenistan Turks and Caicos Islands Tuvalu Uganda, Republic of Ukraine United Arab Emirates United Kingdom of Great Britain & N. Ireland Uruguay, Eastern Republic of Uzbekistan Vanuatu Venezuela, Bolivarian Republic of Viet Nam, Socialist Republic of Wallis and Futuna Islands Western Sahara Yemen Zambia, Republic of Zimbabwe"
    },
    {
      "news_title": "Ticker: Trump says he’ll keep extending TikTok shutdown deadline; Cracker Barrel unveils a new logo",
      "news_link": "https://www.bostonherald.com/2025/08/22/ticker-trump-says-hell-keep-extending-tiktok-shutdown-deadline-cracker-barrel-unveils-a-new-logo/",
      "bias": "Lean Right",
      "text": "President Donald Trump is calling national security and privacy concerns related to TikTok and its Chinese parent company “highly overrated” and said Friday he’ll keep extending the deadline for the popular video-sharing platform until there’s a buyer.\nCongress approved a U.S. ban on TikTok unless its parent company, ByteDance, sold its controlling stake. But Trump has so far extended the deadline three times during his second term — with the next one coming up on Sept. 17.\n“We’re gonna watch the security concerns,” Trump told reporters, but added, “We have buyers, American-buyers,” and “until the complexity of things work out, we just extend a little bit longer.”\nCracker Barrel unveils a new logo\nCracker Barrel is marching forward with an ongoing makeover. And to the dismay of some fans, the chain’s new logo now ditches the barrel itself.\nOr rather, the drawing many have associated with Cracker Barrel over the years. The man leaning on that barrel is also gone, as are the words “Old Country Store.” Instead, the new emblem features a simpler design with just “Cracker Barrel” written on a gold background, which also has a semi-updated shape.\n“Anchored in Cracker Barrel’s signature gold and brown tones, the updated visuals will appear across menus and marketing collateral,” the Tennessee-based company wrote in a Tuesday announcement. Cracker Barrel added that its logo is “now rooted even more closely to the iconic barrel shape and word mark that started it all.”"
    },
    {
      "news_title": "Trump says he may extend TikTok ban deadline again",
      "news_link": "https://thehill.com/policy/technology/5465871-tiktok-divestment-deadline-extension/",
      "bias": "Center",
      "text": null
    },
    {
      "news_title": "Trump says he’ll keep extending TikTok shutdown deadline",
      "news_link": "https://apnews.com/article/trump-tiktok-china-extension-deadline-4a66fbd0e485db5b3da83c176f22ad11",
      "bias": "Lean Left",
      "text": "Trump says he’ll keep extending TikTok shutdown deadline\nTrump says he’ll keep extending TikTok shutdown deadline\nWASHINGTON (AP) — President Donald Trump is calling national security and privacy concerns related to TikTok and its Chinese parent company “highly overrated” and said Friday he’ll keep extending the deadline for the popular video-sharing platform until there’s a buyer.\nCongress approved a U.S. ban on TikTok unless its parent company, ByteDance, sold its controlling stake. But Trump has so far extended the deadline three times during his second term — with the next one coming up on Sept. 17.\n“We’re gonna watch the security concerns,” Trump told reporters, but added, “We have buyers, American-buyers,” and “until the complexity of things work out, we just extend a little bit longer.”\nThe first extension was through an executive order on Jan. 20, his first day in office, after the platform went dark briefly when a national ban — approved by Congress and upheld by the U.S. Supreme Court — took effect. The second was in April, when White House officials believed they were nearing a deal to spin off TikTok into a new company with U.S. ownership that fell apart after China backed out following Trump’s tariff announcement.\nHis comments follow the White House starting a TikTok account this week.\n“I used TikTok in the campaign,” Trump said.\n“I’m a fan of TikTok,” he said. “My kids like TikTok. Young people love TikTok. If we could keep it going.”\nAs the extensions continue, it appears less and less likely that TikTok will be banned in the U.S. any time soon. The decision to keep TikTok alive through an executive order has received some scrutiny, but the administration has not faced a legal challenge in court — unlike many of Trump’s other executive orders.\nAmericans are even more closely divided on what to do about TikTok than they were two years ago.\nA recent Pew Research Center survey found that about one-third of Americans said they supported a TikTok ban, down from 50% in March 2023. Roughly one-third said they would oppose a ban, and a similar percentage said they weren’t sure.\nAmong those who said they supported banning the social media platform, about 8 in 10 cited concerns over users’ data security being at risk as a major factor in their decision, according to the report."
    },
    {
      "news_title": "After joining TikTok, Trump says he could extend sale deadline if needed",
      "news_link": "https://gazette.com/news/us-world/after-joining-tiktok-trump-says-he-could-extend-sale-deadline-if-needed/article_36f84ff6-b4e2-5d21-8015-4f8403a14957.html",
      "bias": "Center",
      "text": "WASHINGTON (Reuters) -President Donald Trump has U.S. buyers lined up for TikTok and could further extend the deadline for China-based ByteDance to divest the app's U.S. assets, he said on Friday, days after the White House joined the short video platform.\nSpeaking to reporters, Trump dismissed bipartisan security concerns over TikTok, saying his administration would watch for any problems. He said he would talk to Chinese President Xi Jinping \"at the right time.\"\nThe Republican president has repeatedly opted not to enforce the deadline following passage of a 2024 law requiring that TikTok stop operating by January 19 of this year. He recently pushed the deadline to September 17.\nThe White House joined the app on Tuesday.\n\"I haven't spoken to President Xi about it,\" Trump told reporters during a visit to a White House gift shop across the street from the presidential residence. \"In the meantime, until the complexity of things work out, we just extend a little bit longer.\"\n\"We have very substantial American buyers that want to buy it,\" he added, without naming any individuals or companies.\nAsked if he was concerned about privacy or national security, Trump said: \"I'm really not. I think it's highly overrated ... I'm a fan of TikTok.\"\nLast year's law requires ByteDance to divest of the app's U.S. assets or demonstrate significant progress toward a sale. Trump opted not to enforce it after taking office on January 20.\nSome lawmakers have criticized the delay, arguing his administration is flouting the law and ignoring national security concerns related to Chinese control over TikTok.\n(Reporting by Trevor Hunnicutt, Andrea Shalal and Katharine Jackson; Writing by Susan Heavey; Editing by Joe Bavier)"
    },
    {
      "news_title": "Top News Headlines of August 22, 2025 | Trump administration accuses George Mason University of illegally using race in faculty hiring",
      "news_link": "https://indianexpress.com/article/india/latest-news-today-live-updates-world-india-cities-news-delhi-mumbai-bengaluru-08-22-2025-news-headlines-10203970/",
      "bias": "Lean Left",
      "text": null
    },
    {
      "news_title": "Trump on TikTok: ‘We’re gonna watch the security concerns’ and keep extending deadline until ‘things work out’",
      "news_link": "https://www.philstockworld.com/2025/08/23/trump-on-tiktok-were-gonna-watch-the-security-concerns-and-keep-extending-deadline-until-things-work-out/",
      "bias": "unknown",
      "text": "HomeMarkets Markets Trump on TikTok: ‘We’re gonna watch the security concerns’ and keep extending deadline until ‘things work out’ By news August 23, 2025 0 263 FacebookTwitterPinterestWhatsApp President Donald Trump is calling national security and privacy concerns related to TikTok and its Chinese parent company “highly overrated” and said …This post was originally published on this site Share FacebookTwitterPinterestWhatsApp Subscribe Login Notify of new follow-up comments new replies to my comments Please login to comment 0 Comments Inline Feedbacks View all comments Stay Connected150,493FansLike396,312FollowersFollow2,400SubscribersSubscribe Latest Articles Markets Monday Market Movement – Heading into the Final Third of 2025 Markets Rates Updates Markets The Bolton Raid Feels Like a Warning Markets Trump’s National Security Purge Continues (shared) Energy Inside Putin’s Fossil-Fueled Victory Lap in Alaska Markets Netanyahu remains unmoved by Israel’s lurch toward pariah status − but at home and abroad, Israelis are suffering the consequences Market News Free VPN apps found to have ties with Russia and China – and they’re hiding in Google and Apple’s app stores Markets The ‘security guarantee’ paradox: Too weak and it won’t protect Ukraine; too robust and Russia won’t accept it Markets Hegseth fires general whose agency’s intel assessment of damage from Iran strikes angered Trump Markets Nobody Likes John Bolton Markets Search of Bolton’s Home Shows Uneasy Mix of Retribution and Law Enforcement Markets Why Powell’s Jackson Hole Speech Suggests a US Interest Rate Cut is On the Way Markets Why a new ‘iron curtain’ is being built across Europe. This time it’s to keep Russia out Markets FBI Raids John Bolton’s Home in Apparent Act of ‘Political Retribution’ for Trump Criticism Load more"
    },
    {
      "news_title": "Trump May Extend TikTok Sale Deadline - Khaama Press",
      "news_link": "https://www.khaama.com/trump-may-extend-tiktok-sale-deadline/",
      "bias": "unknown",
      "text": "President Trump said U.S. concerns over TikTok are exaggerated and suggested he may extend ByteDance’s deadline to sell its American assets, despite lawmakers’ security warnings.\nPresident Donald Trump has signaled he may extend the deadline for Chinese tech giant ByteDance to divest its TikTok assets in the United States.\nSpeaking to reporters on August 22, Trump downplayed national security fears surrounding the app, saying concerns had been “exaggerated” but insisted his administration was monitoring potential risks closely.\nHe added that he intends to discuss the issue with Chinese President Xi Jinping “at the appropriate time,” suggesting the matter could feature in broader U.S.-China negotiations.\nThe current deadline for ByteDance to either sell or restructure its U.S. holdings has already been postponed until September 17. Trump noted there are “significant American buyers” interested in TikTok, though he declined to name them.\nLast year’s legislation requires ByteDance to divest its U.S. operations or show clear progress toward a sale. However, Trump has repeatedly delayed implementation since taking office, citing diplomatic considerations and economic factors.\nThe debate reflects growing tension in Washington over Chinese ownership of TikTok. While some lawmakers argue that extending the deadline ignores mounting national security concerns, Trump insists a more measured approach is needed to avoid unnecessary disruption.\nAnalysts say Trump’s latest comments highlight the delicate balancing act between safeguarding digital security and maintaining stable economic ties with Beijing. The outcome could reshape both TikTok’s future in the U.S. and the broader trajectory of U.S.-China tech relations."
    },
    {
      "news_title": "Trump Suggests Possible Extension For TikTok Sale Deadline - Pakistan Live News",
      "news_link": "https://pakistanlivenews.com/trump-suggests-possible-extension-for-tiktok-sale-deadline/",
      "bias": "unknown",
      "text": "Just days after the White House joined TikTok, US President Donald Trump on Friday indicated that he may extend the deadline for China-based ByteDance to sell its US assets and said that American buyers are ready to acquire it.\nSpeaking to reporters, Trump dismissed bipartisan security concerns over TikTok, saying his administration would watch for any problems. He said he would talk to Chinese President Xi Jinping “at the right time.”\nThe Republican president has repeatedly opted not to enforce the deadline following passage of a 2024 law requiring that TikTok stop operating by January 19 of this year. He recently pushed the deadline to September 17.\nThe White House joined the app on Tuesday.\n“I haven’t spoken to President Xi about it,” Trump told reporters during a visit to a White House gift shop across the street from the presidential residence. “In the meantime, until the complexity of things work out, we just extend a little bit longer.”\n“We have very substantial American buyers that want to buy it,” he added, without naming any individuals or companies.\nAsked if he was concerned about privacy or national security, Trump said: “I’m really not. I think it’s highly overrated … I’m a fan of TikTok.”\nLast year’s law requires ByteDance to divest of the app’s US assets or demonstrate significant progress toward a sale. Trump opted not to enforce it after taking office on January 20.\nSome lawmakers have criticised the delay, arguing his administration is flouting the law and ignoring national security concerns related to Chinese control over TikTok."
    },
    {
      "news_title": "Trump to keep extending TikTok shutdown deadline",
      "news_link": "https://sjvsun.com/u-s/trump-to-keep-extending-tiktok-shutdown-deadline/",
      "bias": "unknown",
      "text": "President Donald Trump stated he will keep extending the TikTok shutdown deadline until a buyer with American ownership is secured for the Chinese-owned app.\nTrump described the national security and privacy concerns linked to TikTok and its parent company ByteDance as “highly overrated.”\nDriving the news: Congress passed a law to ban TikTok unless ByteDance sells its controlling stake, but Trump has already extended the deadline three times during his second term. The next extension deadline is set for September 17.\n- The first extension was issued via executive order on January 20, the first day of Trump’s second term, following a brief TikTok shutdown under a national ban upheld by the Supreme Court.\n- The second extension happened in April when White House officials expected a deal to spin off TikTok to U.S. ownership; however, China backed out after Trump announced tariffs.\nGo deeper: The White House recently launched its own TikTok account, with Trump expressing positive personal sentiments, stating he used TikTok during his campaign and that young people, including his own children, enjoy the platform.\n- Public opinion on TikTok remains deeply split; a Pew Research Center survey found about one-third of Americans support banning the app, down from 50% in early 2023, with data security concerns driving most supporters of a ban.\n- No legal challenges have yet been brought against the executive orders extending TikTok’s operation, unlike other Trump administration directives."
    }
  ]
}