{
  "story_id": "GN_20250825_221748_725c44c9",
  "metadata": {
    "title": "Barcelona mayor barred from Israel after decision to cut ties with Tel Aviv",
    "timestamp": "2025-08-25T22:17:48.854205",
    "url": "https://ground.news/article/after-promoting-boycott-measures-the-population-authority-blocked-the-entry-of-the-mayor-of-barcelona-to-israel"
  },
  "bias_distribution": {
    "total_sources": "37",
    "leaning_left": "7",
    "center": "1",
    "leaning_right": "5"
  },
  "perspective_summaries": {
    "left": [
      "Israel denied Barcelona Mayor Jaume Collboni entry, accusing him of defaming Tel Aviv, according to the Population and Immigration Authority.",
      "Barcelona's city council suspended ties with Tel Aviv-Jaffa, demanding that Palestinian rights are respected and that international law is upheld.",
      "Turkiye mandated that shipping agents confirm vessels have no Israeli links, enforcing new trade restrictions.",
      "President Recep Tayyip Erdogan's government accused Israel of committing genocide against Palestinians, a claim that Israel rejects."
    ],
    "center": [
      "Israel denied Barcelona Mayor Jaume Collboni entry, accusing him of defaming Tel Aviv, according to the Population and Immigration Authority.",
      "Barcelona's city council suspended ties with Tel Aviv-Jaffa, demanding that Palestinian rights are respected and that international law is upheld.",
      "Turkiye mandated that shipping agents confirm vessels have no Israeli links, enforcing new trade restrictions.",
      "President Recep Tayyip Erdogan's government accused Israel of committing genocide against Palestinians, a claim that Israel rejects."
    ],
    "right": [
      "Barcelona Mayor Jaume Collboni's request to enter Israel was rejected.",
      "This decision follows Collboni's harsh statements against Israel and the city's announcement to sever ties with the State of Israel.",
      "The Barcelona City Council decided to freeze the sister city agreement with Tel Aviv, which was signed in 1998.",
      "The Population and Immigration Authority stated that the refusal aligns with the Entry to Israel Law."
    ]
  },
  "sources": [
    {
      "news_title": "After Cutting Ties Over Gaza Genocide, Barcelona Mayor Banned from Entering Israel - Quds News Network",
      "news_link": "https://qudsnen.co/after-cutting-ties-over-gaza-genocide-barcelona-mayor-banned-from-entering-israel/",
      "bias": "Lean Left",
      "text": "After Cutting Ties Over Gaza Genocide, Barcelona Mayor Banned from Entering Israel\nOccupied Palestine (Quds News Network)- Barcelona Mayor Jaume Collboni has been barred from entering Israel, following the city’s decision to cut ties over the ongoing genocide in Gaza.\nAccording to Israeli media, citing the Population Immigration and Border Authority announced on Friday, Collboni had been slated to land in Israel late Friday night, but was informed that he would not be granted entry.\nIt said that his entry refusal is “in accordance with the Entry into Israel Law” and in coordination with the Foreign Ministry and the National Security Council, without elaborating further.\nAccording to the ARA newspaper in the Spanish city, he had been invited by the mayors of Bethlehem and Ramallah and had been planning to visit Palestinian cities in the West Bank.\nIn May, Barcelona’s city council voted to cut institutional ties with Israel and suspend its friendship agreement with Tel Aviv city, citing violations of international law and the rights of Palestinians amid the genocide in Gaza.\nCollboni said at the time that “the suffering and death in Gaza over the past year and a half, and recent attacks by the Israeli government, make any relationship unviable.”\nThis was not the first time Barcelona has taken a stand against the occupation state.\nIn February 2023, former mayor Ada Colau suspended ties with Israel. The move aligns with Spain’s increasingly critical stance toward Israel and its genocide in Gaza under Prime Minister Pedro Sánchez. On May 28, 2024, Spain officially recognized the State of Palestine, along with Ireland and Norway.\nIsrael has blocked several foreign officials in recent months from entering, citing pro-Palestine and anti-genocide statements.\nIn April, Israel barred a group of 27 left-wing French lawmakers from entering amidst diplomatic tensions after President Emmanuel Macron said France would soon recognise a Palestinian state and condemnations over Israel’s blockade on aid entering Gaza.\nIn February, Israel also stopped two left-wing European parliament deputies, Franco-Palestinian Rima Hassan and Lynn Boylan from Ireland, from entering due to their pro-Palestine position. In June, Hassan tried to break Israel’s blockade on the Gaza Strip and was kidnapped by Israeli forces and deported."
    },
    {
      "news_title": "Barcelona mayor barred from Israel after decision to cut ties with Tel Aviv",
      "news_link": "https://www.aa.com.tr/en/europe/barcelona-mayor-barred-from-israel-after-decision-to-cut-ties-with-tel-aviv/3666332",
      "bias": "Right",
      "text": "Barcelona mayor barred from Israel after decision to cut ties with Tel Aviv\nMany Western officials, activists denied entry to country over criticizing Israeli atrocities against civilians in Gaza Strip\nJERUSALEM/ISTANBUL\nThe mayor of Barcelona was denied entry to Israel ahead of a planned visit, after the Spanish city’s decision to cut ties with Tel Aviv over Israel's genocidal war in the Gaza Strip, local media said on Friday.\nAccording to the daily Yedioth Ahronoth, the Interior Ministry announced that Mayor Jaume Collboni, who had been scheduled to arrive in Israel Friday night, was barred from entry.\n“The denial comes following several recent statements by the mayor against Israel, and after the city council passed a resolution in May to sever ties with Israel,” the daily said.\nThe city council’s decision came in response to Israeli war crimes committed against civilians in the Gaza Strip, a year after Spain's recognition of the Palestinian state in May 2024.\nAccording to Israel’s Channel 12, Collboni was set to visit Yad Vashem, a museum in East Jerusalem, and meet the officials from the Palestinian Authority.\nIn recent months, Israel has banned the entry of many Western officials and activists showing solidarity with Palestinians and criticizing Israeli military actions in the Gaza Strip.\nIsrael has killed more than 62,100 Palestinians in Gaza since October 2023. The military campaign has devastated the enclave, which is facing famine.\nLast November, the International Criminal Court issued arrest warrants for Israeli Prime Minister Benjamin Netanyahu and his former Defense Minister Yoav Gallant for war crimes and crimes against humanity in Gaza.\nIsrael also faces a genocide case at the International Court of Justice for its war on the enclave.\nAnadolu Agency website contains only a portion of the news stories offered to subscribers in the AA News Broadcasting System (HAS), and in summarized form. Please contact us for subscription options."
    },
    {
      "news_title": "Israel bars entry to Barcelona mayor",
      "news_link": "https://www.clevelandjewishnews.com/jns/israel-bars-entry-to-barcelona-mayor/article_6ced2033-1d86-50e6-ad87-1c583ba382d6.html",
      "bias": "Lean Right",
      "text": null
    },
    {
      "news_title": "Israel bars Barcelona mayor over Gaza stance",
      "news_link": "https://shafaq.com/en/Middle-East/Israel-bars-Barcelona-mayor-over-Gaza-stance",
      "bias": "Left",
      "text": "Israel bars Barcelona mayor over Gaza stance\nShafaq News – Barcelona / Ankara\nIsrael barred Barcelona Mayor Jaume Collboni from entering it Friday night, accusing him of “defaming” Tel Aviv, the Population and Immigration Authority announced.\nOfficials said his visa request was denied due to his participation in a boycott campaign. Earlier this year, Barcelona’s city council suspended ties with Tel Aviv-Jaffa, freezing cooperation until “Palestinian rights are respected” and “international law is upheld.”\nSpain, alongside Ireland, has led criticism of Israel’s war in Gaza, pressing the European Union to suspend its trade pact with Israel—a push Germany has repeatedly vetoed. In May 2024, Spain, Ireland, and Norway officially recognized a Palestinian state, while France and Saudi Arabia launched parallel diplomatic efforts to build broader international support.\nSeparately, Turkiye has expanded trade restrictions on Israel. Port officials told The Jerusalem Post that Turkish authorities now require shipping agents to provide written guarantees confirming vessels have no Israeli connections and are not carrying banned cargo such as weapons, explosives, or radioactive material.\nThough not codified in a formal circular, the sources noted, the order is being enforced verbally by harbor masters nationwide. Ships arriving from or bound for Israel are reportedly barred from docking at Turkish ports, including the industrial hub of Kocaeli. Turkish-flagged vessels will also be prohibited from entering Israeli ports.\nThe measures escalate Ankara’s suspension of $7 billion in bilateral trade imposed last year over the Gaza war. President Recep Tayyip Erdogan’s government, a NATO member, has repeatedly accused Israel of committing “genocide against Palestinians,” a charge Israel rejects."
    },
    {
      "news_title": "Barcelona mayor denied entry into Israel after city's May decision to cut ties",
      "news_link": "https://www.haaretz.com/israel-news/2025-08-22/ty-article/.premium/barcelona-mayor-denied-entry-into-israel-after-citys-may-decision-to-cut-ties/00000198-d102-d1e9-abf9-db76468f0000",
      "bias": "Lean Left",
      "text": "Barcelona Mayor Denied Entry Into Israel After City's May Decision to Cut Official Ties\nBarcelona's Mayor Jaume Collboni, due to land in Israel late on Friday night, was denied entry into the country, Israel's Population and Immigration Authority said on Friday."
    },
    {
      "news_title": "Israel denies Barcelona mayor's entry request",
      "news_link": "https://www.israelnationalnews.com/news/413696",
      "bias": "Lean Right",
      "text": null
    },
    {
      "news_title": "After severing ties, Israel denies entry to Barcelona mayor",
      "news_link": "https://www.ynetnews.com/article/hj3q42skex",
      "bias": "Lean Left",
      "text": "Israel barred Barcelona Mayor Jaume Collboni from entering the country on Friday, two months after his city council severed all ties with the Israeli government and ended its twin-city relationship with Tel Aviv.\nCollboni, set to visit Yad Vashem and the Palestinian Authority, canceled his trip after the rejection. His entry request via the ETA system, which pre-screens travel from visa-exempt countries, was denied due to his anti-Israel statements, a decision made by the Population and Immigration Authority, acting Interior Minister Yariv Levin, Foreign Minister Gideon Sa’ar and National Security Council head Tzachi Hanegbi.\nIn late May, Collboni’s Socialist-led council voted to cut “all institutional ties with the current Israeli government until human rights in Gaza are respected,” reversing his own September 2024 decision to restore Tel Aviv ties, which had been severed by his predecessor Ada Colau.\nThe council’s move included economic steps to block cooperation with companies linked to Israel, as identified by the UN for alleged illegal operations in territories harming Palestinian rights, economy, society and culture. It also directed the Fira de Barcelona trade fair to exclude Israeli pavilions and urged Barcelona’s port to deny docking to ships carrying arms to Israel.\nThe decision aligns with Spain’s stance among 21 nations condemning Israel’s approval of the E1 plan in Ma’ale Adumim, which disrupts Palestinian territorial continuity between Ramallah and Bethlehem and was once dubbed a “death knell” for a Palestinian state."
    },
    {
      "news_title": "Israel denies entry to Barcelona mayor over anti-occupation statements - Egypt Independent",
      "news_link": "https://www.egyptindependent.com/israel-denies-entry-to-barcelona-mayor-over-anti-occupation-statements/",
      "bias": "unknown",
      "text": "The Israeli occupation has prevented Jaume Collboni, the mayor of Barcelona, Spain, from entering Israel due to his earlier statements against the occupation, according to a report by the Times of Israel.\nCollboni was scheduled to arrive in Israel tonight but was informed at the last minute of the decision by the Israeli Population and Immigration Authority to deny him entry. He had planned to visit the Yad Vashem complex and hold meetings with the Palestinian Authority.\nThe Israeli move follows recent statements made by Collboni against Israel and comes about three months after the Barcelona City Council decided to cut ties with Israel and suspend a friendship agreement with Tel Aviv due to the “aggression and genocidal war in Gaza.”\nCollboni was quoted at the time as saying, “The suffering and death in Gaza over the past year and a half, and the recent attacks launched by the Israeli government, make any relationship unsustainable.”"
    }
  ]
}