{
  "story_id": "GN_20250826_000159_46cff098",
  "metadata": {
    "title": "Alaska medical board approves draft to discipline providers of gender-affirming care for youth",
    "timestamp": "2025-08-26T00:01:59.789778",
    "url": "https://ground.news/article/alaska-medical-board-approves-draft-to-discipline-providers-of-gender-affirming-care-for-youth"
  },
  "bias_distribution": {
    "total_sources": "28",
    "leaning_left": "15",
    "center": "7",
    "leaning_right": "3"
  },
  "perspective_summaries": {
    "left": [
      "Alaska medical professionals may face disciplinary action for providing gender-affirming care to youth, following proposed regulation changes approved by the state medical board.",
      "The board unanimously agreed to amend regulations to classify gender-affirming care as unprofessional conduct.",
      "Katherine Easley stated that none of the board doctors provide transgender care.",
      "Major medical groups advocate for access to gender-affirming treatment, stating it is essential for those experiencing gender dysphoria."
    ],
    "center": [
      "The Alaska State Medical Board unanimously approved draft language classifying gender-affirming medical or surgical care for minors as unprofessional conduct, with review set for Aug. 22, 2025.",
      "After lawmakers failed to act on a March request, the Alaska State Medical Board sent a letter urging limits on gender-affirming care for minors and moved to draft regulations led by Matt Heilala, Anchorage podiatrist and board member.",
      "The draft language expands unprofessional conduct to include puberty blockers and surgeries for minors, exempts congenital sex development disorder treatments, and will go to the State Department of Law before a 30-day public comment period.",
      "If adopted, practitioners may face sanctions including license revocation, and medical students and physicians warned this could deter clinicians and harm Alaska's physician workforce and access to care.",
      "The board's move reflects a broader trend in other states, where more than half have limited gender-affirming care, and the rulemaking process can take months including further meetings and oral comments."
    ],
    "right": [
      "The Alaska State Medical Board unanimously approved draft language classifying gender-affirming medical or surgical care for minors as unprofessional conduct, with review set for Aug. 22, 2025.",
      "After lawmakers failed to act on a March request, the Alaska State Medical Board sent a letter urging limits on gender-affirming care for minors and moved to draft regulations led by Matt Heilala, Anchorage podiatrist and board member.",
      "The draft language expands unprofessional conduct to include puberty blockers and surgeries for minors, exempts congenital sex development disorder treatments, and will go to the State Department of Law before a 30-day public comment period.",
      "If adopted, practitioners may face sanctions including license revocation, and medical students and physicians warned this could deter clinicians and harm Alaska's physician workforce and access to care.",
      "The board's move reflects a broader trend in other states, where more than half have limited gender-affirming care, and the rulemaking process can take months including further meetings and oral comments."
    ]
  },
  "sources": [
    {
      "news_title": "Alaska Medical Board moves to ban transgender tinkering on children",
      "news_link": "https://mustreadalaska.com/alaska-medical-board-moves-to-ban-transgender-tinkering-on-children/",
      "bias": "Right",
      "text": "The Alaska State Medical Board has released a draft regulation that, for the first time, formally defines boys as male and girls as female based on their biological sex at birth, and prohibits doctors from providing medical interventions that attempt to alter that reality in patients under 18\nThe Board has released a draft regulation that would bar physicians from performing transgender medical interventions on anyone under the age of 18, formally classifying such procedures as “unprofessional conduct” that would be subject to disciplinary action.\nThe board also approved a short statement that says abortions performed just prior to delivery are typically unethical. Alaska law currently allows abortion up to the moment of birth.\n“Alaska state law allows for elective late term abortions, up until the time of delivery,” the board’s statement reads. “The Alaska State Medical Board believes this is not ethical medical practice and does not embody the values of Alaskans. Many Alaskans and even physicians are unaware of this. We encourage Alaskans to engage with their representatives and to advocate for new legislation to bring state law into alignment with community values on this issue.”\nThe proposed rule relating to the chemical and surgical mutilation of children falls under the regulation 12 AAC 40.967 – Unprofessional Conduct, the section of state regulation that sets the standards for medical licensure in Alaska. The draft adds a new subsection, number 36, that specifically addresses medical treatments related to gender identity in minors.\nThe regulation states that “providing medical or surgical intervention to treat gender dysphoria or facilitate gender transition by altering sex characteristics inconsistent with the biological sex at birth” would constitute a violation. It lists as examples puberty blockers, cross-sex hormones, mastectomy, phalloplasty, and genital modification procedures.\nTwo exceptions are included in the draft. Physicians would not be subject to discipline if providing treatment for congenital sex development disorders, sometimes referred to as intersex conditions, or if performing non-elective procedures required as a result of physical injury.\nThe board also introduces new definitions to clarify its intent. “Biological sex” is defined as “the male or female designation based on chromosomes, gonads, hormones, and genitals at birth, irrespective of psychological identity.” “Gender transition” is defined as “any process to align sex characteristics with a gender identity different from biological sex.”\nBy inserting the prohibition into the “unprofessional conduct” section, the medical board would gain authority to discipline licensees who engage in such practices, up to and including suspension or revocation of a medical license.\nThe draft rules are subject to the state’s regulatory process, which includes a public comment period before any final adoption. Once comments are received and reviewed, the board may make revisions before sending the regulation for final approval and implementation.\nIf adopted, the policy would put limits on what has become a profit center for some doctors — the gender mutilation of children and forcing them into a life of chemical dependency.\nEarlier this year the medical board unanimously adopted a statement urging the Alaska Legislature to outlaw chemical castration and surgical gender transition treatments for minors, but the Alaska Legislature is controlled by Democrats and a few enabling Republicans who refused to act.\nIn June, the US Supreme Court sided with Tennessee’s law that bans medical treatments for minors whose parents are seeking gender transitions. The court said that such laws do not automatically violate the Constitution’s Equal Protection Clause. The change to the regulation in Alaska would likely be challenged by the ACLU in state court, with pro-mutilation advocates claiming that such a prohibition violates the Alaska State Constitution’s privacy clause.\nThank God! Hope that this ‘return to sanity’ continues everywhere. Leave our children out of your radical madness, and get treatment yourselves!\nWho ever thought that this was a good idea in the first place should’ve been arrested!!! It’s called child abuse.\nListen carefully voters!\n“The Alaska Legislature is controlled by Democrats and a few ENABLING Republicans who refused to act.”\nWake up and start paying attention to the voting record of your candidate who claims to be a true republican conservative but actually nothing more than a wolf in sheep’s clothing.\nJosh Revak caught speeding with his beer drinking buddy Scott Kawasaki on the sterling hiway on their way to a party was a wake up call. That was not crossing the isle to “work with fellow members”.\nThis introductory paragraph illustrates the extent of degradation of our society and lack of both professionalism and attachment to reality of what we call “doctors”.\nWe are living through an age of utter depravity, ignorance, making a mockery of science and basic reality.\nThe level of dysfunctional selfishness prevelant throughout society that led to an accepted human condition that exterminating children in the womb or after birth and mutilating their bodies and minds is normal.\nIt is very encouraging the board is taking the first steps to address this, and there is a long way to go.\nSubsection 36 is necessary because Democrats still don’t understand basic biology. A penis is not a vagina. A mouth is not an *ss. Hello.\nAnyone who thinks a man can be a woman is mentally ill all day long. Period.\nUnfortunately, the Governor stopped any regulation projects by executive order in May. Yet he issued a diametrically opposite executive order earlier in August requiring every department, division, board and commission to eliminate 15-25% of existing regulations. But, at this point, the state employees are still banned from working on regulation projects. They are necessary for Law review and public notices before adoption (or elimination) of any regulations. So this, like many other pending regulations, will sit unenacted.\nThe doctor that transgendered her two year old should be put in Alaska Psychiatric Institute for life. She is the sickest person on the planet to do that to a child.\nBetter late than never. This has been obscene and has forever tarnished the medical profession, especially when watching them as a group of lemmings jumping on the COVID vaccine bandwagon which has caused great harm and death. Some Doctors refused to follow the juggernaut and they are to be commended. Last note, the brain is not fully developed until you’re in your 20s…\nThere were cash incentives for administering the jabs. The opiate epidemic is also due to incentives by the Rx drug companies for “doctors” to prescribe their toxins."
    },
    {
      "news_title": "Alaska Doctors Could Be Disciplined for Providing Transgender Care for Minors",
      "news_link": "https://www.medpagetoday.com/pediatrics/transgendermedicine/117131",
      "bias": "Center",
      "text": null
    },
    {
      "news_title": "Alaska medical board moves to restrict gender-affirming care for minors in the state",
      "news_link": "https://alaskapublic.org/news/health/2025-08-22/alaska-medical-board-moves-to-restrict-gender-affirming-care-for-minors-in-the-state",
      "bias": "Center",
      "text": "The Alaska State Medical Board took the first step Friday toward restricting access to gender-affirming care for minors in the state. In a unanimous vote, the board passed a draft regulation that would allow medical providers to be sanctioned by the board for providing the care, and would put their licenses at risk. The draft will be open for further public comment for 30 days after it’s reviewed by the state law department. A spokesperson for the board said the next public comment period will be announced on the state’s online public notice system, but she could not estimate a date.\nAccording to experts, if finalized, the regulation would severely restrict gender-affirming care for anyone under age 18 in Alaska, although nurses and nurse practitioners are not subject to the board’s regulations.\nDr. David Paulson, a neurosurgeon and member of the board, explained that the regulation is meant to prevent minors from making irreversible medical choices.\n“While compassion requires us to care for the youth in distress, we must recognize our duty to protect them from medical and surgical interventions that risk permanently altering their bodies or futures before they're fully capable of mature consent,” Paulson said.\nThe change in regulation would consider medical or surgical intervention to treat gender dysphoria in minors as unprofessional conduct, according to the board.\nMore than half of states have effectively banned or restricted gender affirming care for minors. And a U.S. Supreme Court decision this year found such bans don’t violate the U.S. constitution. Opponents of the care for minors cite the permanence of intervention, and potential for negative, long-term consequences. Supporters cite the high suicide rates for transgender youth, especially for those without access to gender affirming treatment.\nSome medical interventions, like puberty blockers, are considered reversible. And all major medical associations support access to gender affirming care for minors, including options for medical interventions. WPATH, the World Professional Association for Transgender Health, which often guides acceptable practice, endorses access to gender-affirming care like hormone blockers and hormones for minors in some circumstances, but not surgeries. The American Medical Association has called state bans on gender-affirming health care for minors “a dangerous intrusion into the practice of medicine.”\nDr. Lindsey Banning, who identified herself as a parent of a transgender child, spoke during the public comment period before the vote.\n“It's quite simply the standard of care for trans folks that's accepted by all major medical organizations in this country,” Banning said. “Blocking access to this care has devastating consequences on the health and well being of trans kids dramatically raising rates of depression, anxiety and suicide.”\nTom Pittman, executive director for Identity Alaska, which provides gender affirming care, calls the move politically motivated and said the changes would impact a very small number of vulnerable Alaskans.\nDr. Matt Heilala, a podiatrist who is running for governor, suggested the regulation change. The medical board was appointed by Gov. Mike Dunleavy and Heilala noted that the board has the governor’s support for this change.\nBut Dave Wilson, a pilot on the medical board, said that the move is not politically motivated and emerged in response to public concern."
    },
    {
      "news_title": "Alaska Medical Board passes draft reg against gender transition of minors",
      "news_link": "https://alaskawatchman.com/2025/08/22/alaska-medical-board-passes-draft-reg-against-gender-transition-of-minors/",
      "bias": "Right",
      "text": "In a 5-0 vote on Aug. 22 the Alaska Medical Board approved a draft regulation aimed at holding medical providers accountable for performing transgender surgeries or administering cross-sex hormones to minors.\nThe draft now heads to the Alaska Dept. of Law for review, after which there will be a 30-day public comment period before the board can take a final vote to adopt the measure.\nThe draft regulation would add the following language to an extensive list of actions that are deemed “unprofessional conduct” by medical providers. This includes medical or surgical intervention to facilitate gender transition such as administering puberty blockers and cross-sex hormones or performing mastectomy, phalloplasty, or genital mutilation to a minor under the age of 18 years old. Exceptions would be made for treatments aimed at addressing congenital sex development disorders or procedures for physical injuries.\nA public hearing immediately preceded the board’s unanimous vote in which a litany of radical transgender activists claimed that doctors should be free to engage in practices aimed a making gender-confused youth appear as the opposite sex.\nOne testifier was a biological female who had taken cross-sex drugs as a teen in order to appear as a male. The woman later had her breasts amputated and now sports a goatee. She argued that these sorts of services should be perfectly legal in Alaska.\nAnother testifier, Dr. Kevin Talow, works as a psychologist in Anchorage. He echoed many of the same points as the other transgender activists, claiming that “the research” does not support the medical board’s regulation change.\nMost of those who spoke against the board’s proposed changes claimed the effort was politically motivated and wasn’t “following the science.”\nPrior to voting, several board members refuted these claims.\nIn a separate action, the board approved a statement to educate Alaskans about the lack of regulation of abortion in Alaska, especially regarding late-term abortions.\nDr. Matt Heilala noted that there is a global shift when it comes to transgender care with countries around the world moving to ban or curtail cross-sex surgeries and hormonal interventions. He highlighted that more than half of all U.S. states have already limited or barred such practices.\nIn fact, More than 60 studies have been issued debunking claims that puberty blockers, cross sex hormones and mutilation surgery are beneficial for young people with gender dysphoria. Despite the move away from such practices, many Alaska medical facilities and providers continue to engage in issuing powerful hormonal drugs that can arrest or stunt natural puberty in gender-confused kids, and can lead to serious and life-altering medical side effects, including heart problems, reduced bone mass, interruption to natural brain development and permanent sterilization.\nDr. Heilala clarified that that the regulation, if adopted, would provide the Medical Board with an “option” not an “obligation” to sanction medical providers who engage in these practices.\nFellow board member, Dr. David Paulson, expressed his appreciation for the public participation, and then emphasized that the first duty of a physician is to “do no harm,” and argued that minors were simply too young to make life-altering decisions regarding transgender interventions.\nPublic board member David Wilson pointed out that it was members of the public who first approached the board asking it to address the practice of transgender procedures in Alaska. He emphasized that the board’s work on this issue was not politically motivated, and that each member had done a “tremendous” amount of research in the lead up to the vote.\nIf the proposed changes are adopted, those who violate the provisions could be disciplined or denied medical licenses to work in the State of Alaska.\nALASKA WATCHMAN DIRECT TO YOUR INBOX\nAdditionally, the proposed changes would define biological sex as “the male or female designation based on chromosomes, gonads, hormones, and genitals at birth, irrespective of psychological identity.”\nNow that the draft regulation has been approved the Dept. of Law will review it. If approved the public will have a 30-day window to write letters to the Medical Board. The board will review the comments and suggestions and see if any changes are needed before adopting the regulation.\nIn a separate action, the board voted 5-0 to approve a statement aimed at educating Alaskans about the expansive nature and lack of regulation of abortion in Alaska, especially as it relates to late-term abortions.\nThe proposal states: “Alaska state law allows for elective late term abortions, up until the time of delivery. The Alaska State Medical Board believes this is not ethical medical practice and does not embody the values of Alaskans. Many Alaskans and even physicians are unaware of this. We encourage Alaskans to engage with their representatives and to advocate for new legislation to bring state law into alignment with community values on this issue.”\nThe State Medical Board consists of up to eight members, which are appointed by the governor and confirmed by the State Legislature. Board members can include five licensed Alaska physicians, one physician assistant and two other members with no direct financial interest in the health care industry.\n5 Comments\nWell done Matt Heilala and each board member. Acting on this matter was essential given how the Legislature sat on their hands. The 8th Judicial Circuit’s recent decision to uphold the Arkansas ban (the first in the country) on medical and chemical mutilation of minors as well as the Skrmetti SCOTUS ruling giving Tennessee, and other states, the right to protect children in this area, are all great indications this correction has legal momentum on the right side. Although the Alaska Supreme Court, given the opportunity will shoot these regulations down, the new AG should rigorously defend them.\nI live in Quinhagak. We haven’t had public radio or TV for the last two decades. We won’t miss it.\nWhat Lisa is afraid of is, it will be gone from the Hubs with thousands of votes, not a couple dozen or up to a couple hundred votes in the remote villages Copy This Link………………. Tinyurl.com/5n6c9adv\nGood news! The point is: “to do no harm” God made us male and female. He does not make mistakes!\nAgree your a male or female end of story\nI live in Quinhagak. We haven’t had public radio or TV for the last two decades. We won’t miss it.\nWhat Lisa is afraid of is, it will be gone from the Hubs with thousands of votes, not a couple dozen or up to a couple hundred votes in the remote villages……..> rb.gy/uvl61c"
    },
    {
      "news_title": "Alaska medical board approves draft to discipline providers of gender-affirming care for youth",
      "news_link": "https://apnews.com/article/alaska-gender-affirming-care-doctor-sanctions-c4b7c63518bd4ef41d54f14eb9849f10",
      "bias": "Lean Left",
      "text": "Alaska medical board approves draft to discipline providers of gender-affirming care for youth\nANCHORAGE, Alaska (AP) — Alaska medical professionals who provide gender-affirming care for children could risk disciplinary action under proposed changes to state regulations approved by the state medical board on Friday.\nThe board unanimously approved draft language that would add those providing medical or surgical intervention to “treat gender dysphoria or facilitate gender transition” to a state regulation outlining unprofessional conduct.\nThe draft language was proposed by board member Matt Heilala, an Anchorage podiatrist, who also announced that he submitted his resignation effective after Friday’s meeting because he is running for governor.\nNo member of the public spoke in favor of the change during the meeting over Zoom, but several people spoke against it.\nKatherine Easley, a registered nurse, noted that none of the five doctors on the board is involved in transgender care. She said it was important for them to listen to the people of Alaska and other health professionals who say “what you are doing is overstepping.”\nHeilala is one of at least eight Republicans planning to run for governor next year. But he told The Associated Press on Thursday that this is an issue the board has been working on for some time and “has nothing to do with my running at all.”\nDavid Wilson, a pilot who is a public member of the board, said the proposed change wasn’t politically motivated.\nThe board asked the Legislature to limit such treatments, but took it up on its own when lawmakers didn’t act on the request.\nThe draft language will be sent to the state attorney general’s office for review before it gets 30 days of public comment. After that, the board can hold a meeting to receive oral comments. But it is not required to do so before making a final decision.\nThe medical board at a June meeting designated member Heilala to help draft a statement for consideration that would pertain to declaring those providing the care “as being grossly negligent and therefore subject to disciplinary sanctions,” according to the minutes of that meeting. It was not immediately clear what the possible penalties would be.\nGender-affirming care includes a range of medical and mental health services to support a person’s gender identity, including when it is different from the sex they were assigned at birth. It encompasses counseling, medications that block puberty and hormone therapy to produce physical changes as well as surgeries to transform chests and genitals, though those are rare for minors.\nMost major medical groups say access to the treatment is important for those with gender dysphoria and see gender as existing along a spectrum. While there is wide, if not universal, medical consensus, the political situation is contentious.\nIn Texas, Republican Gov. Greg Abbott had issued an order allowing the state to investigate parents of transgender youth for child abuse. But a Texas judge in 2022 blocked the state from investigating families of transgender youths who have received such care and members of the LGBTQ advocacy group PFLAG Inc. over such medical care.\nTom Pittman, executive director of Identity Inc., an Anchorage-based advocacy and health care organization for the LGBTQ+ community, said nearly 700 Alaska medical professionals have signed an open letter opposing the changes being considered by the board.\nPittman said he expected the board to vote the way it did, but he’s encouraged by the support from those who signed the letter and the many who spoke before the vote.\n“The health care community understands science, and they got into this field because they care about families, they care about people and they’ll continue to stand behind us,” he said.\nThe letter campaign organized by Pittman’s group said gender-affirming care for adolescents, when provided in partnership with families, is evidence-based medicine.\n“Labeling it ‘negligence’ is not a medical conclusion. It is a political act with devastating consequences: punishing clinicians, undermining parents, and denying young people lifesaving treatment,” the letter states.\nFewer than 100 youth are receiving such gender-affirming care, Pittman said.\n___\nAssociated Press writer Becky Bohrer contributed from Juneau, Alaska."
    },
    {
      "news_title": "Proposal could lead to sanctions against Alaska medical professionals for gender-affirming care",
      "news_link": "https://abcnews.go.com/Health/wireStory/proposal-lead-sanctions-alaska-medical-professionals-gender-affirming-124870061",
      "bias": "Lean Left",
      "text": "Proposal could lead to sanctions against Alaska medical professionals for gender-affirming care\nThe Alaska State Medical Board will be considering language that says medical professionals provide gender-affirming care for children could risk having their work considered unprofessional conduct\nANCHORAGE, Alaska -- Alaska medical professionals who provide gender-affirming care for children could risk disciplinary action under a proposal set for review by the state medical board on Friday.\nThe proposal would deem any professional who uses hormonal and surgical treatments for minors “as being grossly negligent” and subject to sanctions by the board, according to the board’s minutes from a June meeting.\nThe type and extent of disciplinary actions were not spelled out, and board member Matt Heilala, an Anchorage podiatrist who was helping write the proposed regulations, declined to discuss the details Thursday with The Associated Press ahead of the meeting.\nThe move comes after the board in March sent a letter to state lawmakers expressing opposition to hormonal or surgical gender-affirming care for minors and urging legislators to enact limits on treatments. The Legislature — controlled by bipartisan majorities in both the House and Senate — didn’t take up the issue before adjourning in May.\nCritics worry the board is overstepping its authority in pursuing regulations that could leave medical providers open to possible disciplinary actions. Instead of allowing the legislative process to play out, “they are now becoming the legislators themselves, which is inappropriate,” said state Sen. Löki Tobin, a Democrat who has been outspoken in support of the LGBTQ+ community.\nThe medical board at a June meeting designated member Heilala to help draft a statement for consideration that would pertain to declaring those providing the care “as being grossly negligent and therefore subject to disciplinary sanctions,” according to the minutes of that meeting.\nHeilala declined to discuss the specific language stemming from that directive that the board would consider Friday but told the AP that the proposed rules would go through a deliberate and transparent process for the public. Such processes can take months, he said.\nGender-affirming care includes a range of medical and mental health services to support a person’s gender identity, including when it’s different from the sex they were assigned at birth. It encompasses counseling, medications that block puberty and hormone therapy to produce physical changes as well as surgeries to transform chests and genitals, though those are rare for minors.\nMost major medical groups say access to the treatment is important for those with gender dysphoria and see gender as existing along a spectrum. While there’s wide, if not universal, medical consensus, the political situation is contentious.\nIn Texas, Republican Gov. Greg Abbott had issued an order allowing the state to investigate parents of transgender youth for child abuse. But a Texas judge in 2022 blocked the state from investigating families of transgender youths who have received such care and members of the LGBTQ advocacy group PFLAG Inc. over such medical care.\nTom Pittman, executive director of Identity Inc., an Anchorage-based advocacy and health care organization for the LGBTQ+ community, said about 500 Alaska medical professionals have signed an open letter opposing the changes being considered by the board.\nThe letter campaign organized by Pittman's group said gender-affirming care for adolescents, when provided in partnership with families, is evidence-based medicine.\n“Labeling it ‘negligence’ is not a medical conclusion. It is a political act with devastating consequences: punishing clinicians, undermining parents, and denying young people lifesaving treatment,” the letter states.\nFewer than 100 youth are receiving such gender-affirming care, Pittman said.\nPittman called Heilala’s actions politically motivated, saying he “has co-opted Alaska’s medical board and institution to launch a bid for governorship, and he’s using scapegoating and discrimination against what is a very small vulnerable population of Alaskans to create a bully pulpit for himself.”\nHeilala is one of at least eight Republicans to announce plans to run for governor next year. But he said this is an issue the board has been working on for some time and “has nothing to do with my running at all.”\n___\nBohrer reported from Juneau, Alaska."
    },
    {
      "news_title": "Alaska medical board seeks to restrict abortion, transgender medical care - Chilkat Valley News",
      "news_link": "https://www.chilkatvalleynews.com/2025/08/22/alaska-medical-board-seeks-to-restrict-abortion-transgender-medical-care/",
      "bias": "unknown",
      "text": "The politically appointed board that regulates health care in Alaska voted unanimously Friday to recommend that the state restrict medical care for transgender youth in the state and approved a letter asking Alaska lawmakers to end access to abortion in the late stages of pregnancy.\nOn transgender care, the board approved a draft regulation that — if made final — would declare that providing gender transition care for someone younger than 18 amounts to “unprofessional conduct” equivalent to drunkenly practicing medicine.\nSomeone violating that regulation could be subject to disciplinary action. In the most extreme cases, the board has revoked medical licenses after a discipline investigation.\nThe draft regulation is subject to a public comment period before becoming final or being amended.\nIn a separate action, the board approved a statement declaring that it does not believe that abortions late in pregnancy are “ethical medical practice” and advised Alaskans to lobby the Legislature to change state law.\nCurrently, access to abortion in Alaska is protected by a precedent set by the Alaska Supreme Court, which has declared that medical care is covered by the personal privacy clause of the Alaska Constitution.\nBoth actions come amid a push by Republicans nationally to restrict abortion and gender-affirming care for children. Twenty-seven states, almost all of which are controlled by Republican politicians, have enacted laws or policies restricting gender-affirming care for children.\nAbortion restrictions are more common, with only Alaska, eight other states, and the District of Columbia, having no restrictions on abortion care.\nBoard member Dave Wilson, a commercial pilot who sits in a public seat on the board, said before the vote that the transgender care regulation came about because of public requests.\n“This was brought to us as a concern by members of the public, and we acted on that. This is not politically driven. This is not politically motivated,” he said.\nNext to Wilson’s image in the board’s Zoom meeting was Dr. Matt Heilala, a podiatrist who is a member of the board and a Republican candidate for governor.\nAll six of the board’s current members were appointed by Republican Gov. Mike Dunleavy. The board has eight seats, but two are vacant. All six sitting members are male; four are from the Matanuska-Susitna Borough and two are from Anchorage.\nUnder the draft regulation, medical providers would be acting unprofessionally if they provide “medical or surgical intervention to treat gender dysphoria or facilitate gender transition by altering sex characteristics inconsistent with the biological sex at birth, including but not limited to puberty blockers, cross-sex hormones, mastectomy, phalloplasty, or genital modification to a minor under the age of 18 years old.”\nThe term “biological sex at birth” has frequently been used by Christian conservatives who believe gender is immutable and cannot be changed once assigned by birth.\nThat contradicts recommendations from most medical associations in the United States, which have defined gender dysphoria as a disorder that can affect children. The American Academy of Pediatrics, for example, has continuously supported access to chemical and surgical procedures to treat dysphoria and allow someone to potentially seek gender-affirming surgery.\nOther countries, including the United Kingdom, have taken a different approach and have restricted gender-affirming care for children.\nSince the start of President Donald Trump’s second term in office, the U.S. Department of Health and Human Services has also changed its policy to be against gender-affirming care for youths.\n“Earlier in the year, we’ve seen a lot more study that is alarming,” Heilala said during Friday’s board meeting, “policy shifts across the world, and we have strong support of the governor on this. More than half of the states have either outright banned or curtailed this care. And I think it does need to be pointed out, a regulation is an opportunity and a tool to be used at the discretion of the board.”\nHe said that if the regulation is enacted, disciplinary sanction isn’t “an obligation … but it is an option.”\nPublic testimony on Friday was uniformly against the draft regulation.\nTom Pittman is executive director of Identity Inc., which offers gender-affirming care to minors in Alaska.\nSpeaking to the board, he said the proposed regulation “strips parents of their ability to work with trusted doctors to make the best decisions for their child. It shrinks the already fragile provider network and endangers children’s lives.”\nDr. Lindsey Banning, a licensed psychologist and the parent of a transgender child, said that the benefits of gender-affirming care are well-established.\n“It’s quite simply the standard of care for trans folks that’s accepted by all major medical organizations in this country,” she said. “Blocking access to this care has devastating consequences on the health and well being of trans kids, dramatically raising (their) rates of depression, anxiety and suicide, and yet somehow we’re here watching this politically appointed medical board brazenly ask us to ignore the research and opt to politicize the healthcare choices of Alaskans.”\nThe draft regulation is expected to be vetted by the Alaska Department of Law, then would be published for a 30-day public comment period."
    },
    {
      "news_title": "Alaska State Medical Board injects politics into medicine with anti-trans, anti-abortion votes - The Alaska Current",
      "news_link": "https://thealaskacurrent.com/2025/08/22/alaska-state-medical-board-injects-politics-into-medicine-with-anti-trans-anti-abortion-votes/",
      "bias": "unknown",
      "text": "The Alaska State Medical Board, which is wholly appointed by GOP Gov. Mike Dunleavy, today approved anti-abortion and anti-trans measures authored by a member who also happens to be one of the eight Republicans running for governor, ignoring concerns that they put politics over good medicine.\nThe Alaska Constitution’s privacy clause has been broadly and regularly interpreted to protect Alaskans’ health care decisions, including on abortion and gender-affirming care, but that hasn’t stopped conservatives like the Medical Board member and Republican gubernatorial candidate Dr. Matt Heilala from pushing restrictions on the board that oversees health care providers in Alaska.\nHeilala, a podiatrist, spearheaded the effort to restrict minors’ access to gender-affirming care, as well as an official board message calling for changing the state’s laws on abortion access. Both were approved unanimously during the hearing, but not before a public testimony session that asked the board to rethink its actions.\n“I’m willing to bet most people on the board have never met a trans kid, you’ve never met a trans person. You never talked to them about their real, lived experiences. Maybe I can enlighten a little bit; There are some of these young folks, they’re so brave, they’re so resilient,” said Josh Smith, a veteran and uncle of a trans teen. “I just want these young people to have access to everything I did … Nobody should be launching a governor campaign based off of trans kids or my family.”\nDr. Lindsey Banning, who said she’s a parent to a transgender child, warned that a blanket ban on care would harm kids and run contrary to the advice of major medical associations. Gender-affirming care can include puberty blockers and hormone treatment in some cases, but surgeries that conservatives say they are worried about are typically rare.\n“It’s quite simply the standard of care for trans folks that’s accepted by all major medical organizations in this country,” Banning said. “Blocking access to this care has devastating consequences on the health and well-being of trans kids, dramatically raising rates of depression, anxiety and suicide.”\nSeveral testifiers were highly critical of Heilala, who entered the race for governor earlier this summer, positioned as a right-wing conservative. As the former chair of the Medical Board, Heilala has pushed strongly for the body that regulates the licensing for the state’s medical professionals to be more involved in of-the-moment hot-button issues. One testifier ironically thanked him for stepping down from his position as board chair.\n“I’m very thankful that the provider … Dr Heilala is stepping down, because I think that it has definitely been a platform for him to use to push some right-wing conservative agenda,” they said.\nThe vote doesn’t immediately enact restrictions on gender-affirming care, but it sets in motion new regulations that could be used to sanction health care providers who provide anything deemed as gender-affirming care to minors. The process of adopting the regulations will include another window for written public testimony, but the board didn’t commit to holding a second hearing on the measure.\nThe board did little to ease concerns about the application of the regulations, with Heilala conceding that enforcement may not be consistent.\n“I think it does need to be pointed out, a regulation is an opportunity and a tool to be used at the discretion of the board,” he said. “It’s not an obligation to disciplinary sanction, but it is an option.”\nAnti-abortion measure to boot\nThe board also voted 6-0 to approve a statement saying so-called “late-term abortions, up until the time of delivery” – a Republican bogeyman that isn’t really a thing – “does not embody the values of Alaskans” and encourages Alaskans to lobby legislators to change state abortion protections that are guaranteed by the Alaska Constitution into “alignment with community values.”\nHere’s the full text:\n“Alaska state law allows for elective late-term abortions, up until the time of delivery. The Alaska State Medical Board believes this is not ethical medical practice and does not embody the values of Alaskans. Many Alaskans and even physicians are unaware of this. We encourage Alaskans to engage with the representatives and to advocate for new legislation to bring state law into alignment with community values on this issue.”\nHeilala defended the measure by arguing that the Alaska Constitution is “extremely permissive” when it comes to abortion. He also seemed to pat himself on the back for daring to bring up such a hot-topic issue, going as far as to raise the spectre of convicted serial killer Kermit Gosnell, a Philadelphia “abortion provider” who targeted poor and minority communities with ghastly practices and has been held up by conservatives as an example of abortion providers in the push to outlaw the procedure.\n“Harm occurs when people are unwilling to speak about them because they’re too fearful it’s too hot a topic,” he said, “but, and you know, in this regard, in this one, a recent example is Dr. Gosnell in Philadelphia, and what had happened there.”\nHe was cut off by another member before he delved any further into Gosnell’s case.\nWhile the regulations limiting access to gender-affirming care were the main draw of the testimony, a few said they were alarmed by the board adopting such a brazenly political statement on abortion. Several noted that the ghastly-sounding “late-term abortion” isn’t actually a thing in the way they describe it, and that their effort to restrict access to abortion interferes with critical care in life-threatening pregnancy complications.\nSeveral said they were worried about the long-term state of health care in Alaska as long as such a nakedly political board is overseeing the industry.\n“I guess I’m not quite sure that everyone here even cares about the evidence,” said Brian Griffith, an Alaskan pursuing a medical degree. “How could a trainee like myself want to come and work under a medical board that opposes the standard of care?”\nMatt Acuña Buxton is a long-time political reporter who has written for the Fairbanks Daily News-Miner and The Midnight Sun political blog. He also authors the daily politics newsletter, The Alaska Memo, and can frequently be found live-tweeting public meetings on Bluesky."
    }
  ]
}