{
  "story_id": "GN_20250826_001519_97694e20",
  "metadata": {
    "title": "US Opens Furniture Import Probe, Setting Up Potential Tariffs Within 50 Days",
    "timestamp": "2025-08-26T00:15:19.301865",
    "url": "https://ground.news/article/trump-says-us-will-impose-tariffs-on-all-foreign-furniture_dbfe93"
  },
  "bias_distribution": {
    "total_sources": "51",
    "leaning_left": "5",
    "center": "13",
    "leaning_right": "11"
  },
  "perspective_summaries": {
    "left": [
      "President Donald Trump announced a tariff investigation into furniture imports, set to be completed within 50 days, which he claims will help revive the furniture business in several U.S. states.",
      "Furniture retailer RH's shares fell 7.5% after Trump's announcement, while other retailers experienced stock declines.",
      "The United States imported about $25.5 billion in furniture in 2024, with significant amounts coming from Vietnam and China.",
      "Nonprofits argue there is no rational relationship between furniture imports and national security, claiming tariffs will not restore American manufacturing levels."
    ],
    "center": [
      "On Friday, President Donald Trump announced a major probe into imported furniture, stating on Truth Social, `Furniture coming from other Countries into the United States will be Tariffed at a Rate yet to be determined`.",
      "The probe is a Section 232 review of imports, framed by the Trump administration as a national security assessment of timber, lumber and derivative products to reduce reliance on foreign manufacturing.",
      "Trade data show the United States imported about $25.5 billion in furniture in 2024, with about 60% from Vietnam and China, while the Consumer Price Index shows furniture prices rose 0.9% month-to-month and shares of Wayfair, RH and Williams-Sonoma tumbled on Friday.",
      "Trump set a 50-day timeline for the probe, with duties “yet to be determined,” and the White House said new tariffs won’t stack on existing ones targeting China and Vietnam.",
      "The president said tariffs aim to revive production in states like North Carolina, South Carolina and Michigan, with furniture and wood products employment falling from 1.2 million in 1979 to 340,000 today, while Section 232 could legally support duties if courts uphold other sector probes."
    ],
    "right": [
      "President Trump announced an investigation into furniture imports to set new tariff rates, aiming to boost manufacturing in states like North Carolina and Michigan.",
      "The probe aims to revive furniture manufacturing in North Carolina and Michigan, according to Trump.",
      "Shares of companies dependent on foreign manufacturing fell after the announcement, impacting firms reliant on foreign manufacturing.",
      "Trump's strategy seeks to reduce reliance on foreign manufacturing and revive domestic production."
    ]
  },
  "sources": [
    {
      "news_title": "Trump says US is conducting tariff investigation into furniture imports - Economy - The Jakarta Post",
      "news_link": "https://www.thejakartapost.com/business/2025/08/24/trump-says-us-is-conducting-tariff-investigation-into-furniture-imports.html",
      "bias": "Lean Left",
      "text": "Can't find what you're looking for?\nView all search resultsCan't find what you're looking for?\nView all search resultsresident Donald Trump said on Friday his administration will conduct a \"major\" tariff investigation on furniture entering the United States, a step toward imposing higher duties on a sector already seeing tariff-fueled price increases.\n\"Furniture coming from other Countries into the United States will be Tariffed at a Rate yet to be determined,\" Trump said in a post on Truth Social.\nFurniture retailer RH -- previously known as Restoration Hardware -- shares fell 7.5 percent in after-hours trading on Trump's announcement.\nTrump said the investigation will be completed within the next 50 days but other national security probes have taken significantly longer than that. A White House official confirmed that it would be conducted under the Section 232 national security statute.\nThe probe could serve as a backstop legal basis for existing tariffs if a federal appeals court strikes down \"reciprocal\" duties that Trump imposed on a broad range of US trading partners in April, as well as import taxes imposed in February against China, Canada and Mexico.\n\"This will bring the Furniture Business back to North Carolina, South Carolina, Michigan, and States all across the Union,\" Trump said.\nFurniture and wood products manufacturing -- which employed 1.2 million people in 1979 -- has fallen from 681,000 in 2000 to 340,000 today, according to government statistics.\nThe United States imported about $25.5 billion in furniture in 2024, up 7 percent over 2023, with about 60 percent of those imports coming from Vietnam and China, according to Furniture Today, a trade publication.\nNew tariffs on imports from furniture-producing countries helped push up consumer prices for home furnishings by a steep 0.7 percent in July, according to Commerce Department data, though overall consumer price inflation was restrained by lower gasoline prices.\nThe American Home Furnishings Alliance, a trade group representing domestic furniture manufacturers and importers, including many companies that do both, had no immediate comment on Trump's announcement.\nBut the High Point, North Carolina-based AHFA in April led an industry coalition in opposing new tariffs under Trump's ongoing Section 232 investigation into lumber and wood products imports.\n\"As a strictly legal matter, there is no rational relationship between imports of wood products or furniture and the national security of the United States,\" the group said in written comments to the Commerce Department.\n\"Second, no amount of tariffs will bring back American furniture manufacturing back to its prior levels. Tariffs will harm manufacturing still being done in the United States.\"\nFurniture would be the latest imported products targeted for a national security investigation by the Trump administration. On Thursday, it announced a national security probe into imported wind turbines and has previously targeted copper and other metals.\nThe department has opened numerous probes into the national security ramifications of imports of airplanes, semiconductors, pharmaceuticals, heavy trucks, timber and lumber, critical minerals and drones.\nThe European Union won some relief from these potential new Section 232 tariffs as part of a joint statement on Thursday fleshing out their trade deal.\nThe two sides agreed to limit any new US tariffs on EU pharmaceuticals, lumber and semiconductors to the general 15 percent rate applied to most products from the bloc and will shield EU aircraft and parts, generic pharmaceuticals and drug chemical precursors from all new tariffs.\nShare your experiences, suggestions, and any issues you've encountered on The Jakarta Post. We're here to listen.\nThank you for sharing your thoughts. We appreciate your feedback.\nQuickly share this news with your network—keep everyone informed with just a single click!\nShare the best of The Jakarta Post with friends, family, or colleagues. As a subscriber, you can gift 3 to 5 articles each month that anyone can read—no subscription needed!\nGet the best experience—faster access, exclusive features, and a seamless way to stay updated."
    },
    {
      "news_title": "Trump On Tariff Investigation Into Furniture Imports: Bring ‘Business Back’ To U.S.",
      "news_link": "https://www.dailywire.com/news/trump-on-tariff-investigation-into-furniture-imports-bring-business-back-to-u-s",
      "bias": "Right",
      "text": "President Donald Trump said on Friday his administration will conduct a “major” tariff investigation on furniture entering the United States, a step toward imposing higher duties on a sector already seeing tariff-fueled price increases.\n“Furniture coming from other Countries into the United States will be Tariffed at a Rate yet to be determined,” Trump said in a post on Truth Social.\nFurniture retailer RH — previously known as Restoration Hardware — shares fell 7.5% in after-hours trading on Trump’s announcement.\nTrump said the investigation will be completed within the next 50 days but other national security probes have taken significantly longer than that. A White House official confirmed that it would be conducted under the Section 232 national security statute.\nThe probe could serve as a backstop legal basis for existing tariffs if a federal appeals court strikes down “reciprocal” duties that Trump imposed on a broad range of U.S. trading partners in April, as well as import taxes imposed in February against China, Canada and Mexico.\n“This will bring the Furniture Business back to North Carolina, South Carolina, Michigan, and States all across the Union,” Trump said.\nFurniture and wood products manufacturing — which employed 1.2 million people in 1979 — has fallen from 681,000 in 2000 to 340,000 today, according to government statistics.\nEnd of Summer Sale – Get 40% off New DailyWire+ Annual Memberships\nThe United States imported about $25.5 billion in furniture in 2024, up 7% over 2023, with about 60% of those imports coming from Vietnam and China, according to Furniture Today, a trade publication.\nNew tariffs on imports from furniture-producing countries helped push up consumer prices for home furnishings by a steep 0.7% in July, according to Commerce Department data, though overall consumer price inflation was restrained by lower gasoline prices.\nThe American Home Furnishings Alliance, a trade group representing domestic furniture manufacturers and importers, including many companies that do both, had no immediate comment on Trump’s announcement.\nBut the High Point, North Carolina-based AHFA in April led an industry coalition in opposing new tariffs under Trump’s ongoing Section 232 investigation into lumber and wood products imports.\n“As a strictly legal matter, there is no rational relationship between imports of wood products or furniture and the national security of the United States,” the group said in written comments to the Commerce Department.\n“Second, no amount of tariffs will bring back American furniture manufacturing back to its prior levels. Tariffs will harm manufacturing still being done in the United States.”\nFurniture would be the latest imported products targeted for a national security investigation by the Trump administration. On Thursday, it announced a national security probe into imported wind turbines and has previously targeted copper and other metals.\nThe department has opened numerous probes into the national security ramifications of imports of airplanes, semiconductors, pharmaceuticals, heavy trucks, timber and lumber, critical minerals and drones.\nThe European Union won some relief from these potential new Section 232 tariffs as part of a joint statement on Thursday fleshing out their trade deal. The two sides agreed to limit any new U.S. tariffs on EU pharmaceuticals, lumber and semiconductors to the general 15% rate applied to most products from the bloc and will shield EU aircraft and parts, generic pharmaceuticals and drug chemical precursors from all new tariffs.\n(Reporting by Ismail Shakil and Bhargav Acharya; editing by Ryan Patrick Jones, Caitlin Webber and Diane Craft)"
    },
    {
      "news_title": "Trump announces pending furniture tariffs",
      "news_link": "https://www.upi.com/Top_News/US/2025/08/23/furniture-tariffs/6511755971459/",
      "bias": "Center",
      "text": "Aug. 23 (UPI) -- The Trump administration is undertaking a 50-day investigation into the furniture market, with pending tariffs likely to revive the nation's industry.\nPresident Donald Trump announced the investigation in a Truth Social post on Friday and said he will impose undetermined tariffs afterward.\n\"This will bring the furniture business back to NorthCarolina, South Carolina, Michigan and states across the Union,\" Trump said.\nNorth Carolina ia known as the Furniture Capital of the World, which developed from access to hardwood in Appalachian forests. U.S. companies include Ashley Furniture, Century, Vanguard and Lexington Home Brands.\nRelated\nThe pending tariffs are in keeping with those the president has imposed on other industries with the aim of returning manufacturing to the United States and reducing reliance on foreign-made goods.\nThe investigation is directed at furniture from \"other Countries\" but primarily impacts key suppliers such as China and Vietnam, which together supply about 60% of U.S. furniture imports.\nMost foreign goods are already subject to tariffs from trading partners, including a baseline 10%. In a deal with Vietnam, the rate is 20% with 40% on goods going through Vietnam from a third country. In China, the rate is 10% under a 90-day pause until November from 30% after a threatened peak of 125%.\nTrump's social media post prompted a drop in shares during after-hours trading for many of the nation's leading furniture retailers, including Wayfair, Williams-Sonoma and RH, CNBC reported.\nWayfair shares ended after-hours trading at $74.03, which was down 3.81% from its closing price of $77.84 at the end of day trading on Friday.\nWilliams-Sonoma dropped $6.37 and 3.13% to $197.05 during after-hours trading, while RH fell $13.51 and 5.54% to $230.20.\nU.S.-based La-Z Boy, though, saw its share price rise by 76 cents and 2.08% to $37.34 after closing at $36.58 at the close of day trading on Friday.\nThe furniture tariffs announcement comes as the nation's furniture industry is experiencing difficulties.\nDemand for new furniture and home goods has declined as home sales slowed over the past year.\nSlower home sales lessen the demand for new furniture and furnishings, and years of relatively high inflation have made consumers wary of how they spend their money, according to CNBC."
    },
    {
      "news_title": "Trump announces plans to tariff imported furniture",
      "news_link": "https://seekingalpha.com/news/4488556-trump-announces-plans-to-tariff-imported-furniture?utm_source=feed_news_all&utm_medium=referral&feed_item_type=news",
      "bias": "Lean Right",
      "text": null
    },
    {
      "news_title": "\"Within Next 50 Days...\": Trump Threatens Tariff On Imported Furniture",
      "news_link": "https://www.ndtv.com/world-news/us-president-donald-trump-threatens-tariff-on-imported-furniture-says-will-decide-within-50-days-9143296",
      "bias": "Lean Right",
      "text": null
    },
    {
      "news_title": "Furniture Tariff Investigation Underway, Details Coming Within 50 Days: Trump",
      "news_link": "https://www.theepochtimes.com/us/furniture-tariff-investigation-underway-details-coming-within-50-days-trump-5905064",
      "bias": "Lean Right",
      "text": "President Donald Trump announced Friday that his administration is considering tariffs on furniture imports, with an investigation underway and a report expected within 50 days.\n“This will bring the Furniture Business back to North Carolina, South Carolina, Michigan, and States all across the Union,” Trump posted on his Truth Social platform."
    },
    {
      "news_title": "Trump announces tariff investigation into furniture imports to restore U.S. manufacturing",
      "news_link": "https://www.foxbusiness.com/politics/trump-announces-tariff-investigation-furniture-imports-restore-u-s-manufacturing",
      "bias": "Lean Right",
      "text": "Trump announces tariff investigation into furniture imports to restore U.S. manufacturing\nPresident says probe will be completed within 50 days to determine tariff rates\nPresident Trump announced on Friday that his administration is launching a probe into furniture imports to determine new tariff rates on pieces entering the country.\n\"I am pleased to announce that we are doing a major Tariff Investigation on Furniture coming into the United States,\" Trump posted to his Truth Social account Friday afternoon. \"Within the next 50 days, that Investigation will be completed, and Furniture coming from other Countries into the United States will be Tariffed at a Rate yet to be determined.\"\nCANADA LIFTS TARIFFS ON SOME US GOODS TO RESUME TRADE TALKS\nThe president noted that the investigation, along with the subsequent duties imposed, are aimed at reviving furniture manufacturing in states such as North Carolina, South Carolina and Michigan.\n\"This will bring the Furniture Business back to North Carolina, South Carolina, Michigan, and States all across the Union,\" Trump added. \"Thank you for your attention to this matter!\"\nTRUMP'S TARIFF REVENUE HAS SKYROCKETED IN JUST A FEW MONTHS, SOARING PAST 2024 LEVELS\nEarlier this month, Trump touted a \"beautiful\" surge in tariff revenues on imported goods, crediting his administration's trade policies for a flood of cash into the U.S. economy.\nTRUMP'S HIGHER TARIFFS GO INTO EFFECT ON DOZENS OF COUNTRIES\nThe U.S. collected more than $29 billion in tariff revenues in July, the highest monthly total this year. According to the Treasury Department’s latest \"Customs and Certain Excise Taxes\" data, released on Aug. 19, total tariff revenues have reached $158.3 billion for the fiscal year.\nGET FOX BUSINESS ON THE GO BY CLICKING HERE\nThe White House did not immediately respond to FOX Business' request for comment.\nFOX Business' Amanda Macias contributed to this report."
    },
    {
      "news_title": "Trump says he will place tariffs on furniture — causing shares of Wayfair, Williams-Sonoma to plunge",
      "news_link": "https://nypost.com/2025/08/22/business/trump-threatens-furniture-tariffs-causing-wayfair-williams-sonoma-shares-to-plunge/",
      "bias": "Lean Right",
      "text": "Trump says he will place tariffs on furniture — causing shares of Wayfair, Williams-Sonoma to plunge\nPresident Trump announced Friday that his administration is investigating imported furniture for potential tariffs, sending shares of major home goods companies tumbling in after-hours trading.\nTrump said the probe would be wrapped up within 50 days, after which furniture imports would face duties at rates “yet to be determined.”\n“This will bring the Furniture Business back to North Carolina, South Carolina, Michigan, and States all across the Union,” Trump posted on his Truth Social platform.\nThe tariff threat hammered stocks of companies heavily reliant on foreign manufacturing. Wayfair, RH and Williams-Sonoma all saw their shares plunge following Trump’s announcement.\nWayfair, whose stock fell by more than 6% after the closing bell on Friday, imports much of its furniture inventory from overseas suppliers.\nShares of RH were also down more than 6% while Williams-Sonoma stock dropped more than 4% Friday evening.\nHowever, not all furniture companies suffered. La-Z-Boy shares actually rose nearly 2.5% on the news since the company conducts most of its manufacturing operations within the United States.\nThe furniture industry investigation adds to Trump’s growing list of sectoral tariff targets.\nHe has already imposed steep duties on automobiles, steel and aluminum while floating similar measures for copper, pharmaceuticals and semiconductors.\nFriday’s announcement left unclear whether furniture tariffs would stack on top of existing country-specific duty rates that Trump has negotiated through bilateral trade deals.\nThe Trump administration has spent months conducting trade negotiations with partners worldwide, seeking to rebalance what it views as unfair global commerce arrangements.\nRecent framework agreements with the European Union and China have provided some market stability, though many longer-term trade disputes remain unresolved.\nThe timing of potential furniture tariffs comes as the industry faces significant headwinds.\nCompanies like Wayfair have endured more than a year of declining demand for big-ticket items, including couches and dining room sets.\nThe furniture sales slump stems partly from a sluggish housing market as prospective buyers wait for interest rates to decline before making major purchases.\nFewer new home sales translate directly into reduced furniture demand, since consumers typically buy new furnishings when they move into different residences.\nPersistent inflation has also made consumers more selective about discretionary spending. Restaurants, clothing, travel and home decor have all experienced reduced sales as shoppers tighten their budgets.\nTrump’s tariff strategy aims to encourage companies to relocate manufacturing operations back to the United States, particularly in states with strong furniture-making traditions.\nNorth Carolina and other southeastern states historically served as major furniture production hubs before much of the industry migrated overseas in search of lower labor costs.\nThe investigation represents another step in Trump’s broader trade agenda focused on reducing America’s reliance on foreign manufacturing across multiple industries.\nPrevious tariff announcements have produced mixed results, with some companies announcing plans to reshore production while others have absorbed higher costs or passed them on to consumers.\nThe Post has sought comment from the American Home Furnishings Alliance."
    },
    {
      "news_title": "Major furniture retailers see stocks plummet after Trump's social media warning",
      "news_link": "https://www.rawstory.com/trump-tariffs-2673912372/",
      "bias": "Left",
      "text": "President Donald Trump's warning that imported furniture will soon face tariffs sent stocks reeling for major retailers, according to a report.\nOn Friday, Trump said on his Truth Social platform that his administration was conducting a major tariff investigation into furniture imports. The administration plans to impose tariffs at a rate still to be determined once the probe is completed within the next 50 days.\n“This will bring the Furniture Business back to North Carolina, South Carolina, Michigan, and States all across the Union,” Trump promised.\nThe announcement reverberated through the furniture retail sector, the Wall Street Journal reported. Wayfair sunk 6.2% at $73 in after-hours trading on Friday, according to the Journal, while shares of RH slipped 7.5%. Williams-Sonoma saw its stock plunge 5.6%.\nTwo furniture retailers that make most of their products in North America were notable exceptions, however, with both La-Z-Boy and Ethan Allen Interiors seeing shares climb following the post. La-Z-Boy rose 2.5% to $37.48, while Ethan Allen soared 5.2% to $31.60.\nThe new tariff announcement comes a day after a Fox Business host was forced to acknowledge Trump's signature policy is hitting Americans in the pocket.\nDuring a Thursday afternoon segment on \"Claman Countdown,\" guest host Cheryl Casone acknowledged that the biggest \"blue chip\" stocks were taking a beating, and honed in on retail giant Walmart as a prime example.\nIt also comes after a a Minnesota small-business owner was brought to tears on CNN talking about the effect Trump's tariffs have had on her olive oil and vinegar shop."
    },
    {
      "news_title": "Trump announces 'major tariff investigation’ on imported furniture",
      "news_link": "https://www.aa.com.tr/en/americas/trump-announces-major-tariff-investigation-on-imported-furniture/3666904",
      "bias": "Right",
      "text": "ISTANBUL\nPresident Donald Trump announced Friday that there is \"a major tariff investigation on furniture coming into the United States.\"\n\"Within the next 50 days, that investigation will be completed, and furniture coming from other countries into the United States will be tariffed at a rate yet to be determined,\" Trump wrote on the Truth social media platform.\nHe said the move will bring the furniture business back to North Carolina, South Carolina, Michigan and states across the country.\nThe US' furniture imports were at around $26.4 billion last year, while the main sources for imports were Vietnam, China, Canada, Mexico and Italy.\nTrump also touched on tariffs by stressing: \"I am pleased to announce that the Radical Left Representatives working at the Congressional Budget Office (CBO) have now admitted how incredible my Tariff strategy has been, saying that, 'Trump’s Tariffs reduce the deficit by $4 Trillion Dollars.'\"\n\"When I began my Tariff policy suggestions, they refused to acknowledge the potential SUCCESS that would be derived,\" he said. \"Deficits are DOWN, Taxes are DOWN, Energy is DOWN, Prices generally are DOWN, the only things that are UP are, Take Home Pay, the Stock Market, and our Country, which is the 'HOTTEST' anywhere in the World.\""
    },
    {
      "news_title": "Trump says US is conducting tariff investigation into furniture imports",
      "news_link": "https://www.reuters.com/world/us/trump-says-us-is-conducting-tariff-investigation-into-furniture-imports-2025-08-22/",
      "bias": "Center",
      "text": null
    },
    {
      "news_title": "Trump Announces Furniture Imports Probe, Setting Up Tariffs",
      "news_link": "https://financialpost.com/pmn/business-pmn/trump-announces-furniture-imports-probe-setting-up-tariffs",
      "bias": "Lean Right",
      "text": null
    },
    {
      "news_title": "Trump says furniture tariffs are coming later this year",
      "news_link": "https://www.cnbc.com/2025/08/22/trump-tariffs-furniture-trade.html",
      "bias": "Center",
      "text": "The Trump administration has launched an investigation into imported furniture, President Donald Trump said Friday, setting the stage for new tariffs on a wide range of products.\n\"Within the next 50 days, that Investigation will be completed, and Furniture coming from other Countries into the United States will be Tariffed at a Rate yet to be determined,\" Trump wrote on his Truth Social platform. \"This will bring the Furniture Business back to North Carolina, South Carolina, Michigan, and States all across the Union.\"\nFollowing Trump's post, shares of top furniture and home goods companies, including Wayfair, RH and Williams-Sonoma, tumbled in after-hours trading.\nWayfair imports much of its furniture. RH, formerly Restoration Hardware and Williams-Sonoma have been working to diversify their supply chains.\nNew tariffs could drive up costs for many of these major furniture brands. But not for all of them.\nShares of La-Z-Boy, which has most of its manufacturing in the U.S., rose on the news of Trump's tariff plans.\nTrump has already put steep tariffs on cars, steel and aluminum and he has floated similar customs duties for imported copper, pharmaceuticals and semiconductors.\nIt was unclear Friday whether new, sectoral tariffs on furniture would be applied on top of country specific tariff rates.\nThe Trump administration has spent months holding bilateral negotiations with U.S. trade partners in an effort to reset the balance of global trade. Recent framework agreements with the European Union and China have helped to calm markets, but leave many longer-term issues unresolved.\nAny new tariffs would come at a difficult moment for the U.S. furniture industry, which faces a range of challenges.\nCompanies like Wayfair have seen demand fall for more than a year on items like new couches and dining sets, a drop caused in part by a slower overall housing market as buyers wait for interest rates to come down.\nWith fewer new homes being bought, consumers have fewer reasons to buy new furniture.\nPlus, with stubborn inflation, they have been more choosy on where they are spending their discretionary income. Restaurants, new clothes, trips and home decor have all taken a hit.\n— CNBC's Gabrielle Fonrouge contributed to this report."
    },
    {
      "news_title": "Trump announces probe of furniture imports, pledges tariffs",
      "news_link": "https://insidetrade.com/daily-news/trump-announces-probe-furniture-imports-pledges-tariffs",
      "bias": "Center",
      "text": "August 25, 2025\nTrump announces probe of furniture imports, pledges tariffs\nEditor's note: This story was updated after initial publication to include a comment from an administration official. The Trump administration will begin a “major Tariff investigation” of furniture imports that will lead to new duty rates, the president said on Friday, touting an effort a White House official said would be pursued as part of an ongoing national security-focused probe into lumber and timber products. “Within the next 50 days, that Investigation will be completed, and Furniture coming from..."
    },
    {
      "news_title": "Higher tariffs on furniture to be announced within next 50 days, Trump says",
      "news_link": "https://www.cnn.com/2025/08/22/economy/furniture-tariff-trump",
      "bias": "Lean Left",
      "text": "President Donald Trump on Friday announced he’s directing his administration to investigate imports of furniture into the United States that will lead to higher tariffs by October.\n“Within the next 50 days, that Investigation will be completed, and Furniture coming from other Countries into the United States will be Tariffed at a Rate yet to be determined,” Trump wrote in a Truth Social post.\n“This will bring the Furniture Business back to North Carolina, South Carolina, Michigan, and States all across the Union,” Trump said.\nThe investigation comes as the Trump administration is mulling higher tariff levels on imported goods such as copper, semiconductors and pharmaceuticals.\nAlready, furniture prices have been increasing over the past few months as Trump hiked tariffs on countries including China and Vietnam, the top two sources of imported furniture. Both countries exported $12 billion worth of furniture and fixtures last year, according to US Commerce Department data.\nFurniture and bedding prices, an overarching category the Consumer Price Index tracks, rose 0.4% in June and 0.9% in July after prices had been largely deflationary for the past two and a half years.\nOther furniture, including office, recreation and patio, saw the biggest spikes since May. Prices were up 1.5% in May, 1.6% in June and 1.5% in July. Like most goods, these categories were seeing prices fall by that much on a monthly basis, if not more, following the unraveling of pandemic nesting trends.\nFurniture stocks, such as Wayfair, William-Sonoma and Restoration Hardware, all tanked in after-hours trading Friday evening following a big day of gains across the stock market after Federal Reserve Chair Jerome Powell opened up the door to an interest rate cut.\nCNN’s Alicia Wallace contributed reporting."
    },
    {
      "news_title": "Trump says US will impose tariffs on all foreign furniture",
      "news_link": "https://thehill.com/business/5466577-trump-says-us-will-impose-tariffs-on-all-foreign-furniture/",
      "bias": "Center",
      "text": null
    },
    {
      "news_title": "Trump Announces Probe Into Furniture Imports, Setting Up Tariffs",
      "news_link": "https://www.bloomberg.com/news/articles/2025-08-22/trump-announces-probe-into-furniture-imports-setting-up-tariffs",
      "bias": "Lean Left",
      "text": null
    },
    {
      "news_title": "Trump Targets Furniture Imports with Major Tariff Probe",
      "news_link": "https://www.devdiscourse.com/article/technology/3591203-trump-targets-furniture-imports-with-major-tariff-probe",
      "bias": "Center",
      "text": "Trump Targets Furniture Imports with Major Tariff Probe\nPresident Donald Trump announced a significant tariff investigation on foreign furniture entering the U.S., indicating potential tariffs at an undecided rate. The investigation, set to conclude within 50 days, could impact trade policies and the furniture market.\nIn a recent statement, President Donald Trump declared his administration's plans to initiate a comprehensive tariff investigation focused on furniture imports to the United States.\nThe president emphasized the potential implementation of tariffs on furniture entering the country, with specific rates still under consideration.\nAccording to Trump's announcement on Truth Social, the investigation is expected to reach its conclusion within a 50-day timeframe.\n(With inputs from agencies.)\nAdvertisement\nALSO READ\nChile Suspends Argentine Poultry Imports Amid Bird Flu Concerns\nIndia's Rising Coal Imports Amid Domestic Challenges\nIndia Sets Minimum Import Price for Paperboard, Targets Indonesian Imports\nTrump Targets Furniture Imports with Major Tariff Initiative\nOnion Market Sees Price Uptick as Bangladesh Resumes Imports"
    },
    {
      "news_title": "Trump threatens even more tariffs as he opens probe into furniture imports",
      "news_link": "https://www.tag24.com/politics/politicians/donald-trump/trump-threatens-even-more-tariffs-as-he-opens-probe-into-furniture-imports-3414307",
      "bias": "unknown",
      "text": "Trump threatens even more tariffs as he opens probe into furniture imports\nWashington DC - President Donald Trump on Friday threatened fresh tariffs on imported furniture, saying his administration will launch a probe on the sector.\n\"We are doing a major Tariff Investigation on Furniture coming into the United States,\" Trump wrote in a post on his Truth Social platform.\n\"Within the next 50 days, that Investigation will be completed,\" the US leader added.\nHe said the tariff rate for furniture has yet to be decided, but justified the plan as a means to bring the furniture industry back to states like North Carolina, South Carolina, and Michigan.\nThe US employed over 340,000 people in the furniture and related products manufacturing sector as of July, according to government data, about half the level seen in the year 2000.\nChina and Vietnam are among the major sources of US furniture imports.\nThe US imported $25.5 billion worth of furniture in 2024, according to trade publication Furniture Today.\nTrump's move marks his latest threat targeting specific sectors, after he imposed steep duties on imports of steel, aluminum, autos, and other products this year.\nThe Trump administration has also launched several investigations into imports of pharmaceuticals, chips, critical minerals, and various categories of goods – taking into consideration their effects on national security.\nTypically, such probes take months to conclude, and they could eventually justify the imposition of new tariffs.\nTrump administration's escalating tariffs continue\nWhile economies like Vietnam and China are already hit with separate waves of countrywide levies – with specific sectors coming under separate rates – some of these country-specific duties are facing legal challenges.\nThe sectoral tariffs imposed after investigations, however, are generally seen to be on firmer legal ground.\nSince returning to the presidency in January, Trump's fresh duties on products from US trading partners have added to the business costs of importers and other firms.\nThe hit to overall consumer inflation appears limited for now, although economists expect it will take time for tariffs to flow through the world's biggest economy.\nCover photo: Andrew CABALLERO-REYNOLDS / AFP"
    },
    {
      "news_title": "This stock crashes after President Trump announces major tariff investigation",
      "news_link": "https://finbold.com/this-stock-crashes-after-president-trump-announces-major-tariff-investigation/",
      "bias": "unknown",
      "text": "Shares of luxury home furnishings retailer Restoration Hardware(NYSE: RH) tumbled after President Donald Trump announced a tariff investigation targeting the furniture sector.\nTrump said his administration plans to impose new taxes on imported furniture within 50 days, a move that rattled markets and sent RH shares sliding over 5% in after-hours trading.\nThis came just after the stock had ended the last session on a bullish note, closing at $243 up more than 11%. Year-to-date, however, RH remains deep in the red, down almost 40%.\nThe company, which relies heavily on international supply chains, has long been flagged as one of the most vulnerable retailers to trade-related disruptions.\n“Furniture coming from other Countries into the United States will be Tariffed at a Rate yet to be determined. <…> This will bring the Furniture Business back to North Carolina, South Carolina, Michigan, and States all across the Union,” Trump said.\nRH stock struggles\nNotably, the tariff announcement marks the latest blow for RH in what has already been a volatile year. Back in April, the stock plunged more than 40% after the company issued a bleak earnings outlook, citing higher costs and housing market weakness.\nAt the time, the fallout left shares down over 53% year-to-date, with CEO Gary Friedman acknowledging the difficulty of navigating tariff headwinds.\nDespite those setbacks, RH staged a brief rebound in June after reporting an unexpected $0.13 per share profit on revenue of $814 million, beating Wall Street expectations.\nShares surged more than 20% as Friedman outlined steps to mitigate exposure, including delaying a major new concept launch to 2026 and shifting more production to the company’s North Carolina facility.\nEven so, RH lowered its near-term revenue growth guidance by six percentage points, underscoring the ongoing strain of tariffs and supply chain adjustments.\nFeatured image via Shutterstock"
    },
    {
      "news_title": "Trump says furniture tariffs are coming later this year – RetailWit",
      "news_link": "https://retailwit.com/trump-says-furniture-tariffs-are-coming-later-this-year/",
      "bias": "unknown",
      "text": "Stocks for some furniture and home goods companies, including Wayfair, RH and Williams-Sonoma, tumbled after the market close, following Trump’s post.\nView Original Article\nPost Views: 1\nCNBC is the recognized world leader in business news and provides real-time financial market coverage and business content consumed by more than 355 million people per month across all platforms.\nhttps://www.cnbc.com"
    },
    {
      "news_title": "Financial News Network - Trump announces tariff investigation into furniture imports to restore U.S. manufacturing",
      "news_link": "https://financialnewsnetwork.com/trump-announces-tariff-investigation-into-furniture-imports-to-restore-u-s-manufacturing",
      "bias": "unknown",
      "text": "Trump has announced a tariff investigation into furniture imports to restore manufacturing in states including North Carolina, South Carolina and Michigan.\nOrignial Source:\nhttps://www.foxbusiness.com/politics/trump-announces-tariff-investigation-furniture-imports-restore-u-s-manufacturing"
    }
  ]
}