{
  "story_id": "GN_20250823_210536_6497ab9e",
  "metadata": {
    "title": "Trump says Putin may attend North America’s FIFA World Cup",
    "timestamp": "2025-08-23T21:05:36.071510",
    "url": "https://ground.news/article/trump-says-putin-may-come-to-world-cup"
  },
  "bias_distribution": {
    "total_sources": "33",
    "leaning_left": "7",
    "center": "3",
    "leaning_right": "7"
  },
  "perspective_summaries": {
    "left": [
      "President Donald Trump speculated that Vladimir Putin may attend the 2026 World Cup despite Russia's ban from FIFA competitions.",
      "Trump made these comments during the World Cup draw announcement at the Kennedy Center in Washington, D.C.",
      "Russia was banned from FIFA following its 2022 invasion of Ukraine and did not qualify for the 2026 World Cup.",
      "Trump stated, 'He may be coming and he may not, depending on what happens."
    ],
    "center": [
      "President Donald Trump speculated that Vladimir Putin may attend the 2026 World Cup despite Russia's ban from FIFA competitions.",
      "Trump made these comments during the World Cup draw announcement at the Kennedy Center in Washington, D.C.",
      "Russia was banned from FIFA following its 2022 invasion of Ukraine and did not qualify for the 2026 World Cup.",
      "Trump stated, 'He may be coming and he may not, depending on what happens."
    ],
    "right": [
      "President Donald Trump stated that Russian President Vladimir Putin might attend the World Cup soccer tournament in the United States next year, mentioning, \"That was a man named Vladimir Putin, who I believe will be coming.\"",
      "Trump expressed frustration over a reported Russian airstrike but did not assign direct blame, stating, \"I'm not happy about anything to do with that war.\"",
      "Homeland Security Secretary Kristi Noem announced plans to streamline the visa process for international visitors attending the tournament, saying, \"Everybody will be thoroughly vetted, but they'll be welcomed to this country.\"",
      "The World Cup draw will be held at the renovated Kennedy Center in Washington on December 5, according to Trump, with speculation over potential international participation and visa grants for visitors."
    ]
  },
  "sources": [
    {
      "news_title": "Putin wants to come to the World Cup: Trump",
      "news_link": "https://www.independent.co.uk/bulletin/news/trump-putin-fifa-world-cup-america-b2812973.html",
      "bias": "Lean Left",
      "text": "US President Donald Trump suggested that Russian leader Vladimir Putin could be invited to the 2026 World Cup, stating Putin wants to be there “very badly”.\nTrump displayed a picture of himself and Putin from their recent summit in Alaska while announcing the date and draw for the 2026 tournament.\nThe upcoming World Cup will be jointly hosted by the US, Canada, and Mexico, despite Russia currently being banned from all Fifa and Uefa competitions due to the conflict in Ukraine.\nPutin recently expressed that Trump's leadership qualities could help restore US-Russia relations, following their meeting in Alaska.\nTrump indicated he would assess the situation regarding the conflict in Ukraine within approximately two weeks before deciding on further actions or potential sanctions.\nThank you for registering\nPlease refresh the page or navigate to another page on the site to be automatically logged inPlease refresh your browser to be logged in"
    },
    {
      "news_title": "Trump Hints at Putin Coming to 2026 World Cup in USA and Jokes About Taking the Soccer Field in Shorts",
      "news_link": "https://twitchy.com/warren-squire/2025/08/22/trump-to-don-shorts-and-play-soccer-football-fifa-n2417756",
      "bias": "Far Right",
      "text": "President Donald Trump made a shocking announcement from the Oval Office on Friday. He said Russian President Vladimir Putin might be attending the 2026 FIFA World Cup in the USA. FIFA is the premier soccer tournament in the world. Some are taking the news as a sign that relations between Russia and the U.S. are thawing as Trump facilitates peace talks between Russia and Ukraine.\nHere’s Trump. (WATCH)\n🚨 HOLY CRAP! President Trump just announced VLADIMIR PUTIN may be attending the World Cup in the USA.\n— Eric Daugherty (@EricLDaugh) August 22, 2025\nPutin also sent Trump a photo of the two together.\n\"That's a man named Vladimir Putin, who I believe will be coming, depending on what happens.\"\nRelations are improving 👀 pic.twitter.com/VMeJHFEVDv\nFunny how world peace suddenly seems possible when Trump’s in charge.\n— Crushing Woke Culture (@CrushWokeAgenda) August 22, 2025\nNo endless wars, no cold stares, just strength, respect, and results.\nThey feared his diplomacy because it actually worked. 🧠🇺🇸\nMaybe they'll both wear shorts 🤣\n— LisaontheWrite 🇺🇸 (@LisaontheWrite) August 22, 2025\nWouldn’t that be a sight?\nSpeaking of wearing shorts. Trump joked that he might be suiting up and participating in a soccer match or two. (WATCH)\n🚨 LMAO! A reporter just asked if President Trump is going to take part in FIFA events, and he gave the most Trump answer ever\n— Nick Sortor (@nicksortor) August 22, 2025\nPOTUS: \"I may play... I look EXTREMELY good in shorts\" 🤣\n\"I see the money these players are making! I'm a very good athlete.\" pic.twitter.com/nNXznwrmlP\nJoe Biden could never interact with anyone like this during his four years.\n— Kurt Nimphius' Hair (@Hcp1Hcp) August 22, 2025\nWe were told POTUS Biden was the best version of Biden ever.\nRecommended\nPresident Donald Trump is always ready with the answers. He will never disappoint 😁😁😁\n— Liam (@realpjack) August 22, 2025\nDefinitely a Trump answer lol\n— UncleKoco (@UncleKoco) August 22, 2025\nThere will never be another Trump.\nSome are picturing what Trump would look like on the field. (WATCH)\nHaters will say this is ai 😂\n— Politi_Rican 🇵🇷 𝕏 🇺🇸 (@TheRicanMemes) August 22, 2025\npic.twitter.com/d4tlk08mLt\n— Richard Crowe (@SocraticQuant) August 22, 2025\nUnfortunately i'll place my bets on Leo Messi and his squad to eliminate Trump in the first round 😂\n— Kole Sousa (@KoleSousa) August 22, 2025\nYeah right... There's a reason he plays golf.\n— keeblurr (@keeblurr) August 22, 2025\nIt’s true pic.twitter.com/V58QkTK1jt\n— Chi-Town John (@Shytownboy) August 22, 2025\nOk, we can never unsee that pic. But the poster is right. Trump’s game will always be golf.\nEditor’s Note: Do you enjoy Twitchy's conservative reporting that takes on the radical left and woke media? Support our work so that we can continue to bring you the truth.\nJoin Twitchy VIP and use the promo code FIGHT to get 60% off your VIP membership!\nJoin the conversation as a VIP Member"
    },
    {
      "news_title": "Donald Trump says Vladimir Putin 'may' come to attend 2026 World Cup",
      "news_link": "https://www.usatoday.com/story/sports/soccer/worldcup/2025/08/22/putin-fifa-world-cup-donald-trump/85781141007/",
      "bias": "Lean Left",
      "text": "Donald Trump says Vladimir Putin 'may' come to attend 2026 World Cup\n- Former President Trump speculated that Vladimir Putin may attend the 2026 World Cup despite Russia's ban from FIFA competitions.\n- Trump's comments came during the announcement of the World Cup draw location at the Kennedy Center in Washington D.C.\n- Russia was banned from FIFA following its 2022 invasion of Ukraine and did not participate in 2026 World Cup qualifying.\nDespite Russia being banned from FIFA competitions, Donald Trump said he thinks that Vladimir Putin will attend the 2026 World Cup co-hosted by the United States, Canada and Mexico.\nSpeaking to reporters on Friday, Aug. 22 to announce that the draw for the World Cup would be held at the Kennedy Center in Washington, D.C., Trump showed off a photo of himself and the Russian president from the historic summit in Alaska and suggested that Putin would come to next summer's tournament.\nTrump said he believes Putin \"will be coming, depending on what happens\" but did not elaborate beyond reiterating that he \"may be coming and he may not, depending on what happens.\"\nFIFA president Gianni Infantino, standing beside Trump as he made the remarks in the Oval Office, did not comment on the possibility of Putin attending.\nRussia was banned from competing in FIFA and UEFA competitions following the 2022 invasion of Ukraine, and it didn't participate in qualification for the 2026 tournament.\nRussia hosted the 2018 World Cup and Putin took on a large public-facing role during the festivities. He spoke at the opening ceremony and was on the field for trophy presentations following France's win over Croatia in the final."
    },
    {
      "news_title": "Putin wants to attend 2026 FIFA World Cup in the U.S. \"very badly,\" Trump says",
      "news_link": "https://www.axios.com/2025/08/22/putin-fifa-world-cup-trump-usa",
      "bias": "Lean Left",
      "text": null
    },
    {
      "news_title": "Moved on to gingerbread: Trump showed a photo with Putin and invited him to the 2026 Football World Cup: EADaily",
      "news_link": "https://eadaily.com/en/news/2025/08/22/moved-on-to-gingerbread-trump-showed-a-photo-with-putin-and-invited-him-to-the-2026-football-world-cup",
      "bias": "Lean Right",
      "text": "US President Donald Trump showed a joint photo with the Russian leader taken during the summit in Alaska. He showed it to reporters at today's briefing at the White House.\nHe admitted that Putin came out better in the picture.\n\"I think it's a good picture of him and a normal one of me, but his is a good one,\" Trump said, quoted by TASS.\nIn the picture, Putin and Trump are captured at Anchorage Airport.\n\"This is a man named Vladimir Putin, who I am sure will come [to the World Cup in 2026], it depends on what happens ... A lot of events are expected in the next couple of weeks, but I thought it was a good photo,\" the American president said.\nAs reported by EADaily, US President Donald Trump spoke with his Russian counterpart Vladimir Putin about the attack of the Russian Armed Forces on the American Flex plant in Mukachevo in Transcarpathia. He told reporters about this today at a briefing at the White House."
    },
    {
      "news_title": "Trump: Russia's Putin Might Come to US for World Cup '26",
      "news_link": "https://www.newsmax.com/newsfront/donald-trump-russia-vladimir-putin/2025/08/22/id/1223571/",
      "bias": "Right",
      "text": "President Donald Trump said Thursday that Russian President Vladimir Putin might travel to the United States for next year's World Cup soccer tournament, suggesting the Russian leader could be among the international figures attending the global event.\n\"I was just sent a picture from somebody who wants to be there very badly,\" Trump told reporters, in a press conference airing on Newsmax on Friday afternoon. \"He's been very respectful of me and of our country, but not so respectful of others. That was a man named Vladimir Putin, who I believe will be coming. Depending on what happens, he may be coming, and he may not. We have a lot of things happening over the next couple of weeks.\"\nThe president then held up a photograph of himself with Putin from their recent summit in Alaska, saying he planned to sign a copy for the person who had sent it. \"I thought it was a nice picture of him. OK of me, but nice of him,\" Trump said.\nAsked about a reported Russian airstrike that hit a U.S. factory in Ukraine, Trump voiced frustration but avoided assigning direct blame.\n\"I'm not happy about it, and I'm not happy about anything having to do with that war,\" he said. \"I said I settled seven wars, and actually, if you think about wars, add three more, so it would be 10. I thought this would be in the middle of the pack in terms of difficulty.\"\nTrump added that he is \"not happy about anything about that war. Nothing. Not happy at all. We'll see what happens. I think over the next two weeks, we're going to find out which way it's going to go.\"\nEarlier in the press conference, Trump announced that the World Cup draw will be held at the renovated Kennedy Center in Washington on Dec. 5.\nThe president's remarks come as speculation grows over potential international participation in the tournament, and about whether visas will be granted for visitors coming in from around the world.\nHomeland Security Secretary Kristi Noem explained that the administration is preparing to streamline the visa process for international visitors attending the tournament.\n\"We have a process set up that we'll be implementing for getting visas approved,\" she said. \"Everybody will be thoroughly vetted, but they'll be welcomed to this country. It'll happen quickly, and we're excited for them to come,\" Noem said. \"So I would hope that around the world, people know that the United States is excited to bring their family here to enjoy this event.\"\nSandy Fitzgerald ✉\nSandy Fitzgerald has more than three decades in journalism and serves as a general assignment writer for Newsmax covering news, media, and politics.\n© 2025 Newsmax. All rights reserved."
    },
    {
      "news_title": "Trump says Putin may come to World Cup",
      "news_link": "https://www.nbcnews.com/video/shorts/trump-says-putin-may-come-to-world-cup-245581893867",
      "bias": "Lean Left",
      "text": "Parents arrested in connection to baby's disappearance\n00:57\nEvacuations underway after explosion at Louisiana plant\n00:16\nMaxwell denies existence of Epstein 'client list'\n00:31\nMaxwell says she never saw Trump be 'inappropriate'\n00:16\nDozens hospitalized in deadly NY bus crash\n00:24\nMeta responds to censorship of pro-immigration post\n00:40\nThe DOJ releases Ghislaine Maxwell interview transcript\n01:44\nCracker Barrel changes stir up controversy\n00:57\n'I worry about people's growing lack of trust in' gov.\n01:49\nKilmar Abrego Garcia released from federal custody\n00:31\nMultiple fatalities in New York tour bus crash\n00:32\nJoe Gruters elected as next RNC chairman\n00:24\nTrump on cities potentially next in crime crackdown\n00:35\nNow Playing\nTrump says Putin may come to World Cup\n00:37\nUP NEXT\nTrump: 'I might play' in FIFA's group draw stage\n00:20\nCalifornia joins US redistricting battle against Texas\n01:06\nTrump says Putin may come to World Cup\n00:37\nCopied\nWhile talking about the World Cup, President Trump held up a picture of him and Russian President Putin, adding that he may attend the games, \"depending on what happens.\"Aug. 22, 2025"
    },
    {
      "news_title": "Trump says Putin may attend North America’s FIFA World Cup",
      "news_link": "https://thehill.com/homenews/5466036-trump-says-putin-may-attend-north-americas-world-cup/",
      "bias": "Center",
      "text": null
    },
    {
      "news_title": "Trump Says Putin May Attend World Cup",
      "news_link": "https://politicalwire.com/2025/08/22/trump-says-putin-may-attend-world-cup/",
      "bias": "Center",
      "text": "“President Trump on Friday said that Russian President Vladimir Putin may attend the 2026 FIFA World Cup being co-hosted by the U.S., Canada and Mexico, showing off a photograph in the Oval Office of the two leaders together,” The Hill reports.\nSaid Trump: “He may be coming and he may not, depending on what happens. We have a lot of things happening over the next couple of weeks.”\nSave to Favorites"
    },
    {
      "news_title": "Putin may come to the World Cup, says Trump",
      "news_link": "https://www.telegraph.co.uk/us/news/2025/08/22/donald-trump-world-cup-putin/",
      "bias": "Lean Right",
      "text": "The West imposed sanctions on Russia following the invasion in 2014, which proved the first step in Putin’s move to take the rest of Ukraine eight years later.\nQuestioned by a reporter on a Russian air strike that hit an American electronics factory in Ukraine on Thursday, Mr Trump answered: “I’m not happy about it, and I’m not happy about anything having to do with that war.”\nAfter Putin’s meeting with Mr Trump in Alaska, the US president announced he was working to organise a sit-down between Putin and Volodymyr Zelensky, but the Kremlin has so far refused to confirm the invitation.\nCommentators have noted that Mr Trump often imposes “two-week” deadlines for himself on a range of issues, including dealing with Russia, which rarely end up materialising.\nIn May, he announced he would know if Putin was serious about ending the war in Ukraine “within two weeks”.\nIn the White House on Friday, Mr Trump was presented with a ticket to the final World Cup match, which will take place in July 2026 in New Jersey, by Mr Infantino.\nThe Fifa boss also handed the president the football trophy, which is made of 18-carat gold, telling him: “It’s for winners only – since you are a winner, of course you can as well touch it.”"
    },
    {
      "news_title": "Trump Flaunts Personal Photo Gift From Putin In the Oval Office",
      "news_link": "https://api.follow.it/track-rss-story-click/v3/NmWK7c5pDzY_pXJicSkotuJoQqQNI1GC",
      "bias": "unknown",
      "text": "During a recent event at the White House about the 2026 World Cup draw in Washington, Donald Trump was in the Oval Office grinning like a man who had just found treasure, holding up a picture he said came from Vladimir Putin, showing the two of them standing together in Alaska only a week ago.\n“I was just sent a picture from somebody that wants to be there very badly,” Trump said. “He’s been very respectful of me and of our country, but not so respectful of others.” He continued, “That’s a man named Vladimir Putin,” and even promised to sign the picture for the Russian leader, as if autographs were now part of diplomacy.\nOn his head was a bright red hat screaming TRUMP WAS RIGHT ABOUT EVERYTHING! He smiled while showing off the image. “I thought it was a nice picture of him. Okay of me, but nice of him.”\nThe whole scene felt out of touch. Russia had just launched fresh missile strikes in Ukraine, including one that hit an American electronics factory. Putin’s foreign minister also dismissed Trump’s announcement of an upcoming Putin-Zelenskyy meeting, saying there was no such plan.\nStay up-to-date with the latest news!\nSubscribe and start recieving our daily emails.\nMeanwhile, the reality outside that room looked far more serious. Only days earlier, Trump had hosted Putin in Anchorage and then welcomed Zelenskyy and European leaders in Washington. He said he was arranging a direct meeting between the Russian and Ukrainian presidents.\nHis press secretary Karoline Leavitt even told reporters it would happen soon. But on Friday, Russian foreign minister Sergey Lavrov told NBC News there was no summit planned. He also called NATO talks “futile.”\nThat left Trump in an awkward spot. The peace deal he promised looked further away than ever.\nWhen asked about the Russian strike on Ukraine, Trump said, “I told that I’m not happy about it, and I’m not happy about anything having to do with that war.” He added, “No, I’m not happy about anything about that war. Nothing. Not happy at all. We’ll see what happens. I say, over the next two weeks, we’re going to find out which way it’s going to go. And, I better be very happy.”\nTrump also said, “It’s gonna be a very important decision. And that’s whether or not it’s massive sanctions or massive tariffs or both, or do we do nothing and say, ‘It’s your fight.’”\nThe “two weeks” promise has become one of Trump’s favorite lines. He keeps saying something big is coming soon. But for people watching the war, his words do not sound like a plan.\nFeatured image via YouTube screengrab"
    }
  ]
}