{
  "story_id": "GN_20250825_235820_939f991e",
  "metadata": {
    "title": "Trump threatens Russia sanctions if no progress toward peace deal with Ukraine",
    "timestamp": "2025-08-25T23:58:20.267488",
    "url": "https://ground.news/article/russia-does-not-want-to-end-the-war-they-are-doing-everything-to-prevent-trump-from-imposing-sanctions-on-them"
  },
  "bias_distribution": {
    "total_sources": "76",
    "leaning_left": "11",
    "center": "11",
    "leaning_right": "20"
  },
  "perspective_summaries": {
    "left": [
      "U.S. President Donald Trump warned Russia could face massive sanctions unless progress is made towards peace with Ukraine within two weeks, stating he is not happy about a recent Russian strike that hit an American factory in Ukraine.",
      "Russia ruled out an immediate meeting with Ukrainian President Volodymyr Zelenskyy, despite Trump's claims of arranging a summit between them.",
      "Ukraine has developed a new cruise missile, the Flamingo FP-5, which can strike over 3,000 kilometers into Russian territory, according to Iryna Terekh, CEO of Ukraine's Fire Point defense company.",
      "Kaja Kallas, the European Union’s foreign policy chief, warned against concessions to Russia, describing such negotiations as a trap that rewards the aggressor."
    ],
    "center": [
      "U.S. President Donald Trump warned Russia could face massive sanctions unless progress is made towards peace with Ukraine within two weeks, stating he is not happy about a recent Russian strike that hit an American factory in Ukraine.",
      "Russia ruled out an immediate meeting with Ukrainian President Volodymyr Zelenskyy, despite Trump's claims of arranging a summit between them.",
      "Ukraine has developed a new cruise missile, the Flamingo FP-5, which can strike over 3,000 kilometers into Russian territory, according to Iryna Terekh, CEO of Ukraine's Fire Point defense company.",
      "Kaja Kallas, the European Union’s foreign policy chief, warned against concessions to Russia, describing such negotiations as a trap that rewards the aggressor."
    ],
    "right": [
      "U.S. President Donald Trump stated he will make a significant decision in two weeks regarding Russia sanctions if no progress is made toward a peace deal in Ukraine.",
      "Ukrainian President Volodymyr Zelensky accused Russia of stalling negotiations for a meeting with President Putin, asserting that a summit is essential to negotiate an end to the conflict.",
      "Russian Foreign Minister Sergei Lavrov mentioned that Putin is willing to meet Zelensky when the agenda is fully prepared, indicating that currently, 'this agenda is not ready at all."
    ]
  },
  "sources": [
    {
      "news_title": "When the world converges against Trump",
      "news_link": "https://asiatimes.com/2025/08/when-the-world-converges-against-trump/",
      "bias": "Lean Left",
      "text": "India could become a significant and unexpected complication in US President Donald Trump’s efforts to secure a peace deal on Ukraine.\nThe meeting at the end of August in Beijing between Indian Prime Minister Narendra Modi and Chinese President Xi Jinping – with Russia’s blessing – could provide Moscow with precious wiggle room to stall or delay any ceasefire with Kyiv.\nA closer Russia-India-China (RIC) triangle would also mean that possible new US sanctions against Moscow could be absorbed more easily.\nIt could pose a serious setback for Trump. If he loses the midterm elections next year, he could become a lame duck, throwing the US into a state of political uncertainty for the following two years.\nBetting on American disarray until the new presidential vote in 2028 could be well in the interests of Russian President Vladimir Putin. With a political victory in Ukraine now nearly out of reach, Putin could boast of the chaos he managed to spread in America and the wider West.\nIt is about the next three years, but it begins now and can be divided into two chapters: the allies and Putin’s strategy.\nThe allies\nIn the early months of Trump’s presidency, for the first time in the past eight decades, a fissure between America and its allies has emerged. This crack started about the defense of Ukraine, the US relationship with NATO and ties with Russia. American allies, both west and east of Russia, feel left behind, if not totally abandoned, by the US.\nFor nearly a century, America was the bulwark of their security. Now, for the first time, many of them seem to be adopting a dual strategy. In the short term, they are focused on managing Trump, while many have begun to consider long-term alternatives to a world order centered on America.\nThis long-term thinking is unprecedented among American allies since the end of World War II. While they always understood that American support might not always be absolute and that America could withdraw at some point, few believed that the American presence could disappear entirely.\nThere’s a difference between leaving Afghanistan or Vietnam after ten years of war and shrugging off security guarantees for Germany or Japan. Now, some may feel that any country could become another Afghanistan overnight, forsaken by sudden mood changes in Washington.\nThese shifts in thinking could have very significant medium- and long-term effects. America is not only a country but also a global system with a thin but essential balance between inside and outside. If America jeopardizes its international system to sustain itself, it risks losing both global influence and internal stability.\nA concrete example of this shift can be seen in the next Xi-Modi summit. For over two decades, the US worked to pull India more closely into its strategic orbit. During Trump’s first term, this effort seemed to pay off, bolstered by a strong personal rapport between the American president and Prime Minister Modi.\nHowever, after the recent brief border clash between China and Pakistan, something went wrong. India now faces higher US tariffs than China, a surprising reversal given that China was identified as America’s main adversary by Trump’s advisors before the presidential vote. The new US attitude probably prompted India to reconsider its relationship with China.\nOf course, old China-India suspicions have not been buried. India just tested a medium-range ballistic missile capable of carrying a nuclear warhead, thus signaling it’s ready to confront China. At the same time, Xi made a surprise visit to Tibet, reaffirming Beijing’s sovereignty in the region neighboring India.\nTibetan spiritual leader the Dalai Lama – who turned 90 in July – has said his reincarnation will be born in India, which could give India a special role as de facto “guardian” of the new Lama (see here) and thus a say in Tibet. Moreover, the Modi-Xi summit is happening after the Indian Prime Minister will have visited Japan, famously wary of China.\nTherefore, the rapprochement is occurring with great caution. But it’s happening, and it is happening under Russia’s watch. It’s unclear what consequences this Indian shift may have, or whether it will last, and how important it will be in the coming months and years. But the issue and implications go beyond India.\nIt reflects deep and growing doubts among US allies. The meeting between Modi and Japanese Prime Minister Shigeru Ishiba could be significant, as Tokyo is also concerned about its ties with America.\nEven if a future American president changes course — or if Trump himself reverses his current approach — the precedent has been set: even close allies are starting to question whether the US remains fully committed.\nThis raises enormous questions for America, its allies and its adversaries. Uncertainty is growing, and the coming months ahead could be tense.\nMoriarty Putin\nThe new tariff-driven situation could prove hazardous for America, even if some American politicians argue that it is necessary to replenish the country’s coffers. In truth, without a strong America, the American-led international order is also doomed. Yet the disruption could undermine decades of strides and efforts.\nCompounding this are global and domestic campaigns against Trump. He is widely portrayed as unreliable and ineffective. As a result, a country led by such a figure is also seen as untrustworthy. And by extension, a nation that elects such a leader is viewed with suspicion.\nThe implication is that America is flawed, and democracy itself is suspect. This narrative is gaining traction both at home and abroad, isolating not just the presidency, but the United States as a whole.\nCui prodest? Who gains from this? Putin is losing politically and militarily in Ukraine. In Europe, his actions have created an unprecedented wave of unity, anti-Russian sentiment and military buildup.\nIn Asia, he is losing power and influence to China and even North Korea. Even loyal Belarus is growing afraid of Moscow. Ultimately, Russia risks losing everything: its geopolitical relevance, its influence, even its identity. As both East and West turn away, what may remain is a shrunken version of itself — a new Muscovy, confined to Moscow and a handful of surrounding regions.\nYet this is not the end of the story. Media coverage increasingly portrays Trump as subjecting the world to an ongoing reality show where the goal is not to reach any conclusion or agreement but to create perpetual drama, resulting in a collective neurosis around him. It’s thus unclear whether Trump genuinely wants a deal with Russia. Perhaps not — because reaching an agreement would end the drama.\nThis may not reflect the full reality, but it’s a message that’s being peddled around. By now, Trump should be aware that not only is Putin deceiving him, but that he might also be riding the ongoing global campaign against him. The stories of Trump being a Putin puppet suggest that Putin is some super Moriarty (Sherlock Holmes’ super villain) of international politics.\nIn this narrative, a United States led by a patently incompetent and Russian puppet president is evidence of America’s decline, foreshadowing a Russian overall victory. Putin would be foolish not to exploit this narrative – and he’s not foolish.\nTrump, however, has proved time and again that he is practical and pragmatic in responding to market pressures and external forces. He could still reconsider his approach to Russia and on tariffs. The next few weeks could be pivotal as Trump prepares to meet Xi. Objectively, China is the greatest beneficiary of the current US-Russia conflict.\nBut Beijing shouldn’t gloat; it should be cautious and humble as things could suddenly turn upside down. American fissures could be fixed and Russia may be too quick to anticipate what card will be played next.\nIt’s a time of chaos; perhaps everyone should take a pause and seek some kind of truce. But stopping the merry-go-round is easier said than done. Trump could begin to pivot when he welcomes South Korea’s new President Lee Jae Myung to the White House on August 25.\nThis article first appeared on Appia Institute and is republished with permission. Read the original here.\nAn idiotic narcissist…. who wears a made in China hat reading “Trump was right about everything”. Narcissism. It is one of the pre-requisites of being a Beltway tool for corporate fascism. There is no saving America from its decline, that country has been hijacked by a hostile lifeform – just take a look at Congress. No “voting” can fix that.\nIt takes ine aback to see just how desparate the Western narrative has become. Divorced from reality.\nHoping, praying, rain dancing for the cintinuation of war and conflict.\nUt nay be news to sime but Rusdia has akready won the war. Trump just wanrs to make sure that this is Eurooean loss — not his. The rest are detailes. It will be in US interest to extracate itself as quickly as pissible from this entanglenent\nIf course Trump can be persuaded to crrate another drama. It is goid for the morale, bad for economy. But fear not — British arr doublung down in mischief. Which means that bug ans slow in uptake — the biggvdummy will just “have to” come in to save the honor of our allies, pay in treasure and blood to clean up the mess.\nEU countries need to show some spine and stop acting as U.S. running dogs. EU is basically seen as complete joke in global south now.\nMuch of the Global South has Paris Syndrome\n“Dalai Lama – who turned 90 in July – has said his reincarnation will be born in India…”\nI think next Dalai Lama will be born in askai chin. China controls it while India claims it as Indian territory."
    },
    {
      "news_title": "War, Trump’s New $500 Note & Volcanos -Martin Armstrong",
      "news_link": "https://www.sgtreport.com/2025/08/war-trumps-new-500-note-volcanos-martin-armstrong/",
      "bias": "Right",
      "text": "by Greg Hunter, USA Watchdog:\nFive weeks ago, legendary financial and geopolitical cycle analyst Martin Armstrong warned his “Socrates” predictive computer program showed a “100% Chance of Nuclear War.” After that, Trump was able to get Putin to Alaska to start meaningful peace talks between Russia and Ukraine. The chance for war is still 100%, but now, that war may not involve America. Armstrong explains, “My sources in Ukraine are telling me the losses on the battlefield are approaching 1.8 million, 5 million fled to Russia, 8 million fled to the EU. . .. Ukraine is about ready to fall apart. . .. I spread this to Washington and that is President Zelensky was sending $50 million per month to UAE. So, Zelensky has been preparing to leave. There is no way this guy could possibly retire in Ukraine. They will kill him.”\nTRUTH LIVES on at https://sgtreport.tv/\nDoes this mean the war may be over? Zelensky and nearly all of Europe’s leaders came to Washington recently to meet with President Trump, but it really was not to talk peace. Armstrong says, “The fact that all those leaders came to Washington—uninvited, they all met with Zelensky before they went to meet with Trump. Why did they come? Because they need war. I have warned Washington.”\nSo, if Europe starts a wider war with Russia, will Trump stay out of it? Armstrong says, “Yes, Trump said no American troops from what I have been told. Trump refuses to send any American troops to Ukraine as peacekeepers—period.”\nReading between the lines, does this mean Trump is putting the EU on notice we are not going to Article 5 in if you start a war? Armstrong says, “Article 5 is voluntary. I have made this very clear to them in Washington. You don’t have to participate. . .. I can’t stop the war. The best I can do is reduce the amplitude. If I can keep America out of this war, that is our best outcome. . .. Europe knows it’s in trouble financially. They have $335 billion of Russian assets frozen. France has about $71 billion. . .. The rumor going around right now is if there is a peace deal and they have to release those frozen assets, France can’t because they have been dipping into them. Europe is a complete mess. When it comes down to handing back $335 billion in Russian assets, I am not sure Europe is prepared to do that.”\nArmstrong says forget all the talk of the elite wanting to get rid of cash and replace it with digital currency. Armstrong says, “No, no, no. Why is Trump talking about a $500 note. . .. Trump would not even contemplate doing a $500 bill if he was going to cancel the currency. Everybody else is cancelling currency and putting in capital controls, and Trump is going in the opposite direction. . .. Gold is still projected to go much higher because it is anticipating war.”\nOne of the surprising things Armstrong brought up are new signals from “Socrates” on increasing volcanic activity all over the world. Hawaii’s Kilauea eruption happened for the 31st time since December on Friday. It spewed lava for 12 hours, and then there was the recent eruption in Northeast Russia that had a huge eruption after 600 years of lying dormant. Armstrong says, “We have every data base in there. Earthquakes, volcanos and temperatures back to 1869 from New York City. It does not show global warming. . .. The computer says we are heading to global cooling and not global warming. . .. The computer is showing from 2025 on, we are going to be seeing a lot more volcanic activity. I just got off the phone with someone from Italy, and they say the super volcano there is starting to become active.”\nIn closing, Armstrong says, “I still want to have one of those $500 notes.”\nThere is more in the 64-minute interview."
    },
    {
      "news_title": "Why Trump's diplomacy leaves Ukraine no closer to peace",
      "news_link": "https://www.rte.ie/news/2025/0824/1529678-trump-ukraine/",
      "bias": "Center",
      "text": "One week after US President Donald Trump's meeting with his Russian counterpart Vladimir Putin in Alaska, the war in Ukraine is no closer to ending.\nIt has been a week of hype, confusion and, ultimately, disappointment over the direction of the US-led peace initiative.\nThe main and most immediate takeaway from Alaska was Mr Trump's unexpected decision to drop US demands for a ceasefire, a US-proposed policy supported by Ukraine and Europe, and instead support Russia's demand to go straight to peace talks.\nBut one other significant point emerged from last weekend's US-Russia summit: an apparent shift by Russia on security guarantees for Ukraine.\nWe know this because after the meeting US Special Envoy Steve Witkoff told CNN that the Russian delegation had agreed to the idea of the US and European countries providing an Article 5-type security guarantee for Ukraine (Article 5 being the clause in the alliance's founding treaty that an attack on one member is an attack on all).\n\"Game-changing\" is how Mr Witkoff described this apparent Russian concession.\nDuring the meeting in Alaska, Mr Putin stuck to his maximalist demands for Ukraine to cede one-fifth of its sovereign territory to Russia, including a brazen demand for Ukraine to withdraw entirely from the part of Donetsk region that it still controls.\nHowever, a Russian concession on Western security guarantees would make a real difference for Ukraine, providing an insurance policy against another Russian invasion in the future.\nAfter the disappointment of Mr Trump's abandonment of the ceasefire policy, European leaders seized the initiative and tried to pin down what those security guarantees would mean in practice, and the level of US commitment.\nAt his meeting with Ukrainian President Volodymyr Zelensky and European leaders in the White House on Monday, Mr Trump gave his clearest statement yet on US involvement in security guarantees for Ukraine when he said that the US would \"help\" Europe.\n\"European nations are going to take a lot of the burden. We're going to help them and we're going to make it very secure.\"\nMr Zelensky hailed Mr Trump’s statement on security guarantees for Ukraine.\nAnd though the US president ruled out sending American ground troops, he offered a better indication on Fox News last Tuesday of the level of help Europe could expect.\n\"We're willing to help them with things, especially, probably by air,\" he said.\n'No one in Ukraine optimistic about security guarantees'\nThough vague, the suggestion of US air support gave weight to European plans for a post-war reassurance force.\n\"No one in Ukraine is optimistic about security guarantees, really, because we don't know what would happen,\" Volodymyr Dubovyk, the Director for the Centre of International Studies at Odesa Mechnikov National University, told RTÉ News.\nHe cautioned that Mr Trump could change his mind on the level of US involvement in providing Western security guarantees to Ukraine.\nPutting \"some meat back on the bone\" about security guarantees is, said Mr Dubovyk, \"the main conversation right now\".\nEuropean leaders and other members of the 'Coalition of the Willing’ began those kinds of discussions on Tuesday. Ireland, Taoiseach Micheál Martin said, was open to contributing a peacekeeping mission in line with the UN Charter.\nBut Russia’s reported concession on supporting security guarantees for Ukraine turned out not to be the \"game-changer\" Mr Witkoff touted.\nBy Wednesday, Russian foreign minister Sergey Lavrov was saying that Russia needed to be included in any talks that dealt with security guarantees for Ukraine.\nBy Thursday, he was saying that Russia must have a veto on Western security guarantees, which would render them useless.\nAnd, Russia again brought up its opposition to the deployment of Western troops in Ukraine as part of a peacekeeping force.\nSomehow, Mr Putin and his delegation had not mentioned these major stipulations during their three-hour discussions with Mr Trump, Mr Witkoff and US Secretary of State Marco Rubio in Anchorage.\nIt was a classic case of Kremlin subterfuge: offer something vague that has connotations of a big concession, only to take it all back days later.\nDifficult to see what US achieved from Alaska meeting\nFrankly, it is difficult to pinpoint what the US achieved from the meeting in Alaska.\nMr Trump conceded to Russia’s opposition to a 'ceasefire-first' approach, which he had said was his priority going into the meeting.\nHe and his team failed to get concrete details on what kind of security guarantees, if any, Russia would agree to.\nMr Trump also let Russia avoid new US sanctions and the secondary tariffs that he had threatened to impose on countries that buy Russian oil.\nAnd Mr Putin continues to show no willingness to meet Mr Zelensky.\nOn Monday, Mr Trump said he had begun to make arrangements for a meeting between the Russian and Ukrainian presidents.\nBut the Kremlin saw it differently.\nRemarks from Russian officials since Tuesday show that Moscow has no intention of agreeing to a meeting between Mr Putin and Mr Zelensky any time soon.\nThe closest the Kremlin came to acknowledging Mr Trump’s push for a Putin-Zelensky meeting came on Tuesday when a senior Russian foreign policy advisor said the US and Russian presidents had discussed \"the possibility of raising the level of representatives\".\nThat could just as well mean a meeting at the level of foreign ministers.\nPerhaps Mr Trump sensed after his 40-minute phone call with Mr Putin late on Monday that the meeting in Alaska had not advanced his peace plan efforts.\nThere was a possibility, Mr Trump conceded during a phone-in interview with Fox News on Tuesday, that Russia's leader \"doesn't want to make a deal.\"\nSanctions a leverage for Trump\nSanctions were Mr Trump's leverage to cajole Russia into peace talks.\nOn Friday, after a week of no progress and vague words from the Kremlin, the US president renewed his threat to impose sanctions on Russia if no progress towards a peace deal were made in the next two weeks.\nMr Trump's intentions to stop the war in Ukraine should be commended but he has gone about it the wrong way, failing to use America's economic might to extract real concessions from Russia.\nFor Ukraine, sanctions are still an important tool to pressure Russia.\n\"Normally, I would say the weapons are more important than sanctions, but this time, I would say maybe sanctions are even more important than the weapons, because the sanctions can actually hurt Russia,\" said Mr Dubovyk.\nIt is clear that Russia has no intention of stopping its war any time soon.\nThis week its forces continued to launch drones and missiles at Ukrainian cities and towns and its ground offensive continued as normal.\nRichard Haass, a former senior US diplomat, this week told Politico that Mr Trump's decision to abandon calls for a ceasefire in Ukraine was a \"big tactical error\".\n\"To negotiate a formal peace could take months or years,\" he said, because \"it involves all the most difficult issues that either side wants to bring up\".\n\"It’s most likely to prolong the war and make it difficult, if not impossible, to succeed\".\nGiven that the Kremlin shows no signs of wanting to engage in a leaders summit with Mr Zelensky, the current US-brokered peace initiative looks stuck.\nIf and when Mr Trump wants to inject some momentum back into the process, he might finally have to get tough with Russia and commit to sanctions.\nOtherwise, his goal of being the US president who stopped the war looks unlikely to succeed."
    },
    {
      "news_title": "Iran's Surprise New Neighbor",
      "news_link": "https://www.gatestoneinstitute.org/21854/iran-surprise-new-neighbor",
      "bias": "Far Right",
      "text": "On October 10, as the committee that chooses the Nobel Peace Prize laureate meets, US President Donald Trump is expected to be in Transcaucasia to inaugurate work on a 166-kilometer-long railway line over one of the world's most rugged terrains.\nThe planned line is already dubbed the Trump Pathway to Peace and Prosperity, because it ends more than 200 years of on-and-off wars between Turks (initially as Ottomans) and Armenians (as subjects of the Russian czar and later the USSR). The disintegration of the Soviet Empire in the 1990s led to the emergence of a landlocked Armenian state next to what was dubbed the Republic of Azerbaijan, but the conflict continued.\nWith the Soviet suzerain gone, the two impoverished republics started a war that lasted over a decade and pushed over 300,000 people out of their ancestral villages.\nTurkey backed Azerbaijan, with which it shares a more or less similar language, while Iran took Armenia's side to put a halt to expanding Turkish influence towards the Caspian Basin. Russia tried to hedge its bets because it needed close ties with Azerbaijan in forging a new legal convention for the Caspian, while retaining access to Iran via Armenia's border.\nIran has a 688-kilometer-long border with Azerbaijan, which is cut by Armenia's 44-kilometer-long frontier with Iran. That narrow frontier was to be the starting point of what was called the North-South Corridor, linking Iran with Russia and thence Europe via Georgia.\nNeedless to say, the tense situation between Armenia and Azerbaijan meant that the Iran-Georgia-Russia-Europe railway link was never built. Nevertheless, the Armenian border remained crucial for Iranian transit and trade, with long lines of trucks bringing goods from Russia and, before the Ukraine war, much of eastern and Central Europe.\nThe transit route became even more important to Iran for beating American and European sanctions with a wink and a nod from Russia and Armenia.\nIn addition, two important hydroelectric complexes are located in the short border area, making close cooperation between Iran and Armenia vital for both sides. Within a 5-kilometer depth of the border zone, we also find a free-trade zone of some importance to the Iranian provinces of East Azerbaijan and Ardebil. To these, one could add water-management facilities and environmental projects.\nThe patchwork, created by Stalin's deliberate divide-and-rule policy, chopped the Azerbaijan Republic into two bits, with the one on the west known as the Autonomous Republic of Nakhichevan, which has a border with Turkey, Iran and Armenia, but not with Azerbaijan itself. Thus, contact between Turkey and Azerbaijan has only been possible via Iranian territory.\nThe Trump \"pathway\" is designed to connect two existing railway lines, one between the city of Kars in Turkey to Nakhichevan and another,158 kilometers long, from Velidbag to Ordubad, and extend it with a new 166-kilometer-long line between Ordubad in Nakhichevan and Horadiz in Azerbaijan and thence to Baku on the Caspian.\nHad Iran not been isolated diplomatically, the ideal route for the Turkey-Caspian railway would have been through Iranian territory, because it could have also served Iran's northwestern provinces. The theoretical line via Iran might have also reduced the cost of building pipelines to transit Caspian energy resources to the Mediterranean via Turkey.\nThe choice of the new route, known as the Zangezur, in the Armenian province of Syunik, shuts Iran out of a trade line that could link Anatolia to Central Asia and China via the Caspian at a time that Iran is also excluded from China's global belt-and-road scheme.\nNeedless to say, Tehran isn't happy about all that.\nIran's Tasnim news agency, controlled by the Islamic Revolutionary Guard Corps, expresses concern that, in view of Baku's close ties with Israel, the project could pose a direct threat to Iranian security. The headline of the government daily newspaper in Iran the other day was \"America Become Our Neighbor!\"\nThis is because under the Trump \"pathway\" deal, the border area on the Armenian side to the depth of five kilometers is leased to the US for 99 years. Under the memorandum of understanding by Trump with Azerbaijani President Ilham Aliev and his Armenian counterpart Nikol Pashinyan, the actual border posts will be manned by Armenian guards. But the US will be in control of the entire border by creating a Pathway Zone like the Panama Canal Zone in Central America.\nThe 99-year lease deal revives the bitter memory of Iran ceding what are now Azerbaijan, Armenia and Nakhichevan to the Russian Empire under the Golistan Treaty in 1813. But when that lease ended, Iran was too weak to demand the return of its lost territories and Russia too strong to even consider handing them back.\nAt the time, the Qajar rulers of Iran decided to grin and bear it, hoping that the czarist Russian Empire would collapse. But when that happened in 1917, the Qajars were still not strong enough to challenge the new Soviet Empire.\nTehran is also sore that it wasn't even consulted about such a major change along a crucial border. Nevertheless, the Tehran leadership has decided to welcome the deal brokered by Trump and accept the Pathway, albeit with a few frowns, in the hope that the new situation would help ease tensions with Washington.\nOne sign that Tehran has decided to accept the new neighbor is the decision to stop the project to build a new military base in Talesh, close to the borders of both Armenia and Azerbaijan, for possible use in an operation to invade and annex Nakhichevan. Thus, the Trump pathway could also make sure that peace is kept between Iran and Azerbaijan.\nIran's \"Supreme Guide\" Ali Khamenei has remained totally silent on the issue, implicitly endorsing President Massoud Pezeshkian's pragmatic approach.\nAs \"neighbors,\" Iran and the Pathway Zone Authority will have to cooperate in a number of domains: security, fighting smugglers and drug- and human-traffickers, while contenting well-established joint environmental and water-sharing projects.\nThe US zone would also need cooperation with Iran to secure part of its electricity, as well as all its oil and gas needs. In other words, Iranian and American personnel will have to learn to talk to each other and work together about practical day-to-day matters rather than hostages, exporting revolution, wiping Israel off the map and nuclear weapons.\nWell. One question: Will the Nobel barons recognize Trump as peacemaker?\nAmir Taheri was the executive editor-in-chief of the daily Kayhan in Iran from 1972 to 1979. He has worked at or written for innumerable publications, published eleven books, and has been a columnist for Asharq Al-Awsat since 1987.\nGatestone Institute would like to thank the author for his kind permission to reprint this article in slightly different form from Asharq Al-Awsat. He graciously serves as Chairman of Gatestone Europe."
    },
    {
      "news_title": "Trump Threatens New Sanctions On Russia As War Spreads Closer To Neighbors (Worthy News Radio) - Worthy Christian News",
      "news_link": "https://www.worthynews.com/107984-trump-threatens-new-sanctions-on-russia-as-war-spreads-closer-to-neighbors-worthy-news-radio",
      "bias": "Center",
      "text": "Trump Threatens New Sanctions On Russia As War Spreads Closer To Neighbors (Worthy News Radio)\nBy Stefan J. Bos, Worthy News Europe Bureau Chief\nKYIV/BUDAPEST (Worthy News) – U.S. President Donald J. Trump has threatened to impose new sanctions on Russia if relentless drone and missile strikes against Ukraine continue, as the war increasingly impacts neighboring countries, Hungary and Slovakia.\nTrump expressed frustration that a week after his high-profile meeting with Russian President Vladimir Putin in Alaska, the conflict had only escalated.\nNumerous people were killed and injured in the latest Russian attacks, including at an American-owned plant near Ukraine’s border with Hungary.\n“I’m going to make a decision as to what we do and it’s going to be, it’s going to be a very important decision, and that’s whether or not it’s massive sanctions or massive tariffs or both, or we do nothing and say it’s your fight,” Trump said Friday.\nThe president confirmed he was “unhappy” about the strike on the American facility, which sparked a fire and injured several employees.\nHe warned Moscow that severe sanctions could be imposed within two weeks if the attacks continue.\nBut while Washington blames Moscow, Ukraine’s neighbors, Hungary and Slovakia, voiced anger at Kyiv after it struck a key pumping station on the Druzhba pipeline.\nSUPPLIES CUT\nThe attack temporarily cut Russian crude supplies to both countries, the only European Union members still receiving oil directly from Russia. Budapest and Bratislava warned the European Commission that deliveries could be halted for at least five days.\nHungary’s government insisted that disrupting energy supplies risked further destabilizing the region.\nUkrainian President Volodymyr Zelenskyy maintains that Russia’s 2022 invasion triggered the war and that peace can only be reached through direct talks with Putin.\nHe has repeatedly called for a face-to-face summit, but Moscow’s foreign minister, Sergei Lavrov, told NBC News television there was no basis for such a meeting.\n“Putin is ready to meet with Zelenskyy when the agenda would be ready for a summit. And this agenda is not ready at all,” Lavrov said, accusing Kyiv of refusing to accept Russian demands to drop NATO ambitions and surrender occupied territories.\nWith clashes ongoing, humanitarian efforts are also under fire. The Scottish charity Sunflower Scotland, which delivers medical aid to Ukraine, reported that even ambulances have been targeted by Russian drones.\nThe group vowed to continue operations despite the dangers, underscoring the growing risks faced by civilians and aid workers in Europe’s deadliest war since World War II.\n💡 Did you know? One of the best ways you can support Worthy News is by simply leaving a comment and sharing this article.\n📢 Social media algorithms push content further when there’s more engagement — so every 👍 like, 💬 comment, and 🔄 share helps more people discover the truth. 🙌\nLatest Worthy News\nIf you are interested in articles produced by Worthy News, please check out our FREE sydication service available to churches or online Christian ministries. To find out more, visit Worthy Plugins."
    },
    {
      "news_title": "Is Anyone Else Pushing for Peace?",
      "news_link": "https://quadrant.org.au/news-opinions/qed/is-anyone-else-pushing-for-peace/",
      "bias": "Right",
      "text": "Is Anyone Else Pushing for Peace?\nAndrew Bolt on Monday evening outdid himself. Watch it here if you have a strong stomach. It was the most drawn-out unhinged attack on Trump that I have seen. None of Adam Schiff, Gavin Newsom, Jasmine Crockett, Rashida Tlaib, Maxine Waters or Zohran Mamdani has done it better. What company to keep. But, for the record, Greg Sheridan congratulated him on his magnificent op-ed. Mon Dieu!\nNow, to be fair, Bolt is a conservative warrior on climate change, on Israel, and on other things. He is one of the good guys. However, there is evidently something about Putin and Russia, maybe Zelensky, which produces cognitive dissonance in certain susceptible conservative minds. An assessment that Putin is a despotic thug, which is accurate enough, becomes synonymous with waging war by proxy to the last Ukrainian and Russian soldier standing. Recalcitrant, Trump refuses to buy this deadly bill of goods.\nTrump has tried and is trying to forge a peace deal. So far without success. Are his critics upset at his failed mediation attempts? Not so much. Clearly, they are much more upset at his reluctance to go all in for Zelensky and a forever war. Seemingly, at whatever cost in blood and treasure, and however much it might lead to a wider bloodier war.\nThus, instead of warmly greeting and rolling out the red carpet for Putin in Alaska, Trump should have shirtfronted the thug or something of the sort. Yet, if the convivial meeting with Putin and the later meeting with European leaders and Zelensky eventually leads to a winding pathway to peace what the heck is there to gripe about? Not to worry. Those of a determined anti-Trump disposition will find something. There is no “conceivable” peace deal that will reflect well on Trump.\nTrump knows that if the killing is to stop, the smaller country will have to swallow giving up territory; already mostly lost on the battlefield. Meanwhile, in the make-believe world of his critics, Russia can’t be “rewarded” for its aggression. It would be unjust. A lesson in history would be instructive. Constantinople is now Istanbul. Tibet is China.\nI wrote about Israel last week. For some reason the comments section switched to Ukraine. The wars don’t have much in common. At the same time both are plagued with fabulism.Take Albo, Burke and Wong on the Israeli-Hamas war. They believe in recognising an imaginary Palestinian state sitting beside Israel. And its leadership and system of governance? Its boundaries? Its appetite to endlessly kill Jews? As to answering these questions, their abject ignorance and smug insouciance are unbounded.\nEqually imaginary and damaging is the view that Russia can be made to turn tail; to give up territory won at the cost of so many of its soldiers’ lives, and to feel chastened behind its pre-2022 borders, or even its pre-2014 borders. It is not going to happen. Quixotically trying to make it happen will go on costing many Ukrainian and Russian lives; all for nothing. And in a worst case might even lead to nuclear war.\nIt was amusing to hear Hillary Clinton say that she would nominate Trump for the Nobel Peace Prize if he were to bring peace between Russia and Ukraine without loss of Ukrainian territory. She’s safe. Only Jesus Christ can perform miracles. Peace and the loss of Ukrainian territory are inextricably linked. The first can’t happen without the second. Thus, if Trump succeeds in bringing peace, territory will have been given up; not swapped by the way. Inevitably it will be called a sellout by the usual suspects. C’est la vie. It is water off a Trump’s back.\nUnlike most democratic political leaders Trump doesn’t try to appease his critics. He knows it won’t work. TDS can’t be cured. Ergo, within the bounds of realism and commonsense, he acts as he sees fit. So far so good.\nWhat do the likes of Penny Wong expect Israel to do? Leave Hamas in peace to prepare its next massacre?\nAug 17 2025\n4 mins\nMigration without cultural cohesion makes relativism the default morality even as it hollows out the societies new arrivals leave behind\nAug 08 2025\n6 mins\nThe UK is branding protest as terrorism and transforming police from servants of the people to political enforcers\nAug 07 2025\n7 mins\nYou are right about Andrew Bolt; it is one of the worst cases of TDS going around and Greg Sheridan is not too far behind. With Trump, both of these men just suspend any analysis of what he is doing and just criticise each and every action he takes.\nOn the other hand, I admire Trump for the various ways he is trying to bring about a peaceful resolution of the war. He is beset by critics on each and every side, the media, and his political opponents. He is also not getting much help from Putin who does not seem to realise he is burning his bridges and will ultimately end up along with the genal Russian population having to pay for his insouciance I suspect when Trump gets tired of trying to bring some sanity to proceedings. At least the Europeans and Zelensky seem to have finally worked out what he is doing and are starting to come into line, at least that is a start.\nPeter. Good effort but I lean towards the contrary view as might not Putin and Xi – both declared besties – by now be colluding for each other’s benefit to weaken the US? So Putin keeps Russia’s gains in Ukraine and – instead of orange – Xi in effect gets a green light to move with virtual impunity on Taiwan?\nTo clarify my point: I wish Trump every success, both on Ukraine and Gaza as appropriate, but we observers need to be clear eyed about what the US President might be up against if Putin and Xi are working as a tag team to “make Authoritarianism great again”.\nSomething has been missing from articles about Trump’s efforts towards peace. From many of his statements it’s very clear he genuinely wants to stop people being killed. That’s the driving force behind his peace efforts.\nAgreed, and also behind his reluctance to commit US troops on the ground. Putin is doubtless playing to this “weakness”.\nI’m convinced that many would rather see the bloodshed in Ukraine continue than see Trump achieve peace.\nIt’s all about Trump, Putin and Zelenski and yet not one of these is in the front line.\nHas the parliament in Ukraine considered changing the constitution in order to give up land for peace?\nWhere is the democracy these brave men and women are supposedly defending?\nWithout a referendum in Ukraine who can tell what the majority desire.\nWhat about the soldiers fighting and toiling in constant fear of their lives?\nYesterday they might have been brothers sharing a vodka and a joke.\nAre the girls of Ukraine any different to the girls of Russia?\nIn retrospect Zelenski should never have told the West he only needed their weapons.\nHe has condemned his country to much bloodshed by pitching his army against a much larger army.\nThe West should have supported him with both men and weapons or not at all\nNever surrender we say but we are not the ones dying and facing the relentless guns.\nIf we spent one day facing the advance of a Russian battalion we might see things differently.\nHere’s how the main-stream media in the USA put a negative spin on Trump’s peace efforts.\nThey are obviously hoping he will fail.\nhttps://www.facebook.com/SkyNewsAustralia/videos/left-wing-media-in-total-meltdown-following-donald-trumps-push-to-end-the-ukrain/24682589004699707/\nVery good, Tasman. It’s weird how TDS manifests itself in the most unexpected people. You think you’re in harmony on many subjects with a friend and all of a sudden, there’s a mention of Trump and, as Elon Musk once said, kaboom! Do you think it’s a latent gene, or something? Hovering in the body cells like malaria, dormant but ready to break out at any moment?\nBolt’s on-camera style is awkward and always has been, but that has nothing to do with the substance of what he says. When it comes to Trump, he’s generally spot on. But the link in the second paragraph above is to an op-ed dated 19 March. Couldn’t find any op-ed there for Monday 18th August.\nOne can be in furious and genuine agreement with the statement that “there is evidently something about Putin and Russia, maybe Zelensky, which produces cognitive dissonance in certain susceptible conservative minds”, from the wholly opposite perspective."
    },
    {
      "news_title": "Trump optimistic about Russia-Ukraine peace deal: ‘I know exactly what I’m doing’ · American Wire News",
      "news_link": "https://americanwirenews.com/trump-optimistic-about-russia-ukraine-peace-deal-i-know-exactly-what-im-doing/",
      "bias": "Right",
      "text": "Amid the possibility of a trilateral meeting, President Donald Trump’s outlook on negotiations between Russia and Ukraine included a reminder to the media about his dealmaking prowess.\n(Video Credit: Fox News)\nFriday, after making an announcement about the 2026 FIFA World Cup alongside FIFA President Gianni Infantino, the president fielded questions from the press in the Oval Office. It was then that repeated inquiries about the progress of peace talks involving Russian President Vladimir Putin and Ukrainian President Volodymyr Zelenskyy found Trump optimistic about what may come within two weeks.\nAdorned with a red hat that read “TRUMP WAS RIGHT ABOUT EVERYTHING!” the president responded to a question about where things may be at the end of two weeks and said, “Well then, I’m gonna make a decision as to what we do. And it’s gonna be a very important decision. And that’s whether or not it’s massive sanctions or massive tariffs or both. Or do we do nothing and say it’s your fight.”\nReminding the press about the numerous peace deals he’d brokered and the reported devastating loss of life as the now-three and a half year war between Russia and Ukraine was said to be causing 7,000 deaths per week, the president was then asked by CNN White House reporter Alayna Treene, “Are you saying that’s a real possibility then, that you do nothing if Putin doesn’t come to the table for a ceasefire?”\n“I’ll see whose fault it is. If there are reasons why, I’ll understand that. I know exactly what I’m doing,” asserted the commander-in-chief. “We’re gonna see whether or not they have a meeting. That’ll be interesting to see. And if they don’t, why didn’t they have a meeting, ’cause I told them to have a meeting. But I’ll know in two weeks what I’m gonna do.”\nEarlier in the week, the president had hosted European leaders, including Zelenskyy, mere days after hosting Putin in Alaska. While White House press secretary Karoline Leavitt wound up excoriating corporate media over the anti-Trump slant being applied to how talks were being covered, the president had more to say about the conflict between Putin and Zelenskyy on Friday.\nPrior to the Oval Office event, Trump had made a surprise visit to The People’s House: A White House Experience, where he’d referred to the respective leaders as “oil and vinegar.”\n“We’re gonna see if Putin and Zelenskyy will be working together. You know that’s like oil and vinegar a little bit. They don’t get along too well, for obvious reasons,” said the president. “But we’ll see. And then we’ll see whether or not I would have to be there. And I’d rather not. I’d rather have them have a meeting and see how they can do. But in the meantime, they continue to fight and they continue to kill people, which is very stupid.”\n.@POTUS: “We’re going to see if Putin and Zelensky will be working together… They don’t get along too well for obvious reasons, but we’ll see.” pic.twitter.com/gX3hCx9EDx\n— Rapid Response 47 (@RapidResponse47) August 22, 2025\nComment\nWe have no tolerance for comments containing violence, racism, profanity, vulgarity, doxing, or discourteous behavior. If a comment is spam, instead of replying to it please click the ∨ icon below and to the right of that comment. Thank you for partnering with us to maintain fruitful conversation."
    },
    {
      "news_title": "Frustrated, Trump signals pause in his Ukraine peace effort",
      "news_link": "https://www.washingtonpost.com/politics/2025/08/23/trump-ukraine-frustration/",
      "bias": "Lean Left",
      "text": null
    },
    {
      "news_title": "Trump renews sanctions threat against Russia over slow progress toward peace",
      "news_link": "https://www.politico.eu/article/trump-renews-sanctions-threat-against-russia-over-slow-progress-toward-peace/",
      "bias": "Lean Left",
      "text": "U.S. President Donald Trump on Friday renewed his threat to impose sanctions on Russia unless progress is made to reach a peace deal with Ukraine, as tensions between Moscow and Washington escalated.\nTrump appeared to set a two-week deadline for Russian President Vladimir Putin to show more willingness to end his invasion of Ukraine. So far, Moscow hasn’t offered any concessions for a truce deal and has demanded more territorial concessions from Kyiv.\nSpeaking to reporters at the White House on Friday, Trump said he would “make a decision as to what we do, and it’s going to be a very important decision, and that’s whether or not it’s massive sanctions or massive tariffs or both, or do we do nothing and say it’s your fight?”"
    },
    {
      "news_title": "Trump Floats, Putin Sinks Ukraine Plan",
      "news_link": "https://www.thebulwark.com/p/trump-flails-in-alaska-raids-boltons",
      "bias": "Lean Right",
      "text": "Trump Flails in Alaska, Raids Bolton's House\nWhat You Missed This Week From The Bulwark\nHappy Saturday! Overtime is for everyone. If you’re a Bulwark+ member: thank you. If you’re not, there’s no better time to subscribe to Bulwark+ than today. If you like today’s issue, you can share this newsletter with someone you think would value it.\nICYMI: Here are links to each newsletter section so you can quickly get back to that edition you may have missed this week.\nMorning Shots - Triad - Huddled Masses - Press Pass - Bulwark Goes to Hollywood - The Opposition - False Flag - The Breakdown\n🚨OVERTIME🚨\nWho said it? RFK Jr. or The Simpsons’ Dr. Nick? (TNR) I got 92%. Can you beat me?\nSalzburg Journal, Part III… Jay Nordlinger on habits, Habsburgs, Humperdinck, and more.\nWhere is Crimea? And other things you (and US presidents) should know. (Kyiv Independent)\n5 days of diplomacy… 5 days of deadly Russian attacks on Ukraine, Yuliia Taradiuk reports for the Kyiv Independent.\nThis week’s chat prompt: What political news most surprised you?\nTech support questions? Email members@thebulwark.com. Questions for me? Respond to this message.\n—30—\nEditorial photos provided by Getty Images. For full credits, please consult the article.\nHey, Jim, I did beat you. 100% correct identifying RFK Jr. vs. Dr. Nick. Ha, Ha.\nJeez, was the Alaska fiasco only a week ago?!"
    },
    {
      "news_title": "Trump choked — but the rest of the GOP followed him anyway",
      "news_link": "https://www.alternet.org/trump-news-putin/",
      "bias": "Left",
      "text": "Trump choked — but the rest of the GOP followed him anyway\nLindsay Graham says he believes Donald Trump is ready to “crush” the Russian economy if that country’s leader, Vladimir Putin, doesn’t agree to peace talks with Ukrainian President Volodymyr Zelensky.\n“Trump believes that if Putin doesn’t do his part, that he’s going to have to crush his economy,” the US senator told reporters in South Carolina on Tuesday. “Because you’ve got to mean what you say.”\nThis is an amazing thing to say.\nJust three days prior, Trump met with Putin in Alaska for three hours. Beforehand, he said there would be “severe consequences” if Putin didn’t agree to a ceasefire in the war in Ukraine. Trump said he “solved six wars in six months,” implying that this one would be no different.\nThen he choked.\nHis demands melted into the air. He was all smiles, all handshakes, all deference verging on reverence. The leader of the world’s most powerful military emerged from his meeting with a cut-rate tyrant as if he’d been dogwalked. It was so bad even a Fox reporter had to admit it looked like “Putin came in and steamrolled, got right into what he wanted to say and got his photo next to the president and then left.”\nThe Post’s George Will, who is not a liberal, also saw the plain truth. “The former KGB agent currently indicted for war crimes felt no need to negotiate with the man-child,” Will said (my stress). “The president’s thunderous demands — a 50-day deadline, a 10-day deadline, 'severe consequences,' a ceasefire before negotiations — all were just noise.\"\nSo yes. Senator Graham is right. You’ve got to mean what you say. Trump doesn’t. Indeed, he never does. That’s why he choked.\nBecause of that, he and other Trump allies have spent their time in the days after that disastrous “summit” trying to rewrite history in order to protect the president from the consequences of his own weakness.\nGraham now says Trump is ready to “crush” the Russian economy, as if Trump really were the big strong man he portrays himself to be, rather than the milksop who actually called Putin “the boss” and later phoned him during a meeting with European leaders, as if getting permission.\nBut Graham isn’t alone.\n“The president has this uncanny ability to bend people to his sensible way of thinking,” US envoy Steve Witkoff told Sean Hannity last night.\n“He does it each and every time,” he said. “I've never seen anything quite like it and I've been around some master dealmakers. He is the legend as far as I'm concerned. His policy prescriptions are so pragmatic and so sensible and in a distorted world, he’s recalibrating it all. It’s simply remarkable. And every single leader that I have met in my travels, they say the same things I do. Every single one of them.”\nWitkoff is the envoy who Anne Applebaum said was “an amateur out of his depth” who “misunderstood his last meeting with Putin in Moscow if he thought that the Alaska summit was going to be successful.”\nOn Fox, noted international relations expert Montana Congressman Ryan Zinke said: “President Trump has done an unbelievable job against long odds,” before speculating, oddly, that “it'll end up probably with a land bridge between the Crimean peninsula and Russia.” He also said that Trump “hasn’t changed where his mission focus is. It’s peace.”\nPeace through surrender.\nIsn’t that the most striking thing? The US is unrivaled in its military and diplomatic might. We could end this war, now. As Applebaum said, “arm Ukraine, expand sanctions, stop the lethal drone swarms, break the Russian economy, and win the war. Then there will be peace.”\nBut Trump chooses weakness.\nHe chooses to look strong, not be strong.\nAnd no matter what his Republican allies in the Congress do to cover up that fact, they themselves cannot make him. They, too, are weak.\nLindsay Graham said the clock is ticking and that Trump must “impose steep tariffs on countries that are fueling Russia’s invasion of Ukraine by buying its oil, gas, uranium, and other exports,” according to the AP, and such threats might push Putin to the negotiating table. “If we don’t have this thing moving in the right direction by the time we get back, then I think that plan B needs to kick in,” Graham told the AP Tuesday.\nPlan B would be Congress acting without Trump.\nWhich means there is no plan B.\nThe Republicans are weak, because they surrendered their power, first to the rightwing media apparatus, then to Trump, who surrendered his power to Putin, who dominates the rightwing media apparatus.\nAnd has for a decade.\nWe can speculate about the dirt Putin has on Donald Trump, but fact is, he could mortally wound the president by turning the world’s biggest firehose of disinformation away from his “woke” enemies and toward him. Trump’s base is already confused by his refusal to release “the Epstein files.” Russian propaganda could be deployed to savagely widen the already broad gap between him and the maga faithful.\nMore likely, though, the Kremlin could sow doubt about Trump’s alleged strength. He’s all talk, no walk. We saw it. Russian state media brags about it. Echoes are now bouncing around mainstream media.\nOn Tuesday, while Graham was shielding Trump from his weakness, the UK’s biggest conservative paper ran this hed and dek: “European rearmament is pushing Trump into irrelevance on Ukraine. This vain, vacillating, gullible US president no longer commands the West.”\nThe importance of the rightwing media apparatus to the Republicans is evident in their efforts at damage control. Trump showed his whole ass. Now it’s up to allies to persuade his supporters that they did not see what they saw or if they did, it was the most amazing thing ever.\nThey have a lot of work to do. The Economist reported that Americans have a -14 approval rating of his handling of foreign policy. The public knows next to nothing about global affairs, but we know what fear looks like. After meeting Putin, Trump looked scared. And I think he looked scared, because Putin reminded him of something important.\nHe who can destroy a thing controls it.\nSo Trump chooses weakness.\nAnd the rest of his party follows.\nNOW READ: Behind Trump's latest purge — and why MAGA's no longer pretending"
    },
    {
      "news_title": "Ukraine war live: Trump gives Putin another deadline to agree Zelensky meeting",
      "news_link": "https://www.independent.co.uk/news/world/europe/trump-ukraine-russia-war-live-putin-zelensky-peace-news-b2812891.html",
      "bias": "Lean Left",
      "text": null
    },
    {
      "news_title": "With no Ukraine peace deal, Trump again threatens Russia sanctions - Hawaii Tribune-Herald",
      "news_link": "https://www.hawaiitribune-herald.com/2025/08/23/nation-world-news/with-no-ukraine-peace-deal-trump-again-threatens-russia-sanctions/",
      "bias": "Center",
      "text": "With no Ukraine peace deal, Trump again threatens Russia sanctions\nWASHINGTON/KYIV — U.S. President Donald Trump renewed a threat to impose sanctions on Russia on Friday if there is no progress toward a peaceful settlement in Ukraine in two weeks, showing frustration at Moscow a week after his meeting with Russian President Vladimir Putin in Alaska.\n“I’m going to make a decision as to what we do and it’s going to be, it’s going to be a very important decision, and that’s whether or not it’s massive sanctions or massive tariffs or both, or we do nothing and say it’s your fight,” Trump said.\nADVERTISING\nHe said he was unhappy about Russia’s strike on an American factory in Ukraine this week, which caused a fire that injured some of the facility’s employees.\n“I’m not happy about it, and I’m not happy about anything having to do with that war,” Trump told reporters at the White House.\nUkrainian President Volodymyr Zelenskyy, meanwhile, said on Friday that Russia was doing everything it could to prevent a meeting between him and Putin, while Russia’s foreign minister said the agenda for such a meeting was not ready.\nZelenskyy has repeatedly called for Putin to meet him, saying it is the only way to negotiate an end to the war.\nTrump had said he had begun the arrangements for a Putin-Zelenskyy meeting after a call with the Russian leader on Monday that followed their Alaska meeting on August 15.\nZelenskyy accused Russia of stalling.\n“The meeting is one of the components of how to end the war,” he said on Friday at a press conference in Kyiv with NATO Secretary General Mark Rutte. “And since they don’t want to end it, they will look for space to (avoid it).”\nRussian Foreign Minister Sergei Lavrov told NBC there was no agenda for such a summit.\n“Putin is ready to meet with Zelenskyy when the agenda would be ready for a summit. And this agenda is not ready at all,” he said.\nThe statement echoed Moscow’s established rhetoric about a leaders’ meeting being impossible unless certain conditions were met.\nAsked for his response to Lavrov’s comments and what the next steps are, Trump told reporters earlier on Friday: “Well, we’ll see. We’re going to see if Putin and Zelenskyy will be working together. It’s like oil and vinegar a little bit.”\nTrump had taken sanctions off the table in preparation for his summit in Anchorage with Putin. But at the same White House event where he mentioned possible sanctions, he showed a photograph of his meeting with Putin on the red carpet in Alaska, saying Putin wanted to attend the World Cup 2026 soccer tournament in the United States.\n“I’m going to sign this for him. But I was sent one, and I thought you would like to see it, it’s a man named Vladimir Putin, who I believe will be coming, depending on what happens. He may be coming, and he may not, depending on what happens,” Trump said.\nTrump’s comments did not address the fact that Russia was banned from international competitions such as the World Cup after the 2022 invasion of Ukraine and has not taken part in qualification for the 2026 tournament, which will be hosted by the U.S., Canada and Mexico.\nThousands of Ukrainian civilians have been killed in the full-scale invasion of Ukraine that Russia launched in 2022. Analysts estimate that more than a million soldiers on both sides have been killed or wounded and fighting is continuing unabated, with both sides also attacking energy facilities.\nRussia has maintained its longstanding demand for Ukraine to give up land it still holds in two eastern regions while proposing to freeze the front line in two more southerly regions Moscow claims fully as its own and possibly hand back small pieces of other Ukrainian territory it controls.\nZelenskyy meanwhile has dropped his demand for a lengthy ceasefire as a prerequisite for a leaders’ meeting, although he has previously said Ukraine cannot negotiate under the barrel of a gun."
    },
    {
      "news_title": "Trump Yet Again Threatens Russian Sanctions",
      "news_link": "https://politicalwire.com/2025/08/23/trump-yet-again-threatens-russian-sanctions/",
      "bias": "Center",
      "text": "“President Donald Trump again threatened Russia with ‘massive sanctions’ over the war in Ukraine unless an agreement can be reached in about two weeks, swerving back to a tougher stance after an inconclusive meeting with President Vladimir Putin,” Bloomberg reports.\nSaid Trump: “I’m not happy about anything about that war — nothing, not happy at all. I think over the next two weeks, we’re going to find out which way it’s going to go. And I better be very happy.”\nSave to Favorites"
    },
    {
      "news_title": "With No Ukraine Peace Deal, Trump Again Threatens Russia Sanctions",
      "news_link": "https://japannews.yomiuri.co.jp/news-services/reuters/20250823-276854/",
      "bias": "Lean Right",
      "text": null
    },
    {
      "news_title": "'Trump is not a very good deal maker if he gives everything away'",
      "news_link": "https://www.southwalesargus.co.uk/news/25409828.trump-not-good-deal-maker-gives-everything-away/",
      "bias": "Center",
      "text": "Crimean peninsula was illegally annexed by Moscow in 2014 and America and NATO did nothing.\nDonald Trump's first tenure as the president of the United States began on January 20, 2017, and he did nothing, question or even complain about the Crimean peninsula to his new friend Putin.\nThis is what started the Russian invasion of Ukraine, and Putin's real goal was to gain a land link from Russia to Crimea.\nOther parts of the invasion were to spread Ukrainian forces to various Ukrainian points in a smoke and mirrors operation to move soldiers from that region.\nClassic move to make the oppositions to think the attack comes from one end and to protect the real military objective on the other end.\nPutin has got what he wants, thanks to a lack of tougher sanctions, countries allowed to purchase oil from Russia, a soft Trump and a NATO afraid to upset him.\nI can see the damage to the Kakhovka dam being a lot more and a permeant flooding of the lower area and a water border between Crimea and Ukraine.\nIn other words, Trump's best friend Putin thinks it is about having a full peace agreement than a ceasefire, not what he was saying before the meeting.\nTrump is not a very good negotiator and deal maker if he gives everything away.\nA good deal is when both sides leave with positives to take back to their people.\nIf this looks bad for Volodymyr Zelensky then he could be replaced by a Putin puppet or a far-right leader who might re-kindle the war, with sabotaging attacks in the region.\nAndrew Nutt\nBargoed"
    },
    {
      "news_title": "What is Trump's plan if Putin, Zelensky fail to make deal to end Russia-Ukraine war? US President reveals...",
      "news_link": "https://www.livemint.com/news/us-news/what-is-trumps-plan-if-putin-zelensky-fail-to-make-deal-to-end-russia-ukraine-war-us-president-reveals-11755917852125.html",
      "bias": "Center",
      "text": "US President Donald Trump revealed his plan to take a “very important decision” in the next two weeks if Ukraine's Volodymyr Zelensky and Russia's Vladimir Putin fail to make a deal to end Russia-Ukraine war. He asserted he might impose “massive sanctions or tariffs or do nothing”.\nTrump stated that his decision relies on developments over the coming fortnight and advocated for talks between Putin and Zelensky.\n\"In two weeks, we are going to know which way I am going because I'm going to go one way or another. It's going to be very important decision. I'm gonna decide whether it's not massive sanctions or massive tariffs or both or do we do nothing and say it's your fight. It takes two to tango. I wanted to have a meeting with those two. We'll see if they don't have a meeting, then why it was so, after I told them to have a meeting,\" Trump told reporters at Oval office.\nTrump said he is “not happy” about US factory reportedly bombed in Ukraine during recent Russian missile attacks. He stated, “I'm not happy about it and I'm not happy about anything about that war. I've settled seven wars and you think about pre-wars, that'll be three so 10 wars. Not happy at all. Over the next two weeks we are going to find out which ways it's going to go.”\nPreviously, Russia’s top diplomat Sergey Lavrov stated that President Vladimir Putin is willing to hold talks with Ukraine’s leader Volodymyr Zelensky, on the condition that every matter connected to resolving the dispute between Moscow and Kyiv are fully addressed.\nWhile speaking to RT on Thursday, Lavrov mentioned, \"The Russian president repeatedly said that he is ready to meet, including with Zelensky, if there is an understanding that all issues that require consideration at the highest level have been worked out thoroughly\" by experts and ministers.\nOn August 19, 2025, Trump met with Zelensky at the White House alongside several European leaders, signalling a more collaborative approach to ending the war in Ukraine. Trump hinted at providing security guarantees for Ukraine. He proposed a trilateral summit with Zelensky and Russian President Vladimir Putin, according to US media.\nRussian President Vladimir Putin held a high-profile but ultimately inconclusive summit in Alaska on August 15. Despite hours of discussions, the summit ended without any formal agreement or ceasefire on Ukraine. However, Trump described the talks as “very productive” and Putin viewed them as a potential starting point.\n(With inputs from ANI)\nStay updated with the latest Trending, India , World and US news. Read the latest updates on the Supreme Court verdict regarding Delhi-NCR stray dog relocation and ongoing protests now on Livemint."
    },
    {
      "news_title": "Trump Again Threatens Russia Sanctions",
      "news_link": "https://www.deccanchronicle.com/world/with-no-ukraine-peace-deal-trump-again-threatens-russia-sanctions-1899186",
      "bias": "Lean Right",
      "text": "Trump Again Threatens Russia With Sanctions\nTrump said he was unhappy about Russia's strike on an American factory in Ukraine this week, which caused a fire that injured some of the facility's employees\nWashington/Kyiv: U.S. President Donald Trump renewed a threat to impose sanctions on Russia on Friday if there is no progress toward a peaceful settlement in Ukraine in two weeks, showing frustration at Moscow a week after his meeting with Russian President Vladimir Putin in Alaska.\n\"I'm going to make a decision as to what we do and it's going to be, it's going to be a very important decision, and that's whether or not it's massive sanctions or massive tariffs or both, or we do nothing and say it's your fight,\" Trump said.\nHe said he was unhappy about Russia's strike on an American factory in Ukraine this week, which caused a fire that injured some of the facility's employees.\n\"I'm not happy about it, and I'm not happy about anything having to do with that war,\" Trump told reporters at the White House.\nUkrainian President Volodymyr Zelenskiy, meanwhile, said on Friday that Russia was doing everything it could to prevent a meeting between him and Putin, while Russia's foreign minister said the agenda for such a meeting was not ready.\nZelenskiy has repeatedly called for Putin to meet him, saying it is the only way to negotiate an end to the war.\nTrump had said he had begun the arrangements for a Putin-Zelenskiy meeting after a call with the Russian leader on Monday that followed their Alaska meeting on August 15.\nZelenskiy accused Russia of stalling.\n\"The meeting is one of the components of how to end the war,\" he said on Friday at a press conference in Kyiv with NATO Secretary General Mark Rutte. \"And since they don't want to end it, they will look for space to (avoid it).\"\nRussian Foreign Minister Sergei Lavrov told NBC there was no agenda for such a summit.\n\"Putin is ready to meet with Zelenskiy when the agenda would be ready for a summit. And this agenda is not ready at all,\" he said.\nThe statement echoed Moscow's established rhetoric about a leaders' meeting being impossible unless certain conditions were met.\nAsked for his response to Lavrov's comments and what the next steps are, Trump told reporters earlier on Friday: \"Well, we'll see. We're going to see if Putin and Zelenskiy will be working together. It's like oil and vinegar a little bit.\"\n‘He may be coming’\nTrump had taken sanctions off the table in preparation for his summit in Anchorage with Putin. But at the same White House event where he mentioned possible sanctions, he showed a photograph of his meeting with Putin on the red carpet in Alaska, saying Putin wanted to attend the World Cup 2026 soccer tournament in the United States.\n\"I'm going to sign this for him. But I was sent one, and I thought you would like to see it, it's a man named Vladimir Putin, who I believe will be coming, depending on what happens. He may be coming, and he may not, depending on what happens,\" Trump said.\nTrump's comments did not address the fact that Russia was banned from international competitions such as the World Cup after the 2022 invasion of Ukraine and has not taken part in qualification for the 2026 tournament, which will be hosted by the U.S., Canada and Mexico.\nDuring a visit to a nuclear research center on Friday, Putin said Trump's leadership qualities would help restore U.S.-Russia relations.\n\"With the arrival of President Trump, I think that a light at the end of the tunnel has finally loomed. And now we had a very good, meaningful and frank meeting in Alaska,\" Putin said.\nThousands of Ukrainian civilians have been killed in the full-scale invasion of Ukraine that Russia launched in 2022. Analysts estimate that more than a million soldiers on both sides have been killed or wounded and fighting is continuing unabated, with both sides also attacking energy facilities.\nRussia has maintained its longstanding demand for Ukraine to give up land it still holds in two eastern regions while proposing to freeze the front line in two more southerly regions Moscow claims fully as its own and possibly hand back small pieces of other Ukrainian territory it controls.\nZelenskiy meanwhile has dropped his demand for a lengthy ceasefire as a prerequisite for a leaders' meeting, although he has previously said Ukraine cannot negotiate under the barrel of a gun.\nAt the press conference with Rutte, Zelenskiy said they had discussed security guarantees for Ukraine. He said the guarantees ought to be similar to NATO's Article 5, which considers an attack on one member of the alliance as an attack against all.\nRutte said NATO allies and Ukraine are working together to ensure security guarantees are strong enough that Russia will never try to attack again.\n\"Robust security guarantees will be essential, and this is what we are now working on to define,\" he said.\n( Source : Reuters )\nNext Story"
    },
    {
      "news_title": "Trump threatens ‘massive sanctions’ for Russia if Ukraine conflict doesn’t end",
      "news_link": "https://www.thehindu.com/news/international/trump-threatens-massive-sanctions-for-russia-if-ukraine-conflict-doesnt-end/article69967347.ece",
      "bias": "Lean Left",
      "text": "U.S. President Donald Trump said Friday (August 22, 2025) he would make an “important” decision in two weeks on Ukraine peace efforts — specifying that Moscow could face massive sanctions or he might do nothing.\nMr. Trump told reporters in the Oval Office that he was “not happy” about a Russian strike on Thursday (August 21, 2025) that hit a U.S.-owned factory in Ukraine “and I’m not happy about anything having to do with that war.”\nBut he said he wanted to see whether Russian President Vladimir Putin and Ukraine’s Volodymyr Zelenskyy would meet first.\n“I think I’ll know. I think I’ll know the attitude of Russia and, frankly, of Ukraine. It takes two,” Mr. Trump said when asked what he would do at the end of a two-week timeframe he set for assessing the state of peace talks.\n“Then I’m going to make a decision as to what we do and it’s going to be a very important decision,” he said.\n“That’s whether or not it’s massive sanctions or massive tariffs or both. Or do we do nothing and say it’s your fight?” he added.\nMr. Trump — who showed off a picture of him and Mr. Putin at their recent Alaska summit, which he said had been sent by the Kremlin leader — has repeatedly announced timescales of around two weeks for decisions on Ukraine and other issues. Many of those deadlines have failed to materialise.\nAlso read: Takeaways from Trump-Putin meeting: No agreement, no questions but lots of pomp\nRussia on Friday (August 22, 2025) ruled out an immediate meeting with Mr. Zelenskyy, despite Mr. Trump saying on Monday (August 18, 2025) after meeting with the Ukrainian and European leaders that he was arranging a summit.\nMr. Trump said Friday (August 22, 2025) that setting up a Zelenskyy-Putin summit was as hard as mixing “oil and vinegar.”\n“We’re going to see if Putin and Zelensky will be working together. You know, it’s like oil and vinegar, a little bit. They don’t get along too well, for obvious reasons,” he told reporters.\nMr. Trump added “we’ll see” if he would need to attend any such meeting.\nPublished - August 23, 2025 07:01 am IST"
    },
    {
      "news_title": "Trump Says He Will Make ‘Very Important Decision’ on Russia-Ukraine Negotiations in 2 Weeks - The Thinking Conservative",
      "news_link": "https://www.thethinkingconservative.com/trump-says-he-will-make-very-important-decision-on-russia-ukraine-negotiations-in-2-weeks/",
      "bias": "Far Right",
      "text": "The U.S. president is weighing potential options, including imposing massive sanctions or tariffs on Moscow.\nWASHINGTON—U.S. President Donald Trump said Friday he will give Russia and Ukraine two weeks to hold talks aimed at ending the war between the two countries, and if no progress is made, he will decide on the next steps, which could include heavy sanctions or tariffs.\n“We’ll see what happens over the next two weeks. We’re going to find out which way it’s going to go,” Trump told reporters in the Oval Office.\nTrump said he expects to watch the attitudes of both sides during that period before determining his course of action.\nCalling it “a very important decision,” the president said he will determine “whether or not it’s massive sanctions or massive tariffs or both—or do we do nothing and say, ‘It’s your fight.’”\nTrump made the remarks in the Oval Office during an event announcing that the 2026 World Cup draw will be held at the Kennedy Center in Washington in December.\nAt the event, Trump showed a photo of himself with Putin, taken at last week’s Alaska summit. He stated that the Russian president may visit the United States for the World Cup next summer.\nHe later expressed his disappointment with Russia’s latest overnight strikes, which hit a U.S. factory in Ukraine.\n“I’m not happy about it,” he said. “I’m not happy about anything about that war. Nothing.”\nLast week, Trump hosted high-stakes peace talks with Putin in Alaska, which ended without a cease-fire. On Aug. 18, he met with Zelenskyy and European leaders at the White House to discuss the Alaska summit and next steps.\nFollowing those talks, Trump began arranging a bilateral meeting between Putin and Zelenskyy, after which he said the three leaders would hold a trilateral session. So far, however, neither Russia nor Ukraine has announced a date or location for the bilateral meeting.\nRussian Foreign Minister Sergei Lavrov said in an interview with NBC aired on Friday that there’s no agenda for a potential summit.\n“Putin is ready to meet with Zelenskyy when the agenda would be ready for a summit. And this agenda is not ready at all,” Lavrov said, adding no meeting was therefore planned for now.\nBy Emel Akan"
    },
    {
      "news_title": "Massive sanctions or tariffs? Trump warns Russia over Ukraine peace in two weeks",
      "news_link": "https://www.indiatoday.in/world/us-news/story/massive-sanctions-or-tariffs-trump-warns-russia-over-ukraine-peace-in-two-weeks-glbs-2775524-2025-08-23",
      "bias": "Lean Right",
      "text": "Massive sanctions or tariffs? Trump warns Russia over Ukraine peace in two weeks\nPresident Trump warned Russia of potential massive sanctions or tariffs if no Ukraine peace progress occurs within two weeks, citing frustration over Moscow's actions and stalled talks between Putin and Zelenskyy.\nUS President Donald Trump on Friday renewed his threat to impose sanctions on Russia if no progress is made toward a peaceful settlement in Ukraine within two weeks. Speaking at the White House, Trump signalled frustration at Moscow just a week after his Alaska meeting with Russian President Vladimir Putin.\n“I’m going to make a decision as to what we do and it’s going to be, it’s going to be a very important decision, and that’s whether or not it’s massive sanctions or massive tariffs or both, or we do nothing and say it’s your fight,” Trump said.\nThe president voiced disapproval over Russia’s deadly strike on a factory in Ukraine, adding, “I’m not happy about it, and I’m not happy about anything having to do with that war. I settled seven wars Over the next two weeks, we are going to find out which way it will go, and I’d better be very happy.”\nTrump said he had initiated arrangements for a meeting between Putin and Ukrainian President Volodymyr Zelenskyy. However, Zelenskyy accused Russia of stalling. “The Russians are doing everything they can to prevent the meeting from taking place Since they don’t want to end it, they will look for space to avoid it,” Zelenskiy told reporters in Kyiv.\nRussian Foreign Minister Sergei Lavrov, however, insisted the summit’s agenda was not ready, saying, “Putin is ready to meet with Zelenskyy when the agenda would be ready for a summit. And this agenda is not ready at all.”\nTrump also highlighted a lighter moment from his Alaska summit, presenting a photograph of himself with Putin on the red carpet. “I’m going to sign this for him He may be coming to the World Cup 2026 in the US, depending on what happens,” Trump said.\nThe European Union’s foreign policy chief said that the possibility of Ukraine ceding land to Russia as part of a peace deal to end their three-year war is “a trap” set by Putin. The Russian leader is demanding Ukrainian concessions in return for halting his army’s invasion, but granting him those demands would amount to rewarding the country that started the fighting, Kaja Kallas said. The recent talk about handing Putin concessions is “exactly the trap that Russia wants us to walk into,” Kallas said in an interview with the BBC."
    },
    {
      "news_title": "Trump to take important decision in 2 weeks on Russia-Ukraine war, says may impose massive sanctions or do nothing - The Tribune",
      "news_link": "https://www.tribuneindia.com/news/world/trump-to-take-important-decision-in-2-weeks-on-russia-ukraine-war-says-may-impose-massive-sanctions-or-do-nothing/",
      "bias": "Lean Right",
      "text": "Trump to take \"important decision\" in 2 weeks on Russia-Ukraine war, says may impose \"massive sanctions or do nothing\"\nWashington DC [US], August 23 (ANI): US President Donald Trump on Friday (local time) said that he is going to take a \"very important decision\" in the next two weeks on Russia-Ukraine war, suggesting that he might impose \"massive sanctions or tariffs\" on Kremlin or tell Kyiv that it's not Washington's war.\nTrump said that his decision is dependent on what happens in the next two weeks and pushed for a meeting between Russian President Vladimir Putin and his Ukrainian counterpart Volodymyr Zelenskyy.\nSpeaking to the reporters at the Oval Office, Donald Trump said, \"In two weeks, we are going to know which way I am going because I'm going to go one way or another. It's going to be very important decision. I'm gonna decide whether it's not massive sanctions or massive tariffs or both or do we do nothing and say it's your fight.\"\n\"It takes two to tango. I wanted to have a meeting with those two. We'll see if they don't have a meeting, then why it was so, after I told them to have a meeting,\" he added.\nWhen asked about a US factory reportedly hit in Ukraine during recent Russian missile attacks, Donald Trump said, \"\"I'm not happy about it and I'm not happy about anything about that war. I've settled seven wars and you think about pre-wars, that'll be three so 10 wars. Not happy at all. Over the next two weeks we are going to find out which ways it's going to go.\"\nTrump again claimed that he stopped a 'potential' nuclear war between India and Pakistan and six other wars, and 3 potential ones.\n\"I've settled seven wars, and you think about pre-wars, that'll be three, so 10 wars. Not happy at all. Over the next two weeks, we are going to find out how it's going to go. We solved what could've been a nuclear war with India and Pakistan. It was getting ready to be a nuclear war.\"\nEarlier, Russian Foreign Minister Sergey Lavrov said that Vladimir Putin is ready to meet Ukraine's President Volodymyr Zelensky, provided all issues relating to the settlement of the conflict between Moscow and Kiev are thoroughly worked out.\nLavrov told RT on Thursday, \"The Russian president repeatedly said that he is ready to meet, including with Zelensky, if there is an understanding that all issues that require consideration at the highest level have been worked out thoroughly\" by experts and ministers. (ANI)\n(This content is sourced from a syndicated feed and is published as received. The Tribune assumes no responsibility or liability for its accuracy, completeness, or content.)\nUnlock Exclusive Insights with The Tribune Premium\nTake your experience further with Premium access.\nThought-provoking Opinions, Expert Analysis, In-depth Insights and other Member Only Benefits\nAlready a Member? Sign In Now"
    },
    {
      "news_title": "Trump says U.S. sanctions, tariffs could be coming if Putin, Zelenskyy fail to meet soon",
      "news_link": "https://www.washingtontimes.com/news/2025/aug/22/trump-says-us-sanctions-tariffs-could-coming-putin-zelenskyy-fail/",
      "bias": "Lean Right",
      "text": null
    },
    {
      "news_title": "Trump says will decide on Russia sanctions within two weeks",
      "news_link": "https://www.firstpost.com/world/trump-says-will-decide-on-russia-sanctions-within-two-weeks-13927264.html",
      "bias": "Lean Right",
      "text": "US President Donald Trump said on Friday that in two weeks he should know whether progress is possible in his bid to end Russia’s invasion of Ukraine and he again raised the prospect of imposing sanctions on Moscow.\nSpeaking to reporters in the Oval Office, Trump said “I’m not happy” with any aspect of the effort to find peace.\nA week ago Trump held talks in Alaska with Russian President Vladimir Putin and has been unable thus far to coax him into a meeting with Ukraine President Volodymyr Zelenskyy.\n“There’s a tremendous amount of hatred there,” said Trump. “But we’ll see what happens. I think in two weeks, we’ll know which way I’m going.”\nHe said he would decide then whether to impose “massive sanctions” or do nothing and say “it’s your fight.”"
    },
    {
      "news_title": "Trump’s promising start in complex Ukraine-Russia peace process",
      "news_link": "https://www.cleveland.com/letters/2025/08/trumps-promising-start-in-complex-ukraine-russia-peace-process.html",
      "bias": "Center",
      "text": "President Donald Trump is making historic peace initiatives in his efforts to end the horrid three-year Ukrainian-Russia war. He managed a meeting with Russia’s Vladimir Putin on U.S. soil and within two days, Ukraine’s Volodymyr Zelensky and the major European NATO leaders met in the White House. Meetings of this stature have not been held before. This is a promising start in a complicated peace process.\nPresident Trump brought Putin to the table with economic pressure and with a now-strong NATO, thanks to his push for members to put 5% of their GDP toward defense spending by 2035. Trump also arranged to sell our military equipment to NATO countries. No more U.S. taxpayers financing the war, as happened under President Joe Biden.\nWithin his first 6 months, Trump has brokered peace in numerous other world conflicts. True to form, the media and Democrats cannot give him credit, only criticism. This, while the European leaders congratulated Trump for making more progress towards peace in three weeks than Biden did in three years.\nPolitics aside, all Americans, like Trump, should want the killing to stop.\nMichael Anderson,\nBarberton"
    },
    {
      "news_title": "Trump: Could Impose Sanctions on Russia in Two Weeks",
      "news_link": "https://www.usnews.com/news/world/articles/2025-08-22/trump-could-impose-sanctions-on-russia-in-two-weeks",
      "bias": "Lean Left",
      "text": null
    },
    {
      "news_title": "Trump warns of ‘massive sanctions or tariffs’ on Russia in 2 weeks",
      "news_link": "https://www.aa.com.tr/en/americas/trump-warns-of-massive-sanctions-or-tariffs-on-russia-in-2-weeks/3666773",
      "bias": "Right",
      "text": "Trump warns of ‘massive sanctions or tariffs’ on Russia in 2 weeks\nUS president says he will decide Russia-Ukraine war in 2 weeks, adding: 'that's whether or not it's massive sanctions or massive tariffs'\nWASHINGTON\nUS President Donald Trump said on Friday that he will know in two weeks whether progress can be made toward ending the Russia-Ukraine war, while also hinting at possible sanctions against Moscow.\nSpeaking to reporters in the Oval Office, Trump expressed frustration with recent Russian strikes that damaged a US factory operating in Ukraine.\n“I’m not happy about it, and I’m not happy about anything having to do with that war,” he said. “Over the next two weeks, we’re going to find out which way it’s going to go. And I better be very happy.”\nPressed on what will happen in two weeks, Trump said: “I'm going to make a decision as to what we do, and it's going to be a very important decision, and that's whether or not it's massive sanctions or massive tariffs or both, or do we do nothing and say it's your fight?”\nTrump has recently been making efforts to resolve the conflict in Ukraine. He conducted several rounds of talks with both sides, including a summit with Russian President Putin in Alaska on Aug. 15, and announced preparations for a meeting between Ukrainian President Zelenskyy and Putin.\nEarlier Friday, he expressed cautious optimism that the two sides could eventually come together.\n“We’re going to see if Putin and Zelenskyy will be working together,” Trump told reporters during a visit to The People’s House museum in Washington. “That’s like oil and vinegar a little bit. They don’t get along too well, for obvious reasons, but we’ll see.”\nAnadolu Agency website contains only a portion of the news stories offered to subscribers in the AA News Broadcasting System (HAS), and in summarized form. Please contact us for subscription options."
    },
    {
      "news_title": "Trump threatens ‘massive’ sanctions and tariffs in if Putin and Zelensky don’t meet: ‘I’ll see whose fault it is’",
      "news_link": "https://nypost.com/2025/08/22/us-news/trump-shows-off-photo-putin-mailed-him-from-alaska-summit/",
      "bias": "Lean Right",
      "text": "Trump threatens ‘massive’ sanctions and tariffs if Putin and Zelensky don’t meet: ‘I’ll see whose fault it is’\nWASHINGTON — President Trump said Friday he was considering “massive” sanctions and tariffs if Russian President Vladimir Putin and Ukrainian President Volodymyr Zelensky fail to set up a meeting to discuss peace negotiations.\n“I’ll see whose fault it is. If there are reasons why, I would understand that,” Trump, 79, told reporters in the Oval Office after showing off a glossy photo of himself and Putin at last week’s summit in Alaska, which he said Putin had sent.\n“I know exactly what I’m doing. We’re going to see whether or not they have a meeting — that will be interesting to see,” Trump said.\n“And if they don’t, why didn’t they have a meeting? Because I told them to have a meeting. But I’ll know in two weeks what I’m going to do. I have a pretty good idea already.”\nTrump also said he was unhappy with Russian airstrikes hitting a US-owned electronics factory in Ukraine Thursday and warned in a menacing tone that “I better be very happy” with peace-talk progress.\n“I was just sent a picture by someone who wants to be [at FIFA World Cup events] badly,” Trump said, holding up an image that showed the US president’s tie slightly askew.\n“He may be coming and he may not, depending on what happens… I thought it was a nice picture — of him,” Trump said after a dramatic pause.\n“OK of me, but nice of him. I thought it was very nice that it was sent to me.”\nTrump added of peace talks: “Over the next two weeks we’re going to find out which way it’s going to go — and I better be very happy.”\nBut the president left his options open.\n“Then I’m going to make a decision as to what we do,” he said. “And it’s going to be a very important decision. And that’s whether or not it’s massive sanctions or massive tariffs, or both, or do we do nothing and say, ‘It’s your fight’?”"
    },
    {
      "news_title": "Trump threatens Russia sanctions if no progress toward peace deal with Ukraine",
      "news_link": "https://www.theglobeandmail.com/world/article-russia-ukraine-zelensky-putin-ceasefire-talks/",
      "bias": "Center",
      "text": "U.S. President Donald Trump renewed a threat to impose sanctions on Russia on Friday if there is no progress toward a peaceful settlement in Ukraine in two weeks, showing frustration at Moscow a week after his meeting with Russian President Vladimir Putin in Alaska.\n“I’m going to make a decision as to what we do and it’s going to be, it’s going to be a very important decision, and that’s whether or not it’s massive sanctions or massive tariffs or both, or we do nothing and say it’s your fight,” Trump said.\nHe said he was unhappy about Russia’s strike on an American factory in Ukraine this week, which caused a fire that injured some of the facility’s employees.\n“I’m not happy about it, and I’m not happy about anything having to do with that war,” Trump told reporters at the White House.\nUkrainian President Volodymyr Zelensky, meanwhile, said on Friday that Russia was doing everything it could to prevent a meeting between him and Putin, while Russia’s foreign minister said the agenda for such a meeting was not ready.\nAndrew Coyne: The Ukraine emergency is far from over – because Donald Trump is the emergency\nZelensky has repeatedly called for Putin to meet him, saying it is the only way to negotiate an end to the war.\nTrump had said he had begun the arrangements for a Putin-Zelenskiy meeting after a call with the Russian leader on Monday that followed their Alaska meeting on August 15.\nZelensky accused Russia of stalling.\n“The meeting is one of the components of how to end the war,” he said on Friday at a news conference in Kyiv with NATO Secretary General Mark Rutte. “And since they don’t want to end it, they will look for space to (avoid it).”\nRussian Foreign Minister Sergey Lavrov told NBC there was no agenda for such a summit.\n“Putin is ready to meet with Zelensky when the agenda would be ready for a summit. And this agenda is not ready at all,” he said.\nThe statement echoed Moscow’s established rhetoric about a leaders’ meeting being impossible unless certain conditions were met.\nAsked for his response to Lavrov’s comments and what the next steps are, Trump told reporters earlier on Friday: “Well, we’ll see. We’re going to see if Putin and Zelensky will be working together. It’s like oil and vinegar a little bit.”\nIn Kyiv, Ukrainians use indoor steel capsules as a way to shelter from Russian strikes\nTrump had taken sanctions off the table in preparation for his summit in Anchorage with Putin. But at the same White House event where he mentioned possible sanctions, he showed a photograph of his meeting with Putin on the red carpet in Alaska, saying Putin wanted to attend the World Cup 2026 soccer tournament in the United States.\n“I’m going to sign this for him. But I was sent one, and I thought you would like to see it, it’s a man named Vladimir Putin, who I believe will be coming, depending on what happens. He may be coming, and he may not, depending on what happens,” Trump said.\nTrump’s comments did not address the fact that Russia was banned from international competitions such as the World Cup after the 2022 invasion of Ukraine and has not taken part in qualification for the 2026 tournament, which will be hosted by the U.S., Canada and Mexico.\nDuring a visit to a nuclear research center on Friday, Putin said Trump’s leadership qualities would help restore U.S.-Russia relations.\n“With the arrival of President Trump, I think that a light at the end of the tunnel has finally loomed. And now we had a very good, meaningful and frank meeting in Alaska,” Putin said.\nThousands of Ukrainian civilians have been killed in the full-scale invasion of Ukraine that Russia launched in 2022. Analysts estimate that more than a million soldiers on both sides have been killed or wounded and fighting is continuing unabated, with both sides also attacking energy facilities.\nRussia has maintained its long-standing demand for Ukraine to give up land it still holds in two eastern regions while proposing to freeze the front line in two more southerly regions Moscow claims fully as its own and possibly hand back small pieces of other Ukrainian territory it controls.\nDavid Shribman: Trump’s Ukraine talks show how the global order is changing\nZelensky meanwhile has dropped his demand for a lengthy ceasefire as a prerequisite for a leaders’ meeting, although he has previously said Ukraine cannot negotiate under the barrel of a gun.\nAt the news conference with Rutte, Zelensky said they had discussed security guarantees for Ukraine. He said the guarantees ought to be similar to NATO’s Article 5, which considers an attack on one member of the alliance as an attack against all.\nRutte said NATO allies and Ukraine are working together to ensure security guarantees are strong enough that Russia will never try to attack again.\n“Robust security guarantees will be essential, and this is what we are now working on to define,” he said."
    },
    {
      "news_title": "With no Ukraine peace deal, Trump again threatens Russia sanctions",
      "news_link": "https://www.reuters.com/world/europe/with-no-ukraine-peace-deal-trump-again-threatens-russia-sanctions-2025-08-22/",
      "bias": "Center",
      "text": null
    },
    {
      "news_title": "Frustrated by lack of results from his Putin summit, Trump again hints of abandoning Ukraine, ‘It’s your fight.’",
      "news_link": "https://dailytruthreport.com/frustrated-by-lack-of-results-from-his-putin-summit-trump-again-hints-of-abandoning-ukraine-its-your-fight/",
      "bias": "unknown",
      "text": "TRUMP: ‘I’LL KNOW IN TWO WEEKS’: After a week of insisting the meeting he personally brokered between Vladimir Putin and Volodymyr Zelensky was on track, President Donald Trump has pronounced himself “not happy” it’s not happening, and is vowing to figure out which of the two presidents is responsible for slow rolling peace talks aimed at ending the war in Ukraine — in two weeks.\n“I’ll see whose fault it is. If there are reasons why, I’ll understand that. I know exactly what I’m doing. We’re going to see whether or not they have a meeting,” Trump said. “And if they don’t, why didn’t they have a meeting? Because I told them to have a meeting. But I’ll know in two weeks what I’m going to\nJoin the conversation!\nPlease share your thoughts about this article below. We value your opinions, and would love to see you add to the discussion!"
    },
    {
      "news_title": "Peace process on the brink of collapse: Trump announces key decisions on Russia and Ukraine within two weeks.",
      "news_link": "https://ubn.news/peace-process-on-the-brink-of-collapse-trump-announces-key-decisions-on-russia-and-ukraine-within-two-weeks/",
      "bias": "unknown",
      "text": "Peace process on the brink of collapse: Trump announces key decisions on Russia and Ukraine within two weeks.\nUS President Donald Trump said that if the war in Ukraine does not stop within two weeks, he would make a “very important decision”. The US president clarified this by saying “It will either be large-scale sanctions, or large-scale tariffs, either one or the other, or we will do nothing and say that this is your fight”. Trump added that he would consider “whose fault it is that Putin did not sit down at the negotiating table”.\nAt the same time, he decided not to function as a mediator in organizing a meeting between the presidents of Ukraine and Russia. Furthermore, it is currently unclear whether the meeting will now happen at all. Notably, since July 20, Washington has ceased sharing intelligence on peace talks between Russia and Ukraine even with its closest allies.\nIt is also worth noting that statements from Foreign Minister Sergei Lavrov, who rejected security guarantees for Ukraine from Western countries, led to the breakdown of Russia’s negotiations with the US. European officials and diplomats believe that the Kremlin will now try to persuade the US that the discussed security guarantees should be abandoned, and that a meeting between Putin and Zelenskyy should be replaced with lower-level negotiations.\nThe US views Lavrov’s remarks as an attempt to delay negotiations and doubts that Putin is ready for a genuine agreement. This view is shared by Finnish President Alexander Stubb and German Chancellor Friedrich Merz, who estimated the progress in resolving the Russian-Ukrainian conflict at only 2%."
    },
    {
      "news_title": "Trump Again Threatens Russian Sanctions If Ukraine War Doesn’t End - Iran Front Page",
      "news_link": "https://ifpnews.com/trump-again-threatens-russian-sanctions-if-ukraine-war-doesnt-end/",
      "bias": "unknown",
      "text": "“I’m not happy about anything about that war — nothing, not happy at all,” Trump said Friday, adding, “I think over the next two weeks, we’re going to find out which way it’s going to go. And I better be very happy”.\nHe said he would then make a decision “whether or not it’s massive sanctions or massive tariffs or both — or do we do nothing and say, ‘it’s your fight’”.\nThe threat, which came in response to questions from reporters in the Oval Office, is the latest case of Trump’s whipsawing stance toward Russia and Putin. Trump had demanded a ceasefire before he met with Putin in Alaska a week ago, but said after the meeting he was hopeful about the prospects for a deal.\nBut the likelihood of a truce dimmed again in the days since the summit, with Russian officials noncommittal about a possible meeting between Putin and Ukrainian President Vladimir Zelensky.\nOfficials have also said Russia should have a say in security arrangements for Ukraine.\nSpeaking at a news conference with NATO Secretary General Mark Rutte in Kiev on Friday, Zelensky reiterated his readiness for both a bilateral leaders’ meeting with Putin as well as a trilateral format including Trump.\n“He is currently the only person who can stop Putin,” Zelensky said in Kiev.\nIt wasn’t immediately clear how seriously to take the latest threat.Trump often suggests that something will happen in “two weeks” when he’s looking to buy time. Last month, Trump threatened 100% tariffs on Russia if it did not comply with his calls for a truce, and on July 28, he gave Russia 10 days to reach a ceasefire with Ukraine.\nThat deadline came and went without action. And Trump’s own team has offered contradictory views about possible sanctions.\nIn an interview with NBC News last Sunday, Secretary of State Marco Rubio stated he didn’t think “new sanctions on Russia are going to force him to accept the ceasefire”.\nEven as Trump threatened Russia anew on Friday, he held up a photo of himself and Putin from their Alaska summit and said he would sign it for the Russian leader. Trump also raised the possibility Putin could attend the 2026 World Cup, which is being held in the US, Mexico and Canada.\n“He’s been very respectful of me and of our country, but not so respectful of others,” Trump said, adding, “That’s a man named Vladimir Putin, who I believe will be coming, depending on what happens.”\nThe Russian leader on Friday also offered praise for his US counterpart, calling the Alaska summit “just the start of a full recovery of our relations”, with the US. However, the outcome depends on numerous Western nations and the US is “bound by its obligations” to its partners, including NATO, he noted.\n“But I am sure that leadership qualities of the current president, President Trump, are a good guarantee that the relationships will be restored,” Putin stressed at a meeting with nuclear scientists in the city of Sarov, where the first Soviet nuclear bomb was made."
    },
    {
      "news_title": "POLITICS: Trump vows ‘very important decision’ on Ukraine soon – USSA News – U-S-NEWS.COM",
      "news_link": "https://u-s-news.com/politics-trump-vows-very-important-decision-on-ukraine-soon-ussa-news/",
      "bias": "unknown",
      "text": "🔴 Website 👉 https://u-s-news.com/\nTelegram 👉 https://t.me/usnewscom_channel\nThe US president has said he wants to gauge the approaches both Moscow and Kiev take toward peace before deciding on his next move\nUS President Donald Trump said on Friday he will announce a major decision on the Ukraine conflict within the next two weeks, adding that the step will depend on the positions of both Moscow and Kiev.\nTrump has been pressing for a meeting between Russian President Vladimir Putin and Ukraine’s Vladimir Zelensky since meeting them in Alaska and Washington respectively.\nSpeaking to reporters in the Oval Office, Trump said: “I think over the next two weeks, we’re going to find out which way it’s going to go.”\nAsked about the time frame, he explained he expects clarity soon on whether Russia and Ukraine will engage in direct talks. “We’re going to see whether or not they have a meeting … But I’ll know in two weeks what I’m going to do. It’s going to be a very important decision.”\nTrump said he would then decide whether to impose “massive sanctions” or tariffs, or “do nothing and say it’s your fight.”\nThe US president previously suggested a possible three-way summit could follow a Putin-Zelensky meeting, adding that the Ukrainian leader “has to show some flexibility.”\nOn Thursday, however, Russian Foreign Minister Lavrov said Kiev has shown no interest in a sustainable peace. He cited comments from Zelensky aide Mikhail Podoliak, who said Ukraine will seek to regain any territories “de facto” left to Russia in a peace deal and pursue joining a military alliance, even if not NATO.\nREAD MORE: First Putin-Zelensky meeting ‘would be better without me’ – Trump\nLavrov said these goals run counter to the joint peace efforts being undertaken by Putin and Trump.\nMoscow has long insisted on a peace agreement that eradicates the underlying causes of the conflict. It has demanded that Ukraine maintain neutrality, stay out of NATO and other military blocs, demilitarize and denazify, as well as accept the new territorial reality.\nClick this link for the original source of this article.\nAuthor: RT\nThis content is courtesy of, and owned and copyrighted by, https://www.rt.com and its author. This content is made available by use of the public RSS feed offered by the host site and is used for educational purposes only. If you are the author or represent the host site and would like this content removed now and in the future, please contact USSANews.com using the email address in the Contact page found in the website menu."
    },
    {
      "news_title": "Ukraine-Russia War Escalation: Trump Warns Putin with \"Massive Sanctions\" After Moscow Rejects Summit Proposal – Archyde",
      "news_link": "https://www.archyde.com/ukraine-russia-war-escalation-trump-warns-putin-with-massive-sanctions-after-moscow-rejects-summit-proposal/",
      "bias": "unknown",
      "text": "Okay, here’s a summary of the news updates from the provided text, as of august 23, 2025:\nUS-Russia Relations: A source is confident that President trump’s leadership will lead to a restoration of relations between the US and Russia.(Posted august 23,2025,09:00 by Namita Singh)\nUkraine‘s “Flamingo” Missile: Ukraine has developed a new long-range cruise missile called the “Flamingo FP-5,” capable of striking deep into Russian territory (over 3,000 kilometers) with a one-tonne warhead. It was developed by Ukraine’s fire Point defense company in just nine months. (Posted August 23, 2025, 08:30 by Namita Singh)\nNorth Korea & Russia: Kim Jong-un publicly mourned North Korean soldiers killed fighting alongside Russia in Ukraine, awarding “hero” titles to returning troops. Approximately 600 North Korean soldiers have been killed in action in the Kursk region. (Posted August 23, 2025, 08:21 by Namita Singh)\nNord Stream Sabotage: A ukrainian man, Serhii K, with a history in Ukrainian security services, has been arrested in Italy on a European arrest warrant related to the sabotage of the Nord Stream gas pipelines.He denies the charges. (Posted August 23, 2025, 06:42 by Namita Singh)\nHow might Trump’s threatened “massive sanctions” differ in scope or implementation from those previously imposed on Russia?\nTable of Contents\n- 1. How might Trump’s threatened “massive sanctions” differ in scope or implementation from those previously imposed on Russia?\n- 2. Ukraine-Russia War Escalation: Trump Warns Putin with “Massive Sanctions” After Moscow Rejects Summit Proposal\n- 3. Putin’s Rejection and teh Shift in US Policy\n- 4. The Sanctions Package: What We Know\n- 5. Trump’s Evolving Stance on Russia and Ukraine\n- 6. International Response and Allied Alignment\n- 7. Impact on Global Markets and Energy Security\n- 8. Potential Scenarios and Future Outlook\n- 9. Understanding the Role of SWIFT in Sanctions\n- 10. The Importance of Intelligence Sharing\nUkraine-Russia War Escalation: Trump Warns Putin with “Massive Sanctions” After Moscow Rejects Summit Proposal\nPutin’s Rejection and teh Shift in US Policy\nRecent developments in the Ukraine-Russia war have seen a significant escalation in tensions following Russia’s outright rejection of a proposed summit with Ukraine, brokered by international mediators. This move, widely condemned by Western allies, has prompted a strong response from former US President Donald Trump, who has publicly warned Vladimir Putin of impending “massive sanctions” should further aggression occur. This stance represents a notable shift from earlier periods of perceived reluctance regarding strong action against Russia.\nThe Sanctions Package: What We Know\nU.S. officials have reportedly prepared a comprehensive package of economic sanctions against Russia, ready for implementation upon Trump’s authorization. details emerging suggest the sanctions will target key sectors of the Russian economy, including:\nBanking Sector: Restrictions on major Russian banks’ access to international financial markets. This includes potential exclusion from SWIFT, the global messaging system for financial transactions.\nEnergy Sector: measures aimed at limiting Russia’s energy exports, a crucial source of revenue for the Kremlin. This could involve restrictions on technology transfer for oil and gas projects.\nDefense Industry: Expanded sanctions targeting Russian defense companies and individuals involved in arms sales and military procurement.\nTechnology Imports: Curtailing Russia’s access to critical technologies, including semiconductors and advanced manufacturing equipment.\nThese sanctions build upon existing measures already in place as the initial stages of the conflict in 2014 and the full-scale invasion in 2022. the potential impact on the Russian economy is considerable,with analysts predicting a further contraction in GDP and increased inflationary pressures.\nTrump’s Evolving Stance on Russia and Ukraine\nThroughout his presidency, Trump’s relationship with Russia and Ukraine was often characterized by ambiguity and controversy. While he consistently expressed a desire for improved relations with Putin, he also authorized military aid to Ukraine. However,reports from May 29,2025 (Reuters) indicated a degree of reluctance to impose further sanctions.\nThe current escalation, triggered by Moscow’s rejection of diplomatic overtures, appears to have solidified Trump’s position. His public warning signals a willingness to take a firmer stance against Russia, potentially driven by domestic political pressures and international condemnation. This change in tone is being closely watched by allies in Europe and NATO.\nInternational Response and Allied Alignment\nThe rejection of the summit proposal has drawn widespread criticism from the international community.\nEuropean Union: The EU has expressed strong support for Ukraine’s sovereignty and territorial integrity, and is expected to coordinate its sanctions policy with the US.\nNATO: The North Atlantic Treaty Institution has reaffirmed its commitment to collective defense and is increasing its military presence in Eastern Europe.\nUnited Kingdom: The UK has pledged continued military and financial assistance to Ukraine and is working with allies to impose further sanctions on Russia.\nThe level of allied alignment is crucial for the effectiveness of any sanctions regime. A united front will maximize pressure on Russia and minimize the potential for circumvention.\nImpact on Global Markets and Energy Security\nThe escalating conflict and the threat of further sanctions are already having a significant impact on global markets.\nEnergy Prices: Oil and gas prices have surged, driven by concerns about disruptions to Russian energy supplies. This is contributing to inflationary pressures worldwide.\nFood Security: Ukraine and Russia are major exporters of grain and fertilizers. The conflict is disrupting agricultural production and exports, raising concerns about food security in vulnerable countries.\nFinancial Markets: Global stock markets have experienced volatility, as investors react to the heightened geopolitical risks.\nThe long-term consequences of the conflict for global energy security and food supplies are potentially severe. Diversifying energy sources and strengthening global supply chains are becoming increasingly urgent priorities.\nPotential Scenarios and Future Outlook\nSeveral potential scenarios could unfold in the coming weeks and months:\n- Further Escalation: Russia could intensify its military offensive in Ukraine,potentially leading to a wider conflict.\n- Diplomatic Breakthrough: Despite the current impasse, there is still a possibility of a diplomatic breakthrough, leading to a ceasefire and negotiations.\n- Protracted Stalemate: The conflict could settle into a protracted stalemate, with ongoing fighting and limited territorial gains.\nThe outcome will depend on a complex interplay of factors, including the military situation on the ground, the political dynamics within Russia and Ukraine, and the actions of external actors. The threat of “massive sanctions” from Trump adds a new dimension to the equation, potentially influencing Putin’s calculations.\nUnderstanding the Role of SWIFT in Sanctions\nThe Society for Worldwide Interbank Financial Telecommunication (SWIFT) is a critical component of international finance. Excluding Russian banks from SWIFT would severely hamper their ability to conduct international transactions, effectively isolating them from the global financial system. This has been a key demand from Ukraine and its allies, but its implementation carries risks, including potential disruptions to global trade and financial flows.\nThe Importance of Intelligence Sharing\nEffective sanctions require robust intelligence sharing between countries to identify and target individuals and entities involved in evading sanctions. This includes tracking illicit financial flows, identifying shell companies, and disrupting networks"
    },
    {
      "news_title": "Washington hides failure with Trump’s desperate sanctions on Russia",
      "news_link": "https://easternherald.com/2025/08/23/trump-ukraine-peace-failure/",
      "bias": "unknown",
      "text": null
    },
    {
      "news_title": "Trump Says U.S. May Impose New Sanctions on Russia Within Two Weeks - Khaama Press",
      "news_link": "https://www.khaama.com/trump-says-u-s-may-impose-new-sanctions-on-russia-within-two-weeks/",
      "bias": "unknown",
      "text": "President Trump warned Washington may impose new sanctions on Russia within two weeks, citing lack of progress in peace efforts and continued Russian attacks in Ukraine.\nPresident Donald Trump has warned that the United States could impose new sanctions on Russia within the next two weeks, following Moscow’s latest attacks in Ukraine.\nSpeaking to reporters at the White House on August 22, Trump said it must soon become clear whether his efforts to end the conflict will yield progress. “The decision on Russia will be important, whether it’s sanctions, tariffs, or nothing at all. Within two weeks we’ll know the direction,” he noted.\nTrump admitted he was dissatisfied with ongoing peace efforts, adding he was “not happy in any way” with attempts to bridge differences between Moscow and Kyiv. He acknowledged that “an enormous amount of hatred” still divides the two sides.\nThe remarks came just days after Trump met Russian President Vladimir Putin in Alaska. Despite the talks, he has so far failed to persuade Putin to meet with Ukrainian President Volodymyr Zelensky.\nTrump suggested a possible three-way summit with Putin and Zelensky but cast doubt on its effectiveness. “Many believe it would achieve nothing, unless I’m there myself,” he said.\nMeanwhile, Russian Foreign Minister Sergei Lavrov announced that Putin would only consider a meeting with Zelensky if a clear agenda were established, but stressed that no such framework exists at present.\nTrump also condemned Russia’s continued strikes, including one that hit a U.S.-linked factory in Ukraine. He reminded reporters that he had ended seven wars during his presidency and claimed that, if pre-war tensions were counted, the figure would rise to ten."
    },
    {
      "news_title": "To take \"important decisions\" in 2 weeks on the Russia-Ukraine war, Trump says \"mass restrictions or nothing can do\"",
      "news_link": "https://www.thelocalreport.in/to-take-important-decisions-in-2-weeks-on-the-russia-ukraine-war-trump-says-mass-restrictions-or-nothing-can-do/",
      "bias": "unknown",
      "text": "US President Donald Trump said on Friday (local time) that he is going to take “very important decisions” over the next two weeks on the Russia-Ukraine War, suggesting that he can impose a “large-scale ban or tariff” on the Kremlin or tell Kiev that it is not a Washington war.\nTrump said that his decision is dependent on what happens in the next two weeks and has been pushed for a meeting between Russian President Vladimir Putin and his Ukrainian counterpart Volodimier Zelanski.\nTalking to reporters at the Oval Office, Donald Trump said, “In two weeks, we are going to know what path I am going because I am going in a way or in another way. It is going to take a very important decision. I am going to decide whether it is not a mass restriction or large -scale tariff or we do not do anything or we do not do anything.”\nHe said, “It takes it to two tango. I wanted to have a meeting with both of them. We would see if they did not have a meeting, then why was it when I asked them to hold a meeting,” he said.\nWhen asked about an American factory in Ukraine during a recent Russian missile attacks, Donald Trump said, “I am not happy about it and I am not happy about that war. I have resolved seven wars and you think about the East War, these will be three 10 wars. not amused. In the next two weeks we are going to find out in which way it is going. ,\nTrump again claimed that he stopped a ‘potential’ nuclear war between India and Pakistan and six other wars and 3 potential people.\n“I have resolved seven wars, and you think about the East-War, it will be three, so 10 wars.\nEarlier, Russian External Affairs Minister Sergei Lavarov said that Vladimir Putin is ready to meet Ukraine’s President Volodimier Zelancesi, provided that all issues related to the disposal of the conflict between Moscow and Kiev are working perfectly.\nLavarov told RT on Thursday, “The Russian President repeatedly stated that he is ready to meet with Zelancesi, if it is understood that all issues need to be considered at the highest level, then they have been fully worked” by experts and ministers. (AI)"
    },
    {
      "news_title": "Paqja në Ukrainë mbetet e paqarta një javë pas samitit të Alaskës / Trump rishqyrton sanksionet ndaj Rusisë",
      "news_link": "https://www.asiaone.com/world/no-ukraine-peace-deal-trump-again-threatens-russia-sanctions",
      "bias": "unknown",
      "text": "WASHINGTON/KYIV - US President Donald Trump renewed a threat to impose sanctions on Russia on Friday if there is no progress toward a peaceful settlement in Ukraine in two weeks, showing frustration at Moscow a week after his meeting with Russian President Vladimir Putin in Alaska.\n\"I'm going to make a decision as to what we do and it's going to be, it's going to be a very important decision, and that's whether or not it's massive sanctions or massive tariffs or both, or we do nothing and say it's your fight,\" Trump said.\nHe said he was unhappy about Russia's strike on an American factory in Ukraine this week, which caused a fire that injured some of the facility's employees.\n\"I'm not happy about it, and I'm not happy about anything having to do with that war,\" Trump told reporters at the White House.\nUkrainian President Volodymyr Zelenskiy, meanwhile, said on Friday that Russia was doing everything it could to prevent a meeting between him and Putin, while Russia's foreign minister said the agenda for such a meeting was not ready.\nZelenskiy has repeatedly called for Putin to meet him, saying it is the only way to negotiate an end to the war.\nTrump had said he had begun the arrangements for a Putin-Zelenskiy meeting after a call with the Russian leader on Monday that followed their Alaska meeting on Aug 15.\nZelenskiy accused Russia of stalling.\n\"The meeting is one of the components of how to end the war,\" he said on Friday at a press conference in Kyiv with NATO Secretary General Mark Rutte. \"And since they don't want to end it, they will look for space to (avoid it).\"\nRussian Foreign Minister Sergei Lavrov told NBC there was no agenda for such a summit.\n\"Putin is ready to meet with Zelenskiy when the agenda would be ready for a summit. And this agenda is not ready at all,\" he said.\nThe statement echoed Moscow's established rhetoric about a leaders' meeting being impossible unless certain conditions were met.\nAsked for his response to Lavrov's comments and what the next steps are, Trump told reporters earlier on Friday: \"Well, we'll see. We're going to see if Putin and Zelenskiy will be working together. It's like oil and vinegar a little bit.\"\n'He may be coming'\nTrump had taken sanctions off the table in preparation for his summit in Anchorage with Putin. But at the same White House event where he mentioned possible sanctions, he showed a photograph of his meeting with Putin on the red carpet in Alaska, saying Putin wanted to attend the World Cup 2026 football tournament in the United States.\n\"I'm going to sign this for him. But I was sent one, and I thought you would like to see it, it's a man named Vladimir Putin, who I believe will be coming, depending on what happens. He may be coming, and he may not, depending on what happens,\" Trump said.\nTrump's comments did not address the fact that Russia was banned from international competitions such as the World Cup after the 2022 invasion of Ukraine and has not taken part in qualification for the 2026 tournament, which will be hosted by the US, Canada and Mexico.\nDuring a visit to a nuclear research centre on Friday, Putin said Trump's leadership qualities would help restore US-Russia relations.\n\"With the arrival of President Trump, I think that a light at the end of the tunnel has finally loomed. And now we had a very good, meaningful and frank meeting in Alaska,\" Putin said.\n[[nid:721673]]\nThousands of Ukrainian civilians have been killed in the full-scale invasion of Ukraine that Russia launched in 2022. Analysts estimate that more than a million soldiers on both sides have been killed or wounded and fighting is continuing unabated, with both sides also attacking energy facilities.\nRussia has maintained its longstanding demand for Ukraine to give up land it still holds in two eastern regions while proposing to freeze the front line in two more southerly regions Moscow claims fully as its own and possibly hand back small pieces of other Ukrainian territory it controls.\nZelenskiy meanwhile has dropped his demand for a lengthy ceasefire as a prerequisite for a leaders' meeting, although he has previously said Ukraine cannot negotiate under the barrel of a gun.\nAt the press conference with Rutte, Zelenskiy said they had discussed security guarantees for Ukraine. He said the guarantees ought to be similar to NATO's Article 5, which considers an attack on one member of the alliance as an attack against all.\nRutte said NATO allies and Ukraine are working together to ensure security guarantees are strong enough that Russia will never try to attack again.\n\"Robust security guarantees will be essential, and this is what we are now working on to define,\" he said."
    },
    {
      "news_title": "Trump threatens sanctions as Zelensky accuses Russia of blocking talks | The latest National and International News",
      "news_link": "https://www.upday.com/uk/world/trump-threatens-sanctions-as-zelensky-accuses-russia-of-blocking-talks/4sq5lgp",
      "bias": "unknown",
      "text": "- logo-icon\n- UK\n- hamburger-menu-icon\n- logo-icon\n- close-icon\nUkrainian President Volodymyr Zelensky has accused Russia of \"doing everything\" to avoid a summit with Vladimir Putin, dealing a significant blow to Donald Trump's peace efforts. Speaking alongside NATO chief Mark Rutte in Kyiv, Zelensky said the fundamental issue was that Russia \"do not want to end the war\".\nRussian Foreign Minister Sergei Lavrov reinforced this stance, stating that an agenda for potential Putin-Zelensky talks was \"not ready at all\". Despite Trump's diplomatic push, Lavrov confirmed that Moscow's core demands for any peace deal remained unchanged.\nTrump responded with a stark ultimatum, warning he would decide within two weeks whether to \"impose massive sanctions\" against Russia. When asked about potential inaction if Putin refuses negotiations, Trump said he would \"wait and see whose fault it is\" before making his next move.\nThe US President said: \"I think in two weeks, we'll know which way I'm going.\" Trump's frustration became evident as he described Putin and Zelensky as being \"like oil and vinegar\" in their relationship.\nAccording to The Guardian, Trump expressed particular anger over a Russian strike on an American factory in Ukraine that injured employees. This incident has reportedly heightened his resolve to pressure both sides toward negotiations.\nUkraine intensified its infrastructure targeting strategy, striking the Unecha oil pumping station on Russia's Druzhba pipeline. The attack threatens to halt Russian oil supplies to Hungary and Slovakia for at least five days, creating new tensions within the European Union.\nHungarian and Slovak foreign ministers warned the European Commission that \"without this pipeline, the safe supply of our countries is simply not possible\". The strike demonstrates Ukraine's strategy of targeting infrastructure supporting Moscow's war effort.\nPutin offered contrasting remarks, describing Trump as \"the light at the end of the tunnel\" for struggling US-Russia relations. Speaking at a nuclear research centre in Sarov, Putin said their Alaska meeting had been \"very good, meaningful and frank\".\nTrump displayed a photograph that Putin had sent him from their Alaska meeting, suggesting the Russian leader wanted to attend the 2026 World Cup in the United States. Trump said: \"He may be coming and he may not, depending on what happens.\"\nBritish aid worker Annie Lewis Marffy, 69, was killed in a Russian drone strike while delivering supplies to Ukraine. The Devon resident's body remains in an active combat zone, leaving her family in what aid organisations describe as \"red tape limbo\" due to bureaucratic challenges in issuing a death certificate.\nAccording to Daily Mail reports, EU foreign policy chief Kaja Kallas warned that Russian peace demands represent a \"trap\" designed to extract Ukrainian concessions while Russia makes none in return. Russian attacks on Kostiantynivka damaged 21 multi-storey buildings and civilian infrastructure, highlighting the continued escalation.\nSources used: \"PA Media\", \"The Independent\", \"The Guardian\", \"Daily Mail\" Note: This article has been edited with the help of Artificial Intelligence."
    },
    {
      "news_title": "Trump threatens with massive sanctions, tariffs on Russia that can punish even Hungary",
      "news_link": "https://dailynewshungary.com/trump-threatens-with-massive-sanctions-tariffs-on-russia-that-may-punish-even-hungary/",
      "bias": "unknown",
      "text": "Trump threatens with massive sanctions, tariffs on Russia that can punish even Hungary\nUS President Donald Trump said on Friday that he will know in two weeks whether progress can be made toward ending the Russia-Ukraine war, while also hinting at possible sanctions against Moscow.\nSpeaking to reporters in the Oval Office, Trump expressed frustration with recent Russian strikes that damaged a US factory operating in Ukraine, the Turkish Anadolu News Agency wrote.\nTrump not happy and may punish even Hungary\n“I’m not happy about it, and I’m not happy about anything having to do with that war,” he said. “Over the next two weeks, we’re going to find out which way it’s going to go. And I better be very happy.”\nPressed on what will happen in two weeks, Trump said: “I’m going to make a decision as to what we do, and it’s going to be a very important decision, and that’s whether or not it’s massive sanctions or massive tariffs or both, or do we do nothing and say it’s your fight?”\nEarlier this August, Trump threatened countries purchasing Russian oil with secondary tariffs. Since Hungary is among the largest buyers of Russian crude (4.7 million tonnes in 2024), Budapest could be a target despite the apparent Orbán-Trump friendship.\nPutin and Zelensky are like oil and vinegar\nAccoridng to Anadolu, Trump has recently been making efforts to resolve the conflict in Ukraine. He conducted several rounds of talks with both sides, including a summit with Russian President Putin in Alaska on Aug. 15, and announced preparations for a meeting between Ukrainian President Zelenskyy and Putin.\nEarlier Friday, he expressed cautious optimism that the two sides could eventually come together.\n“We’re going to see if Putin and Zelenskyy will be working together,” Trump told reporters during a visit to The People’s House museum in Washington. “That’s like oil and vinegar a little bit. They don’t get along too well, for obvious reasons, but we’ll see.”\nRead also:\n- Unexpected twist in Trump-Orbán phone call over Ukraine’s EU membership bid\n- Trump to Orbán about Ukrainian Druzhba attack: “I am very angry about it”\nClick for more news concerning the ongoing war in Ukraine."
    },
    {
      "news_title": "Trump Again Warns Of Russia Sanctions If Ukraine Peace Progress Lags",
      "news_link": "https://stratnewsglobal.com/united-states/trump-again-warns-of-russia-sanctions-if-ukraine-peace-progress-lags/",
      "bias": "unknown",
      "text": "U.S. President Donald Trump on Friday reiterated his threat to impose sanctions on Russia if there is no progress toward a peaceful resolution in Ukraine within two weeks, expressing frustration with Moscow just a week after meeting Russian President Vladimir Putin in Alaska.\n“I’m going to make a decision as to what we do and it’s going to be, it’s going to be a very important decision, and that’s whether or not it’s massive sanctions or massive tariffs or both, or we do nothing and say it’s your fight,” Trump said.\nHe was unhappy about Russia’s deadly strike on a factory in Ukraine this week, he said.\n“I’m not happy about it, and I’m not happy about anything having to do with that war,” Trump told reporters at the White House.\n‘No Agenda Set Yet’\nUkrainian President Volodymyr Zelenskyy, meanwhile, said on Friday that Russia was doing everything it could to prevent a meeting between him and Putin, while Russia’s foreign minister said the agenda for such a meeting was not ready.\nZelenskyy has repeatedly called for Putin to meet him, saying it is the only way to negotiate an end to the war.\nTrump had said he had begun the arrangements for a Putin-Zelenskyy meeting after a call with the Russian leader on Monday that followed their Alaska meeting on August 15.\nZelenskyy accused Russia of stalling.\n“The Russians are doing everything they can to prevent the meeting from taking place,” he said on Friday at a press conference in Kyiv with NATO Secretary General Mark Rutte.\n“The meeting is one of the components of how to end the war. And since they don’t want to end it, they will look for space to (avoid it),” he added.\nRussian Foreign Minister Sergei Lavrov told NBC there was no agenda for such a summit.\n“Putin is ready to meet with Zelenskyy when the agenda would be ready for a summit. And this agenda is not ready at all,” he said.\nThe statement echoed Moscow’s established rhetoric about a leaders’ meeting being impossible unless certain conditions were met.\nAsked for his response to Lavrov’s comments and what the next steps are, Trump told reporters earlier on Friday: “Well, we’ll see. We’re going to see if Putin and Zelenskyy will be working together. It’s like oil and vinegar a little bit.”\n‘He May Be Coming’\nTrump had taken sanctions off the table in preparation for his summit in Anchorage with Putin. But at the same White House event where he mentioned possible sanctions, he reached into a drawer to pull out a photograph of his meeting with Putin on the red carpet in Alaska, saying Putin wanted to attend the World Cup 2026 soccer tournament in the United States.\n“I’m going to sign this for him. But I was sent one, and I thought you would like to see it, it’s a man named Vladimir Putin, who I believe will be coming, depending on what happens. He may be coming, and he may not, depending on what happens,” Trump said.\nPutin, at a visit to a nuclear research centre on Friday, said Trump’s leadership qualities would help restore U.S.-Russia relations.\n“With the arrival of President Trump, I think that a light at the end of the tunnel has finally loomed. And now we had a very good, meaningful and frank meeting in Alaska,” Putin said.\nThousands of Ukrainian civilians have been killed in the full-scale invasion of Ukraine that Russia launched in 2022. Analysts estimate that more than a million soldiers on both sides have been killed or wounded, and fighting is continuing unabated, with both sides also attacking energy facilities.\nRussia has maintained its longstanding demand for Ukraine to give up land it still holds in two eastern regions, while proposing to freeze the front line in two more southerly regions Moscow claims fully as its own, and possibly hand back small pieces of other Ukrainian territory it controls.\nZelenskyy Drops Lengthy Truce Demand\nZelenskyy, meanwhile, has dropped his demand for a lengthy ceasefire as a prerequisite for a leaders’ meeting, although he has previously said Ukraine cannot negotiate under the barrel of a gun.\nOn Friday, he called on his country’s allies to pressure Russia into “at least a minimally productive position,” including by applying fresh sanctions if Russia showed no interest in moving towards peace.\nAt the press conference with Rutte, Zelenskyy said they had discussed security guarantees for Ukraine. He said the guarantees ought to be similar to NATO’s Article 5, which considers an attack on one member of the alliance as an attack against all.\n“This is the beginning of a big undertaking, and it is not easy, because guarantees consist of what our partners can give Ukraine, as well as what the Ukrainian army should be like, and where we can find opportunities for the army to maintain its strength,” Zelenskyy said.\nRutte said NATO allies and Ukraine are working together to ensure security guarantees are at such a robust level that Russia will never try to attack again.\n“Robust security guarantees will be essential, and this is what we are now working on to define”, he said.\n(With inputs from Reuters)"
    },
    {
      "news_title": "Trump vows ‘very important decision’ on Ukraine soon - The Press United",
      "news_link": "https://thepressunited.com/updates/trump-vows-very-important-decision-on-ukraine-soon/",
      "bias": "unknown",
      "text": "The US president has said he wants to gauge the approaches both Moscow and Kiev take toward peace before deciding on his next move\nUS President Donald Trump said on Friday he will announce a major decision on the Ukraine conflict within the next two weeks, adding that the step will depend on the positions of both Moscow and Kiev.\nFor the past week, Trump has been pressing for a meeting between Russian President Vladimir Putin and Ukraine’s Vladimir Zelensky. Trump and Putin held a summit in Alaska last week, which he called “very productive,” while on Monday he met Zelensky and EU leaders in Washington. He urged Moscow and Kiev to start working toward a lasting peace.\nSpeaking to reporters in the Oval Office, Trump said: “I think over the next two weeks, we’re going to find out which way it’s going to go.”\nAsked about the time frame, he explained he expects clarity soon on whether Russia and Ukraine will engage in direct talks. “We’re going to see whether or not they have a meeting … But I’ll know in two weeks what I’m going to do. It’s going to be a very important decision.”\nTrump said he would then decide whether to impose “massive sanctions” or tariffs, or “do nothing and say it’s your fight.”\nThe US president previously suggested a possible three-way summit could follow a Putin-Zelensky meeting, adding that the Ukrainian leader “has to show some flexibility.”\nOn Thursday, however, Russian Foreign Minister Lavrov said Kiev has shown no interest in a sustainable peace. He cited comments from Zelensky aide Mikhail Podoliak, who said Ukraine will seek to regain any territories “de facto” left to Russia in a peace deal and pursue joining a military alliance, even if not NATO.\nREAD MORE: First Putin-Zelensky meeting ‘would be better without me’ – Trump\nLavrov said these goals run counter to the joint peace efforts being undertaken by Putin and Trump.\nMoscow has long insisted on a peace agreement that eradicates the underlying causes of the conflict. It has demanded that Ukraine maintain neutrality, stay out of NATO and other military blocs, demilitarize and denazify, as well as accept the new territorial reality.\nAugust 23, 2025 at 02:26AM\nRT"
    }
  ]
}