{
  "story_id": "GN_20250825_230432_d6323eb2",
  "metadata": {
    "title": "Federal workforce to lose 300,000 employees this year, Trump official says",
    "timestamp": "2025-08-25T23:04:32.335327",
    "url": "https://ground.news/article/new-opm-director-estimates-300-000-federal-job-cuts-this-year-no-plans-to-relocate-jobs-from-dc"
  },
  "bias_distribution": {
    "total_sources": "15",
    "leaning_left": "1",
    "center": "5",
    "leaning_right": "6"
  },
  "perspective_summaries": {
    "left": [
      "Scott Kupor, director of the Office of Personnel Management, said around 300,000 federal jobs are expected to be shed by the end of the year, with most coming from voluntary separations.",
      "Kupor said the reduction of federal positions should be mostly finished by year's end, but did not rule out future job cuts, and there are no plans to relocate positions currently.",
      "Kupor said his goal is to create a cultural shift for the agency to operate more efficiently as stewards of taxpayer dollars."
    ],
    "center": [
      "Scott Kupor, director of the Office of Personnel Management, said around 300,000 federal jobs are expected to be shed by the end of the year, with most coming from voluntary separations.",
      "Kupor said the reduction of federal positions should be mostly finished by year's end, but did not rule out future job cuts, and there are no plans to relocate positions currently.",
      "Kupor said his goal is to create a cultural shift for the agency to operate more efficiently as stewards of taxpayer dollars."
    ],
    "right": [
      "In 2025, the federal workforce is expected to reduce by 300,000 employees, marking the largest single-year reduction since World War II.",
      "The federal workforce will decrease from 2.4 million to 2.1 million, a 12.5 percent reduction.",
      "Around 80 percent of job reductions are due to voluntary buyouts and transition programs, with the remaining 20 percent resulting from involuntary layoffs.",
      "Kupor highlighted the empathetic approach to these cuts, ensuring buyouts were generous and expressed awareness of the job loss's impact on families and communities."
    ]
  },
  "sources": [
    {
      "news_title": "Staff cuts have have damaged Social Security, former commissioner says",
      "news_link": "https://ohiocapitaljournal.com/2025/08/25/staff-cuts-have-have-damaged-social-security-former-commissioner-says/",
      "bias": "Lean Left",
      "text": null
    },
    {
      "news_title": "Congressman Burchett on federal job cuts and deep state issues",
      "news_link": "https://justthenews.com/podcasts/john-solomon-reports/congressman-burchett-federal-job-cuts-and-deep-state-issues",
      "bias": "Lean Right",
      "text": "Congressman Burchett on federal job cuts and deep state issues\nImage\nGetty Images\nIn this Sunday brunch edition, John Solomon welcomes Congressman Tim Burchett from Tennessee to discuss the significant reduction of federal jobs, a move that aims to shrink government bureaucracy. We also hear from Kingsley Wilson, the dynamic press secretary at the Pentagon, who addresses the fallout from a controversial Washington Post article regarding security details of Secretary Pete Hegseth's family. Lastly, Dr. Jonathan Greenberg from Zyppah shares insights on a revolutionary mouth guard designed to combat snoring and improve sleep quality."
    },
    {
      "news_title": "Federal Workforce Faces Largest One-Year Cut Since WWII, Shrinking by 300,000 Employees in 2025",
      "news_link": "https://townhall.com/tipsheet/saraharnold/2025/08/23/federal-workforce-faces-largest-one-year-cut-since-wwii-shrinking-by-300000-employees-in-2025-n2662237",
      "bias": "Right",
      "text": "In 2025, the federal government will see its most significant single-year reduction in civilian employment since World War II, with 300,000 fewer workers by year’s end. The federal workforce is expected to shrink from 2.4 million to 2.1 million employees, a 12.5 percent decrease, primarily driven by efforts from the newly established Department of Government Efficiency (DOGE).\nThe new director of the Office of Personnel Management (OPM), Scott Kupor, recently confirmed that about 80 percent of these reductions come from voluntary buyouts and transition programs designed to help employees move on with financial support. The remaining 20 percent were involuntary layoffs. Kupor emphasized that these buyouts were intentionally structured to be generous and provide ample time for affected workers to find new opportunities.\nThis downsizing surpasses previous cuts made by presidents, including former Presidents Reagan and Clinton, which occurred over multiple years. In contrast, the Trump administration also enacted significant workforce reductions during its tenure, including dismantling agencies like the U.S. Agency for International Development, which cut 10,000 jobs. Notable reductions have also occurred at the Department of Health and Human Services, where over 20,000 employees either accepted buyouts or were let go, and the Internal Revenue Service, which has seen approximately 7,300 dismissals.\nKupor, who transitioned from a private-sector leadership role at venture capital firm Andreessen Horowitz, acknowledged the personal impact these job losses have on families and communities. He expressed empathy for those affected while underscoring the government's need to streamline its workforce for greater efficiency.\nRecommended\nLooking ahead, Kupor does not anticipate any further large-scale layoffs this year, signaling that the most intensive phase of federal workforce reduction may be concluding. This historic downsizing marks a shift toward a leaner federal government, aligning with long-standing conservative goals to reduce bureaucracy and improve operational efficiency.\nEditor’s Note: The Democrat Party has never been less popular as voters reject its globalist agenda.\nHelp us continue exposing Democrats' plans to lead America down a dangerous path. Join Townhall VIP and use promo code FIGHT to get 60% off your membership.\nJoin the conversation as a VIP Member"
    },
    {
      "news_title": "Federal workforce to shrink by 300K after Trump cuts",
      "news_link": "https://buffalonews.com/article_54b593a0-4040-51f8-9f0e-612b5d6a9457.html",
      "bias": "Center",
      "text": null
    },
    {
      "news_title": "Longtime Portland-area elected official tapped for job by Trump administration",
      "news_link": "https://www.oregonlive.com/politics/2025/08/longtime-portland-area-elected-official-tapped-for-job-by-trump-administration.html",
      "bias": "Center",
      "text": "Former Clackamas County Chair Tootie Smith has been tapped by the Trump administration for a Department of Agriculture job.\nSmith, who was unseated by former county Sheriff Craig Roberts last fall, will serve as the head of the Oregon Farm Service Agency, as first reported by Oregon City News. The agency assists farmers, ranchers and agricultural landowners through loans, income support and disaster recovery, among other things.\n“When rural America succeeds, our entire country is stronger,” U.S. Secretary of Agriculture Brooke Rollins said in a press release Thursday. “These newly appointed USDA state directors will play a critical role in advancing President Trump’s America First agenda in the states and ensuring that our farmers and ranchers are prioritized.”\nSmith, an outspoken Republican who has voiced support for President Donald Trump, is a fourth-generation Oregon farmer who was raised on her family’s farm. She and her husband now run a hazelnut orchard. She is steeped in local politics, having served two terms in the Oregon House and as a county commissioner before being elected chair in 2020.\nShe lost her bid for reelection as chair last November, taking 43% of the vote to Roberts’ 57%.\nSmith did not immediately respond to a request for comment Friday.\n— Austin De Dios covers county politics, programs and more. Reach him at 503-319-9744, adedios@oregonian.com or @AustinDeDios"
    },
    {
      "news_title": "Donald Trump to Achieve the Largest Cut in Federal Workforce in 80 Years",
      "news_link": "https://www.breitbart.com/pre-viral/2025/08/22/trump-to-achieve-largest-cut-federal-workforce-80-years/",
      "bias": "Right",
      "text": "In what is being called the largest single-year cut in civilian federal employment since World War II, 2025 will end with 300,000 fewer workers employed by the United States government.\nNew Office of Personnel Management (OPM) Director Scott Kupor told several news outlets, most recently the New York Times, that the federal workforce will drop from 2.4 million to 2.1 million employees, largely as the result of the Department of Government Efficiency’s (DOGE) efforts.\nIn a lengthy interview this week with Washington, DC, station WTOP, Kupor said that up to 80 percent of the reductions come from federal workers choosing to access buyouts or another program that paid them while they looked for other work.\n“I think the team that designed those did as much as they could to be appropriately generous and give people as long of a runway as they could to go transition into something,” Kupor told the station.\nThe other 20 percent were fired, Kupor told Reuters in a previous interview. The total reduction amounts to a 12.5 percent decrease in the federal workforce of approximately 2.3 million.\nOPM is sometimes described as the human resources department of the federal government.\nPresident Harry S. Truman reduced the civilian federal work force by 1.3 million following World War II, largely in the defense industry. Other presidents, including Ronald Reagan and Bill Clinton, made substantial reductions, though theirs, unlike President Donald Trump’s, took multiple years to accomplish.\nCNN has featured a tracker of employee reductions implemented by the Trump administration. The U.S. Agency for International Development (USAID) dismissed some 10,000 employees when it was dismantled entirely.\nOthers, as Breitbart News reported, include more than 20,000 employees reportedly cut or accepting buyouts at the Department of Health and Human Services (HHS). Some 7,300 have been dismissed at the Internal Revenue Service, according to the CNN tracker.\nKupor told the Times he doesn’t expect any significant new layoff announcements this year, Forbes reported.\nKupor, confirmed to his position in July, comes from the private sector, where he was a managing partner at Andreessen Horowitz, a venture capital firm.\nHe told the TV station he’s well aware of the personal consequences for some of those who no longer have federal jobs.\n“I recognize and understand we’re talking about very serious things. Anytime we do layoffs or reductions, you know, that impacts people’s families, it impacts people’s friends, it impacts their ability to be contributing members to their community,” he said. “And look, we need to recognize and understand that is a difficult thing for people to live through.”\nContributor Lowell Cauffiel is the best-selling author of Below the Line and nine other crime novels and nonfiction titles. See lowellcauffiel.com for more.\nCOMMENTS\nPlease let us know if you're having issues with commenting."
    },
    {
      "news_title": "Federal workforce to lose 300,000 employees this year, Trump official says",
      "news_link": "https://thehill.com/homenews/administration/5465964-trump-administration-federal-workforce-cuts-opm/",
      "bias": "Center",
      "text": null
    },
    {
      "news_title": "Trump Administration DOGE Cuts Will Total 300,000 This Year, Report Says",
      "news_link": "https://www.forbes.com/sites/saradorn/2025/08/22/trump-administration-doge-cuts-will-total-300000-this-year-report-says/",
      "bias": "Center",
      "text": "Topline\nThe Trump administration will slash 300,000 employees from the federal workforce by the end of September, according to a new report revealing the total impact of the mass layoffs in the first year of President Donald Trump’s second term.\nKey Facts\nThe cuts, most of which were a result of the Department of Government Efficiency’s work, will reduce the federal workforce from 2.4 million to 2.1 million employees by the end of 2025, Office of Personnel Management director Scott Kupor told The New York Times.\nKupor told the paper he doesn’t expect any significant new layoff announcements by the end of the year and that most of the employees cut had already stopped working, though some still remained on the payroll.\nThe bulk of the severed employees—80%—represent those who left voluntarily, while the other 20% were fired, Kupor told Reuters previously.\nBig Number\n5.9%. That’s the government-wide attrition rate in fiscal year 2023, according to the nonprofit Partnership for Public Service, less than half the number of federal workers that will be cut in 2024.\nWhich Agencies Were Cut Most?\nThe U.S. Agency for International Development was dismantled entirely, a reduction of 10,000 total employees, according to a CNN tracker of the Trump administration’s cuts as of July. About 20,000 employees at the Department of Health and Human Services have been cut or accepted buyouts, representing about 24% of total staff, according to a New York Times tracker last updated in May. The Food and Drug Administration has slashed about 3,500 employees, 16.7% of staff, from its payroll, according to CNN.\nKey Background\nTrump assigned Elon Musk to lead the Department of Government Efficiency charged with identifying agencies where workers should be cut, leading to bipartsian backlash that the so-called reductions in force were haphazard or insensitive. While Trump said the cuts were designed to target government waste and bloat, critics argued they depleted some agencies of expertise and threatened key government services. Most of the terminated employees are what’s known as “probationary” workers, or newly hired staff whose permanent employment is contingent on a preliminary review during the probationary period. Many of the firings have faced legal action from individual employees, advocacy groups, unions and some city governments to block the terminations, though the Supreme Court ruled in July the bulk of the terminations could proceed.\nFurther Reading\nTrump Administration Lays Off Hundreds Of Voice Of America Workers (Forbes)\nSupreme Court Clears The Way For Mass Federal Layoffs. What It Means For Workers Now (Forbes)"
    },
    {
      "news_title": "New OPM director estimates 300,000 federal job cuts this year, no plans to relocate jobs from DC",
      "news_link": "https://wtop.com/government/2025/08/new-opm-director-estimates-300000-federal-job-cuts-this-year-no-plans-to-relocate-jobs-from-dc/",
      "bias": "Center",
      "text": "After being confirmed in July, Scott Kupor, director of the Office of Personnel Management, has taken over the federal government human resources agency. Kupor comes to the position from the private sector, where he served as a managing partner at Andreessen Horowitz, a venture capital firm.\n“I feel like I have a decent handle on the team and kind of what we’re going to focus on and where things are going,” Kupor said.\nSpeaking to WTOP at OPM’s E Street headquarters, Kupor discussed the rollout of the plan from President Donald Trump’s administration for downsizing the federal work force.\nAround 300,000 jobs are expected to be shed by the end of the year.\nKupor said the civilian federal workforce currently stands at 2.4 million, and by Dec. 31, he expects that number to shrink to 2.1 million.\nHe said roughly 75% to 80% of the workforce reductions come from federal workers choosing to accept the Deferred Resignation Program or buyouts, known as Voluntary Separation Incentive Payments.\n“I think the team that designed those did as much as they could to be appropriately generous and give people as long of a runway as they could to go transition into something,” Kupor said.\nAccording to recent numbers, 154,000 federal employees accepted the deferred resignation offer.\nKupor maintained reductions in force and layoffs of probationary workers will account for a minority of the separations. Official figures for how many probationary employees were let go and how many were released due to RIFs were not readily available.\nThe reduction of federal positions, Kupor said, should be mostly finished by year’s end, but he didn’t rule out future job cuts.\n“Obviously, a lot of that will be determined by the president’s budget,” Kupor said. “They’re kind of soliciting feedback now from agencies, so there’s not a whole lot of definitive guidance on that yet.”\nImpact on DC region\nKupor said the impact of the cuts would be greater here because of the percentage of the federal workforce that calls the D.C. region home.\n“I think probably a little bit more than half of the government workers in total are in this region, and the rest are obviously in the field,” Kupor said. “And so, from everything I’ve seen, I would expect the reduction in numbers will basically mirror that distribution.”\nBefore taking office, Trump expressed a desire to potentially relocate tens of thousands of federal positions out of D.C. In July, the head of the U.S. Department of Agriculture expressed a similar sentiment, saying 2,600 USDA jobs would be moved as part of a reorganization.\nBut Kupor said as of right now, there are no plans to relocate positions.\n“I don’t think there’s any stated effort to kind of move jobs out of D.C. into other areas,” Kupor said.\nThey have, however, moved to put an end to remote work.\n“What a lot of us went through earlier in the year was looking at people that we had in various field offices and figuring out ways where people were working from home to get them to return to a field office,” he said.\nKupor said the move away from remote work will be a boost to local restaurants and other businesses near federal offices.\nDeparting feds express frustration\nOnce federal layoffs began, WTOP started to hear from federal workers who were impacted. They expressed concerns about being able to reach OPM for information, seeing miscalculated severance payment and other issues.\nKupor said while he hasn’t heard many of those concerns himself, he said the goal is to make sure everyone is “treated fairly and has the information they need.”\n“We put out a lot of guidance to agencies,” Kupor said. “It’s possible maybe that created confusion where people weren’t sure whether to go to OPM or go to their agencies, but I think we’ve resolved those issues.”\nWTOP also heard from some federal workers who chose to retire, were directed to a new digital platform for applying, and they claimed that led to problems with completing the process.\nKupor said rolling out large-scale programs can come with complications, and added issues have been addressed quickly and it is working “very effectively.”\nHe said the goal of moving the retirement process to the digital realm is to improve efficiency and the user experience.\nAddressing morale concerns in the workforce\nThroughout this process, many federal workers have said they’ve felt vilified by high-ranking members of the Trump administration.\nKupor said his goal is to be firm, yet respectful of the fact that decisions being made in regard to the federal workforce impact lives.\n“I recognize and understand we’re talking about very serious things,” he said. “Anytime we do layoffs or reductions, you know, that impacts people’s families, it impacts people’s friends, it impacts their ability to be contributing members to their community. And look, we need to recognize and understand that is a difficult thing for people to live through.”\nHis time in the private sector as a manager, he said, taught him that when an employee is let go, many times trust is lost between a manager and that person.\n“Because you hired them and you told them all the wonderful things that you could do for their career by doing this,” Kupor said. “And now we’re saying, ‘Look, through no fault of your own, unfortunately, we have to eliminate this job,’ and so I think you can be both empathetic and also be firm and direct the organization in the right direction.”\nKupor said he has sought to be truthful with his staff, recognizing that those still working have also been through unsettling times.\n“Right now, you know, we need to digest all this change,” Kupor said. “I said, ‘Look, there’s no plan right now to do any additional kind of major reductions here.’ I said, ‘Look, I want to be also transparent that I can’t make a promise to you that that will never change.’”\nKupor plans to bring ‘cultural change’ to OPM\nKupor said he’s coming to the job as a “new observer,” but brings a new way of looking at things to OPM and comes to the job with a goal of creating a “cultural shift” that results in the agency operating more efficiently.\n“The culture that I’m trying to affect here at OPM, that I hope we will be able to convey across the government, is everybody in every organization should always think about, like, ‘Could I do things differently? Could I do things better? Are there ways to use technology? Are there ways to change the organization? Are we working on the right things?’” he said.\nHe said he wants to change the belief within government agencies that budgets only get bigger.\n“I think people get used to that, and what I want to change is I want people to think of themselves ultimately, as we are stewards of taxpayer dollars,” Kupor said.\nHe said he also hopes to bring some private sector principles to the job, including providing career development opportunities and allowing workers the chance to take “appropriate levels of risk.”\n“I recognize, obviously, that, you know, times of change are unsettling, but I hope we’ll get through this and what will come out of it is, you know, a continuously robust workforce,” Kupor said.\nWatch the full interview below.\nGet breaking news and daily headlines delivered to your email inbox by signing up here.\n© 2025 WTOP. All Rights Reserved. This website is not intended for users located within the European Economic Area."
    },
    {
      "news_title": "Donald Trump to Achieve the Largest Cut in Federal Workforce in 80 Years – altnews.org",
      "news_link": "https://altnews.org/2025/08/24/donald-trump-to-achieve-the-largest-cut-in-federal-workforce-in-80-years/",
      "bias": "unknown",
      "text": "Donald Trump to Achieve the Largest Cut in Federal Workforce in 80 Years\nby Lowell Cauffiel, Breitbart:\nIn what is being called the largest single-year cut in civilian federal employment since World War II, 2025 will end with 300,000 fewer workers employed by the United States government.\nNew Office of Personnel Management (OPM) Director Scott Kupor told several news outlets, most recently the New York Times, that the federal workforce will drop from 2.4 million to 2.1 million employees, largely as the result of the Department of Government Efficiency’s (DOGE) efforts.\nTRUTH LIVES on at https://sgtreport.tv/\nIn a lengthy interview this week with Washington, DC, station WTOP, Kupor said that up to 80 percent of the reductions come from federal workers choosing to access buyouts or another program that paid them while they looked for other work.\n“I think the team that designed those did as much as they could to be appropriately generous and give people as long of a runway as they could to go transition into something,” Kupor told the station.\nThe other 20 percent were fired, Kupor told Reuters in a previous interview. The total reduction amounts to a 12.5 percent decrease in the federal workforce of approximately 2.3 million.\nOPM is sometimes described as the human resources department of the federal government."
    },
    {
      "news_title": "Trump spearheads historic reduction in federal workforce - Conservative Journal Review",
      "news_link": "https://conservativejournalreview.com/trump-leads-historic-reduction-in-federal-workforce/",
      "bias": "unknown",
      "text": "Trump spearheads historic reduction in federal workforce\nUncle Sam just got a serious trim, with the largest single-year cut to the federal workforce since World War II happening under President Donald Trump’s watch.\nBy the end of 2025, the U.S. government will slash 300,000 civilian federal jobs, dropping the total from 2.4 million to 2.1 million, thanks largely to the Trump-inspired Department of Government Efficiency (DOGE), as Breitbart reports.\nThis isn’t just a tweak -- it’s a 12.5% gut punch to a workforce that hovered around 2.3 million before the cuts began.\nBehind the numbers\nLet’s break it down: 80% of these reductions come from federal workers taking buyouts or joining a program that paid them to find new gigs elsewhere.\nThe other 20%? They got the pink slip, plain and simple.\nWhile some might cry “heartless,” the reality is that many were given a softer landing than expected in today’s cutthroat economy.\nDOGE takes charge of cuts\nThe Department of Government Efficiency, or DOGE, is the muscle behind this historic downsizing, flexing its power to streamline a bloated bureaucracy.\nSpecific agencies felt the heat hard -- USAID was completely dismantled, sending 10,000 employees packing.\nMeanwhile, over at Health and Human Services, more than 20,000 either took buyouts or were shown the door, and the IRS bid farewell to about 7,300 staffers.\nLeadership with a private sector edge\nSteering this ship is Scott Kupor, the new director of the Office of Personnel Management -- think of it as the HR hub for the feds -- confirmed to his post in July 2025.\nKupor, a former managing partner at venture capital firm Andreessen Horowitz, brings a private-sector mindset to a government often criticized for inefficiency.\n“I think the team… did as much as they could to be appropriately generous,” Kupor told WTOP, reflecting on the buyout packages.\nBalancing cuts with compassion\nNow, let’s not pretend this is all rosy -- Kupor himself admitted the human toll, saying, “I recognize… we’re talking about very serious things.”\nHe added, “And look… that is a difficult thing for people to live through,” in a TV interview, showing at least some awareness of the families and communities hit by these layoffs.\nBut let’s be real: while empathy is nice, a leaner government has been a long-standing promise of conservatives tired of endless red tape and waste—sometimes, tough calls are the only way forward."
    },
    {
      "news_title": "War on Federal Bureaucracy Achieves Historic Accomplishment – IOTW Report",
      "news_link": "https://iotwreport.com/war-on-federal-bureaucracy-achieves-historic-accomplishment/",
      "bias": "unknown",
      "text": "Breitbart\nIn what is being called the largest single-year cut in civilian federal employment since World War II, 2025 will end with 300,000 fewer workers employed by the United States government.\nNew Office of Personnel Management (OPM) Director Scott Kupor told several news outlets, most recently the New York Times, that the federal workforce will drop from 2.4 million to 2.1 million employees, largely as the result of the Department of Government Efficiency’s (DOGE) efforts. More\nIt’s a start.\nCould be the other way around.\nAnd the 2 Fed employees I’m most glad at seeing become unemployed: Joe Biden and Kamala Harris\n@ 605: what do you call 50,000 loyuhs @ the bottom of the pacific ocean?\nwhy is Trump and maga people so mean?\nIf they cut lose to many of those worthless POSs they’d tank the economy. They need to be cut lose in small quantities for about 8 years. I work with .GOV peeps day in and day out. They better learn to think because they’ll never make it in the private sector. I also work directly with lots of .MIL peeps. One of them refers to the .GOV peeps as grown ups that use to ride the short bus when they were kids.\nWe need to reduce to about one fifteenth of the agencies we have now. That might just fit inside the Constitution.\nThat needs to be the litmus test of what constitutes federal government.\n“OPM is sometimes described as the human resources department of the federal government.”\nIn the world of finance — usually a pool of investors — OPM has long been known as “Other Peoples’ Money”.\nFunny that the gov’t should choose that acronym to describe their HR. It’s so apt."
    }
  ]
}