{
  "story_id": "GN_20250825_232553_b257ec0e",
  "metadata": {
    "title": "Judge blocks Trump from cutting funding from 34 cities and counties over 'sanctuary' policies",
    "timestamp": "2025-08-25T23:25:53.232698",
    "url": "https://ground.news/article/judge-blocks-trump-from-cutting-funding-from-34-cities-and-counties-over-sanctuary-policies_66ca03"
  },
  "bias_distribution": {
    "total_sources": "190",
    "leaning_left": "38",
    "center": "85",
    "leaning_right": "16"
  },
  "perspective_summaries": {
    "left": [
      "A judge ruled that the Trump administration cannot deny funding to Boston, Chicago, Denver, Los Angeles, and 30 other cities over 'sanctuary' policies, as stated by U.S. District Judge William Orrick.",
      "U.S. District Judge William Orrick issued a preliminary injunction to protect sanctuary jurisdictions from stripped federal funds.",
      "The Trump administration seeks to pressure these communities to support immigration enforcement, as stated in one of their executive orders.",
      "Cities that sued claim that billions of dollars in funding are at risk due to the administration's actions against sanctuary policies."
    ],
    "center": [
      "On Friday evening, U.S. District Judge William Orrick issued a ruling preventing the Trump administration from withholding federal funds from a group of cities and counties—including major municipalities such as Boston, Chicago, Denver, and Los Angeles—due to their sanctuary policies that restrict collaboration with federal immigration authorities.",
      "This decision came after President Trump issued executive orders instructing federal officials to withhold funding from jurisdictions that implement policies protecting undocumented immigrants from federal immigration enforcement.",
      "In May, a list identifying over 500 sanctuary jurisdictions as noncompliant was released by Homeland Security, while the Justice Department initiated lawsuits against several cities, including New York and Los Angeles, regarding their sanctuary policies.",
      "Judge Orrick called the administration's actions an unconstitutional coercive threat and extended a preliminary injunction blocking funding cuts, noting the administration offered no opposition to the extension.",
      "The ruling preserves billions of dollars in federal funds for sanctuary jurisdictions and signals judicial resistance to the administration's efforts to punish cities limiting immigration enforcement cooperation."
    ],
    "right": [
      "A federal judge ruled that the Trump administration cannot deny funding to 34 cities and counties with sanctuary policies limiting federal immigration cooperation, according to U.S. District Judge William Orrick.",
      "Judge William Orrick extended a preliminary injunction blocking the administration from withholding federal funds for its 'sanctuary' policies.",
      "The administration's executive orders targeting sanctuary jurisdictions were deemed unconstitutional, with Orrick labeling them a 'coercive threat' that threatens billions in funding.",
      "The ruling is seen as a legal setback for the Trump administration's objectives to enforce tighter immigration policies."
    ]
  },
  "sources": [
    {
      "news_title": "Judge blocks Trump from cutting funding to dozens of “sanctuary” cities, including Los Angeles and Chicago – CBS News",
      "news_link": "https://wirepoints.org/judge-blocks-trump-from-cutting-funding-to-dozens-of-sanctuary-cities-including-los-angeles-and-chicago-cbs-news/",
      "bias": "Right",
      "text": "Poof. Another $26 Billion of Debt Has Magically Disappeared From Illinois Financial Statements – Wirepoints\nThe disappearance is in the state’s newly released financial report. Any questions? Never mind, because you won’t find explanations there, here or anywhere else, but read on.\nSanctuary states and cities should be illegal. They support illegals and criminals. These states and cities should support US law abiding citizens before illegals and criminals.\nAs Chuck Schumer recently disclosed, there are 235 judges the Dems installed with the express intention to overturn every action Trump takes. Think about that."
    },
    {
      "news_title": "Judge blocks Trump from cutting funding over ‘sanctuary’ policies – Knowhere News",
      "news_link": "https://knowherenews.com/judge-blocks-trump-from-cutting-funding-over-sanctuary-policies/",
      "bias": "Center",
      "text": "Due to laws that restrict collaboration with federal immigration efforts, a judge said late Friday that the Trump administration could not refuse funds to Boston, Chicago, Denver, Los Angeles, and thirty other cities and counties.\nA preliminary injunction prohibiting the administration from halting or restricting the use of federal funds for so-called “sanctuary” jurisdictions was extended by U.S. District Judge William Orrick in San Francisco. San Francisco, Portland, Seattle, and over a dozen additional cities and counties were shielded by his previous order.\nThe White House did not immediately respond to an email sent late Friday. Orrick stated in his decision that the administration had only argued that the initial injunction was incorrect and had not objected to a prolonged injunction. The initial order is being appealed.\nOrrick also prevented two specific grant programs from being subject to immigration-related restrictions by the government.\nIn an effort to fulfill President Donald Trump’s campaign pledge to forcibly remove millions of people from the nation, the Trump administration has increased pressure on sanctuary areas.\nAttorney General Pam Bondi and Homeland Security Secretary Kristi Noem are instructed by one of Trump’s executive orders to prevent federal funds from going to sanctuary jurisdictions. Every federal department is also required by another order to make sure that funds given to state and local governments do not “abet so-called’sanctuary’ policies that seek to shield illegal aliens from deportation.”\nThe counties and cities who filed the lawsuit claimed that billions of dollars were at stake.\nPresident Barack Obama nominated Orrick, who claimed that the executive orders and the “executive actions that have parroted them” constituted an unlawful “coercive threat.”\nIn May, the Department of Homeland Security released a list of over 500 “sanctuary jurisdictions,” stating that each would be formally informed that they were considered noncompliant by the government. Additionally, it stated that if it thought they were in breach of any federal criminal statutes, it would notify them.\nAfter opponents pointed out that the list featured communities that have actively backed the administration’s strict immigration policies, the government later took it down from its website.\nDue to their sanctuary policy, the Justice Department has also filed lawsuits against Los Angeles, New York, and other communities.\nAlthough the terms “sanctuary cities” are not strictly defined, they often refer to locations that restrict collaboration with Immigration and Customs Enforcement. While ICE enforces immigration laws across the country, it also looks to state and local agencies for assistance in identifying and holding federal personnel who are wanted for deportation.\nCopyright 2025 NPR"
    },
    {
      "news_title": "Court restores federal funding to Providence Farm Collective after DEI cancellation",
      "news_link": "https://buffalonews.com/news/local/government-politics/article_13660468-cfba-4fad-9ecd-efd6f8783b24.html",
      "bias": "Center",
      "text": null
    },
    {
      "news_title": "Judge: Trump can’t deny funds to ‘sanctuary’ jurisdictions",
      "news_link": "https://www.columbian.com/news/2025/aug/24/judge-trump-cant-deny-funds-to-sanctuary-jurisdictions/",
      "bias": "Center",
      "text": "The Trump administration cannot deny funding to Los Angeles and 30 other cities and counties because of “sanctuary” policies that limit their cooperation with federal immigration agencies, a judge ruled late Friday.\nThe judge issued a preliminary injunction that expands restrictions the court handed down in April that blocked funding cuts to 16 cities and counties, including San Francisco, after federal officials classified them as “sanctuary jurisdictions.”\nU.S. District Judge William Orrick of the federal court in San Francisco ruled then that Trump’s executive order cutting funding was probably unconstitutional and violated the separation-of-powers doctrine.\nFriday’s order added more than a dozen more jurisdictions to the preliminary injunction, including Los Angeles, Alameda County, Berkeley, Baltimore, Boston and Chicago.\nIn a statement, a spokesperson for the White House said the Trump administration expected to ultimately win in its effort on appeal.\nThe preliminary injunction is the latest chapter in an ongoing effort by the Trump administration to force “sanctuary cities” to assist in and commit local resources to federal immigration enforcement efforts.\nEarlier this month, the U.S. Department of Justice published a list of what it determined to be sanctuary jurisdictions, or local entities that have “policies, laws, or regulations that impede enforcement of federal immigration laws.”\n“Sanctuary policies impede law enforcement and put American citizens at risk by design,” Attorney General Pamela Bondi said in a statement accompanying the published list.\nSeveral cities and counties across the country have adopted sanctuary city policies, but specifics as to what extent they’re willing — or unwilling — to do for federal immigration officials have varied.\nThe policies typically do not impede federal officials from conducting immigration enforcement activities, but largely keep local jurisdictions from committing resources to the efforts."
    },
    {
      "news_title": "Trump can't cut 'sanctuary' cities funds",
      "news_link": "https://www.nwitimes.com/article_9abf09e3-6ea3-5244-aeeb-c3de4f621930.html",
      "bias": "Center",
      "text": null
    },
    {
      "news_title": "Obama-Appointed Activist Judge Steps In To Try And Block Trump From Cutting Sanctuary City Funding - The American Tribune.com",
      "news_link": "https://theamericantribune.com/obama-appointed-activist-judge-steps-in-to-try-and-block-trump-from-cutting-sanctuary-city-funding/",
      "bias": "Right",
      "text": "In yet another infuriating case of what many on the MAGA side of politics see as out of control judicial tyranny that is blocking the executive branch and federal government generally from enforcing American immigration law, U.S. District Judge William Orrick in San Francisco, who was appointed by former President Obama, blocked Trump from cutting funding to sanctuary cities.\nAs background, the Trump DOJ has designated 30 jurisdictions as “sanctuary” ones because they refused to cooperate with federal immigration enforcement efforts, primarily by restricting their local police forces from working with the feds. Trump, to counteract that, issued executive orders demanding that their funding be cut until they start working with the federal government/\nAttacking those orders in a ruling, Judge Orrick declared from his bench in San Francisco, that the administration was barred from imposing conditions on grant programs that provide funding “for a variety of critical needs.” He claimed that cutting off funding to unrelated programs unless cities go along with immigration enforcement is a “coercive threat” that is “unconstitutional.”\nIn the ruling, the activist judge declared, describing why he enjoined the funding cuts, “I determined that the Cities and Counties are likely to succeed on the merits of their claims that defendants’ actions with respect to the enjoined executive orders and related agency directives were unconstitutional violations of the separation of powers and spending clause doctrines and violated the Fifth Amendment, Tenth Amendment and Administrative Procedure Act.”\nHe later declared, explaining why the federal funding cuts are being blocked, “The challenged sections of Executive Orders 14,159 and 14,218, and the executive actions that have parroted them threaten to withhold all federal funding from the plaintiffs as sanctuary jurisdictions if they do not adapt their policies and practices to conform with the Trump administration’s preferences.”\nContinuing, and adding his bit about them being coercive and thus unconstitutional, he said, “That coercive threat (and any actions agencies take to realize that threat, or additional Executive Orders the President issues to the same end) is unconstitutional, so I enjoined its effect. I do so again today for the protection of the new parties in this case.”\nThe far-left judge further declared that, “Defendants and their officers, agents, servants, employees, and attorneys, and any other persons who are in active concert or participation with them, are enjoined from directly or indirectly taking any action to withhold, freeze, or condition federal funds based on . . . any other Executive Order or Government action that poses the same coercive threat to eliminate or suspend federal funding based on the Government’s assertion that a jurisdiction is a ‘sanctuary jurisdiction.’”\n\"*\" indicates required fields\nHe added that this is true regardless of whether “the basis that the jurisdiction has policies that limit (i) the honoring of civil immigration detainer requests; (ii) cooperation with administrative warrants for purposes of immigration enforcement; (iii) the sharing of information with federal immigration authorities other than immigration or citizenship status; (iv) the use of local law enforcement to arrest or detain individuals solely for civil immigration violations; or (v) the use of local resources to assist with civil immigration enforcement activities.”\nWatch Pam Bondi vow to keep up the campaign against sanctuary cities here:"
    },
    {
      "news_title": "Why the Sheriff's Hands Are Tied",
      "news_link": "https://www.independent.com/2025/08/23/why-the-sheriffs-hands-are-tied/",
      "bias": "Lean Left",
      "text": "SB 54 erodes transparency and prevents Sheriff Bill Brown from helping immigration enforcement officers. Many complain Sheriff Brown is being “silent.” He can’t do much due to the restriction imposed by SB54. Here are three reasons why:\n(1) ICE does big sweeps because the agency can’t communicate with local authorities due to SB 54. The Sheriff’s hands are tied to being a liaison on the local level. The Truth Act, enacted before SB 54, makes the Sheriff report interactions about people in custody with Federal Immigration Authorities. But, SB54 prevents the Sheriff from reporting to the federal government about illegal immigrants unless the federal government has a warrant for the individual.\n(2) When there is an investigation, like Glass House, if not for SB54, the Sheriff could be on scene for public safety support as a liaison to help legitimize searches and provide transparency.\n(3) ICE comes in full force because agents can’t call local authorities if there is an incident. If local authorities could assist, ICE would come in smaller numbers.\nPoliticians like Newsom, Carbajal, Hart, Limon etc., don’t want the public to understand the support of SB 54, as opposed to Truth Act. It undermines “de-escalation” of ICE. They use Sheriff Brown as a “scapegoat.” Politicians are responsible for chaos dealing with immigration.\nWhat is the purpose of the chaos? If things remain in chaos, then they distract people from what is truly going on. And what is going on? Santa Barbara County and city councils have given away $610,000K taxpayer dollars (Goleta City Council gave $100,000, Santa Barbara City Council gave $500,000, and Carpinteria City Council gave $10,000) to nonprofits such as 805undocufund and Immigrant Legal Defense Center. The problem with organizations like these is they are using Santa Barbara County citizens’ hard-earned taxpayer dollars to pay for people who did not go through proper channels to enter the USA.\nSecond, these NGOs receiving these monies do the bare minimum to help immigrants because most of the money pays high administrative salaries and gets recycled into political campaign funds indirectly. For instance, a contractor paid by a nonprofit for work might then contribute to a candidate. That is why politicians in Santa Barbara County push so hard to protect them.\nCitizens of Santa Barbara are being manipulated because of their empathy and big generous hearts. This needs to stop because, like a dysfunctional, unhealthy relationship, we are enabling our elected leaders and local nonprofits to abuse taxpaying citizens, as well as using the nonprofit system to fund criminal behavior.\nIf these people are able to strongarm our elected Sheriff Bill Brown into supporting this atrocity, we will be in worse trouble than we can imagine. We need to take a stand and rise up against this deception, and we can start now by using our voices and our pens to push back.\nNumber one, vote differently this next election cycle."
    },
    {
      "news_title": "Trump can't deny funds to LA and 30 other 'sanctuary' jurisdictions, judge rules",
      "news_link": "https://www.dailygazette.com/tribune/trump-cant-deny-funds-to-la-and-30-other-sanctuary-jurisdictions-judge-rules/article_934e37a3-aa3d-52be-8f96-e7575404d9d7.html",
      "bias": "Center",
      "text": null
    },
    {
      "news_title": "Trump can't deny funds to L.A. and 30 other 'sanctuary' jurisdictions, judge rules",
      "news_link": "https://www.latimes.com/california/story/2025-08-23/sanctuary-city-funding-judge-ruling",
      "bias": "Lean Left",
      "text": "Trump can’t deny funds to L.A. and 30 other ‘sanctuary’ jurisdictions, judge rules\n- Share via\n- A federal judge in California ruled that the Trump administration is not allowed to cut funding to Los Angeles and other places with “sanctuary” policies that limit cooperation on immigration enforcement.\nThe Trump administration cannot deny funding to Los Angeles and 30 other cities and counties because of “sanctuary” policies that limit their cooperation with federal immigration agencies, a judge ruled late Friday.\nThe judge issued a preliminary injunction that expands restrictions the court handed down in April that blocked funding cuts to 16 cities and counties, including San Francisco and Santa Clara, after federal officials classified them as “sanctuary jurisdictions.”\nU.S. District Judge William Orrick of the federal court in San Francisco ruled then that Trump’s executive order cutting funding was probably unconstitutional and violated the separation of powers doctrine.\nFriday’s order added more than a dozen more jurisdictions to the preliminary injunction, including Los Angeles, Alameda County, Berkeley, Baltimore, Boston and Chicago.\nAngel Rodrigo Minguela Palacios was delivering strawberries to a tearoom in Little Tokyo when Border Patrol agents massed nearby where Gov. Gavin Newsom was holding a news conference. Minguela ended up caught in the middle.\nMayor Karen Bass applauded the court’s decision.\n“Another win for our city as the courts continue to make clear that the federal government’s attempts to inflict their cruel policies on Angelenos are unlawful,” Bass said in a statement to the Times. “We will always defend the rights of Angelenos in the face of these continued assaults on our city.”\nIn a statement, a spokesperson for the White House said the Trump administration expected to ultimately win in its effort on appeal.\n“The government — at all levels — has the duty to protect American citizens from harm,” Abigail Jackson, a spokesperson for the White House, said in a statement. “Sanctuary cities interfere with federal immigration enforcement at the expense and safety and security of American citizens. We look forward to ultimate vindication on the issue.”\nThe preliminary injunction is the latest chapter in an ongoing effort by the Trump administration to force “sanctuary cities” to assist and commit local resources to federal immigration enforcement efforts.\nEarlier this month, the U.S. Department of Justice published a list of what it determined to be sanctuary jurisdictions, or local entities that have “policies, laws, or regulations that impede enforcement of federal immigration laws.”\n“Sanctuary policies impede law enforcement and put American citizens at risk by design,” Atty. Gen. Pamela Bondi said in a statement accompanying the published list.\nSeveral cities and counties across the country have adopted sanctuary city policies, but specifics as to what extent they’re willing — or unwilling — to do for federal immigration officials have varied.\nThe policies typically do not impede federal officials from conducting immigration enforcement activities, but largely keep local jurisdictions from committing resources to the efforts.\nThe policies also don’t prevent local agencies from enforcing judicial warrants, which are signed by a judge. Cooperation on “detainers” or holds on jailed suspects issued by federal agencies, along with enforcement of civil immigration matters, is typically limited by sanctuary policies.\nFederal officials in the suit have so far referred to “sanctuary” jurisdictions as local governments that don’t honor immigration detainer requests, don’t assist with administrative warrants, don’t share immigration status information, or don’t allow local police to assist in immigration enforcement operations.\nOrrick noted that the executive orders threatened to withhold all federal funding if the cities and counties in question did not adhere to the Trump administration’s requests.\nIn the order, the judge referred to the executive order as a “coercive threat” and said it was unconstitutional.\nOrrick, who sits on the bench in the Northern District of California, was appointed by former President Obama.\nThe Trump administration has been ratcheting up efforts to force local jurisdictions to assist in immigration enforcement. The administration has filed lawsuits against cities and counties, vastly increased street operations and immigration detentions, and deployed National Guard troops to Los Angeles as it increased immigration operations.\nThe U.S. Department of Justice in June sued Los Angeles, and local officials, alleging its sanctuary city law is “illegal.”\nThe suit alleged that the city was looking to “thwart the will of the American people regarding deportations” by enacting sanctuary city policies.\nMore to Read\nSign up for Essential California\nThe most important California stories and recommendations in your inbox every morning.\nYou may occasionally receive promotional content from the Los Angeles Times."
    },
    {
      "news_title": "Federal Judge Expands Ban On Trump Withholding Funds to Sanctuary Cities",
      "news_link": "https://www.breitbart.com/immigration/2025/08/23/federal-judge-expands-ban-on-trump-withholding-funds-to-sanctuary-cities/",
      "bias": "Right",
      "text": "A San Francisco federal judge this week expanded an order forbidding the Trump administration from withholding federal funds from sanctuary cities for refusing to cooperate with immigration authorities.\nU.S. District Judge William Orrick, a President Barak Obama appointee, on Friday extended his injunction from earlier this year that argued the administration was trying to coerce local officials to cooperate with agencies such as Immigration and Custom Enforcement (ICE) on illegal alien arrests — calling it a violation of the Constitution.\nOrrick added to his order other municipalities that have since joined the lawsuit against Trump’s funding policy, including Los Angeles, Chicago, Boston, Baltimore, Denver and Albuquerque, CBS reported.\nThe ruling is the result of a lawsuit filed back in February, led by San Francisco, and at the request of 16 cities and counties across the country.\nThe jurisdictions in the initial lawsuit include the cities of Minneapolis and St. Paul, Minnesota; New Haven, Connecticut; Portland, Oregon; Santa Fe, New Mexico; and Seattle, Washington.\nAll of these cities have laws and policies that restrict local law enforcement from assisting federal government with immigration arrests.\nThe February lawsuit challenged an executive order by President Trump called “Protecting the American People Against Invasion” that directs the Department of Homeland Security to withhold funds from sanctuary jurisdictions.\nThe cities and counties that sued argued that billions of dollars were at risk.\nPresident Trump issued a similar order in his first term in 2017, and this same San Francisco judge ruled against the president in that case. As Breitbart News reported, Orrick issued a preliminary injunction on the current case back in April.\n“He we are again,” Orrick wrote in that ruling.\nThe judge ruled that the administration’s withholding of funds violates the 10th Amendment, which establishes the division of power between national and local governments. Trump administration lawyers have appealed that decision.\nIn the most recent action Orrick also blocked the administration from placing immigration-related conditions on two grant programs, Fox News reported.\nSupporters of sanctuary jurisdictions argue that cooperation with federal immigration enforcement discourages illegal aliens from coming forward as victims to or witnesses of crimes.\n“The threat to withhold funding causes them irreparable injury in the form of budgetary uncertainty, deprivation of constitutional rights, and undermining trust between the Cities and Counties and the communities they serve,” Orrick said when he first levied the ban back in April.\nNeither the White House nor Department of Homeland Security has yet to comment on the extended ruling.\nContributor Lowell Cauffiel is the best-selling author of Below the Line and nine other crime novels and nonfiction titles. See lowellcauffiel.com for more.\nCOMMENTS\nPlease let us know if you're having issues with commenting."
    },
    {
      "news_title": "Judge blocks Trump from cutting funding from Las Vegas, other jurisdictions over ‘sanctuary’ policies",
      "news_link": "https://www.reviewjournal.com/news/politics-and-government/judge-blocks-trump-from-cutting-funding-from-34-cities-and-counties-over-sanctuary-policies-3428864/",
      "bias": "Center",
      "text": "Judge blocks Trump from cutting funding from Las Vegas, other jurisdictions over ‘sanctuary’ policies\nAugust 23, 2025 - 11:44 am\nUpdated August 23, 2025 - 12:21 pm\nA judge ruled late Friday the Trump administration cannot deny funding to Las Vegas, Chicago, Denver, Los Angeles and 30 other cities and counties because of policies that limit cooperation with federal immigration efforts.\nU.S. District Judge William Orrick in San Francisco extended a preliminary injunction blocking the administration from cutting off or conditioning the use of federal funds for so-called “sanctuary” jurisdictions. His earlier order protected more than a dozen other cities and counties, including San Francisco, Portland and Seattle.\nAn email to the White House late Friday was not immediately returned. In his ruling, Orrick said the administration had offered no opposition to an extended injunction except to say the first injunction was wrong. It has appealed the first order.\nOrrick also blocked the administration from imposing immigration-related conditions on two particular grant programs.\nThe Trump administration has ratcheted up pressure on sanctuary communities as it seeks to make good on President Donald Trump’s campaign promise to remove millions of people in the country illegally.\nOne executive order issued by Trump directs Attorney General Pam Bondi and Homeland Security Secretary Kristi Noem to withhold federal money from sanctuary jurisdictions. Another order directs every federal agency to ensure that payments to state and local governments do not “abet so-called ‘sanctuary’ policies that seek to shield illegal aliens from deportation.”\nThe cities and counties that sued said billions of dollars were at risk.\nOrrick, who was nominated by President Barack Obama, said the executive orders and the “executive actions that have parroted them” were an unconstitutional “coercive threat.”\nIn May, the Department of Homeland Security published a list of more than 500 “sanctuary jurisdictions,” saying each one would receive formal notification that the government had deemed them noncompliant. It also said it would inform them if they were believed to be in violation of any federal criminal statutes.\nLas Vegas was one of the cities on the list, though the city’s mayor and Nevada’s governor flatly rejected the classification.\nThe list was later removed from the department’s website after critics noted it included localities that have actively supported the administration’s tough immigration policies.\nThe Justice Department has also sued New York, Los Angeles and other cities over their sanctuary policies.\nThere is no strict definition for sanctuary cities, but the terms generally describe places that limit cooperation with Immigration and Customs Enforcement. ICE enforces immigration laws nationwide but seeks help from state and local authorities to identify immigrants wanted for deportation and hold them for federal officers."
    },
    {
      "news_title": "Obama Judge Blocks Trump from Cutting Funds to Sanctuaries",
      "news_link": "https://www.independentsentinel.com/obama-judge-blocks-trump-from-cutting-funds-to-sanctuaries/",
      "bias": "Right",
      "text": "An Obama judge blocked the Trump administration from withholding funds from dozens of sanctuary havens. The judge ruled on Friday that the Trump administration could not deny federal funds to dozens of cities and counties over their probably unconstitutional sanctuary policies.\nUS District judge William Orrick, a California Barack appointee, extended a TRO, a temporary preliminary injunction, to block the Trump administration from withholding or conditioning federal funds from jurisdiction that refused to cooperate with federal authorities.\nHe blocked Donald Trump’s administration from withholding federal funding from more than 30 sanctuary jurisdictions including Los Angeles, Baltimore, Boston and Chicago that have declined to cooperate with the Republican president’s hardline immigration crackdown.\nU.S. District Judge William Orrick expanded an injunction that he initially issued in April covering 16 cities and counties including San Francisco, where he is based, to cover a new batch of local governments that recently joined the case and sought to be protected under his court order.\nThis Obama appointee always rules against the Trump administration’s efforts to earn sanctuary policies. He claims stopping sanctuary cities is unconstitutional.\nThe Trump administration is already appealing Orrick’s earlier ruling. Among the cities covered by Orrick’s new order is Los Angeles.\nAs he did in 2017, the president signed an executive order directing the Department of Justice and the Department of Homeland Security to deny certain federal funds to sanctuary jurisdictions. The DOJ has since maintained a list of cities, counties and states it deems to be sanctuary havens for illegal migrants, including alien criminals or any terrorists who happen in. Democrat leaders have sued elsewhere to block the anti-sanctuary directives.\nIllegal migrants are Democrat district fillers. They use them to increase the number of representatives they have in the House by increasing the numbers in the districts.\nEventually, Democrats will give illegal migrants, even criminals and terrorists, amnesty and they will vote for the people who let them stay. It’s corrupt and unethical, but they are authoritarians who want one party rule.\nThis is a sure win in the long run for Trump. These judges are part of the resist program, they act on politics over the law.\nBuy up the properties in his neighbourhood an load them up with the worst scum they can find …wonder how long it would take him to ‘see the light’….maybe never…his actions can safely predict ‘brain death’…\nJust one more lawfare judge to ignore.\nAll these judiciary jerks are doing is wasting the country’s time and money.; IN this case, sanctuary cities are what’s wrong."
    },
    {
      "news_title": "Federal Court Blocks Trump Admin From Withholding Funds To 'Sanctuary Jurisdictions'",
      "news_link": "https://www.tampafp.com/federal-court-blocks-trump-admin-from-withholding-funds-to-sanctuary-jurisdictions/",
      "bias": "Lean Right",
      "text": "Judge extends a prior injunction, ruling that the administration’s actions are an unconstitutional and coercive overreach.\nA U.S. District Judge has issued a new order that expands an injunction preventing the federal government from withholding funds from a group of cities and counties designated as “sanctuary jurisdictions.”\nThe ruling by Judge William H. Orrick of the Northern District of California extends the scope of a preliminary injunction issued in April 2025 and applies it to dozens of new plaintiffs who joined the lawsuit.\nREAD: Political Showdown Looms As California Pushes Controversial Redistricting Plan\nThe order directly addresses the Department of Housing and Urban Development (HUD), ruling that conditions placed on Continuum of Care (CoC) and Community Development Block Grant (CDBG) programs are impermissible. The court found these conditions to be an implementation of previously enjoined executive orders and agency directives that sought to link federal funding to local immigration enforcement cooperation.\nIn his decision, Judge Orrick reaffirmed the court’s earlier conclusion that the federal government’s actions were likely unconstitutional.\nThe ruling cites violations of the separation of powers and the Tenth Amendment, noting that the administration’s policy sought to “coerce” local governments by threatening to withhold federal funding. The court found that HUD’s attempts to impose immigration-related conditions on grants for homelessness and economic development lacked a sufficient connection, or “nexus,” to immigration enforcement.\nREAD: Salvadoran National Kilmar Abrego Garcia’s Case Takes Wild Turn After Release From Jail\nThe order specifically references a letter from HUD Secretary Scott Turner and another from General Deputy Assistant Secretary Claudette Fernandez, which the court stated confirmed the agency’s intent to incorporate the language of Executive Order 14,218 into its grant agreements. The judge also cited evidence from one plaintiff, the City of Petaluma, which received an email from HUD questioning its grant application based on its alleged failure to comply with the executive order.\nAs a result of the ruling, the defendants, including federal officials, are enjoined from withholding or conditioning federal funds based on the challenged executive orders and related directives. The injunction is now identical for all plaintiffs in the case, protecting their access to federal funds for a variety of critical needs without altering their local policies.\nPlease make a small donation to the Tampa Free Press to help sustain independent journalism. Your contribution enables us to continue delivering high-quality, local, and national news coverage.\nConnect with us: Follow the Tampa Free Press on Facebook and Twitter for breaking news and updates.\nSign up: Subscribe to our free newsletter for a curated selection of top stories delivered straight to your inbox."
    },
    {
      "news_title": "Judge blocks Trump admin from slashing ‘sanctuary city’ funding",
      "news_link": "https://pix11.com/news/judge-blocks-trump-admin-from-slashing-sanctuary-city-funding/",
      "bias": "Center",
      "text": null
    },
    {
      "news_title": "Who is William Orrick, the federal judge blocking Trump on sanctuary city funding?",
      "news_link": "https://www.livemint.com/news/judge-william-orrick-halts-donald-trump-s-bid-to-strip-sanctuary-cities-of-federal-money-11755961956257.html",
      "bias": "Center",
      "text": "US District Judge William H. Orrick III made headlines again this week after blocking the Donald Trump administration from cutting off federal funds to sanctuary cities. The order, issued from his San Francisco courtroom, expanded a prior injunction to now protect more than 30 jurisdictions, including Los Angeles, Boston, Baltimore and Chicago, Reuters reported.\nOrrick said the administration’s threat to pull money from local governments that refuse to cooperate with immigration enforcement amounted to unconstitutional coercion. “That coercive threat (and any actions agencies take to realize that threat, or additional Executive Orders the President issues to the same end) is unconstitutional, so I enjoined its effect,” he wrote in Friday’s ruling, cited by Reuters.\nThe case is part of a broader clash between Trump and cities that limit local cooperation with US Immigration and Customs Enforcement. But the decision has also drawn attention to the judge himself.\nOrrick, 71, serves on the US District Court for the Northern District of California. He was appointed in 2013 by President Barack Obama and has handled a wide range of civil and immigration cases out of San Francisco, according to the Federal Judicial Center.\nBorn and raised in San Francisco, Orrick earned his undergraduate degree at Yale before attending Boston College Law School. He practiced law privately for years, then worked inside the Justice Department during the Obama administration, serving in the Civil Division, cand.uscourts.gov notes. He was confirmed to the federal bench by the Senate in May 2013.\nHis father, William Orrick Jr., was also a federal judge, appointed by John F. Kennedy in the 1960s. That family legacy, plus decades in both private and public law, has made Orrick a fixture in California’s legal world.\nThe sanctuary cities decision is only the latest flashpoint. Orrick has presided over multiple high-profile immigration and civil rights cases during his tenure. In 2017, he also blocked Trump’s first attempt to strip funding from sanctuary jurisdictions, setting up the appeals battle now playing out.\nThe White House has not commented on his most recent order, according to Reuters. But with the administration pushing a harder line on immigration enforcement, legal experts expect Orrick’s court to remain a key battleground.\nFor cities like Los Angeles and Chicago, his rulings have meant that billions in federal dollars cannot be used as leverage to force policy changes. And for Orrick himself, the latest decision cements his role as one of the most consequential judges standing between Trump and his immigration agenda.\nHe is a US District Judge in San Francisco, appointed by President Obama in 2013.\nOrrick studied at Yale and Boston College Law, worked in private practice, and served in the Justice Department’s Civil Division.\nHe blocked Trump’s administration from withholding federal funding from sanctuary cities.\nOver 30 jurisdictions, including Los Angeles, Chicago, Boston and Baltimore.\nYes. He also blocked Trump’s 2017 order to strip funding from sanctuary cities.\nStay updated with the latest Trending, India , World and US news. Read the latest updates on the Supreme Court verdict regarding Delhi-NCR stray dog relocation and ongoing protests now on Livemint."
    },
    {
      "news_title": "'Unconstitutional': Obama judge blocks Trump from withholding funds from sanctuary cities * WorldNetDaily * by Jason Hopkins, Daily Caller News Foundation",
      "news_link": "https://www.wnd.com/2025/08/unconstitutional-obama-judge-blocks-trump-withholding-funds-sanctuary/",
      "bias": "Far Right",
      "text": "An Obama-appointed judge ruled late Friday that the Trump administration could not deny federal funds to dozens of cities and counties over their sanctuary policies.\nU.S. District Judge William Orrick, appointed to the bench in northern California by President Barack Obama, extended a preliminary injunction that blocks the Trump administration from withholding or conditioning federal funds from jurisdictions that refuse to cooperate with federal immigration authorities, according to court documents. The lawsuit, originally filed by San Francisco officials earlier this year, has since taken on many other sanctuary jurisdictions as plaintiffs.\n“The new plaintiffs have each alleged similar reliance on federal funding as the Cities and Counties and filed declarations showing similar harms to community health, welfare and social services and to their budgetary processes that depend on the regularly authorized grants of federal funding for a variety of critical needs,” Orrick stated, according to court documents.\n“The challenged sections of Executive Orders 14,159 and 14,218, and the executive actions that have parroted them threaten to withhold all federal funding from the plaintiffs as sanctuary jurisdictions if they do not adapt their policies and practices to conform with the Trump administration’s preferences,” the judge continued. “That coercive threat (and any actions agencies take to realize that threat, or additional Executive Orders the President issues to the same end) is unconstitutional, so I enjoined its effect. I do so again today for the protection of the new parties in this case.”\nThe Obama-appointed judge has consistently ruled against the Trump’s administration’s quest to end sanctuary policies across the country.\nIn April, Orrick deemed President Donald Trump’s executive orders cracking down on sanctuary cities to be likely unconstitutional, blocking his administration from enforcing them against a slate of liberal enclaves that were suing. “Here we are again,” the judge wrote in the April order, referring to a previous executive order Trump signed in his first presidential term seeking to defund sanctuary cities — an order that Orrick also shot down at the time.\nIn 2017, Trump signed Executive Order 13,768, titled “Enhancing Public Safety in the Interior of the United States,” a directive that sought to block federal funds from sanctuary jurisdictions. Following a court challenge by San Francisco, Orrick ruled the order to be unconstitutional and that the defendants “faced irreparable harm absent an injunction,” according to court documents.\nThere is no official definition for a “sanctuary city” law or policy, but the label generally describes any policy for law that restricts local officials from assisting or otherwise cooperating with Immigration and Customs Enforcement (ICE) or other federal immigration agents. Typical sanctuary policies prohibit local law enforcement from honoring ICE detainer requests, sharing information with the agency or notifying immigration agents of an impending release of a wanted illegal migrant.\nMuch like his first term, Trump has ratcheted up pressure against sanctuary cities, which have served as a major hindrance against his immigration enforcement agenda.\nImmediately upon his return to office, the president signed an executive order directing the Department of Justice (DOJ) and the Department of Homeland Security to deny certain federal funds to sanctuary jurisdictions. The DOJ has since maintained a list of cities, counties and states it deems to be sanctuary havens for illegal migrants.\nDemocrat leaders have sued elsewhere to block the anti-sanctuary directives.\nA lawsuit, filed Monday in Rhode Island federal court, alleges that the Office for Victims of Crime — an office within the DOJ — created a policy that withholds Victims of Crime Act (VOCA) funding from states that are not assisting with Trump’s mission to crack down on illegal immigration. A coalition of Democrat attorneys general claims these “unprecedented conditions” tying VOCA funds to immigration enforcement to be unlawful.\nContent created by The Daily Caller News Foundation is available without charge to any eligible news publisher that can provide a large audience. For licensing opportunities of our original content, please contact [email protected]."
    },
    {
      "news_title": "Judge blocks Trump admin from withholding funding to 34 cities and counties over 'sanctuary' policies",
      "news_link": "https://www.ksro.com/2025/08/23/judge-blocks-trump-admin-from-withholding-funding-to-34-cities-and-counties-over-sanctuary-policies/",
      "bias": "Center",
      "text": null
    },
    {
      "news_title": "Trump can’t cut funds from U.S. cities over ‘sanctuary’ policies: judge",
      "news_link": "https://www.pennlive.com/politics/2025/08/trump-cant-cut-funds-from-us-cities-over-sanctuary-policies-judge.html",
      "bias": "Center",
      "text": "By SUDHIN THANAWALA, The Associated Press\nA judge ruled late Friday that the Trump administration cannot deny funding to Boston, Chicago, Denver, Los Angeles and 30 other cities and counties because of policies that limit cooperation with federal immigration efforts.\nU.S. District Judge William Orrick in San Francisco extended a preliminary injunction blocking the administration from cutting off or conditioning the use of federal funds for so-called “sanctuary” jurisdictions. His earlier order protected more than a dozen other cities and counties, including San Francisco, Portland and Seattle.\nAn email to the White House late Friday was not immediately returned. In his ruling, Orrick said the administration had offered no opposition to an extended injunction except to say the first injunction was wrong. It has appealed the first order.\nOrrick also blocked the administration from imposing immigration-related conditions on two particular grant programs.\nThe Trump administration has ratcheted up pressure on sanctuary communities as it seeks to make good on President Donald Trump’s campaign promise to remove millions of people in the country illegally.\nOne executive order issued by Trump directs Attorney General Pam Bondi and Homeland Security Secretary Kristi Noem to withhold federal money from sanctuary jurisdictions. Another order directs every federal agency to ensure that payments to state and local governments do not “abet so-called ‘sanctuary’ policies that seek to shield illegal aliens from deportation.”\nThe cities and counties that sued said billions of dollars were at risk.\nOrrick, who was nominated by President Barack Obama, said the executive orders and the “executive actions that have parroted them” were an unconstitutional “coercive threat.”\nIn May, the Department of Homeland Security published a list of more than 500 “sanctuary jurisdictions,” saying each one would receive formal notification that the government had deemed them noncompliant. It also said it would inform them if they were believed to be in violation of any federal criminal statutes.\nDauphin County was on that list, but officials were unable to explain why.\nThe list was later removed from the department’s website after critics noted it included localities that have actively supported the administration’s tough immigration policies.\nThe Justice Department has also sued New York, Los Angeles and other cities over their sanctuary policies.\nThere is no strict definition for sanctuary cities, but the terms generally describe places that limit cooperation with Immigration and Customs Enforcement. ICE enforces immigration laws nationwide but seeks help from state and local authorities to identify immigrants wanted for deportation and hold them for federal officers.\nMore on politics\n- Municipal Elections 101: Tax collectors, auditors, and other key local finance positions on Pa. ballot\n- Appointed Harrisburg leaders stay on the job beyond the statutory limit\n- Pentagon says some Guard units in D.C. are now carrying firearms as Trump targets more cities\n- Lawmakers blast SEPTA over predicted chaos for Eagles opener"
    },
    {
      "news_title": "Judge blocks Trump from cutting funding over ‘sanctuary’ policies",
      "news_link": "https://www.opb.org/article/2025/08/23/judge-blocks-trump-from-cutting-funding-over-sanctuary-policies/",
      "bias": "Center",
      "text": "A judge ruled late Friday the Trump administration cannot deny funding to Boston, Chicago, Denver, Los Angeles and 30 other cities and counties because of policies that limit cooperation with federal immigration efforts.\nU.S. District Judge William Orrick in San Francisco extended a preliminary injunction blocking the administration from cutting off or conditioning the use of federal funds for so-called “sanctuary” jurisdictions. His earlier order protected more than a dozen other cities and counties, including San Francisco, Portland and Seattle.\nAn email to the White House late Friday was not immediately returned. In his ruling, Orrick said the administration had offered no opposition to an extended injunction except to say the first injunction was wrong. It has appealed the first order.\nOrrick also blocked the administration from imposing immigration-related conditions on two particular grant programs.\nThe Trump administration has ratcheted up pressure on sanctuary communities as it seeks to make good on President Donald Trump’s campaign promise to remove millions of people in the country illegally.\nOne executive order issued by Trump directs Attorney General Pam Bondi and Homeland Security Secretary Kristi Noem to withhold federal money from sanctuary jurisdictions. Another order directs every federal agency to ensure that payments to state and local governments do not “abet so-called ‘sanctuary’ policies that seek to shield illegal aliens from deportation.”\nThe cities and counties that sued said billions of dollars were at risk.\nOrrick, who was nominated by President Barack Obama, said the executive orders and the “executive actions that have parroted them” were an unconstitutional “coercive threat.”\nIn May, the Department of Homeland Security published a list of more than 500 “sanctuary jurisdictions,” saying each one would receive formal notification that the government had deemed them noncompliant. It also said it would inform them if they were believed to be in violation of any federal criminal statutes.\nThe list was later removed from the department’s website after critics noted it included localities that have actively supported the administration’s tough immigration policies.\nThe Justice Department has also sued New York, Los Angeles and other cities over their sanctuary policies.\nThere is no strict definition for sanctuary cities, but the terms generally describe places that limit cooperation with Immigration and Customs Enforcement. ICE enforces immigration laws nationwide but seeks help from state and local authorities to identify immigrants wanted for deportation and hold them for federal officers."
    },
    {
      "news_title": "US judge blocks Trump administration’s funding cuts to sanctuary cities",
      "news_link": "https://www.aa.com.tr/en/americas/us-judge-blocks-trump-administration-s-funding-cuts-to-sanctuary-cities/3667212",
      "bias": "Right",
      "text": "US judge blocks Trump administration’s funding cuts to sanctuary cities\nRuling protects dozens of cities, including Los Angeles, Chicago, Boston, from funding cuts tied to immigration policies\nISTANBUL\nA US federal judge on Friday halted the Trump administration's attempt to withhold federal funding from numerous sanctuary cities and counties, including several of the nation's largest cities.\nIn April, District Judge William Orrick ruled that President Donald Trump's move to freeze funding for local governments limiting cooperation with immigration authorities was unconstitutional, a decision that initially applied to over a dozen cities and counties, including San Francisco, Sacramento, Minneapolis and Seattle.\nOn Friday, Orrick expanded his ruling to include dozens of other cities and counties that joined the lawsuit, including Los Angeles, Chicago, Boston, Baltimore, Denver and Albuquerque.\nIn his ruling, Orrick said the administration did not oppose extending the injunction, apart from arguing that the initial order was incorrect, which it has already appealed.\nOrrick also barred the administration from attaching immigration-related conditions to two specific grant programs.\nWithin hours of taking office in January, Trump directed his administration to block federal funds to sanctuary jurisdictions, and weeks later ordered that federal funding should not support illegal immigration.\nAttorney General Pam Bondi also announced that the Justice Department would withhold grants from sanctuary cities, with the administration arguing these cities hinder federal law enforcement and obstruct ICE from apprehending undocumented immigrants, including violent offenders.\nThe Trump administration’s crackdown on sanctuary cities has prompted a wave of lawsuits, with 20 states recently suing over the Justice Department’s move to condition crime victim grants on immigration enforcement.\nAnadolu Agency website contains only a portion of the news stories offered to subscribers in the AA News Broadcasting System (HAS), and in summarized form. Please contact us for subscription options."
    },
    {
      "news_title": "Judge blocks Trump from cutting funding from 34 cities and counties — including Denver — over \"sanctuary’\"policies",
      "news_link": "https://coloradosun.com/2025/08/23/denver-immigration-funding-trump-administration-court-ruling/",
      "bias": "Lean Left",
      "text": "By Sudhin Thanawala, The Associated Press\nA judge ruled late Friday the Trump administration cannot deny funding to Boston, Chicago, Denver, Los Angeles and 30 other cities and counties because of policies that limit cooperation with federal immigration efforts.\nU.S. District Judge William Orrick in San Francisco extended a preliminary injunction blocking the administration from cutting off or conditioning the use of federal funds for so-called “sanctuary” jurisdictions. His earlier order protected more than a dozen other cities and counties, including San Francisco, Portland and Seattle.\nAn email to the White House late Friday was not immediately returned. In his ruling, Orrick said the administration had offered no opposition to an extended injunction except to say the first injunction was wrong. It has appealed the first order.\nOrrick also blocked the administration from imposing immigration-related conditions on two particular grant programs.\nThe Trump administration has ratcheted up pressure on sanctuary communities as it seeks to make good on President Donald Trump’s campaign promise to remove millions of people in the country illegally.\nOne executive order issued by Trump directs Attorney General Pam Bondi and Homeland Security Secretary Kristi Noem to withhold federal money from sanctuary jurisdictions. Another order directs every federal agency to ensure that payments to state and local governments do not “abet so-called ‘sanctuary’ policies that seek to shield illegal aliens from deportation.”\nThe cities and counties that sued said billions of dollars were at risk.\nOrrick, who was nominated by President Barack Obama, said the executive orders and the “executive actions that have parroted them” were an unconstitutional “coercive threat.”\nIn May, the Department of Homeland Security published a list of more than 500 “sanctuary jurisdictions,” saying each one would receive formal notification that the government had deemed them noncompliant. It also said it would inform them if they were believed to be in violation of any federal criminal statutes.\nThe list was later removed from the department’s website after critics noted it included localities that have actively supported the administration’s tough immigration policies.\nThe Justice Department has also sued New York, Los Angeles and other cities over their sanctuary policies.\nThere is no strict definition for sanctuary cities, but the terms generally describe places that limit cooperation with Immigration and Customs Enforcement. ICE enforces immigration laws nationwide but seeks help from state and local authorities to identify immigrants wanted for deportation and hold them for federal officers."
    },
    {
      "news_title": "Judge blocks Trump from cutting funding to Boston over ‘sanctuary’ policies",
      "news_link": "https://www.boston25news.com/news/local/judge-blocks-trump-cutting-funding-boston-other-cities-over-sanctuary-policies/YBMEAIY4EVGNZGZROGD7DH22RM/",
      "bias": "Center",
      "text": "We’re Sorry!\nThis website is unavailable in your location.\nError 451\nIt appears you are attempting to access this website from a country outside of the United States, therefore access cannot be granted at this time.\nThis website is unavailable in your location.\nIt appears you are attempting to access this website from a country outside of the United States, therefore access cannot be granted at this time."
    },
    {
      "news_title": "Judge blocks Trump from cutting funding from 34 cities and counties over ‘sanctuary’ policies - Boston News, Weather, Sports",
      "news_link": "https://whdh.com/news/judge-blocks-trump-from-cutting-funding-from-34-cities-and-counties-over-sanctuary-policies/",
      "bias": "Center",
      "text": "U.S. District Judge William Orrick extended a preliminary injunction blocking the administration from cutting off or conditioning the use of federal funds for Boston, Chicago, Denver, Los Angeles and 30 other cities and counties. His earlier order protected more than a dozen other cities and counties, including San Francisco, Portland and Seattle.\nThe Trump administration has ratcheted up pressure on those communities as it seeks to make good on Trump’s campaign promise to remove millions of people in the country illegally.\nOne executive order issued by Trump directs officials to withhold federal money from sanctuary jurisdictions. Another order directs federal agencies to ensure payments to state and local governments do not assist “policies that seek to shield illegal aliens from deportation.”\nThe cities and counties that sued said billions of dollars were at risk.\n(Copyright (c) 2024 The Associated Press. All Rights Reserved. This material may not be published, broadcast, rewritten, or redistributed.)"
    },
    {
      "news_title": "The judge has a little explaining to do",
      "news_link": "https://www.americanthinker.com/blog/2025/08/the_judge_has_a_little_explaining_to_do.html",
      "bias": "Far Right",
      "text": "The judge has a little explaining to do\nIt finally happened. Sensible New Yorkers have come to terms with the damage that “getting Trump” has done to their image as a place to invest money. After all, why would any investor or business owner want to operate in a state where a “fraud” case can be invented against you? I have a feeling that a lot of people with wealth in New York started making plans to pack up to Florida or elsewhere. You can’t blame them for saying: “They ‘got’ Trump, I’m next.” Last, but not least, who remembers Kevin O’Leary telling a CNN host: “What fraud? This is not about Trump anymore”?\nAs always, we check with Professor Jonathan Turley for some perspective:\nFor some of us who covered that trial, the most vivid image of Engoron came at the start. He indicated that he did not want cameras in the courtroom, but when the networks showed up, Engoron took off his glasses and seemed to pose for the cameras.\nIt was a ‘Sunset Boulevard’ moment. We only need Gloria Swanson looking into the camera to speak to ‘those wonderful people out there in the dark!’ and announcing ‘all right, [Ms. James], I’m ready for my close-up.’\nThe close-up was not a good idea, and, on appeal, it was perfectly disastrous. The court found little legal or factual basis for his fine. The purported witnesses not only did not lose a dime, but they testified that they made money on the loans and wanted new loans with the Trump administration. That did not move Engoron. From the start, he was speaking to those ‘wonderful people out there.’\nYou did not have to go far. In both the civil and criminal trials of Trump in New York, there was a carnival atmosphere in the street outside the courthouse. It was really not derangement as much as delirium. Democrat New York Attorney General Letitia James had injected lawfare directly into the veins of New Yorkers. Pledging in her campaign to bag Trump (without bothering to name any crime or violation), James was elected based on her recreational rather than legal appeal.\nYet, James could not have succeeded if she had not had a judge willing to ignore reality and cook the books on the fines. She needed a partner in lawfare. She needed Engoron.\nEven for some anti-Trump commentators, the judgment was impossible to defend, and some acknowledged that they had never seen any case like this one brought in New York.\nYes, no one had seen justice like that before. Why? Because there was no justice here. It was using the legal system to get Trump, or something that our judicial system was not supposed to do.\nWe can understand, not defend but understand, how highly partisan AG James brought this case. She was out to get Trump and couldn’t restrain her TDS. However, the judge should have stopped her and asked: “Where is the fraud or crime?” Instead, the judge added to the lie by inventing his own definition of fraud.\nSo, Judge Engoron has a little explaining to do, and I hope it’s before the Bar Association. This man should never preside over another trial in New York or elsewhere.\nP.S. Check out my blog for posts, podcasts, and videos.\nImage generated by AI."
    },
    {
      "news_title": "Judge blocks funding cuts to 34 cities and counties over 'sanctuary' policies",
      "news_link": "https://spectrumlocalnews.com/nyc/all-boroughs/politics/2025/08/23/judge-decision-sanctuary-policies",
      "bias": "Center",
      "text": "A judge ruled late Friday the Trump administration cannot deny funding to Boston, Chicago, Denver, Los Angeles and 30 other cities and counties because of policies that limit cooperation with federal immigration efforts.\nU.S. District Judge William Orrick in San Francisco extended a preliminary injunction blocking the administration from cutting off or conditioning the use of federal funds for so-called \"sanctuary\" jurisdictions. His earlier order protected more than a dozen other cities and counties, including San Francisco, Portland and Seattle.\nAn email to the White House late Friday was not immediately returned. In his ruling, Orrick said the administration had offered no opposition to an extended injunction except to say the first injunction was wrong. It has appealed the first order.\nOrrick also blocked the administration from imposing immigration-related conditions on two particular grant programs.\nThe Trump administration has ratcheted up pressure on sanctuary communities as it seeks to make good on President Donald Trump's campaign promise to remove millions of people in the country illegally.\nOne executive order issued by Trump directs Attorney General Pam Bondi and Homeland Security Secretary Kristi Noem to withhold federal money from sanctuary jurisdictions. Another order directs every federal agency to ensure that payments to state and local governments do not \"abet so-called 'sanctuary' policies that seek to shield illegal aliens from deportation.\"\nThe cities and counties that sued said billions of dollars were at risk.\nOrrick, who was nominated by President Barack Obama, said the executive orders and the \"executive actions that have parroted them\" were an unconstitutional \"coercive threat.\"\nIn May, the Department of Homeland Security published a list of more than 500 \"sanctuary jurisdictions,\" saying each one would receive formal notification that the government had deemed them noncompliant. It also said it would inform them if they were believed to be in violation of any federal criminal statutes.\nThe list was later removed from the department's website after critics noted it included localities that have actively supported the administration's tough immigration policies.\nThe Justice Department has also sued New York, Los Angeles and other cities over their sanctuary policies.\nThere is no strict definition for sanctuary cities, but the terms generally describe places that limit cooperation with Immigration and Customs Enforcement. ICE enforces immigration laws nationwide but seeks help from state and local authorities to identify immigrants wanted for deportation and hold them for federal officers."
    },
    {
      "news_title": "Trump admin blocked from slashing funding from dozens of local governments over 'sanctuary' policies",
      "news_link": "https://www.foxnews.com/politics/trump-admin-blocked-slashing-funding-dozens-local-governments-sanctuary-policies",
      "bias": "Right",
      "text": "A federal judge ruled Friday that the Trump administration cannot cut funding to 34 cities and counties in response to \"sanctuary\" policies that limit cooperation with federal immigration enforcement.\nU.S. District Judge William Orrick, who issued a previous order protecting more than a dozen other cities and counties, extended a preliminary injunction blocking the administration from pulling federal money or conditioning the use of the funds for local jurisdictions.\nThe judge also blocked the administration from placing immigration-related conditions on two grant programs.\nOrrick said the administration's only opposition to an extended injunction was claiming that the first injunction was wrong after it appealed the first order.\nFEDERAL JUDGE TOSSES TRUMP DOJ LAWSUIT AGAINST SANCTUARY POLICIES IN CHICAGO\nThe administration has increased pressure on sanctuary jurisdictions under President Donald Trump's mass deportation plan.\nTrump issued an executive order directing Attorney General Pam Bondi and Department of Homeland Security Secretary Kristi Noem to withhold federal money from sanctuary communities. He also tasked all federal agencies with ensuring that payments to state and local governments do not \"abet so-called 'sanctuary' policies that seek to shield illegal aliens from deportation,\" The Associated Press reported.\nTRUMP DOJ SUES NEW YORK CITY OVER LONG-STANDING SANCTUARY IMMIGRATION POLICIES\nMany cities and counties sued the federal government, emphasizing that billions of dollars in funding were threatened. The Justice Department has also sued several cities, including New York and Los Angeles, over sanctuary policies.\nOrrick said Trump's orders, and the \"executive actions that have parroted them,\" demonstrated a \"coercive threat\" he ruled unconstitutional.\nEarlier this year, DHS posted a list of more than 500 sanctuary jurisdictions that the federal government determined to be noncompliant with the administration's directives, adding that they would each be formally notified.\nCLICK HERE TO GET THE FOX NEWS APP\nDHS also said it would notify the local communities if they were potentially violating any federal criminal statutes.\nThe list was later removed from the DHS website after the department was made aware that it included communities in support of the administration’s immigration policies, the AP reported.\nThe Associated Press contributed to this report."
    },
    {
      "news_title": "Obama Judge Blocks Trump Admin From Withholding Funds From Dozens Of Sanctuary Havens",
      "news_link": "https://dailycaller.com/2025/08/23/obama-judge-blocks-sanctuary-funding/",
      "bias": "Right",
      "text": "An Obama-appointed judge ruled late Friday that the Trump administration could not deny federal funds to dozens of cities and counties over their sanctuary policies.\nU.S. District Judge William Orrick, appointed to the bench in northern California by President Barack Obama, extended a preliminary injunction that blocks the Trump administration from withholding or conditioning federal funds from jurisdictions that refuse to cooperate with federal immigration authorities, according to court documents. The lawsuit, originally filed by San Francisco officials earlier this year, has since taken on many other sanctuary jurisdictions as plaintiffs. (RELATED: Feds Arrest Brother Of Illegal Migrant Truck Driver Accused Of Killing Three In Accident)\n“The new plaintiffs have each alleged similar reliance on federal funding as the Cities and Counties and filed declarations showing similar harms to community health, welfare and social services and to their budgetary processes that depend on the regularly authorized grants of federal funding for a variety of critical needs,” Orrick stated, according to court documents.\n“The challenged sections of Executive Orders 14,159 and 14,218, and the executive actions that have parroted them threaten to withhold all federal funding from the plaintiffs as sanctuary jurisdictions if they do not adapt their policies and practices to conform with the Trump administration’s preferences,” the judge continued. “That coercive threat (and any actions agencies take to realize that threat, or additional Executive Orders the President issues to the same end) is unconstitutional, so I enjoined its effect. I do so again today for the protection of the new parties in this case.”\nThe Obama-appointed judge has consistently ruled against the Trump’s administration’s quest to end sanctuary policies across the country.\nIn April, Orrick deemed President Donald Trump’s executive orders cracking down on sanctuary cities to be likely unconstitutional, blocking his administration from enforcing them against a slate of liberal enclaves that were suing. “Here we are again,” the judge wrote in the April order, referring to a previous executive order Trump signed in his first presidential term seeking to defund sanctuary cities — an order that Orrick also shot down at the time.\nIn 2017, Trump signed Executive Order 13,768, titled “Enhancing Public Safety in the Interior of the United States,” a directive that sought to block federal funds from sanctuary jurisdictions. Following a court challenge by San Francisco, Orrick ruled the order to be unconstitutional and that the defendants “faced irreparable harm absent an injunction,” according to court documents.\nThere is no official definition for a “sanctuary city” law or policy, but the label generally describes any policy for law that restricts local officials from assisting or otherwise cooperating with Immigration and Customs Enforcement (ICE) or other federal immigration agents. Typical sanctuary policies prohibit local law enforcement from honoring ICE detainer requests, sharing information with the agency or notifying immigration agents of an impending release of a wanted illegal migrant.\nMuch like his first term, Trump has ratcheted up pressure against sanctuary cities, which have served as a major hindrance against his immigration enforcement agenda.\nImmediately upon his return to office, the president signed an executive order directing the Department of Justice (DOJ) and the Department of Homeland Security to deny certain federal funds to sanctuary jurisdictions. The DOJ has since maintained a list of cities, counties and states it deems to be sanctuary havens for illegal migrants.\nDemocrat leaders have sued elsewhere to block the anti-sanctuary directives.\nA lawsuit, filed Monday in Rhode Island federal court, alleges that the Office for Victims of Crime — an office within the DOJ — created a policy that withholds Victims of Crime Act (VOCA) funding from states that are not assisting with Trump’s mission to crack down on illegal immigration. A coalition of Democrat attorneys general claims these “unprecedented conditions” tying VOCA funds to immigration enforcement to be unlawful.\nAll content created by the Daily Caller News Foundation, an independent and nonpartisan newswire service, is available without charge to any legitimate news publisher that can provide a large audience. All republished articles must include our logo, our reporter’s byline and their DCNF affiliation. For any questions about our guidelines or partnering with us, please contact licensing@dailycallernewsfoundation.org."
    },
    {
      "news_title": "Judge Stops Trump from Cutting Federal Funds to Sanctuary Cities - teleSUR English",
      "news_link": "https://www.telesurenglish.net/judge-stops-trump-from-cutting-federal-funds-to-sanctuary-cities/",
      "bias": "Left",
      "text": "Judge Stops Trump from Cutting Federal Funds to Sanctuary Cities\n(FILE). Photo: EFE.\nAugust 23, 2025 Hour: 12:19 am\nA federal judge halted U.S. President Donald Trump’s plan to withhold federal funds from so-called “sanctuary” cities, including Chicago, Los Angeles, Denver, and 31 others nationwide.\nRELATED: Amnesty: Trump Administration’s AI Tools Target Migrants and Pro-Palestinian Supporters\nJudge William Orrick of San Francisco issued a preliminary ruling preventing the reduction of federal funds to these cities, stopping Trump’s contentious policy designed to punish jurisdictions that opposed the Republican Administration’s far right anti-immigration measures enforced by Immigration and Customs Enforcement (ICE).\nWith this new ruling, cities like Boston, Santa Fe, Los Angeles, Portland, Chicago, Oakland, Sacramento, San Diego, and two dozen others won’t lose their funding, as the judge affirmed that doing so would be unconstitutional.\nThree months ago, the Department of Homeland Security (DHS) published a list of over 500 “sanctuary jurisdictions” and stated that each would receive a formal notification that the government considered them non-compliant.\nIn 2017, Judge Orrick had opposed Trump’s initial effort, during his first term, to cut federal funds, stating that this measure was not only unconstitutional but also violated the “separation of powers.”\nThis is the second judicial setback Trump has faced in 24 hours because on Thursday, a judge in Florida ordered the closure of the ‘Alligator Alcatraz’ jail within the next 60 days and added that no more migrants can be transferred to this facility.\nCivil associations in Florida warned on Friday that “horrible conditions” persist for migrants remaining in the immigration detention center despite the court’s decision.\nAuthor: vmmh\nSource: EFE"
    },
    {
      "news_title": "Judge blocks Trump from cutting funding to dozens of \"sanctuary\" cities, including Los Angeles and Chicago",
      "news_link": "https://www.cbsnews.com/news/judge-blocks-trump-cutting-funding-sanctuary-cities-los-angeles-chicago/",
      "bias": "Lean Left",
      "text": "Judge blocks Trump from cutting funding to dozens of \"sanctuary\" cities, including Los Angeles and Chicago\nA federal judge on Friday blocked the Trump administration from cutting off federal funding to dozens of \"sanctuary\" cities and counties — covering several of the largest cities in the U.S.\nThe judge had previously ruled in April that it was unconstitutional for President Trump to freeze funding for local governments that limit their cooperation with Immigration and Customs Enforcement — commonly known as sanctuary cities. That ruling applied to more than a dozen cities and counties that had sued the Trump administration for threatening to cut off funding, including San Francisco, Sacramento, Minneapolis and Seattle.\nOn Friday, San Francisco-based U.S. District Judge William Orrick extended his order to dozens of other places that joined the lawsuit. Those include the second- and third-largest cities in the U.S. — Los Angeles and Chicago — as well as Boston, Baltimore, Denver and Albuquerque.\nWhite House spokeswoman Abigail Jackson said in a statement: \"The government — at all levels — has the duty to protect American citizens from harm. Sanctuary cities interfere with federal immigration enforcement at the expense of the safety and security of Americans citizens. We look forward to ultimate vindication on the issue.\"\nAs Mr. Trump seeks to dramatically boost arrests and deportations of undocumented immigrants, top administration officials have pushed local governments to assist — and they've sought to punish so-called sanctuary jurisdictions with laws on the books that prevent police from helping ICE.\nWithin hours of returning to office in January, Mr. Trump ordered his administration to ensure sanctuary jurisdictions \"do not receive access to Federal funds.\" Weeks later, the president ordered that federal funding shouldn't \"facilitate the subsidization or promotion of illegal immigration,\" and Attorney General Pam Bondi said the Justice Department will not offer grants to sanctuary cities. The administration argues sanctuary cities are interfering with federal law enforcement and making it harder for ICE to arrest undocumented immigrants, including violent criminals.\nThe cities and counties that are suing the administration call those policies an \"abuse of power\" and allege they violate the Tenth Amendment, which says any powers that aren't given to the federal government should be reserved to the states. They argue that local governments are entitled to choose not to assist ICE, often casting sanctuary policies as a way of building trust between police and local residents whose immigration status may make them wary of reporting crimes.\n\"In flagrant disregard of the law, President Trump seeks once again to punish those who disagree with him, coerce local authorities, and commandeer them into carrying out his agenda,\" the cities' lawsuit says.\nThe Trump administration's moves against sanctuary cities have generated a flurry of lawsuits, including one suit filed earlier this week by 20 states over the Justice Department's decision to tie crime victim grants to immigration enforcement.\nThe Justice Department has also vowed to sue dozens of alleged sanctuary jurisdictions, including both cities and states. The administration sued New York City and the state of Illinois over their sanctuary policies earlier this year, though the Illinois suit was tossed out by a judge last month."
    },
    {
      "news_title": "Judge blocks Trump from cutting funding from 34 cities and counties",
      "news_link": "https://www.arabnews.com/node/2612724/world",
      "bias": "Lean Right",
      "text": "Judge blocks Trump from cutting funding from 34 cities and counties over ‘sanctuary’ policies\nJudge blocks Trump from cutting funding from 34 cities and counties over ‘sanctuary’ policies/node/2612724/world\nJudge blocks Trump from cutting funding from 34 cities and counties over ‘sanctuary’ policies\nProtesters hold signs during a demonstration at the governor's mansion in Lincoln, Nebraska, on Aug. 22, 2025, against the planned ICE detention center in McCook. (Lincoln Journal Star via AP)\nJudge blocks Trump from cutting funding from 34 cities and counties over ‘sanctuary’ policies\nThe Trump administration has been trying to remove millions of people in the country illegally\nDistrict Judge William Orrick said Trump's “executive actions” were an unconstitutional “coercive threat”\nUpdated 8 sec ago\nAP\nA judge ruled late Friday the Trump administration cannot deny funding to Boston, Chicago, Denver, Los Angeles and 30 other cities and counties because of policies that limit cooperation with federal immigration efforts.\nUS District Judge William Orrick in San Francisco extended a preliminary injunction blocking the administration from cutting off or conditioning the use of federal funds for so-called “sanctuary” jurisdictions. His earlier order protected more than a dozen other cities and counties, including San Francisco, Portland and Seattle.\nAn email to the White House late Friday was not immediately returned. In his ruling, Orrick said the administration had offered no opposition to an extended injunction except to say the first injunction was wrong. It has appealed the first order.\nOrrick also blocked the administration from imposing immigration-related conditions on two particular grant programs.\nThe Trump administration has ratcheted up pressure on sanctuary communities as it seeks to make good on President Donald Trump’s campaign promise to remove millions of people in the country illegally.\nOne executive order issued by Trump directs Attorney General Pam Bondi and Homeland Security Secretary Kristi Noem to withhold federal money from sanctuary jurisdictions. Another order directs every federal agency to ensure that payments to state and local governments do not “abet so-called ‘sanctuary’ policies that seek to shield illegal aliens from deportation.”\nThe cities and counties that sued said billions of dollars were at risk.\nOrrick, who was nominated by President Barack Obama, said the executive orders and the “executive actions that have parroted them” were an unconstitutional “coercive threat.”\nIn May, the Department of Homeland Security published a list of more than 500 “sanctuary jurisdictions,” saying each one would receive formal notification that the government had deemed them noncompliant. It also said it would inform them if they were believed to be in violation of any federal criminal statutes.\nThe list was later removed from the department’s website after critics noted it included localities that have actively supported the administration’s tough immigration policies.\nThe Justice Department has also sued New York, Los Angeles and other cities over their sanctuary policies.\nThere is no strict definition for sanctuary cities, but the terms generally describe places that limit cooperation with Immigration and Customs Enforcement. ICE enforces immigration laws nationwide but seeks help from state and local authorities to identify immigrants wanted for deportation and hold them for federal officers.\nTrump turns $11.1 billion in US government funds into a 10 percent stake in downtrodden Intel\nUS govt getting the stake through the conversion of $11.1 billion in previously issued funds and pledges, making a gain of $1.9 billion, on paper\nRemarkable turn of events comes at a time that the chipmaker is in the process of laying off more than 20,000 workers in bid to bounce back from years of missteps\nUpdated 23 August 2025\nAP\nWASHINGTON: President Donald Trump on Friday announced the US government has secured a 10 percent stake in struggling Silicon Valley pioneer Intel in a deal that was completed just a couple weeks after he was depicting the company’s CEO as a conflicted leader unfit for the job.\n“The United States of America now fully owns and controls 10 percent of INTEL, a Great American Company that has an even more incredible future,” Trump wrote in a post.\nThe US government is getting the stake through the conversion of $11.1 billion in previously issued funds and pledges. All told, the government is getting 433.3 million shares of non-voting stock priced at $20.47 apiece — a discount from Friday’s closing price at $24.80. That spread means the US government already has a gain of $1.9 billion, on paper.\nThe remarkable turn of events makes the US government one of Intel’s largest shareholders at a time that the Santa Clara, California, company is in the process of jettisoning more than 20,000 workers as part of its latest attempt to bounce back from years of missteps taken under a variety of CEOs.\nIntel’s current CEO, Lip-Bu Tan, has only been on the job for slightly more than five months, and earlier this month, it looked like he might be on shaky ground already after some lawmakers raised national security concerns about his past investments in Chinese companies while he was a venture capitalist. Trump latched on to those concerns in an August 7 post demanding that Tan resign.\nBut Trump backed off after the Malaysian-born Tan professed his allegiance to the US in a public letter to Intel employees and went to the White House to meet with the president, leading to a deal that now has the US government betting that the company is on the comeback trail after losing more than $22 billion since the end of 2023. Trump hailed Tan as “highly respected” CEO in his Friday post.\nIn a statement, Tan applauded Trump for “driving historic investments in a vital industry” and resolved to reward his faith in Intel. “We are grateful for the confidence the President and the Administration have placed in Intel, and we look forward to working to advance US technology and manufacturing leadership,” Tan said.\nIntel’s current stock price is just slightly above where it was when Tan was hired in March and more than 60 percent below its peak of about $75 reached 25 years ago when its chips were still dominating the personal computer boom before being undercut by a shift to smartphones a few years later. The company’s market value currently stands at about $108 billion — a fraction of the current chip kingpin, Nvidia, which is valued at $4.3 trillion.\nThe stake is coming primarily through US government grants to Intel through the CHIPS and Science Act that was started under President Joe Biden’s administration as a way to foster more domestic manufacturing of computer chips to lessen the dependence on overseas factories.\nBut the Trump administration, which has regularly pilloried the policies of the Biden administration, saw the CHIPs act as a needless giveaway and is now hoping to make a profit off the funding that had been pledged to Intel.\n“We think America should get the benefit of the bargain,” US Commerce Secretary Howard Lutnick said earlier this week. “It’s obvious that it’s the right move to make.”\nAbout $7.8 billion had been been pledged to Intel under the incentives program, but only $2.2 billion had been funded so far. Another $3.2 billion of the government investment is coming through the funds from another program called “Secure Enclave.”\nAlthough US government can’t vote with its shares and won’t have a seat on Intel’s board of directors, critics of the deal view it as a troubling cross-pollination between the public and private sectors that could hurt the tech industry in a variety of ways.\nFor instance, more tech companies may feel pressured to buy potentially inferior chips from Intel to curry favor with Trump at a time that he is already waging a trade war that threatens to affect their products in a potential scenario cited by Scott Lincicome, vice president of general economics for the Cato Institute.\n“Overall, it’s a horrendous move that will have real harms for US companies, US tech leadership, and the US economy overall,” Lincicome posted Friday.\nThe 10 percent stake could also intensify the pressure already facing Tan, especially if Trump starts fixating on Intel’s stock price while resorting to his penchant for celebrating his past successes in business.\nNancy Tengler, CEO of money manager Laffer Tengler Investments, is among the investors who abandoned Intel years ago because of all the challenges facing Intel.\n“I don’t see the benefit to the American taxpayer, nor do I see the benefit, necessarily to the chip industry,” Tengler said while also raising worries about Trump meddling in Intel’s business.\n“I don’t care how good of businessman you are, give it to the private sector and let people like me be the critic and let the government get to the business of government.,” Tengler said.\nAlthough rare, it’s not unprecedented for the US government to become a significant shareholder in a prominent company. One of the most notable instances occurred during the Great Recession in 2008 when the government injected nearly $50 billion into General Motors in return for a roughly 60 percent stake in the automaker at a time it was on the verge of bankruptcy. The government ended up with a roughly $10 billion loss after it sold its stock in GM.\nThe US government’s stake in Intel coincides with Trump’s push to bring production to the US, which has been a focal point of the trade war that he has been waging throughout the world. By lessening the country’s dependence on chips manufactured overseas, the president believes the US will be better positioned to maintain its technological lead on China in the race to create artificial intelligence.\nEven before gaining the 10 percent stake in Intel, Trump had been leveraging his power to reprogram the operations of major computer chip companies. The administration is requiring Nvidia and Advanced Micro Devices, two companies whose chips are powering the AI craze, to pay a 15 percent commission on their sales of chips in China in exchange for export licenses.\nGambian man sentenced to more than 67 years after US conviction for torture\nMichael Sang Correa, a member of former Gambian dictator Jammeh’s death squad, was convicted by US jury in April\nRights groups say Jammeh carried out brutalities against critics and political dissenters\nUpdated 23 August 2025\nReuters\nA Gambian man who was part of an armed unit run by former dictator Yahya Jammeh and was convicted of torture by a US jury in April has been sentenced to more than 67 years in prison, the US Justice Department said on Friday.\nA Colorado jury convicted the Gambian national, Michael Sang Correa, for his participation in the torture of numerous victims in Gambia in 2006, including beating and flesh burning, because of the victims’ purported involvement in a coup plot against the then-president, the Justice Department said.\nCorrea, 46, was sentenced to 810 months in prison by Senior Judge Christine Arguello for the District of Colorado after conviction on one count of conspiracy to commit torture and five counts of torture, the department said in a statement.\nThe case marked the first criminal prosecution over involvement in the feared armed group known as “the Junglers,” which operated in Gambia’s police state during Jammeh’s rule. The former president seized power in 1994 and foiled several attempts to overthrow him before he lost a 2016 election.\nCorrea was arrested in 2020 under a law which makes it a crime for anyone in the US to commit torture abroad.\nJammeh denied torture during his rule.\nThe Junglers were a secretive offshoot of the Gambian army that took orders from Jammeh. Rights groups and former victims say they carried out brutalities that worsened after a failed coup in 2006.\nSuspected coup plotters and other outspoken opponents of Jammeh were taken to the National Intelligence Agency near one of the capital Banjul’s white sand beaches, according to victims.\nSome found themselves in a torture chamber where they were subjected to electric shocks, beatings and burning with acid, they said. (Reporting by Kanishka Singh in Washington; Editing by Edmund Klamann)\nBeing Muslim and American in the nation’s heartland\nThe Muslim presence across the Midwest grew exponentially after a 1965 immigration law eliminated the quotas that had blocked arrivals from many parts of the world since the mid-1920s, Curtis said\nFaroz Waziri jokes that he and his wife Mena might have been the first Afghans in town when they came in the mid-2010s on a special visa for those who had worked for the US armed forces overseas\n“You can be a Muslim that’s practicing your religion and still coexist with everybody else around you,” said Hassan Igram, who chairs the center’s board of trustees\nUpdated 23 August 2025\nAP\nCEDAR RAPIDS, Iowa: The oldest surviving place of worship for Muslims in the United States is a white clapboard building on a grassy corner plot, as unassumingly Midwestern as its neighboring houses in Cedar Rapids – except for a dome.\nThe descendants of the Lebanese immigrants who constructed “the Mother Mosque” almost a century ago — along with newcomers from Afghanistan, East Africa and beyond — are defining what it can mean to be both Muslim and American in the nation’s heartland just as heightened conflicts in the Middle East fuel tensions over immigration and Islam in the United States.\nStanding by the door in a gold-embroidered black robe, Fatima Igram Smejkal greeted the faithful with a cheerful “salaam” as they hurried into the Islamic Center of Cedar Rapids for Friday prayers. In 1934, her family helped open what the National Register of Historic Places calls “the first building designed and constructed specifically as a house of worship for Muslims in the United States.”\n“They all came from nothing … so they wanted to give back,” Smejkal said of families like hers, who arrived at the turn of the 20th century. “That’s why I’m so kind to the ones that come in from Somalia and the Congo and Sudan and Afghanistan. I have no idea what they left, what they’re thinking when they walk in that mosque.”\nThe community now gathers in the Islamic Center. It was built in the 1970s when they became too many for the Mother Mosque’s living-room-sized prayer hall, and now they’re have outgrown its prayer hall, as well. Hundreds of fifth-generation Muslim Iowans, recent refugees and migrants pray on industrial carpets rolled onto the gym’s basketball court — the elderly on walkers, babies in car seats, women in headscarves and men sporting headgear from African kufi and Afghan pakol caps to baseball hats.\nThis physical space where diverse groups gather helps sustain community as immigrants try to preserve their heritage while assimilating into US culture and society.\n“You can be a Muslim that’s practicing your religion and still coexist with everybody else around you,” said Hassan Igram, who chairs the center’s board of trustees. He shares the same first and last names as his grandfather and Smejkal’s grandfather – two cousins who came to Iowa as boys in the 1910s.\nLebanese migrants ‘Mother Mosque’\nTens of thousands of young men, both Christians and Muslims, settled in booming Midwestern towns after fleeing the Ottoman Empire, many with little more than a Bible or a Qur’an in their bags. They often worked selling housewares off their backs to widely scattered farms, earning enough to buy horses and buggies, and then opened grocery stores.\nThrough bake sales and community dinners, a group of Muslim women raised money in the 1920s to build what was called the “Muslim Temple.” Like the Igrams, Anace Aossey remembers attending prayer there with his parents – though as children they were more focused on the Dixie Cream donuts that would follow.\n“We weren’t raised real strict religiously,” said Aossey, whose father sold goods along the tracks from a 175-pound sack. “They were here to integrate themselves into the American society.” Growing up Muslim in America\nMuslims sometimes faced institutional discrimination. After serving in World War II, Smejkal’s father, Abdallah Igram, successfully campaigned for soldiers’ dog tags to include Muslim as an option, along with Catholic, Protestant and Jewish.\nBut in Cedar Rapids, immigrants found mutual acceptance, fostered through houses of worship and friendships between US-born children and their non-Muslim neighbors. Smejkal’s best friend was Catholic, and her father kept beef hot dogs in the kitchen to respect the Muslim prohibition against pork. Smejkal’s father, in turn, made sure Friday meals included fish sticks.\n“Arab-speaking Muslims were part and parcel of the same stories that inform our sense of what the Midwest is and its values are,” said Indiana University professor Edward E. Curtis, IV. “They participated in the making of the American heartland.”\nAbdallah Igram is buried in the city’s hilltop Muslim cemetery, among the first in the United States when it was built in the 1940s. It’s next to the Czech cemetery – for the descendants of the migrants who helped establish Cedar Rapids in the 1850s — and the Jewish cemetery, whose operators donated trees to the Muslim one after damage from a derecho five years ago. Smejkal wishes the whole world’s faiths could collaborate this way.\n“That’s when there’s no barriers anymore. I pray one day it’s really like that,” Smejkal said.\nBeing Muslim in the Heartland\nThe Muslim presence across the Midwest grew exponentially after a 1965 immigration law eliminated the quotas that had blocked arrivals from many parts of the world since the mid-1920s, Curtis said.\nMistrust flared again after the Sept. 11, 2001, attacks, especially in farming communities whose young people were fighting in Afghanistan and Iraq, said Ako Abdul-Samad, an African-American who represented Des Moines for nearly two decades in the Iowa House of Representatives. He feared being Muslim would prevent his election when he first ran for office, but voters re-elected him again and again.\nImmigration, including from Muslim countries, remains a contentious issue, even as Muslim communities flourish and increase their political influence in major cities like Minneapolis and Detroit.\nBut daily interactions between Muslims and their neighbors have provided some protection from prejudice, according to the Mother Mosque imam, a Palestinian who immigrated in the 1980s. “Stereotypes and things did not work” in Cedar Rapids, Taha Tawil said.\nBosnian Muslims say they’ve had similar experiences near Des Moines, where a new multimillion dollar mosque and cultural center is opening next month, an expansion of the first center established by war refugees 20 years ago.\n“Our neighbors have been great to us, including the farmers we got the land from,” said its treasurer, Moren Blazevic. “We’re finally Iowans.”\nBecoming Midwesterners\nFaroz Waziri jokes that he and his wife Mena might have been the first Afghans in town when they came in the mid-2010s on a special visa for those who had worked for the US armed forces overseas. After struggling with “culture shock” and language barriers, they’ve become naturalized US citizens, and he’s the refugee resources manager at a non-profit founded by Catholic nuns.\nWhile grateful for the aid and the safety they feel, the Waziris miss their families and homeland. And they fear that cultural differences — especially the individualism Americans express, like when they sit around a table for meals, instead of together on a rug — remain too vast.\n“Mentally and emotionally, I never think I’m American,” said Mena Waziri. She’s a college graduate now, and loves the independence and women’s rights that remain unattainable in Taliban-run Afghanistan. But the family is keen for their US-born son, Rayan, to have Muslim friends and values.\nThese tensions are familiar for the descendants of the city’s first Muslim settlers, like Aossey, who keeps exhibit panels about Lebanese immigration and integration in the same garage where he stores ATVs on his recreational farm.\n“My story is the American story,” Aossey said. “It’s not the Islamic story.”\nTrump threatens federal intervention in Chicago, government takeover in D.C.\nChicago, other cities do not share D.C.’s federal status\nViolent crime has fallen in Washington, Chicago, data shows\nUpdated 23 August 2025\nReuters\nWASHINGTON: US President Donald Trump said on Friday he would probably expand his crime crackdown to Chicago, intervening in another city governed by Democrats, and threatened to take full control of Washington, D.C., rather than only its policing.\nSaying without evidence that violent crime was out of control in the nation’s capital, Trump deployed D.C. National Guard soldiers and federal agents on the streets last week with a mandate to reduce crime.\n“It was horrible and Mayor Bowser better get her act straight or she won’t be mayor very long, because we’ll take it over with the federal government, run it like it’s supposed to be run,” Trump told reporters, referring to Washington Mayor Muriel Bowser.\nRecent statistics, which Trump dismissed, show crime has declined in the US capital since a 2023 peak.\nWashington is a unique federal enclave, established in the US Constitution and falling under the jurisdiction of Congress, not belonging to any state.\nIn 1973, Congress passed the District of Columbia Home Rule Act, allowing residents to elect a mayor and council members.\nContinuing his off-the-cuff remarks at the White House, Trump mused about extending his efforts to other cities. He has declined to explain how the federal government could intervene in local law enforcement in cities outside of the federal enclave of D.C.\n“Chicago is a mess,” Trump said, deriding its mayor. “And we’ll straighten that one out probably next.”\nTrump said some of his supporters in Chicago have been “screaming for us to come.”\n“I did great with the Black vote, as you know, and they want something to happen,” he said. “So I think Chicago will be our next, and then we’ll help with New York.”\nAs in Washington, crime, including murders, has declined in Chicago in the last year.\nChicago Mayor Brandon Johnson said he took Trump’s comments seriously but has not received formal communication from the administration about federal law enforcement or military deployments.\nThe mayor said Trump’s approach has been “uncoordinated, uncalled for and unsound.” He added: “There are many things the federal government could do to help us reduce crime and violence in Chicago, but sending in the military is not one of them.”\nNew York City, also criticized by Trump, has reported a steady decline in violent crime in recent decades, and now has a relatively low murder rate among big American cities. Trump also threatened federal government intervention in San Francisco, another city governed by Democrats.\nWhile the Republican president has cast his efforts as an urgent move to help residents feel safe again, Democrats and other critics say he aims to expand the powers of the president beyond the bounds of the Constitution and assert federal control over cities run by Democratic officials.\nThe US Constitution’s Tenth Amendment generally prevents the federal government from commandeering state or municipal officials and from intervening in states’ legal and criminal justice systems unless citizens’ constitutional rights are being violated.\nWith no Ukraine peace deal, Trump again threatens Russia sanctions\nRussia says agenda ‘not ready’ for Zelensky meeting\nWork on Ukraine’s proposed security guarantees underway\nUpdated 23 August 2025\nReuters\nWASHINGTON/KYIV: US President Donald Trump renewed a threat to impose sanctions on Russia on Friday if there is no progress toward a peaceful settlement in Ukraine in two weeks, showing frustration at Moscow a week after his meeting with Russian President Vladimir Putin in Alaska.\n“I’m going to make a decision as to what we do and it’s going to be, it’s going to be a very important decision, and that’s whether or not it’s massive sanctions or massive tariffs or both, or we do nothing and say it’s your fight,” Trump said.\nHe was unhappy about Russia’s deadly strike on a factory in Ukraine this week, he said.\n“I’m not happy about it, and I’m not happy about anything having to do with that war,” Trump told reporters at the White House.\nUkrainian President Volodymyr Zelensky, meanwhile, said on Friday that Russia was doing everything it could to prevent a meeting between him and Putin, while Russia’s foreign minister said the agenda for such a meeting was not ready.\nZelensky has repeatedly called for Putin to meet him, saying it is the only way to negotiate an end to the war.\nTrump had said he had begun the arrangements for a Putin-Zelensky meeting after a call with the Russian leader on Monday that followed their Alaska meeting on August 15.\nZelensky accused Russia of stalling.\n“The meeting is one of the components of how to end the war,” he said on Friday at a press conference in Kyiv with NATO Secretary General Mark Rutte. “And since they don’t want to end it, they will look for space to (avoid it).”\nRussian Foreign Minister Sergei Lavrov told NBC there was no agenda for such a summit.\n“Putin is ready to meet with Zelensky when the agenda would be ready for a summit. And this agenda is not ready at all,” he said.\nThe statement echoed Moscow’s established rhetoric about a leaders’ meeting being impossible unless certain conditions were met.\nAsked for his response to Lavrov’s comments and what the next steps are, Trump told reporters earlier on Friday: “Well, we’ll see. We’re going to see if Putin and Zelensky will be working together. It’s like oil and vinegar a little bit.”\n‘He may be coming’\nTrump had taken sanctions off the table in preparation for his summit in Anchorage with Putin. But at the same White House event where he mentioned possible sanctions, he showed a photograph of his meeting with Putin on the red carpet in Alaska, saying Putin wanted to attend the World Cup 2026 soccer tournament in the United States.\n“I’m going to sign this for him. But I was sent one, and I thought you would like to see it, it’s a man named Vladimir Putin, who I believe will be coming, depending on what happens. He may be coming, and he may not, depending on what happens,” Trump said.\nTrump’s comments did not address the fact that Russia was banned from international competitions such as the World Cup after the 2022 invasion of Ukraine and has not taken part in qualification for the 2026 tournament, which will be hosted by the US, Canada and Mexico.\nDuring a visit to a nuclear research center on Friday, Putin said Trump’s leadership qualities would help restore US-Russia relations.\n“With the arrival of President Trump, I think that a light at the end of the tunnel has finally loomed. And now we had a very good, meaningful and frank meeting in Alaska,” Putin said.\nThousands of Ukrainian civilians have been killed in the full-scale invasion of Ukraine that Russia launched in 2022. Analysts estimate that more than a million soldiers on both sides have been killed or wounded and fighting is continuing unabated, with both sides also attacking energy facilities.\nRussia has maintained its longstanding demand for Ukraine to give up land it still holds in two eastern regions while proposing to freeze the front line in two more southerly regions Moscow claims fully as its own and possibly hand back small pieces of other Ukrainian territory it controls.\nZelensky meanwhile has dropped his demand for a lengthy ceasefire as a prerequisite for a leaders’ meeting, although he has previously said Ukraine cannot negotiate under the barrel of a gun.\nAt the press conference with Rutte, Zelensky said they had discussed security guarantees for Ukraine. He said the guarantees ought to be similar to NATO’s Article 5, which considers an attack on one member of the alliance as an attack against all.\nRutte said NATO allies and Ukraine are working together to ensure security guarantees are strong enough that Russia will never try to attack again.\n“Robust security guarantees will be essential, and this is what we are now working on to define,” he said."
    },
    {
      "news_title": "Judge blocks Trump from withholding funds from Los Angeles, other sanctuary cities",
      "news_link": "https://gazette.com/news/us-world/judge-blocks-trump-from-withholding-funds-from-los-angeles-other-sanctuary-cities/article_b80a19b3-13c1-566e-a690-461d0b131f31.html",
      "bias": "Center",
      "text": null
    },
    {
      "news_title": "Judge Blocks Trump's Funding Cuts to Sanctuary Cities",
      "news_link": "https://www.newsmax.com/newsfront/trump-sanctuary-cities-funding/2025/08/22/id/1223622/",
      "bias": "Right",
      "text": "A judge ruled late Friday the Trump administration cannot deny funding to Boston, Chicago, Denver, Los Angeles and 30 other cities and counties because of policies that limit cooperation with federal immigration efforts.\nU.S. District Judge William Orrick in San Francisco extended a preliminary injunction blocking the administration from cutting off or conditioning the use of federal funds for “sanctuary” jurisdictions. His earlier order protected more than a dozen other cities and counties, including San Francisco, Portland and Seattle.\nAn email to the White House late Friday was not immediately returned. In his ruling, Orrick said the administration had offered no opposition to an extended injunction except to say the first injunction was wrong. It has appealed the first order.\nOrrick also blocked the administration from imposing immigration-related conditions on two particular grant programs.\nThe Trump administration has ratcheted up pressure on sanctuary communities as it seeks to make good on President Donald Trump’s campaign promise to remove millions of people in the country illegally.\nOne executive order issued by Trump directs Attorney General Pam Bondi and Homeland Security Secretary Kristi Noem to withhold federal money from sanctuary jurisdictions. Another order directs every federal agency to ensure that payments to state and local governments do not “abet so-called ‘sanctuary’ policies that seek to shield illegal aliens from deportation.”\nThe cities and counties that sued said billions of dollars were at risk.\nOrrick, who was nominated by President Barack Obama, said the executive orders and the “executive actions that have parroted them” were an unconstitutional “coercive threat.”\nIn May, the Department of Homeland Security published a list of more than 500 “sanctuary jurisdictions,” saying each one would receive formal notification that the government had deemed them noncompliant. It also said it would inform them if they were believed to be in violation of any federal criminal statutes.\nThe list was later removed from the department’s website after critics noted it included localities that have actively supported the administration’s tough immigration policies.\nThe Justice Department has also sued New York, Los Angeles and other cities over their sanctuary policies.\nThere is no strict definition for sanctuary cities, but the terms generally describe places that limit cooperation with Immigration and Customs Enforcement. ICE enforces immigration laws nationwide but seeks help from state and local authorities to identify immigrants wanted for deportation and hold them for federal officers.\nCopyright 2025 The Associated Press. All rights reserved. This material may not be published, broadcast, rewritten or redistributed without permission."
    },
    {
      "news_title": "Judge blocks President Trump from cutting funding from Chicago and other cities over ‘sanctuary’ policies",
      "news_link": "https://www.chicagotribune.com/2025/08/22/trump-sanctuary-city-funding-ruling/",
      "bias": "Center",
      "text": "A judge ruled late Friday the Trump administration cannot deny funding to Boston, Chicago, Denver, Los Angeles and 30 other cities and counties because of policies that limit cooperation with federal immigration efforts.\nU.S. District Judge William Orrick in San Francisco extended a preliminary injunction blocking the administration from cutting off or conditioning the use of federal funds for so-called “sanctuary” jurisdictions. His earlier order protected more than a dozen other cities and counties, including San Francisco, Portland and Seattle.\nAn email to the White House late Friday was not immediately returned. In his ruling, Orrick said the administration had offered no opposition to an extended injunction except to say the first injunction was wrong. It has appealed the first order.\nOrrick also blocked the administration from imposing immigration-related conditions on two particular grant programs.\nThe Trump administration has ratcheted up pressure on sanctuary communities as it seeks to make good on President Donald Trump’s campaign promise to remove millions of people in the country illegally.\nOne executive order issued by Trump directs Attorney General Pam Bondi and Homeland Security Secretary Kristi Noem to withhold federal money from sanctuary jurisdictions. Another order directs every federal agency to ensure that payments to state and local governments do not “abet so-called ‘sanctuary’ policies that seek to shield illegal aliens from deportation.”\nThe cities and counties that sued said billions of dollars were at risk.\nOrrick, who was nominated by President Barack Obama, said the executive orders and the “executive actions that have parroted them” were an unconstitutional “coercive threat.”\nIn May, the Department of Homeland Security published a list of more than 500 “sanctuary jurisdictions,” saying each one would receive formal notification that the government had deemed them noncompliant. It also said it would inform them if they were believed to be in violation of any federal criminal statutes.\nThe list was later removed from the department’s website after critics noted it included localities that have actively supported the administration’s tough immigration policies.\nThe Justice Department has also sued New York, Los Angeles and other cities over their sanctuary policies.\nThere is no strict definition for sanctuary cities, but the terms generally describe places that limit cooperation with Immigration and Customs Enforcement. ICE enforces immigration laws nationwide but seeks help from state and local authorities to identify immigrants wanted for deportation and hold them for federal officers."
    },
    {
      "news_title": "Judge blocks efforts to cut funding from Boston, other areas over 'sanctuary' policies",
      "news_link": "https://www.boston.com/news/local-news/2025/08/22/judge-blocks-efforts-to-cut-funding-from-boston-other-areas-over-sanctuary-policies/",
      "bias": "Center",
      "text": "Judge blocks efforts to cut funding from Boston, other areas over ‘sanctuary’ policies\nThe cities and counties that sued said billions of dollars were at risk.\nA judge ruled Friday the Trump administration cannot deny funding to Boston, Chicago, Denver, Los Angeles and 30 other cities and counties because of policies that limit cooperation with federal immigration efforts.\nU.S. District Judge William Orrick extended a preliminary injunction blocking the administration from cutting off or conditioning the use of federal funds for so-called “sanctuary” jurisdictions. His earlier order protected more than a dozen other cities and counties, including San Francisco, Portland and Seattle.\nThe Trump administration has ratcheted up pressure on those communities as it seeks to make good on President Donald Trump’s campaign promise to remove millions of people in the country illegally.\nOne executive order issued by Trump directs Attorney General Pam Bondi and Homeland Security Secretary Kristi Noem to withhold federal money from sanctuary jurisdictions. Another order directs every federal agency to ensure that payments to state and local governments do not “abet so-called ‘sanctuary’ policies that seek to shield illegal aliens from deportation.”\nThe cities and counties that sued said billions of dollars were at risk.\nConversation\nThis discussion has ended. Please join elsewhere on Boston.com"
    },
    {
      "news_title": "Judge blocks Trump from denying funds to 34 more ‘sanctuary’ cities, counties",
      "news_link": "https://www.oregonlive.com/nation/2025/08/judge-blocks-trump-from-denying-funds-to-34-more-sanctuary-cities-counties.html",
      "bias": "Center",
      "text": "A judge ruled late Friday the Trump administration cannot deny funding to Boston, Chicago, Denver, Los Angeles and 30 other cities and counties because of policies that limit cooperation with federal immigration efforts.\nU.S. District Judge William Orrick in San Francisco extended a preliminary injunction blocking the administration from cutting off or conditioning the use of federal funds for so-called “sanctuary” jurisdictions. His earlier order protected more than a dozen other cities and counties, including Portland, San Francisco and Seattle.\nThe Trump administration has ratcheted up pressure on those communities as it seeks to make good on President Donald Trump’s campaign promise to remove millions of people in the country illegally.\nOne executive order issued by Trump directs Attorney General Pam Bondi and Homeland Security Secretary Kristi Noem to withhold federal money from sanctuary jurisdictions. Another order directs every federal agency to ensure that payments to state and local governments do not “abet so-called ‘sanctuary’ policies that seek to shield illegal aliens from deportation.”\nThe cities and counties that sued said billions of dollars were at risk.\nAn email to the White House late Friday was not immediately returned.\nIn May, the Department of Homeland Security published a list of more than 500 “sanctuary jurisdictions,” saying each one would receive formal notification that the government had deemed them noncompliant. It also said it would inform them if they were believed to be in violation of any federal criminal statutes.\nThe list was later removed from the department’s website after critics noted it included localities that have actively supported the administration’s tough immigration policies.\nThe Justice Department has sued New York, Los Angeles and other cities over their sanctuary policies.\nThere is no strict definition for sanctuary cities, but the terms generally describes places that limit cooperation with Immigration and Customs Enforcement. ICE enforces immigration laws nationwide but seeks help from state and local authorities to identify immigrants wanted for deportation and hold them for federal officers.\nMore business\n- Do you want to file your taxes for free? Taxpayer input sought as federal program faces elimination\n- As big box stores flee, Portland shopkeepers feel pressure to fuel downtown renaissance\n- Oregon credit card debt jumped 25% in three years\n- Liz Weston: Should I remember longtime domestic employee in my will?\n- Editorial: Billions in new taxes should come with a commitment\n-- Sudhin Thanawala, The Associated Press"
    },
    {
      "news_title": "Judge Blocks Trump From Cutting Funding From 34 Cities And Counties Over ‘Sanctuary’ Policies",
      "news_link": "https://www.huffpost.com/entry/ap-us-trump-sanctuary-cities_n_68a91c30e4b0d5177beaa564",
      "bias": "Left",
      "text": "A judge ruled late Friday the Trump administration cannot deny funding to Boston, Chicago, Denver, Los Angeles and 30 other cities and counties because of policies that limit cooperation with federal immigration efforts.\nU.S. District Judge William Orrick in San Francisco extended a preliminary injunction blocking the administration from cutting off or conditioning the use of federal funds for so-called “sanctuary” jurisdictions. His earlier order protected more than a dozen other cities and counties, including San Francisco, Portland and Seattle.\nThe Trump administration has ratcheted up pressure on those communities as it seeks to make good on President Donald Trump’s campaign promise to remove millions of people in the country illegally.\nOne executive order issued by Trump directs Attorney General Pam Bondi and Homeland Security Secretary Kristi Noem to withhold federal money from sanctuary jurisdictions. Another order directs every federal agency to ensure that payments to state and local governments do not “abet so-called ‘sanctuary’ policies that seek to shield illegal aliens from deportation.”\nThe cities and counties that sued said billions of dollars were at risk.\nAn email to the White House late Friday was not immediately returned.\nIn May, the Department of Homeland Security published a list of more than 500 “sanctuary jurisdictions,” saying each one would receive formal notification that the government had deemed them noncompliant. It also said it would inform them if they were believed to be in violation of any federal criminal statutes.\nThe list was later removed from the department’s website after critics noted it included localities that have actively supported the administration’s tough immigration policies.\nThe Justice Department has sued New York, Los Angeles and other cities over their sanctuary policies.\nThere is no strict definition for sanctuary cities, but the terms generally describes places that limit cooperation with Immigration and Customs Enforcement. ICE enforces immigration laws nationwide but seeks help from state and local authorities to identify immigrants wanted for deportation and hold them for federal officers."
    },
    {
      "news_title": "Judge blocks Trump from cutting funding from 34 cities and counties over ‘sanctuary’ policies",
      "news_link": "https://apnews.com/article/trump-sanctuary-cities-immigrants-chicago-los-angeles-a39891a127c06a6062d74ac2eac50544",
      "bias": "Lean Left",
      "text": "Judge blocks Trump from cutting money to Chicago, LA and other cities over ‘sanctuary’ policies\nA judge ruled late Friday the Trump administration cannot deny funding to Boston, Chicago, Denver, Los Angeles and 30 other cities and counties because of policies that limit cooperation with federal immigration efforts.\nU.S. District Judge William Orrick in San Francisco extended a preliminary injunction blocking the administration from cutting off or conditioning the use of federal funds for so-called “sanctuary” jurisdictions. His earlier order protected more than a dozen other cities and counties, including San Francisco, Portland and Seattle.\nAn email to the White House late Friday was not immediately returned. In his ruling, Orrick said the administration had offered no opposition to an extended injunction except to say the first injunction was wrong. It has appealed the first order.\nOrrick also blocked the administration from imposing immigration-related conditions on two particular grant programs.\nThe Trump administration has ratcheted up pressure on sanctuary communities as it seeks to make good on President Donald Trump’s campaign promise to remove millions of people in the country illegally.\nOne executive order issued by Trump directs Attorney General Pam Bondi and Homeland Security Secretary Kristi Noem to withhold federal money from sanctuary jurisdictions. Another order directs every federal agency to ensure that payments to state and local governments do not “abet so-called ‘sanctuary’ policies that seek to shield illegal aliens from deportation.”\nThe cities and counties that sued said billions of dollars were at risk.\nOrrick, who was nominated by President Barack Obama, said the executive orders and the “executive actions that have parroted them” were an unconstitutional “coercive threat.”\nIn May, the Department of Homeland Security published a list of more than 500 “sanctuary jurisdictions,” saying each one would receive formal notification that the government had deemed them noncompliant. It also said it would inform them if they were believed to be in violation of any federal criminal statutes.\nThe list was later removed from the department’s website after critics noted it included localities that have actively supported the administration’s tough immigration policies.\nThe Justice Department has also sued New York, Los Angeles and other cities over their sanctuary policies.\nThere is no strict definition for sanctuary cities, but the terms generally describe places that limit cooperation with Immigration and Customs Enforcement. ICE enforces immigration laws nationwide but seeks help from state and local authorities to identify immigrants wanted for deportation and hold them for federal officers."
    },
    {
      "news_title": "Judge blocks Trump from cutting funding over 'sanctuary' policies",
      "news_link": "https://www.npr.org/2025/08/23/g-s1-84863/judge-blocks-trump-from-cutting-funding-sanctuary-cities",
      "bias": "Lean Left",
      "text": "Judge blocks Trump from cutting funding over 'sanctuary' policies\nA judge ruled late Friday the Trump administration cannot deny funding to Boston, Chicago, Denver, Los Angeles and 30 other cities and counties because of policies that limit cooperation with federal immigration efforts.\nU.S. District Judge William Orrick in San Francisco extended a preliminary injunction blocking the administration from cutting off or conditioning the use of federal funds for so-called \"sanctuary\" jurisdictions. His earlier order protected more than a dozen other cities and counties, including San Francisco, Portland and Seattle.\nAn email to the White House late Friday was not immediately returned. In his ruling, Orrick said the administration had offered no opposition to an extended injunction except to say the first injunction was wrong. It has appealed the first order.\nOrrick also blocked the administration from imposing immigration-related conditions on two particular grant programs.\nThe Trump administration has ratcheted up pressure on sanctuary communities as it seeks to make good on President Donald Trump's campaign promise to remove millions of people in the country illegally.\nOne executive order issued by Trump directs Attorney General Pam Bondi and Homeland Security Secretary Kristi Noem to withhold federal money from sanctuary jurisdictions. Another order directs every federal agency to ensure that payments to state and local governments do not \"abet so-called 'sanctuary' policies that seek to shield illegal aliens from deportation.\"\nThe cities and counties that sued said billions of dollars were at risk.\nOrrick, who was nominated by President Barack Obama, said the executive orders and the \"executive actions that have parroted them\" were an unconstitutional \"coercive threat.\"\nIn May, the Department of Homeland Security published a list of more than 500 \"sanctuary jurisdictions,\" saying each one would receive formal notification that the government had deemed them noncompliant. It also said it would inform them if they were believed to be in violation of any federal criminal statutes.\nThe list was later removed from the department's website after critics noted it included localities that have actively supported the administration's tough immigration policies.\nThe Justice Department has also sued New York, Los Angeles and other cities over their sanctuary policies.\nThere is no strict definition for sanctuary cities, but the terms generally describe places that limit cooperation with Immigration and Customs Enforcement. ICE enforces immigration laws nationwide but seeks help from state and local authorities to identify immigrants wanted for deportation and hold them for federal officers."
    },
    {
      "news_title": "Judge blocks Trump from cutting funding from cities over ‘sanctuary' policies",
      "news_link": "https://www.nbcphiladelphia.com/news/local/judge-blocks-trump-from-cutting-funding-from-cities-over-sanctuary-policies/4258528/",
      "bias": "Lean Left",
      "text": "What to Know\n- A judge has ruled the Trump administration cannot deny funding to Boston, Chicago, Denver, Los Angeles and 30 other cities and counties because of policies that limit cooperation with federal immigration efforts.\n- U.S. District Judge William Orrick on Friday extended a preliminary injunction blocking the administration from cutting off or conditioning the use of federal funds for so-called “sanctuary” jurisdictions.\n- His earlier order protected more than a dozen other cities and counties, including San Francisco, Portland and Seattle.\n- The Trump administration has ratcheted up pressure on those communities as it seeks to make good on President Donald Trump’s campaign promise to remove millions of people in the country illegally.\nA judge ruled late Friday that the Trump administration cannot deny funding to Boston, Chicago, Denver, Los Angeles and 30 other cities and counties because of policies that limit cooperation with federal immigration efforts.\nStream Philadelphia News for free, 24/7, wherever you are with NBC10.\nU.S. District Judge William Orrick in San Francisco extended a preliminary injunction blocking the administration from cutting off or conditioning the use of federal funds for so-called “sanctuary” jurisdictions.\nHis earlier order protected more than a dozen other cities and counties, including San Francisco, Portland and Seattle.\nAn email to the White House late Friday was not immediately returned.\nIn his ruling, Orrick said the administration had offered no opposition to an extended injunction except to say the first injunction was wrong. It has appealed the first order.\nOrrick also blocked the administration from imposing immigration-related conditions on two particular grant programs.\nThe Trump administration has ratcheted up pressure on sanctuary communities as it seeks to make good on President Donald Trump’s campaign promise to remove millions of people in the country illegally.\nOne executive order issued by Trump directs Attorney General Pam Bondi and Homeland Security Secretary Kristi Noem to withhold federal money from sanctuary jurisdictions.\nAnother order directs every federal agency to ensure that payments to state and local governments do not “abet so-called ‘sanctuary’ policies that seek to shield illegal aliens from deportation.”\nThe cities and counties that sued said billions of dollars were at risk.\nOrrick, who was nominated by President Barack Obama, said the executive orders and the “executive actions that have parroted them” were an unconstitutional “coercive threat.”\nIn May, the Department of Homeland Security published a list of more than 500 “sanctuary jurisdictions,\" saying each one would receive formal notification that the government had deemed them noncompliant. It also said it would inform them if they were believed to be in violation of any federal criminal statutes.\nThe list was later removed from the department’s website after critics noted it included localities that have actively supported the administration’s tough immigration policies.\nThe Justice Department has also sued New York, Los Angeles and other cities over their sanctuary policies.\nThere is no strict definition for sanctuary cities, but the terms generally describe places that limit cooperation with Immigration and Customs Enforcement.\nICE enforces immigration laws nationwide but seeks help from state and local authorities to identify immigrants wanted for deportation and hold them for federal officers."
    },
    {
      "news_title": "Judge blocks Trump from cutting funding to sanctuary cities",
      "news_link": "https://www.ktvu.com/news/judge-blocks-trump-from-cutting-funding-sanctuary-cities",
      "bias": "Center",
      "text": "Judge blocks Trump from cutting funding to sanctuary cities\nSAN FRANCISCO - A judge ruled late Friday the Trump administration cannot deny funding to Boston, Chicago, Denver, Los Angeles and 30 other cities and counties because of policies that limit cooperation with federal immigration efforts.\nTrump can't withhold federal funds\nWhat we know:\nU.S. District Judge William Orrick in San Francisco extended a preliminary injunction blocking the administration from cutting off or conditioning the use of federal funds for so-called \"sanctuary\" jurisdictions. His earlier order protected more than a dozen other cities and counties, including San Francisco, Portland and Seattle.\nAn email to the White House late Friday was not immediately returned. In his ruling, Orrick said the administration had offered no opposition to an extended injunction except to say the first injunction was wrong. It has appealed the first order.\nOrrick also blocked the administration from imposing immigration-related conditions on two particular grant programs.\nThe Trump administration has ratcheted up pressure on sanctuary communities as it seeks to make good on President Donald Trump’s campaign promise to remove millions of people in the country illegally.\nCities claim billions of dollars were at stake\nDig deeper:\nOne executive order issued by Trump directs Attorney General Pam Bondi and Homeland Security Secretary Kristi Noem to withhold federal money from sanctuary jurisdictions. Another order directs every federal agency to ensure that payments to state and local governments do not \"abet so-called ‘sanctuary’ policies that seek to shield illegal aliens from deportation.\"\nThe cities and counties that sued said billions of dollars were at risk.\nOrrick, who was nominated by President Barack Obama, said the executive orders and the \"executive actions that have parroted them\" were an unconstitutional \"coercive threat.\"\nIn May, the Department of Homeland Security published a list of more than 500 \"sanctuary jurisdictions,\" saying each one would receive formal notification that the government had deemed them noncompliant. It also said it would inform them if they were believed to be in violation of any federal criminal statutes.\nThe list was later removed from the department’s website after critics noted it included localities that have actively supported the administration’s tough immigration policies.\nThe Justice Department has also sued New York, Los Angeles and other cities over their sanctuary policies.\nThere is no strict definition for sanctuary cities, but the terms generally describe places that limit cooperation with Immigration and Customs Enforcement. ICE enforces immigration laws nationwide but seeks help from state and local authorities to identify immigrants wanted for deportation and hold them for federal officers.\nThe Source: Assocaited Press"
    },
    {
      "news_title": "Trump can't cut funding from 30+ 'sanctuary' cities, including LA, judge rules",
      "news_link": "https://www.foxla.com/news/trump-los-angeles-sanctuary-city-funding",
      "bias": "Center",
      "text": "Trump can't cut funding from 30+ 'sanctuary' cities, including LA, judge rules\nLOS ANGELES - A federal judge ruled on Friday that President Donald Trump cannot withhold funding from more than 30 \"sanctuary\" cities across the U.S.\nWhat we know:\nU.S. District Judge William Orrick extended his earlier preliminary injunction, blocking the Trump administration from withholding federal funding from \"sanctuary\" cities.\nLos Angeles, Boston, Chicago and Denver were among 34 so-called \"sanctuary cities\" included in the order. Orrick's Friday order expanded on his earlier ruling, which secured funding for more than a dozen other cities and counties, including San Francisco.\nSUGGESTED: Some California lawmakers want to repeal sanctuary state laws\nThe backstory:\nOver the last few months, Trump has issued several executive orders targeting sanctuary cities and policies that the administration says inhibit federal immigration enforcement. Sanctuary policies typically limit local officials' cooperation with federal immigration officials.\nSUGGESTED: LA County not in DOJ's new 'sanctuary jurisdictions' list\nThe Justice Department has published a list of cities, counties and states that they allege are \"obstructing federal immigration law enforcement\" with their sanctuary policies. That list was updated earlier this month, and includes the state of California, the city of Los Angeles and more than 30 other jurisdictions across the U.S.\nThe Justice Department has also sued several cities, including Los Angeles, over sanctuary policies.\nWhat they're saying:\nTrump has claimed that sanctuary cities \"protect the Criminals, not the Victims. They are disgracing our Country, and are being mocked all over the World. Working on papers to withhold all Federal Funding for any City or State that allows these Death Traps to exist!!!\"\nTrump has not pubically commented on Friday's ruling.\nThe Source: Information in this story is from the Associated Press, the U.S. Justice Department, the White House website and previous FOX 11 reports."
    },
    {
      "news_title": "Trump administration can't deny funding to 'sanctuary' cities like Portland, judge says",
      "news_link": "https://katu.com/news/local/trump-administration-cant-deny-funding-to-sanctuary-cities-like-portland-judge-says",
      "bias": "Center",
      "text": "A federal judge late on Friday ruled the Trump administration cannot deny funding to Portland and 33 other cities and counties over “sanctuary” policies.\nU.S. District Judge William Orrick in San Francisco extended a preliminary injunction blocking the administration from cutting off or conditioning the use of federal funds for \"sanctuary\" jurisdictions if they don't cooperate with immigration enforcement.\nKATU has reached out to local leaders for their response to the ruling.\nThe Trump administration has ratcheted up pressure on those communities as it seeks to make good on President Donald Trump’s campaign promise to remove millions of people in the country illegally.\nOne executive order issued by Trump directs Attorney General Pam Bondi and Homeland Security Secretary Kristi Noem to withhold federal money from sanctuary jurisdictions. Another order directs every federal agency to ensure that payments to state and local governments do not “abet so-called ‘sanctuary’ policies that seek to shield illegal aliens from deportation.”\nThe cities and counties that sued said billions of dollars were at risk.\nAn email to the White House late Friday was not immediately returned.\nIn May, the Department of Homeland Security published a list of more than 500 “sanctuary jurisdictions,” saying each one would receive formal notification that the government had deemed them noncompliant. It also said it would inform them if they were believed to be in violation of any federal criminal statutes.\nThe list was later removed from the department’s website after critics noted it included localities that have actively supported the administration’s tough immigration policies.\nThe Justice Department has sued New York, Los Angeles and other cities over their sanctuary policies.\nThere is no strict definition for sanctuary cities, but the terms generally describes places that limit cooperation with Immigration and Customs Enforcement. ICE enforces immigration laws nationwide but seeks help from state and local authorities to identify immigrants wanted for deportation and hold them for federal officers."
    },
    {
      "news_title": "Judge blocks Trump from cutting funding from 34 cities and counties over 'sanctuary' policies",
      "news_link": "https://www.krem.com/article/news/nation-world/judge-blocks-trump-funding-cut-sanctuary-cities/507-11d76773-853e-480e-81f1-14ac69cc0645",
      "bias": "Center",
      "text": "WASHINGTON D.C., DC — A judge ruled late Friday the Trump administration cannot deny funding to Boston, Chicago, Denver, Los Angeles and 30 other cities and counties because of policies that limit cooperation with federal immigration efforts.\nU.S. District Judge William Orrick in San Francisco extended a preliminary injunction blocking the administration from cutting off or conditioning the use of federal funds for so-called “sanctuary” jurisdictions. His earlier order protected more than a dozen other cities and counties, including San Francisco, Portland and Seattle.\nThe Trump administration has ratcheted up pressure on those communities as it seeks to make good on President Donald Trump’s campaign promise to remove millions of people in the country illegally.\nOne executive order issued by Trump directs Attorney General Pam Bondi and Homeland Security Secretary Kristi Noem to withhold federal money from sanctuary jurisdictions. Another order directs every federal agency to ensure that payments to state and local governments do not “abet so-called ‘sanctuary’ policies that seek to shield illegal aliens from deportation.”\nThe cities and counties that sued said billions of dollars were at risk.\nAn email to the White House late Friday was not immediately returned.\nIn May, the Department of Homeland Security published a list of more than 500 “sanctuary jurisdictions,” saying each one would receive formal notification that the government had deemed them noncompliant. It also said it would inform them if they were believed to be in violation of any federal criminal statutes.\nThe list was later removed from the department’s website after critics noted it included localities that have actively supported the administration’s tough immigration policies.\nThe Justice Department has sued New York, Los Angeles and other cities over their sanctuary policies.\nThere is no strict definition for sanctuary cities, but the terms generally describes places that limit cooperation with Immigration and Customs Enforcement. ICE enforces immigration laws nationwide but seeks help from state and local authorities to identify immigrants wanted for deportation and hold them for federal officers.\nCopyright 2025 Associated Press. All rights reserved. This material may not be published, broadcast, rewritten, or redistributed."
    },
    {
      "news_title": "Judge Blocks Trump Administration From Cutting Funds to Sanctuary Cities",
      "news_link": "https://www.polialert.com/political-news/judge-blocks-trump-administration-from-cutting-funds-to-sanctuary-cities/",
      "bias": "unknown",
      "text": "A federal judge late Friday ruled the Trump administration cannot withhold federal funding from Boston, Chicago, Denver, Los Angeles and more than 30 other cities and counties over their policies limiting cooperation with federal immigration enforcement.\nU.S. District Judge William Orrick, sitting in San Francisco, extended a preliminary injunction that prevents the administration from conditioning or cutting off funds to so-called sanctuary jurisdictions. His earlier order had already protected more than a dozen other cities, including San Francisco, Portland and Seattle.\nIn his decision, Orrick said the administration offered no substantive opposition to expanding the injunction beyond arguing that his initial order was incorrect. The government has appealed that first ruling. Orrick also barred the Justice Department from imposing immigration-related conditions on two specific grant programs.\nThe ruling is the latest blow to President Donald Trump’s push to pressure sanctuary cities, part of a broader effort to fulfill his campaign promise to deport millions of undocumented immigrants. One executive order signed by Trump directed Attorney General Pam Bondi and Homeland Security Secretary Kristi Noem to block federal funds from sanctuary jurisdictions. Another ordered all federal agencies to ensure that payments to state and local governments do not “abet” policies shielding undocumented immigrants from deportation.\nOrrick, an Obama appointee, called the orders an unconstitutional “coercive threat.” Cities and counties argued that billions of dollars in federal funding were at stake.\nIn May, the Department of Homeland Security published a list of more than 500 sanctuary jurisdictions it deemed noncompliant, warning they would be formally notified of possible violations. That list was later removed after critics noted it included localities that had actively cooperated with federal immigration authorities.\nThe Justice Department has also pursued separate lawsuits against New York, Los Angeles and other cities over their sanctuary policies.\nThere is no formal legal definition of a “sanctuary city,” but the term generally refers to jurisdictions that limit cooperation with U.S. Immigration and Customs Enforcement. While ICE enforces federal immigration laws nationwide, it relies on state and local governments to identify and hold individuals for deportation."
    },
    {
      "news_title": "Obama Judge Blocks Trump From Defunding Sanctuary Cities",
      "news_link": "https://www.domigood.com/2025/08/obama-judge-blocks-trump-from-defunding.html",
      "bias": "unknown",
      "text": "An Obama-appointed judge ruled on Friday that President Donald Trump can’t cut federal funding from dozens of cities and counties that officials have deemed “sanctuaries” for illegal immigrants.\nU.S. District Judge William Orrick, who was appointed by former President Barack Obama in 2012, extended a preliminary injunction to block the Trump administration from pulling federal funds, or attaching immigration conditions to federal funds for local jurisdictions, according to a Fox News report.\nThe ruling protects more than 30 sanctuary jurisdictions, including Los Angeles, Baltimore, Boston, and Chicago.\nOrrick additionally blocked Trump from placing similar immigration-related conditions on two grant programs.\nThe judge argued that Trump’s action to protect Americans from unvetted illegal immigrants, specifically by threatening to withhold federal funding, is unconstitutional coercion.\nIn January, Trump signed an executive order to cut off federal funding for sanctuary jurisdictions, moving to fulfill a widely-supported campaign promise. The EO, called “Protecting the American People Against Invasion,” directs the DOJ and the Department of Homeland Security to ensure “sanctuary jurisdictions” do not receive federal money. It further directs the DOJ and DHS to “evaluate and undertake any other lawful actions, criminal or civil, that they deem warranted based on any such jurisdiction’s practices that interfere with the enforcement of Federal law.”\nThe administration has also targeted the worst of the worst, suing Los Angeles and New York City for such policies. The DOJ sued Los Angeles in June, arguing that city policies barring city resources from aiding in immigration enforcement operations or collecting information about individuals’ citizenship status violate federal law, Reuters reported. A month later, the DOJ took action against New York City for related immigration reasons.\nTrump has spoken fiercely about wanting to defund sanctuary jurisdictions, deeming them a threat to the American people and the rule of law.\n“No more Sanctuary Cities! They protect the Criminals, not the Victims. They are disgracing our Country, and are being mocked all over the World,” Trump posted back in April on Truth Social. “Working on papers to withhold all Federal Funding for any City or State that allows these Death Traps to exist!!!”\nNo comments:\nPost a Comment"
    },
    {
      "news_title": "Hands Off City Cash, Judge Tells Trump - Asian News from UK",
      "news_link": "https://asianlite.com/2025/top-news/hands-off-city-cash-judge-tells-trump/",
      "bias": "unknown",
      "text": "The court’s latest order underscores a growing judicial pushback against efforts by the Trump administration to penalize sanctuary communities….reports Asian Lite News\nA federal judge in San Francisco has ruled that the Trump administration cannot strip funding from dozens of American cities and counties because of their so-called “sanctuary” policies, delivering a significant setback to one of the former president’s most contentious immigration initiatives.\nLate on Friday, US District Judge William Orrick extended an earlier injunction that prevented the administration from cutting off or conditioning federal funds to jurisdictions that limit cooperation with federal immigration authorities. His decision now protects major cities including Boston, Chicago, Denver and Los Angeles, along with more than 30 other counties across the country. The ruling builds upon an initial injunction that had already safeguarded places such as San Francisco, Portland and Seattle.\nAccording to a report from Arab News, the court’s latest order underscores a growing judicial pushback against efforts by the Trump administration to penalize sanctuary communities. These jurisdictions, which have adopted policies to restrict cooperation with federal immigration enforcement, have long been in the crosshairs of Washington. The administration argued that withholding funds was necessary to pressure local governments into compliance. However, Judge Orrick said the government had failed to provide any legal basis for such measures, describing them instead as unconstitutional coercion.\nIn his ruling, Orrick emphasised that the Justice Department had made little effort to defend its stance beyond asserting that his earlier injunction was incorrect. The administration has already filed an appeal against that order. He further prohibited officials from attaching immigration-related conditions to two specific grant programmes, a move that could have impacted billions of dollars in federal aid.\nThe Trump administration had repeatedly sought to escalate pressure on sanctuary jurisdictions as part of a wider immigration crackdown, promising to remove millions of undocumented immigrants. Executive orders signed by Trump directed the attorney general and the secretary of homeland security to withhold federal money from cities deemed uncooperative. Another directive called on federal agencies to ensure no funding inadvertently supported policies that, in the administration’s view, shielded undocumented immigrants from deportation.\nSanctuary cities and counties argued in court that the stakes were extraordinarily high, with billions in federal funding potentially at risk. Orrick, who was appointed by President Barack Obama, sided with them, labelling the administration’s orders and subsequent actions as unconstitutional “coercive threats.”\nIn May of that year, the Department of Homeland Security had released a list of more than 500 alleged sanctuary jurisdictions, vowing to notify each one formally of its noncompliance. The list, however, was later taken down following criticism that it included localities which had, in fact, supported aspects of the administration’s immigration policy.\nMeanwhile, the Justice Department has filed lawsuits against several major cities, including New York and Los Angeles, in a continued effort to challenge sanctuary policies. While there is no universally accepted definition of a sanctuary city, the term generally refers to localities that limit cooperation with US Immigration and Customs Enforcement. ICE is responsible for enforcing federal immigration law but depends heavily on state and local authorities to identify and detain individuals targeted for deportation."
    },
    {
      "news_title": "Judge blocks Trump admin from withholding funding to 34 cities and counties over 'sanctuary' policies - The Pulse of NH",
      "news_link": "https://thepulseofnh.com/judge-blocks-trump-admin-from-withholding-funding-to-34-cities-and-counties-over-sanctuary-policies/",
      "bias": "unknown",
      "text": "Judge blocks Trump admin from withholding funding to 34 cities and counties over ‘sanctuary’ policies\n(WASHINGTON) -- A federal judge halted the Trump administration's efforts to withhold grant funding from \"sanctuary\" cities and counties for not cooperating with immigration enforcement.\nThe 15-page order from Judge William Orrick grants a preliminary injunction in the administration's effort to withhold funds and expands the number of cities that federal funds can't be withheld from due to their \"sanctuary\" status for undocumented immigrants.\nThe Trump administration has sought to strip the cities' Housing and Urban Development (HUD) grants due to their lack of cooperation with immigration authorities.\nMore than 30 cities from Albuquerque to Boston were under the ruling -- which amounts to hundreds of millions of dollars in grants.\nThe Trump administration has been increasing its efforts to have so-called \"sanctuary cities\" cooperate with the federal government.\nThe Department of Justice in recent months has filed several legal challenges in several cities and states including New York City, New York state, Los Angeles, Colorado, Illinois, New Jersey, challenging policies that that blocked immigration officials from arresting people at or near courthouses without a warrant signed by a judge.\nCopyright © 2025, ABC Audio. All rights reserved."
    },
    {
      "news_title": "Judge Blocks Trump From Withholding Funds From Los Angeles, Other Sanctuary Cities",
      "news_link": "https://gvwire.com/2025/08/23/judge-blocks-trump-from-withholding-funds-from-los-angeles-other-sanctuary-cities/",
      "bias": "unknown",
      "text": null
    },
    {
      "news_title": "Judge blocks Trump admin from withholding funding to 34 cities and counties over ‘sanctuary’ policies - Connect FM | Local News Radio | Dubois, PA",
      "news_link": "https://www.connectradio.fm/abc-national/judge-blocks-trump-admin-from-withholding-funding-to-34-cities-and-counties-over-sanctuary-policies/",
      "bias": "unknown",
      "text": null
    },
    {
      "news_title": "Judge blocks Trump admin from withholding funding to 34 cities and counties over 'sanctuary' policies | TALK! 100.7 FM",
      "news_link": "https://wutqfm.com/judge-blocks-trump-admin-from-withholding-funding-to-34-cities-and-counties-over-sanctuary-policies/",
      "bias": "unknown",
      "text": "Suspect accused of shooting ex-wife at a Detroit hospital taken into custody\nAugust 23, 2025Russia hits Ukraine with drones as Kyiv celebrates independence day\nAugust 24, 2025Judge blocks Trump admin from withholding funding to 34 cities and counties over ‘sanctuary’ policies\n(WASHINGTON) — A federal judge halted the Trump administration’s efforts to withhold grant funding from “sanctuary” cities and counties for not cooperating with immigration enforcement.\nThe 15-page order from Judge William Orrick grants a preliminary injunction in the administration’s effort to withhold funds and expands the number of cities that federal funds can’t be withheld from due to their “sanctuary” status for undocumented immigrants.\nThe Trump administration has sought to strip the cities’ Housing and Urban Development (HUD) grants due to their lack of cooperation with immigration authorities.\nMore than 30 cities from Albuquerque to Boston were under the ruling — which amounts to hundreds of millions of dollars in grants.\nThe Trump administration has been increasing its efforts to have so-called “sanctuary cities” cooperate with the federal government.\nThe Department of Justice in recent months has filed several legal challenges in several cities and states including New York City, New York state, Los Angeles, Colorado, Illinois, New Jersey, challenging policies that that blocked immigration officials from arresting people at or near courthouses without a warrant signed by a judge.\nCopyright © 2025, ABC Audio. All rights reserved."
    },
    {
      "news_title": "Judge blocks Trump from cutting funding over 'sanctuary' policies - TPR: The Public's Radio",
      "news_link": "https://thepublicsradio.org/npr/judge-blocks-trump-from-cutting-funding-over-sanctuary-policies/",
      "bias": "unknown",
      "text": "A judge ruled late Friday the Trump administration cannot deny funding to Boston, Chicago, Denver, Los Angeles and 30 other cities and counties because of policies that limit cooperation with federal immigration efforts.\nU.S. District Judge William Orrick in San Francisco extended a preliminary injunction blocking the administration from cutting off or conditioning the use of federal funds for so-called “sanctuary” jurisdictions. His earlier order protected more than a dozen other cities and counties, including San Francisco, Portland and Seattle.\nAn email to the White House late Friday was not immediately returned. In his ruling, Orrick said the administration had offered no opposition to an extended injunction except to say the first injunction was wrong. It has appealed the first order.\nOrrick also blocked the administration from imposing immigration-related conditions on two particular grant programs.\nThe Trump administration has ratcheted up pressure on sanctuary communities as it seeks to make good on President Donald Trump’s campaign promise to remove millions of people in the country illegally.\nOne executive order issued by Trump directs Attorney General Pam Bondi and Homeland Security Secretary Kristi Noem to withhold federal money from sanctuary jurisdictions. Another order directs every federal agency to ensure that payments to state and local governments do not “abet so-called ‘sanctuary’ policies that seek to shield illegal aliens from deportation.”\nThe cities and counties that sued said billions of dollars were at risk.\nOrrick, who was nominated by President Barack Obama, said the executive orders and the “executive actions that have parroted them” were an unconstitutional “coercive threat.”\nIn May, the Department of Homeland Security published a list of more than 500 “sanctuary jurisdictions,” saying each one would receive formal notification that the government had deemed them noncompliant. It also said it would inform them if they were believed to be in violation of any federal criminal statutes.\nThe list was later removed from the department’s website after critics noted it included localities that have actively supported the administration’s tough immigration policies.\nThe Justice Department has also sued New York, Los Angeles and other cities over their sanctuary policies.\nThere is no strict definition for sanctuary cities, but the terms generally describe places that limit cooperation with Immigration and Customs Enforcement. ICE enforces immigration laws nationwide but seeks help from state and local authorities to identify immigrants wanted for deportation and hold them for federal officers."
    },
    {
      "news_title": "Judge blocks Trump from cutting funding to dozens of \"sanctuary\" citi...",
      "news_link": "https://areyoupop.com/judge-blocks-trump-from-cutting-funding-to-dozens-of-sanctuary-citi/",
      "bias": "unknown",
      "text": "A federal judge on Friday blocked the Trump administration from cutting off federal funding to dozens of “sanctuary” cities and counties — covering several of the largest cities in the U.S.\nThe judge had previously ruled in April that it was unconstitutional for President Trump to freeze funding for local governments that limit their cooperation with Immigration and Customs Enforcement…\n…\nContinue reading this article at;\nhttps://www.cbsnews.com/news/judge-blocks-trump-cutting-funding-sanctuary-cities-los-angeles-chicago/\nhttps://www.cbsnews.com/news/judge-blocks-trump-cutting-funding-sanctuary-cities-los-angeles-chicago/\nwww.cbsnews.com\nFeed Name : Home – CBSNews.com\nhashtags : #Judge #blocks #Trump #cutting #funding #dozens #sanctuary #citi..\n[gs-fb-comments]"
    },
    {
      "news_title": "Obama Judge Blocks Trump Admin From Withholding Funds From More Than 30 ‘Sanctuary Cities’ - Politics, Policy, Political Views",
      "news_link": "https://politicom.com.au/obama-judge-blocks-trump-admin-from-withholding-funds-from-more-than-30-sanctuary-cities/",
      "bias": "unknown",
      "text": "A federal judge out of San Francisco on Friday blocked President Trump from pulling federal funds from ‘sanctuary cities.’\nUS District Judge William Orrick, and Obama appointee, blocked Trump from withholding funds from Chicago, Boston, Los Angeles and more than 30 other sanctuary cities.\nThe Associated Press reported:\nA judge ruled late Friday the Trump administration cannot deny funding to Boston, Chicago, Denver, Los Angeles and 30 other cities and counties because of policies that limit cooperation with federal immigration efforts.\nU.S. District Judge William Orrick in San Francisco extended a preliminary injunction blocking the administration from cutting off or conditioning the use of federal funds for so-called “sanctuary” jurisdictions. His earlier order protected more than a dozen other cities and counties, including San Francisco, Portland and Seattle.\nEarlier this year Judge Orrick issued a preliminary injunction blocking Trump from withholding funding to other sanctuary cities like Portland and San Francisco.\nPresident Trump issued a flurry of executive orders – in his first term – and now in his second term – to withhold funds from jurisdictions harboring illegal aliens.\nSanta Clara, San Francisco and 14 other cities and counties sued the Trump Administration. They moved for a preliminary injunction blocking President Trump’s executive orders.\n“Here we go again,” Judge Orrick wrote in his 6-page order blasting Trump for his second round of executive orders aimed at ending the subsidization of open borders.\nIn 2017, Judge Orrick permanently blocked a similar executive order from Trump’s effort to defund sanctuary cities.\nThe judge said withholding funds from sanctuary jurisdictions is unconstitutional. He said it violates the Fifth and Tenth Amendments and also violates due process.\n“Precedent in the Ninth Circuit and the orders of this court show why the Cities and Counties have established that they are likely to prevail on the merits of at least their separation of powers, Spending Clause, and Fifth and Tenth Amendment claims. The challenged sections in the 2025 Executive Orders and the Bondi Directive that order executive agencies to withhold, freeze, or condition federal funding apportioned to localities by Congress, violate the Constitution’s separation of powers principles and the Spending Clause, as explained by the Ninth Circuit in the earlier iteration of this case in 2018; they also violate the Fifth Amendment to the extent they are unconstitutionally vague and violate due process,” the judge wrote in his order reviewed by The Gateway Pundit.\nThe post Obama Judge Blocks Trump Admin From Withholding Funds From More Than 30 ‘Sanctuary Cities’ appeared first on The Gateway Pundit."
    },
    {
      "news_title": "Judge blocks Trump from cutting funding from 34 cities and counties over ‘sanctuary’ policies - The Morning Sun",
      "news_link": "https://www.morningsun.net/stories/judge-blocks-trump-from-cutting-funding-from-34-cities-and-counties-over-sanctuary-policies,237475",
      "bias": "unknown",
      "text": null
    },
    {
      "news_title": "Judge blocks Trump from withholding funds from Los Angeles, other sanctuary cities - Regional Media News",
      "news_link": "https://www.regionalmedianews.com/news/national/politics/judge-blocks-trump-from-withholding-funds-from-los-angeles-other-sanctuary-cities/",
      "bias": "unknown",
      "text": "By Dietrich Knauth and Nate Raymond\n(Reuters) -A U.S. federal judge on Friday blocked Donald Trump’s administration from withholding federal funding from more than 30 so-called sanctuary jurisdictions including Los Angeles, Baltimore, Boston and Chicago that have declined to cooperate with the Republican president’s hardline immigration crackdown.\nU.S. District Judge William Orrick expanded an injunction that he initially issued in April covering 16 cities and counties including San Francisco, where he is based, to cover a new batch of local governments that recently joined the case and sought to be protected under his court order.\nThe lawsuit was filed after Trump signed two executive orders in January and February that the cities and counties said unlawfully threatened to cut off funding to them unless they cooperated with federal immigration law enforcement, including U.S. Immigration and Customs Enforcement.\nThose orders targeted so-called sanctuary jurisdictions that have laws and policies that limit or prevent local law enforcement from assisting federal officers with civil immigration arrests.\nOrrick on Friday said Trump’s orders “threaten to withhold all federal funding from the plaintiffs as sanctuary jurisdictions if they do not adapt their policies and practices to conform with the Trump administration’s preferences.”\n“That coercive threat (and any actions agencies take to realize that threat, or additional Executive Orders the President issues to the same end) is unconstitutional, so I enjoined its effect,” Orrick wrote. “I do so again today for the protection of the new parties in this case.”\nThe White House did not immediately respond to a request for comment. The Trump administration is already appealing Orrick’s earlier ruling.\nAmong the cities covered by Orrick’s new order is Los Angeles. Trump’s deployment in June of the National Guard to patrol Los Angeles after protests against intensified federal immigration raids is the subject of a separate lawsuit by California Governor Gavin Newsom.\n(Reporting by Dietrich Knauth in New York and Nate Raymond in Boston; Editing by Kim Coghill)\nBrought to you by www.srnnews.com"
    }
  ]
}