{
  "story_id": "GN_20250826_001042_8e83fff7",
  "metadata": {
    "title": "Trump nominates Sergio Gor to be next US ambassador to India",
    "timestamp": "2025-08-26T00:10:42.191528",
    "url": "https://ground.news/article/trump-white-house-personnel-honcho-sergio-gor-picked-as-ambassador-to-india-after-post-reporting-on-musk-feud-vetting-controversy"
  },
  "bias_distribution": {
    "total_sources": "138",
    "leaning_left": "14",
    "center": "25",
    "leaning_right": "25"
  },
  "perspective_summaries": {
    "left": [
      "President Donald Trump announced on August 22, 2025, that he would nominate Sergio Gor to be the next U.S. ambassador to India and special envoy for South and Central Asian affairs.",
      "Sergio Gor is currently the director of the White House Presidential Personnel Office and will remain in that role until confirmed by the U.S. Senate.",
      "Relations between the U.S. and India have soured due to increased U.S. tariffs, which will double to 50% from August 27, following India's oil purchases from Russia.",
      "Trump stated that Gor has been a close aide and has played a significant role in his administration."
    ],
    "center": [
      "On Friday, President Donald Trump said he would nominate Sergio Gor as U.S. ambassador to India, with Gor remaining White House personnel director until U.S. Senate confirmation.",
      "Amid a tariff clash that began with 25% duties, Trump first imposed additional tariffs then said they would double to 50% from August 27, straining U.S.-India trade talks over agriculture and dairy access.",
      "Gor will take on both ambassador and special envoy duties, with his nomination arriving nearly seven months after Eric Garcetti, former U.S. Ambassador to India, stepped down.",
      "The White House framed the pick as driven by trust, noting Trump called Sergio Gor `a great friend, who has been at my side for many years` and stressed his role to help `MAKE AMERICA GREAT AGAIN`.",
      "With more than $190 billion in bilateral trade at stake, U.S. Treasury Secretary Scott Bessent accused India of profiteering from Russian oil purchases, while stalled talks on agriculture and dairy market access intensify tensions."
    ],
    "right": [
      "President Donald Trump nominated Sergio Gor as the next U.S. ambassador to India and special envoy for South and Central Asian affairs, pending Senate confirmation.",
      "Sergio Gor, currently the director of the White House Presidential Personnel Office, will remain in his position until confirmed.",
      "Trump stated Gor's role has been essential in hiring nearly 4,000 personnel across the government and emphasized trust in Gor to advance his agenda.",
      "Relations between the U.S. and India are tense due to trade tariffs, with Trump recently doubling tariffs on Indian imports to 50%."
    ]
  },
  "sources": [
    {
      "news_title": "Trump names close political aide as India envoy",
      "news_link": "https://tribune.com.pk/story/2562869/trump-names-close-political-aide-as-india-envoy",
      "bias": "Center",
      "text": "President Donald Trump on Friday tapped close political aide Sergio Gor as US ambassador to India, sending one of his feared enforcers at a delicate time in ties with New Delhi.\nThe 38-year-old Gor rose quickly in conservative politics to become one of the most powerful, if low-profile, aides in the White House with a task of vetting some 4,000 appointees to ensure utmost loyalty to Trump.\nGor's enemies include Elon Musk, who following his spectacular falling-out with Trump branded Gor a \"snake\" after he scuttled the tech and aerospace billionaire's choice to lead NASA.\nGor's influence does not include extensive experience in foreign policy, beyond joining travel overseas and leading a purge of National Security Council staffers whose views were called into suspicion.\n\"For the most populous Region in the World, it is important that I have someone I can fully trust to deliver on my Agenda and help us, MAKE AMERICA GREAT AGAIN,\" Trump wrote on his Truth Social platform.\n\"Sergio will make an incredible Ambassador,\" he wrote.\nTrump wrote that Gor would also hold a role of special envoy for South and Central Asia.\nTrump has largely sidelined traditional diplomats and relied for diplomacy on personal friends, with the State Department's top position for South Asia still vacant.\nThe nomination comes after a spike in tensions with India, which the United States has prioritized as an emerging partner since the 1990s.\nTrump has moved to ramp up tariffs on India to pressure it over its purchases of energy from Russia, despite Trump's own diplomacy with counterpart Vladimir Putin.\nIndia in recent days has held top-level meetings with both Russia and China. Successive US administrations have viewed India as a balance against China, seen as the top US global rival.\nTrump has spoken of brokering between India and Pakistan after they reached a ceasefire in a brief conflict in May, although India has been hesitant on any direct US role.\nCOMMENTS\nComments are moderated and generally will be posted if they are on-topic and not abusive.\nFor more information, please see our Comments FAQ"
    },
    {
      "news_title": "Trump Personnel Director Gor Shuffled to India Ambassador Role",
      "news_link": "https://www.theamericanconservative.com/trump-personnel-director-gor-shuffled-to-india-ambassador-role/",
      "bias": "Right",
      "text": "Trump Personnel Director Gor Shuffled to India Ambassador Role\nPresident Donald Trump has chosen Sergio Gor, the director of presidential personnel, to be the next ambassador to India, he announced Friday on Truth Social. Trump depicted the nomination as a promotion, but he may have been offering a soft landing to the embattled staffer.\nSubscribe Today\nGet daily emails in your inbox\nGor sparked the fiery falling-out this summer between Trump and the world’s richest man Elon Musk, the New York Post reported. Gor had played a role in Trump's yanking the nomination of Jared Isaacman, a friend of Musk, as head of NASA, triggering a flurry of harsh insults between the president and former ally.\nRumors spread over the past week that Gor would be nominated ambassador to the small island nation Malta, which he calls his home country. But questions have emerged about Gor’s national origin, with the Times of Malta reporting last month that he was born in Uzbekistan.\nGor’s nomination to be ambassador to India comes at a time of elevated tensions between that country, the most populous in the world, and America. India faces a massive 50 percent tariff rate on exports to the United States, as Trump punishes its purchasing of Russian oil."
    },
    {
      "news_title": "Trump names Malta-raised Sergio Gor as US ambassador to India",
      "news_link": "https://timesofmalta.com/article/trump-names-maltalinked-sergio-gor-us-ambassador-india.1115090",
      "bias": "Center",
      "text": "President Donald Trump on Friday tapped close political aide Sergio Gor as US ambassador to India, sending one of his feared enforcers at a delicate time in ties with New Delhi.\nThe 38-year-old Gor rose quickly in conservative politics to become one of the most powerful, if low-profile, aides in the White House with a task of vetting some 4,000 appointees to ensure utmost loyalty to Trump.\nGor's enemies include Elon Musk, who following his spectacular falling-out with Trump branded Gor a \"snake\" after he scuttled the tech and aerospace billionaire's choice to lead NASA.\nGor's influence does not include extensive experience in foreign policy, beyond joining travel overseas and leading a purge of National Security Council staffers whose views were called into suspicion.\n\"For the most populous Region in the World, it is important that I have someone I can fully trust to deliver on my Agenda and help us, MAKE AMERICA GREAT AGAIN,\" Trump wrote on his Truth Social platform.\n\"Sergio will make an incredible Ambassador,\" he wrote.\nTrump wrote that Gor would also hold a role of special envoy for South and Central Asia.\nTrump has largely sidelined traditional diplomats and relied for diplomacy on personal friends, with the State Department's top position for South Asia still vacant.\nThe nomination comes after a spike in tensions with India, which the United States has prioritised as an emerging partner since the 1990s.\nTrump has moved to ramp up tariffs on India to pressure it over its purchases of energy from Russia, despite Trump's own diplomacy with counterpart Vladimir Putin.\nIndia in recent days has held top-level meetings with both Russia and China. Successive US administrations have viewed India as a balance against China, seen as the top US global rival.\nTrump has spoken of brokering between India and Pakistan after they reached a ceasefire in a brief conflict in May, although India has been hesitant on any direct US role.\nPolitical insider\nGor was born in Uzbekistan when it was still in the Soviet Union -- a background on which he has been discreet -- before moving as a child to Malta.\nAfter attending university in the United States, he became active in Republican Party politics, eventually taking top positions with Senator Rand Paul, a leading Republican critic of foreign interventionism, then working as a fund-raiser and book publisher for Trump -- and as an amateur wedding DJ.\nIn his post, Trump hailed Gor's work as director of presidential personnel, saying that 95 percent of positions have been filled and that he will stay on until the Republican-led Senate confirms him as ambassador.\nSecretary of State Marco Rubio quickly endorsed Gor on X, saying he would be an \"excellent representative of America in one of the most important relationships our nation has in the world.\"\nTrump named an ambassador to India later than for many other major countries.\nWhile presidents have often tapped political aides as ambassador -- former president Joe Biden sent former White House chief of staff Rahm Emanuel to Tokyo -- India has an illustrious history of seeing public intellectuals as ambassador.\nUS ambassadors to India have included prominent economist John Kenneth Galbraith and the social scientist and future senator Daniel Patrick Moynihan.\nBiden's ambassador to India was Eric Garcetti, a former mayor of Los Angeles known for his interest in Indian philosophy and who had studied Hindi and Urdu as a young man."
    },
    {
      "news_title": "Publisher, Republican staffer, White House aide—Trump appoints Sergio Gor as new US ambassador to India",
      "news_link": "https://theprint.in/world/publisher-republican-staffer-white-house-aide-trump-appoints-sergio-gor-as-new-us-ambassador-to-ind/2727364/",
      "bias": "Lean Right",
      "text": "New Delhi: US President Donald Trump Friday appointed loyalist and director of the White House Presidential Personnel Office Sergio Gor as the next American ambassador to India, even as ties between New Delhi and Washington DC have been severely strained in recent weeks.\n“I am pleased to announce that I am promoting Sergio Gor to be our next United States Ambassador to the Republic of India, and Special Envoy for South and Central Asian Affairs. As Director of Presidential Personnel, Sergio and his team have hired nearly 4,000 America First Patriots across every Department of our Federal Government in RECORD time,” Trump said in a post on his social media platform Truth Social.\nHe added: “For the most populous Region in the World, it is important that I have someone I can fully trust to deliver on my Agenda and help us, MAKE AMERICA GREAT AGAIN. Sergio will make an incredible Ambassador. Congratulations Sergio!”\nThe post of ambassador to India has remained vacant since Trump assumed the Presidency on 20 January. America’s previous ambassador to India was Eric Garcetti, the former mayor of Los Angeles.\nGor, born in 1986, will not only be the US’ envoy to India, but also the “Special Envoy for South and Central Asian Affairs”, which is being clubbed together with his role, which will be new for New Delhi to make sense of. Gor’s appointment is subject to Senate confirmation and until then he will remain director of personnel.\n“Beyond grateful to Donald Trump for his incredible trust and confidence in nominating me to be his next U.S. Ambassador to India and Special Envoy for South and Central Asian Affairs! Nothing has made me prouder than to serve the American people through the GREAT work of this Administration! Our White House has achieved historic results in MAKING AMERICA GREAT AGAIN! It will be the honor of my life to represent the United States,” Gor said in a post on the social media platform X.\nSenior Trump administration officials including Vice President J. D. Vance, Secretary of Health Robert F. Kennedy Jr., Secretary of Commerce Howard Lutnick, Treasury Secretary Scott Bessent and Secretary of the Department of Homeland Security Kristi Noem have all come out in support of Gor’s appointment.\n“I am excited about the President’s decision to nominate Sergio Gor to be our next Ambassador to India. He will be an excellent representative of America in one of the most important relationships our nation has in the world,” US Secretary of State Marco Rubio said in a statement on X.\nGor’s appointment comes at a delicate moment in India-US ties that have hit a rough patch. From floundering negotiations for a bilateral trade deal, to criticisms over the purchase of Russian oil, to Trump’s oft repeated claim of bringing peace to the India-Pakistan conflict, the last few months have seen a number of irritants in the relationship.\nOn 6 August, Trump announced the imposition of additional tariffs of 25 percent on India due to New Delhi’s purchase of Russian oil. The penalty tariffs are set to kick in at the end of the month, which will see New Delhi’s total levies hit 50 per cent—one of the highest amongst American trading partners.\nHowever, while Trump aide Peter Navarro and Treasury Secretary Bessent have been launching broadsides against India for the purchase of Russian crude, both Rubio and Kennedy have come out to describe ties with New Delhi positively.\n“Congratulations Sergio Gor, our next Ambassador to India. Your leadership will reinforce America’s partnership with India and advance our shared interests,” Kennedy said in a post on X.\nFrom book publisher to White House aide\nGor has been involved with Republican politicians for the better part of the last two decades. However, his growth in Trump’s second administration comes along with his nearly half-decade long business partnerships with the President’s son Donald Trump Jr.\nThe White House aide is reported to have been born in Uzbekistan in the erstwhile Soviet Union in 1986, before his parents reportedly moved to Malta before emigrating to the US at the end of the last millennium.\nIn 2008, Gor is said to have worked for the Presidential campaign of Republican nominee John McCain before going on to be the spokesperson for a number of Republican representatives including Steve King in 2010 and Michele Bachmann in 2011.\nA couple of years later Gor joined a political action committee (PAC) supporting Senator Rand Paul, and eventually became the Senator’s deputy chief of staff in 2018. Eventually in 2020 Gor moved to become the chief of staff to the Trump Victory Finance Committee, a joint fundraising committee between the Republican National Committee and the Trump campaign.\nIn 2021 along with Trump Jr., Gor launched Winning Team Publishing to “promote authors that represent the Silent Majority”. Eventually Gor was appointed director of personnel in the incoming White House in November 2024 and has been handling the staffing across the government.\nHis ascent into Trump’s orbit indicates that New Delhi will soon have an ambassador who likely has more access to the US President."
    },
    {
      "news_title": "Trump appoints Sergio Gor as ambassador to India",
      "news_link": "https://gazette.com/news/wex/trump-appoints-sergio-gor-as-ambassador-to-india/article_d09bde28-5da1-5c6b-96eb-02ea614638ec.html",
      "bias": "Center",
      "text": "President Donald Trump nominated Sergio Gor, currently a White House official, to be the new ambassador to India.\nGor, who has been serving as director of the White House Presidential Personnel Office, will also serve as the special envoy for South and Central Asian Affairs, pending Senate confirmation.\nIn his announcement, Trump praised Gor's work in the White House advising him on hiring decisions.\n\"As Director of Presidential Personnel, Sergio and his team have hired nearly 4,000 America First Patriots across every Department of our Federal Government in RECORD time — Our Departments and Agencies are over 95% filled!\" the president posted on Truth Social. \"Sergio’s role as Director of Presidential Personnel has been essential to delivering on the unprecedented Mandate that we received from the American People.\"\nTrump also pointed to the close relationship he has with Gor, who has previously led a pro-Trump super PAC and cofounded a book publisher with one of the president's sons, Donald Trump Jr.\n\"For the most populous Region in the World, it is important that I have someone I can fully trust to deliver on my Agenda and help us, MAKE AMERICA GREAT AGAIN. Sergio will make an incredible Ambassador. Congratulations Sergio!\" Trump added.\nIf confirmed, Gor will vacate his position in the White House, with speculation already pouring in on who could fill it.\nSteve Bannon, a chief strategist in Trump's first term, suggested right-wing influencer Laura Loomer is on the short list.\n\"Loomer has to be on the short list as potential replacement given her expertise in the vetting arena,\" he wrote on social media.\nLoomer waded into the speculation herself, telling Politico it would be an \"honor\" to serve in the Trump administration if she was offered the White House position.\nA possible White House role for Loomer follows her already outsized influence on Trump's hiring decisions in his second term, targeting top officials in key agencies over alleged disloyalty to Trump and his agenda.\nThat would appear to align with Gor's hiring decisions, as he is known for his strict policy of not hiring Trump critics.\nSome of those decisions led to a spat with former Trump senior adviser Elon Musk, who called Gor a \"snake\" after he blocked the nomination of his friend, Jared Isaacman, for NASA administrator.\nLAURA LOOMER'S INFLUENCE GROWS AS SHE CARVES OUT ROLE AS TRUMP'S OUTSIDE VETTER-IN-CHIEF\nAs for Gor's potential new role, his appointment comes amid tense relations with India, particularly over the South Asian country's continued purchasing of Russian oil.\nEarlier this month, Trump doubled the tariff on Indian imports to 50% as a result."
    },
    {
      "news_title": "Trump nominates personnel chief to be U.S. ambassador to India",
      "news_link": "https://www.washingtonpost.com/world/2025/08/23/sergio-gor-trump-india-ambassador/",
      "bias": "Lean Left",
      "text": null
    },
    {
      "news_title": "Trump taps Sergio Gor as next US ambassador to India",
      "news_link": "https://www.dw.com/en/trump-taps-sergio-gor-as-next-us-ambassador-to-india/a-73738606",
      "bias": "Center",
      "text": "Trump taps Sergio Gor as next US ambassador to India\nAugust 23, 2025US President Donald Trump said Friday he would nominate Sergio Gor to be Washington's next ambassador to India.\nGor, one of Trump's closest aides who currently serves as the director of the White House Presidential Personnel Office, will oversee frosty relations with New Delhi.\nBilateral ties have soured over the planned doubling of US tariffs on goods from India next week.\nGor will also serve as a special envoy for South and Central Asian affairs, the US president confirmed.\nWhat did Trump say about the nomination?\nTrump said in a post on his Truth Social platform that Gor would remain in his current position until he is confirmed for the India post by the US Senate.\n\"Sergio is a great friend, who has been at my side for many years,\" Trump said.\n\"For the most populous Region in the World, it is important that I have someone I can fully trust to deliver on my Agenda and help us, MAKE AMERICA GREAT AGAIN,\" Trump wrote.\nVice President JD Vance also hailed the appointment.\n\"Sergio is a great guy and will make a fantastic ambassador for our country to India,\" he wrote on X.\nHow have relations between the US and India deteriorated?\nRelations between the United States and India have been strained by Trump's trade war.\nTalks on lower tariff rates stalled after India, the world's fifth-largest economy, resisted opening its vast agricultural and dairy sectors.\nBilateral trade between Washington and New Delhi is worth more than $190 billion (€164 billion) each year.\nEdited by: Karl Sexton"
    },
    {
      "news_title": "Trump appoints Tashkent-born Sergio Gor as next US ambassador to India | Who is he?",
      "news_link": "https://www.indiatvnews.com/news/world/trump-appoints-tashkent-born-sergio-gor-as-next-us-ambassador-to-india-who-is-he-2025-08-23-1004743",
      "bias": "Lean Right",
      "text": "President Donald Trump on Friday (local time) appointed close political aide Sergio Gor as the next US ambassador to India, and special envoy for South and Central Asian affairs. Gor is currently the director of the White House Presidential Personnel Office and will remain in this role until his confirmation.\nAs a director of the White House Presidential Personnel Office, Gor and his team hired around 4,000 America First Patriots across every department of the federal government in 'record time', said Trump in a post on 'Truth Social', adding that his departments and agencies are 'over 95 per cent filled'.\nGor, Trump said, is his 'great friend', and extensively worked in his 'historic' presidential campaigns and had also published many of his best-selling books.\n\"Sergio’s role as Director of Presidential Personnel has been essential to delivering on the unprecedented Mandate that we received from the American People,\" Trump said.\n\"For the most populous Region in the World, it is important that I have someone I can fully trust to deliver on my Agenda and help us, MAKE AMERICA GREAT AGAIN,\" Trump said, while congratulating Gor.\nWho is Sergio Gor?\nBorn in Tashkent, Uzbekistan, on November 30, 1986, Gor's original last name was Gorokhovsky. In 1999, he and his family emigrated to Los Angeles, where he attended school. Later, he moved to George Washington University.\nWhile his mother is of Israeli origin, his father Yuri Gorokhovsky was an aviation engineer who used to work on aircraft designs for the Soviet military.\nDuring the 2008 US Presidential election, Gor supported Senator John McCain's presidential campaign. He has even worked for the Republican National Committee. In 2013, he was appointed as director for RANDPAC.\nHe began working with Trump in 2020 and played a key role in his Make America Great Again (MAGA) movement. After Trump returned to the office in 2024, Gor was announced as the director of the White House Presidential Personnel Office. Though Gor has now been appointed as the next US ambassador to India, he doesn't have much experience with the country."
    },
    {
      "news_title": "Trump names Uzbekistan-born close aide – and Musk foe – Sergio Gor ambassador to India",
      "news_link": "https://www.malaymail.com/news/world/2025/08/23/trump-names-uzbekistan-born-close-aide-and-musk-foe-sergio-gor-ambassador-to-india/188609",
      "bias": "Lean Right",
      "text": "WASHINGTON, Aug 23 — President Donald Trump on Friday tapped close political aide Sergio Gor as US ambassador to India, sending one of his feared enforcers at a delicate time in ties with New Delhi.\nThe 38-year-old Gor rose quickly in conservative politics to become one of the most powerful, if low-profile, aides in the White House with a task of vetting some 4,000 appointees to ensure utmost loyalty to Trump.\nGor’s enemies include Elon Musk, who following his spectacular falling-out with Trump branded Gor a “snake” after he scuttled the tech and aerospace billionaire’s choice to lead Nasa.\nGor’s influence does not include extensive experience in foreign policy, beyond joining travel overseas and leading a purge of National Security Council staffers whose views were called into suspicion.\n“For the most populous Region in the World, it is important that I have someone I can fully trust to deliver on my Agenda and help us, MAKE AMERICA GREAT AGAIN,” Trump wrote on his Truth Social platform.\n“Sergio will make an incredible Ambassador,” he wrote.\nTrump wrote that Gor would also hold a role of special envoy for South and Central Asia.\nTrump has largely sidelined traditional diplomats and relied for diplomacy on personal friends, with the State Department’s top position for South Asia still vacant.\nThe nomination comes after a spike in tensions with India, which the United States has prioritized as an emerging partner since the 1990s.\nTrump has moved to ramp up tariffs on India to pressure it over its purchases of energy from Russia, despite Trump’s own diplomacy with counterpart Vladimir Putin.\nIndia in recent days has held top-level meetings with both Russia and China. Successive US administrations have viewed India as a balance against China, seen as the top US global rival.\nTrump has spoken of brokering between India and Pakistan after they reached a ceasefire in a brief conflict in May, although India has been hesitant on any direct US role.\nPolitical insider\nGor was born in Uzbekistan when it was still in the Soviet Union – a background on which he has been discreet – before moving as a child to Malta.\nAfter attending university in the United States, he became active in Republican Party politics, eventually taking top positions with Senator Rand Paul, a leading Republican critic of foreign interventionism, then working as a fund-raiser and book publisher for Trump – and as an amateur wedding DJ.\nIn his post, Trump hailed Gor’s work as director of presidential personnel, saying that 95 percent of positions have been filled and that he will stay on until the Republican-led Senate confirms him as ambassador.\nSecretary of State Marco Rubio quickly endorsed Gor on X, saying he would be an “excellent representative of America in one of the most important relationships our nation has in the world.”\nTrump named an ambassador to India later than for many other major countries.\nWhile presidents have often tapped political aides as ambassador – former president Joe Biden sent former White House chief of staff Rahm Emanuel to Tokyo – India has an illustrious history of seeing public intellectuals as ambassador.\nUS ambassadors to India have included prominent economist John Kenneth Galbraith and the social scientist and future senator Daniel Patrick Moynihan.\nBiden’s ambassador to India was Eric Garcetti, a former mayor of Los Angeles known for his interest in Indian philosophy and who had studied Hindi and Urdu as a young man. — AFP"
    },
    {
      "news_title": "Trump nominates close aide Sergio Gor as US Ambassador to India",
      "news_link": "https://www.siasat.com/trump-nominates-close-aide-sergio-gor-as-us-ambassador-to-india-3262275/",
      "bias": "Lean Left",
      "text": "New York: President Donald Trump has nominated his longtime aide Sergio Gor, who is currently the Director of the White House Presidential Personnel Office, as the next US Ambassador to India.\nIn a social media post on Friday, Trump said Gor, 38, is a “great friend, who has been at my side for many years”.\n“I am pleased to announce that I am promoting Sergio Gor to be our next United States Ambassador to the Republic of India,” he said.\nHe would also serve as a special envoy for South and Central Asian affairs, Trump said.\nAppointment amid tariff tensions\nThe announcement comes amid tariff tensions between Washington and New Delhi.\nTrump said Gor and his team had overseen the hiring of nearly 4,000 officials across federal departments and agencies “in record time,” adding that over 95 per cent of positions were now filled.\nGor will remain in his current role at the White House until his confirmation by the Senate, he said.\n“Gor has worked on my historic presidential campaigns, published my best-selling books, and run one of the biggest Super PACs, which supported our movement,” Trump wrote.\nThe president described Gor’s role in the administration as “essential” in delivering on his political mandate.\n“For the most populous region in the world, it is important that I have someone I can fully trust to deliver on my agenda and help us make America great again. Sergio will make an incredible Ambassador. Congratulations Sergio!” Trump said.\nGor in a social media post said he is “beyond grateful” to Trump for his incredible trust and confidence in nominating him to be the next US Ambassador to India and Special Envoy for South and Central Asian Affairs.\n“It will be the honour of my life to represent the United States,” he said.\nGor will make fantastic ambassador: VP Vance\nVice President JD Vance, in a social media post, said Gor “will make a fantastic ambassador for our country to India”.\nGor will succeed Eric Garcetti, who served as ambassador from May 2023 to January 2025."
    },
    {
      "news_title": "Trump Nominates Sergio Gor as U.S. Ambassador to India, Special Envoy for South and Central Asia",
      "news_link": "https://www.breitbart.com/politics/2025/08/22/trump-nominates-sergio-gor-u-s-ambassador-india-special-envoy-south-central-asia/",
      "bias": "Right",
      "text": "President Donald Trump announced Friday that he has nominated Sergio Gor, currently serving as White House Director of Presidential Personnel, to become the next U.S. ambassador to India and special envoy for South and Central Asian affairs.\nTrump said Gor will remain in his current White House position until the Senate confirmation process is complete. “As Director of Presidential Personnel, Sergio and his team have hired nearly 4,000 America First Patriots across every Department of our Federal Government in RECORD time — Our Departments and Agencies are over 95% filled!” Trump wrote.\nThe president praised Gor as a longtime ally who played roles in Trump’s presidential campaigns, publishing his books, and leading Right for America, a pro-Trump super PAC. “For the most populous Region in the World, it is important that I have someone I can fully trust to deliver on my Agenda and help us, MAKE AMERICA GREAT AGAIN,” Trump stated, adding, “Sergio will make an incredible Ambassador.”\nGor, a Young America’s Foundation (YAF) alumnus and former president of the George Washington University YAF chapter, has been active in conservative politics since his college years. At GWU, he helped organize events featuring figures such as Sen. Rand Paul (R-KY) and former Fox News host Judge Jeanine Pirro. YAF previously noted that Gor’s work highlighted efforts to promote free speech and bring conservative speakers to campuses.\nBefore joining the Trump administration, Gor served as CEO of Winning Team Publishing, which released Trump’s best-selling books, including Letters to Trump and Save America.\nTrump first appointed Gor to lead the Presidential Personnel Office in November 2024, describing him and fellow adviser Steven Cheung as trusted members of his political team dating back to his 2016 campaign. Gor’s office has been central to staffing the Trump administration during his second term.\nCOMMENTS\nPlease let us know if you're having issues with commenting."
    },
    {
      "news_title": "Trump Announces Sergio Gor as Next US Ambassador to India",
      "news_link": "https://www.latestly.com/agency-news/world-news-trump-announces-sergio-gor-as-next-us-ambassador-to-india-7072975.html",
      "bias": "Right",
      "text": "Washington DC [US], August 23 (ANI): US President Donald Trump on Friday (local time) announced Sergio Gor as the next US Ambassador to India, and Special Envoy for South and Central Asian Affairs.\nAnnouncing on Truth Social, Donald Trump said, \"I am pleased to announce that I am promoting Sergio Gor to be our next United States Ambassador to the Republic of India, and Special Envoy for South and Central Asian Affairs. As Director of Presidential Personnel, Sergio and his team have hired nearly 4,000 America First Patriots across every Department of our Federal Government in RECORD time -- Our Departments and Agencies are over 95% filled! Sergio will remain in his current role at the White House until his confirmation.\"\nAddressing Gor as a \"great friend,\" Trump expressed his complete trust in him while noting his contributions to the White House Office of Presidential Personnel.\n\"Sergio is a great friend who has been at my side for many years. He worked on my Historic Presidential Campaigns, published my Best Selling Books, and ran one of the biggest Super PACs, which supported our Movement. Sergio's role as Director of Presidential Personnel has been essential to delivering on the unprecedented Mandate that we received from the American People. For the most populous Region in the World, it is important that I have someone I can fully trust to deliver on my Agenda and help us, MAKE AMERICA GREAT AGAIN. Sergio will make an incredible Ambassador. Congratulations Sergio!\"Trump wrote on Truth Social.\nSergio Gor will replace Eric Garcetti, who served from May 11, 2023, to January 20, 2025. Before Garcetti, Kenneth Juster held the position from November 23, 2017, to January 20, 2021. Since Garcetti's departure, the US Embassy in India has been led by interim Charge d'Affaires Jorgan K. Andrews, who took over on January 20, 2025\nIn his final weeks, Ambassador Garcetti delivered a series of speeches celebrating the historic progress the United States and India have made together, for the planet, for prosperity and for peace.\nSergio Gor's appointment as US Ambassador to India comes at a time when New Delhi is dealing with 50 per cent of trade tariffs, including a 25 per cent penalty for the oil purchases from Russia. (ANI)\n(The above story is verified and authored by ANI staff, ANI is South Asia's leading multimedia news agency with over 100 bureaus in India, South Asia and across the globe. ANI brings the latest news on Politics and Current Affairs in India & around the World, Sports, Health, Fitness, Entertainment, & News. The views appearing in the above post do not reflect the opinions of LatestLY)"
    },
    {
      "news_title": "Trump Names Sergio Gor as US Ambassador to India, Clubs Post With Special Envoy to South, Central Asia",
      "news_link": "https://thewire.in/diplomacy/trump-names-sergio-gor-as-us-ambassador-to-india-clubs-post-with-special-envoy-to-south-central-asia",
      "bias": "Lean Left",
      "text": "New Delhi: Seven months into his presidency and on the verge of imposing steep import tariffs, US President Donald Trump has nominated senior White House official Sergio Gor as ambassador to India, with an additional mandate as special envoy for South and Central Asia – a move that revives sensitivities in New Delhi over being linked to Pakistan.Making the announcement on his social media platform Truth Social, Trump wrote on Friday night that he was “promoting” White House Director of Presidential Personnel, 38-year-old Sergio Gor to be the next United States Ambassador to India, and Special Envoy for South and Central Asian Affairs.The State department’s bureau of South and Central Asian covers 13 countries in the region, which means that Gor would be supervising not just India, but also neighbouring Pakistan.New Delhi has long been prickly about any such hyphenation. Before President Obama formally appointed Richard Holbrooke as special representative for Afghanistan and Pakistan in 2009, early talk of extending his mandate to India had already drawn strong resistance from New Delhi. Officials lobbied hard to ensure that India was kept out of his title and portfolio, fearing any reference would open the door to outside involvement in Kashmir.According to a December 2008 US diplomatic cable released by Wikileaks, then foreign secretary Shivshankar Menon had told US officials that a “special envoy would be deeply unpopular and could negatively affect the gains in our bilateral relationship made over the past eight years”.A week later, in January 2009, then foreign minister Pranab Mukherjee conveyed his unease to outgoing US ambassador David Mulford, saying he was “deeply concerned about any move toward an envoy with a broad regional mandate that could be interpreted to include Kashmir.”Mulford wrote in his cable that Mukherjee had warned such a mandate “would be viewed by India as risky and unpredictable, exposing issues of vital concern to India to the discretion of the individual appointed. A special envoy smacks of interference and would be unacceptable.”As The New Yorker later noted, the backlash was so strong that Holbrooke joked he would finish his assignment without ever uttering the “K-word.”India’s position on the inclusion of this expanded mandate for the newly nominated US envoy is not yet clear.At an event in New Delhi on Saturday, External Affairs Minister S. Jaishankar was asked about Gor’s nomination. He said he had “read” about the appointment but declined to offer a view, noting: “Look, I am a foreign minister. I don’t comment on ambassadorial appointments of other countries in public.”Former Indian foreign secretary and ambassador to the United States Nirupama Rao told The Wire that Gor’s appointment underscored his role as a political loyalist rather than an independent-minded envoy. “Gor is not a navigator, he is no Huck Finn exploring the waters, a wanderer learning the river, he is a loyal ferryman. Washington is sending an envoy who rows to orders. The agenda will not be shaped by the river but by faraway shores. Gor is a political operator sent with a script. India might have hoped for someone navigating the currents of history; instead it gets someone rowing to orders,” she said.Another former foreign secretary, Kanwal Sibal, also raised objections to the dual role.He described it as “a version of the Special Envoy for India and Pakistan, which we rejected,” adding that by giving the ambassador himself a second mandate, Washington was “reviving the same approach in another form.” Sibal wrote that this amounted to “hyphenating India and Pakistan again” and warned that it blurred the Indo-Pacific focus of the partnership. He also argued that the sheer scale of the US mission in India, one of Washington’s largest embassies worldwide, with several consulates and a heavy bilateral agenda, made such “concurrent accreditation” unusual and problematic.The appointment comes at a time of strained ties between Washington and New Delhi. India bristled when Trump claimed credit for mediating a ceasefire between India and Pakistan following Operation Sindoor in May, insisting that the truce was achieved solely through bilateral military channels.Tensions deepened when Pakistani army chief General Asim Munir received an unprecedented lunch meeting with Trump just days after the fighting ended. Pakistan subsequently secured a trade agreement with Washington that lowered tariffs and included deals on oil reserves and cryptocurrency.Adding to the friction, the US is set to raise tariffs on Indian imports to 50 per cent from August 27, doubling the “reciprocal” duties already in place. Washington has justified the move as retaliation for India’s continued purchases of Russian oil. New Delhi has called the measure “unfair and unjustified.” Once implemented, India will face the highest US tariff rate in the world, alongside Brazil.Gor can only take up his post after confirmation by both the Senate and Congress. According to the American Foreign Service Association, as of August 4, Trump had nominated 61 ambassadors, with 45 still awaiting confirmation.In his announcement post, Trump described him as a “a great friend” who had worked on his presidential campaigns, published his books, and led a pro-Trump super PAC. Trump noted that Gor, as director of presidential personnel, had overseen the hiring of “nearly 4,000 America First Patriots” across government and would remain in that role until his confirmation. He added that for “the most populous region in the world,” he wanted someone he could “fully trust to deliver on my agenda,” declaring, “Sergio will make an incredible ambassador.”Gor, writing on X, stated that he was “beyond grateful” to Trump for his “incredible trust and confidence” in nominating him to be ambassador to India and special envoy for South and Central Asia. “Nothing has made me prouder than to serve the American people through the great work of this administration,” he said, adding that the White House had “achieved historic results in making America great again.”Calling the appointment “the honour of my life,” Gor declared: “It will be the honor of my life to represent the United States!”.Politico, citing a Trump administration official who requested anonymity, reported that Gor’s nomination was intended as “a powerful signal to the Modi government by sending an envoy that is very personally close to him.” The official added, “Sergio is a clear signal that the negotiations need to be serious and that all messages come from the president.”Steve Bannon, Trump’s former chief strategist, similarly argued that Gor’s closeness to the president would serve both countries. “I believe Sergio is the only person outside of [chief of staff] Susie Wiles and a handful of others who actually has walk-in privileges to the president at any time, day or night,” Bannon told the news outlet. “If I’m [Prime Minister Narendra] Modi in India – and I say this as somebody that’s so pro that relationship – I couldn’t think of a better pick.“Does he have a deep knowledge base of Indian policy issues? He doesn’t, but this guy’s a quick study. He not only has access to the president, but he has a unique trust. The president trusts this guy, that he’s dealing with him straight.”Gor, whose public biography in US media has often described him as Maltese-born, was reported by the Organized Crime and Corruption Reporting Project (OCCRP) and the Times of Malta to have actually been born Sergio Gorokhovsky in Tashkent, Uzbekistan, then part of the Soviet Union, in 1986. His lawyer confirmed his Soviet birthplace. Records indicate that he spent several years of his childhood in Malta, attending school while his family maintained property there, before emigrating to the United States, where he later became a citizen.Gor has become one of Trump’s most trusted loyalists. The Washington Post described him as “the most powerful man you’ve never heard of,” noting his pivotal role in overseeing the installation of some 4,000 political appointees in the administration.At the White House, Gor has played a central role in enforcing loyalty tests for appointments. His business partner and political ally, Donald Trump Jr. said earlier this year that “loyalty has got to be number one,” adding that Gor’s task was to ensure candidates were not only Republicans but also proven Trump supporters “on January 7th,” the day after the Capitol riot.Known for his extensive political network, he had worked at Fox News, served as spokesman for Senator Rand Paul, and co-founded Winning Team Publishing with Trump Jr., which produced Trump’s books and titles by conservative figures such as Peter Navarro and Charlie Kirk. He also ran the super PAC Right for America, which raised more than $70 million for Trump’s re-election campaign.Gor was also a fixture at Trump’s Florida estate, where allies dubbed him the “Mayor of Mar-a-Lago”, according to The Post profile. He was also known to be the DJ at conservative gatherings.But Gor has also attracted criticism. Former congressional colleagues described him to the news article as a “sweet-talking backstabber” bent on power, with one recalling that he named his pet beagle “Machiavelli.”More recently, the New York Post reported that Gor embarked on what was described as a “revenge tour” against Elon Musk, fanning criticism of the billionaire within Trump’s circle while boasting privately about Tesla’s stock drop. The rift reportedly stemmed from Gor’s role in advising Trump to rescind Musk’s ally’s NASA nomination, leading Musk to go public with scathing criticism of the administration thereafter.Another New York Post article noted that Gor himself has not undergone full vetting for his powerful personnel role, even as he vets thousands of others for administration jobs. Musk took the opportunity to take aim at Gor publicly by labelling him as “a snake” in a reaction to the report on Twitter."
    },
    {
      "news_title": "Trump Nominates Sergio Gor as US Ambassador to India",
      "news_link": "https://www.devdiscourse.com/article/politics/3591266-trump-nominates-sergio-gor-as-us-ambassador-to-india",
      "bias": "Center",
      "text": "Trump Nominates Sergio Gor as US Ambassador to India\nPresident Donald Trump has nominated Sergio Gor, a longtime aide, as the US Ambassador to India and Special Envoy for South and Central Asian affairs. Gor, who currently oversees the White House Presidential Personnel Office, will succeed Eric Garcetti amid US-India tariff tensions and will stay in his current role until confirmed.\n- Country:\n- United States\nPresident Donald Trump has appointed Sergio Gor, a pivotal figure within his team, as the United States Ambassador to India. Gor, currently directing the White House Presidential Personnel Office, is poised to tackle responsibilities as a Special Envoy for South and Central Asian affairs.\nThe announcement arrived amidst tariff disputes between Washington and New Delhi. Trump's announcement highlighted Gor's achievements, who has facilitated recruitment for nearly 4,000 federal positions under rapid timelines.\nPraising Gor's contributions to his administration, Trump expressed confidence in Gor's ability to advance US interests abroad. Gor, appreciative of the nomination, pledged his commitment to representing the US on the global stage after succeeding Eric Garcetti.\n(With inputs from agencies.)"
    },
    {
      "news_title": "Trump names 'great friend' Sergio Gor as next US ambassador to India, special envoy for South Asia",
      "news_link": "https://www.firstpost.com/world/trump-names-great-friend-sergio-gor-as-next-us-ambassador-to-india-special-envoy-for-south-asia-13927276.html",
      "bias": "Lean Right",
      "text": "US President Donald Trump on Friday (August 22) announced that he is appointing \" great friend\" Sergio Gor, the White House personnel director, as the next United States ambassador to India and special envoy for South and Central Asian Affairs.\nTrump described Gor as a “great friend” and one of the most influential figures in his administration. The appointment comes at a sensitive moment in relations with New Delhi, as Trump has imposed 25 per cent reciprocal tariffs on India along with an additional 25 per cent penalty over its trade ties with Russia.\n“I am pleased to announce that I am promoting Sergio Gor to be our next United States Ambassador to the Republic of India, and Special Envoy for South and Central Asian Affairs,” Trump posted on Truth Social. “Sergio and his team have hired nearly 4,000 America First Patriots across every Department of our Federal Government in RECORD time — Our Departments and Agencies are over 95% filled!”\nGor, who currently serves as director of the White House Presidential Personnel Office, will remain in the role until his confirmation, Trump said.\nThe president credited Gor with playing a central role in his “historic presidential campaigns,” publishing his best-selling books, and leading a major pro-Trump super PAC.\n“For the most populous Region in the World, it is important that I have someone I can fully trust to deliver on my Agenda and help us, MAKE AMERICA GREAT AGAIN. Sergio will make an incredible Ambassador. Congratulations Sergio!” Trump added.\nWho is Sergio Gor?\nSergio Gor was born as Sergio Gorokhovsky on November 30, 1986, in Tashkent, Uzbekistan. He later studied at George Washington University, where he became active with the College Republicans.\nGor began his political career working as a spokesman for Republican lawmakers including Michele Bachmann, Steve King, and Randy Forbes. In 2013, he became communications director for Senator Rand Paul’s PAC, RANDPAC, and continued to work closely with the Kentucky senator.\nImpact Shorts\nView AllIn 2021, he co-founded Winning Team Publishing, a conservative publishing house that has released multiple Trump-related titles such as Letters to Trump, Our Journey Together, and Save America. He also reportedly led Right for America, a pro-Trump PAC.\nIn November 2024, Trump appointed Gor as director of the White House Presidential Personnel Office, a position from which he will transition once confirmed as ambassador."
    },
    {
      "news_title": "Donald Trump nominates Sergio Gor as US ambassador to India: ‘Someone I can fully trust to…’",
      "news_link": "https://www.livemint.com/news/us-news/donald-trump-nominates-sergio-gor-as-us-ambassador-to-india-someone-i-can-fully-trust-to-11755906382006.html",
      "bias": "Center",
      "text": "US President Donald Trump said on Friday he nominated one of his closest aides, Sergio Gor, to be the next US ambassador to India.\nSergio Gor, who is currently the director of the White House Presidential Personnel Office, would also serve as a special envoy for South and Central Asian affairs.\n\"I am pleased to announce that I am promoting Sergio Gor to be our next United States Ambassador to the Republic of India, and Special Envoy for South and Central Asian Affairs,\" Trump said in a post on TRUTH social.\nThe US President said Gor would remain in his current position until he is confirmed for the India post by the US Senate.\n\"Sergio is a great friend, who has been at my side for many years. He worked on my Historic Presidential Campaigns, published my Best Selling Books, and ran one of the biggest Super PACs, which supported our Movement,\" Trump said, lauding Gor's work in hiring staff for his second term.\n\"For the most populous Region in the World, it is important that I have someone I can fully trust to deliver on my Agenda and help us, MAKE AMERICA GREAT AGAIN,\" Trump wrote.\nGor, in a posting on X, thanked Trump for the nomination and said it would be \"the honor of my life\" to represent the United States in the new role.\nTrump's announcement about Gor's nomination came shortly after the abrupt cancellation of a planned visit by US trade negotiators to New Delhi from August 25-29.\nTrump's loyalist Sergio Gor played a critical role in deciding who does and doesn’t get jobs in the current administration.\nAccording to Politico, Gor, in his role overseeing hiring across the administration, endeared himself to the president and his family for adopting a zero tolerance policy toward job-seekers who had been critical of Trump in the past, often scouring their social media posts and occasionally intervening to block hirings.\nGor began working with Trump in 2020, when he was chief of staff of the Trump Victory Finance Committee. He also was a senior advisor to MAGA Inc, and also led Right for America – a political action committee (PAC) – for Trump.\nHe was born in Tashkent, Uzbekistan, in 1986. At that time, it was part of Soviet Russia. He also spent some years in Malta.\nGor previously helped create a publishing venture that paid millions to Trump to produce his books when he was out of office, and ran a super PAC supporting the president in 2024.\nGor was valued by the president for his perceived loyalty, and his willingness to freeze out of government people he considered insufficiently pure in that regard, the New York Times reported.\nMoreover, Gor was reportedly involved in providing Trump information that Jared Isaacman, a businessman and ally of Musk whom Trump picked in late 2024 to lead NASA on Musk’s recommendation, had donated money to Democrats in the recent past.\nTrump's announcement came at a crucial time for the US-India relations that seems to have worsened with the planned doubling of US tariffs on goods from India next week.\nUS-India ties have been strained by Trump's trade war, with talks on lower tariff rates collapsing after India resisted opening its vast agricultural and dairy sectors, Reuters reported.\nBilateral trade between the two countries is worth more than $190 billion each year.\nTrump first imposed additional tariffs of 25% on imports from India, then said they would double to 50% from August 27 as punishment for New Delhi's increased purchases of Russian oil. Trump has not imposed similar tariffs on goods from China, the biggest purchaser of Russian oil.\nIndia is addressing its future trade relationship with the United States with a \"very open mind\", Trade Minister Piyush Goyal said on Friday, while underscoring the consequential and important nature of the relationship to both countries.\n(With inputs from agencies)\nStay updated with the latest Trending, India , World and US news. Read the latest updates on the Supreme Court verdict regarding Delhi-NCR stray dog relocation and ongoing protests now on Livemint."
    },
    {
      "news_title": "Trump Names Sergio Gor as Next US Ambassador to India",
      "news_link": "https://www.usnews.com/news/world/articles/2025-08-22/trump-names-sergio-gor-as-next-us-ambassador-to-india",
      "bias": "Lean Left",
      "text": null
    },
    {
      "news_title": "Trump names close political aide as ambassador to India",
      "news_link": "https://www.kake.com/trump-names-close-political-aide-as-ambassador-to-india/article_120b0c0b-f34b-508b-96ad-4df7d13013e3.html",
      "bias": "Center",
      "text": "Bulletin: ...FLOOD WARNING NOW IN EFFECT UNTIL 145 PM CDT THIS AFTERNOON...\n* WHAT...Flooding caused by excessive rainfall continues.\n* WHERE...Portions of south central and southwest Kansas, including\nthe following counties, in south central Kansas, Comanche. In\nsouthwest Kansas, Clark.\n* WHEN...Until 145 PM CDT.\n* IMPACTS...Flooding of rivers, creeks, streams, and other low-lying\nand flood-prone locations is imminent or occurring. Low-water\ncrossings are inundated with water and may not be passable.\n* ADDITIONAL DETAILS...\n- At 1124 AM CDT, emergency management reported ongoing\nflooding was occurring on highway 183 west of Protection to\nnear the Clark county line from the heavy rainfall that fell\nlast night and early this Monday morning. Radar estimated\nbetween 3 and 4 inches of rain have fallen in this area.\n- Additional rainfall amounts up to 1 inch are possible in the\nwarned area.\n- Some locations that will experience flooding include...\nColdwater, Protection, Sitka and Buttermilk.\n- http://www.weather.gov/safety/flood\nPRECAUTIONARY/PREPAREDNESS ACTIONS...\nTurn around, don't drown when encountering flooded roads. Most flood\ndeaths occur in vehicles.\nPlease report observed flooding to local emergency services or law\nenforcement and request they pass this information to the National\nWeather Service when you can do so safely.\n&&\nType: Flood Warning\nIssued for: 2025-08-25T11:29:00-05:00\nEnding at: 2025-08-25T13:45:00-05:00\nCounty Name: Clark County\nState: Kansas\nCategory: Met\nUrgency: Unknown\nSeverity: Severe\nCertainty: Unknown\nWeather Alert\nHeadline: Flood Warning until MON 1:45 PM CDT\nBulletin: ...FLOOD WARNING NOW IN EFFECT UNTIL 145 PM CDT THIS AFTERNOON...\n* WHAT...Flooding caused by excessive rainfall continues.\n* WHERE...Portions of south central and southwest Kansas, including\nthe following counties, in south central Kansas, Comanche. In\nsouthwest Kansas, Clark.\n* WHEN...Until 145 PM CDT.\n* IMPACTS...Flooding of rivers, creeks, streams, and other low-lying\nand flood-prone locations is imminent or occurring. Low-water\ncrossings are inundated with water and may not be passable.\n* ADDITIONAL DETAILS...\n- At 1124 AM CDT, emergency management reported ongoing\nflooding was occurring on highway 183 west of Protection to\nnear the Clark county line from the heavy rainfall that fell\nlast night and early this Monday morning. Radar estimated\nbetween 3 and 4 inches of rain have fallen in this area.\n- Additional rainfall amounts up to 1 inch are possible in the\nwarned area.\n- Some locations that will experience flooding include...\nColdwater, Protection, Sitka and Buttermilk.\n- http://www.weather.gov/safety/flood\nPRECAUTIONARY/PREPAREDNESS ACTIONS...\nTurn around, don't drown when encountering flooded roads. Most flood\ndeaths occur in vehicles.\nPlease report observed flooding to local emergency services or law\nenforcement and request they pass this information to the National\nWeather Service when you can do so safely.\n&&\nSergio Gor (right), who has been tapped a the next US ambassador to India, walks with Treasury Secretary Scott Bessent on the White House lawn after a trip with President Donald Trump in April 2025\nPresident Donald Trump on Friday tapped close political aide Sergio Gor as US ambassador to India, sending one of his feared enforcers at a delicate time in ties with New Delhi.\nThe 38-year-old Gor rose quickly in conservative politics to become one of the most powerful, if low-profile, aides in the White House with a task of vetting some 4,000 appointees to ensure utmost loyalty to Trump.\nGor's enemies include Elon Musk, who following his spectacular falling-out with Trump branded Gor a \"snake\" after he scuttled the tech and aerospace billionaire's choice to lead NASA.\nGor's influence does not include extensive experience in foreign policy, beyond joining travel overseas and leading a purge of National Security Council staffers whose views were called into suspicion.\n\"For the most populous Region in the World, it is important that I have someone I can fully trust to deliver on my Agenda and help us, MAKE AMERICA GREAT AGAIN,\" Trump wrote on his Truth Social platform.\n\"Sergio will make an incredible Ambassador,\" he wrote.\nTrump wrote that Gor would also hold a role of special envoy for South and Central Asia.\nTrump has largely sidelined traditional diplomats and relied for diplomacy on personal friends, with the State Department's top position for South Asia still vacant.\nThe nomination comes after a spike in tensions with India, which the United States has prioritized as an emerging partner since the 1990s.\nTrump has moved to ramp up tariffs on India to pressure it over its purchases of energy from Russia, despite Trump's own diplomacy with counterpart Vladimir Putin.\nIndia in recent days has held top-level meetings with both Russia and China. Successive US administrations have viewed India as a balance against China, seen as the top US global rival.\nTrump has spoken of brokering between India and Pakistan after they reached a ceasefire in a brief conflict in May, although India has been hesitant on any direct US role.\n- Political insider -\nGor was born in Uzbekistan when it was still in the Soviet Union -- a background on which he has been discreet -- before moving as a child to Malta.\nAfter attending university in the United States, he became active in Republican Party politics, eventually taking top positions with Senator Rand Paul, a leading Republican critic of foreign interventionism, then working as a fund-raiser and book publisher for Trump -- and as an amateur wedding DJ.\nIn his post, Trump hailed Gor's work as director of presidential personnel, saying that 95 percent of positions have been filled and that he will stay on until the Republican-led Senate confirms him as ambassador.\nSecretary of State Marco Rubio quickly endorsed Gor on X, saying he would be an \"excellent representative of America in one of the most important relationships our nation has in the world.\"\nTrump named an ambassador to India later than for many other major countries.\nWhile presidents have often tapped political aides as ambassador -- former president Joe Biden sent former White House chief of staff Rahm Emanuel to Tokyo -- India has an illustrious history of seeing public intellectuals as ambassador.\nUS ambassadors to India have included prominent economist John Kenneth Galbraith and the social scientist and future senator Daniel Patrick Moynihan.\nBiden's ambassador to India was Eric Garcetti, a former mayor of Los Angeles known for his interest in Indian philosophy and who had studied Hindi and Urdu as a young man."
    },
    {
      "news_title": "Donald Trump Names Close Political Aide Sergio Gor As India Ambassador",
      "news_link": "https://www.ndtv.com/world-news/donald-trump-names-close-political-aide-sergio-gor-as-india-ambassador-9142686#publisher=newsstand",
      "bias": "Lean Right",
      "text": null
    },
    {
      "news_title": "Trump appoints close aide Sergio Gor as next US ambassador to India",
      "news_link": "https://indianexpress.com/article/world/trump-appoints-close-aide-sergio-gor-as-next-us-ambassador-to-india-10205923/",
      "bias": "Lean Left",
      "text": null
    },
    {
      "news_title": "Trump taps trusted aide Sergio Gor as next US ambassador to India",
      "news_link": "https://www.thenews.com.pk/latest/1338315-trump-taps-trusted-aide-sergio-gor-for-top-diplomatic-post-in-india",
      "bias": "Lean Right",
      "text": "President Donald Trump on Friday tapped close political aide Sergio Gor as US ambassador to India, sending one of his feared enforcers at a delicate time in ties with New Delhi.\nThe 38-year-old Gor rose quickly in conservative politics to become one of the most powerful, if low-profile, aides in the White House with a task of vetting some 4,000 appointees to ensure utmost loyalty to Trump.\nHe would also serve as a special envoy for South and Central Asian affairs, Reuters reported.\nGor's enemies include Elon Musk, who, following his spectacular falling-out with Trump, branded Gor a \"snake\" after he scuttled the tech and aerospace billionaire´s choice to lead NASA.\nHis influence does not include extensive experience in foreign policy, beyond travelling overseas and leading a purge of National Security Council staffers whose views were called into suspicion.\n\"For the most populous Region in the World, it is important that I have someone I can fully trust to deliver on my Agenda and help us, MAKE AMERICA GREAT AGAIN,\" Trump wrote on his Truth Social platform.\n\"Sergio will make an incredible Ambassador,\" he wrote.\nTrump wrote that Gor would also hold the role of special envoy for South and Central Asia.\nTrump has largely sidelined traditional diplomats and relied on personal friends for diplomacy. The nomination comes after a spike in tensions with India, which the United States has prioritised as an emerging partner since the 1990s.\nTrump has moved to ramp up tariffs on India to pressure it over its purchases of energy from Russia, despite Trump's own diplomacy with counterpart Vladimir Putin.\nIndia, in recent days, has held top-level meetings with both Russia and China. Successive US administrations have viewed India as a balance against China, seen as the top US global rival.\nTrump has spoken of brokering between India and Pakistan after they reached a ceasefire in a brief conflict in May, although India has been hesitant on any direct US role.\nSecretary of State Marco Rubio quickly endorsed Gor on X, saying he would be an \"excellent representative of America in one of the most important relationships our nation has in the world.\"\nUS secretary of state says rising number of foreign truckers putting US lives, livelihoods at stake\nAuthorities call it “terrorist attack”; city mayor imposes ban on large trucks, fearing further explosions\nSpain is currently battling multiple wildfires in western part of the country\nCaprio became widely recognised through Caught in Providence, the long-running reality television show\nPentagon’s push to build a fleet of autonomous vessels hit snags, according to dozen people familiar with programme\nTesla CEO has recently been focused in partly on maintaining ties with US Vice President JD Vance"
    },
    {
      "news_title": "Trump taps close aide Sergio Gor as next US ambassador to India",
      "news_link": "https://www.scmp.com/news/world/united-states-canada/article/3322897/trump-taps-close-aide-sergio-gor-next-us-ambassador-india",
      "bias": "Center",
      "text": "Trump taps close aide Sergio Gor as next US ambassador to India\nTies between the two countries have been strained by the US president’s plan to double tariffs on Indian goods to 50 per cent\nUS President Donald Trump said on Friday he would nominate Sergio Gor, one of his closest aides, to be the country’s next ambassador to India, where he will oversee frosty relations that have worsened with the planned doubling of US tariffs on India next week.\nGor, who is currently the director of the White House Presidential Personnel Office, would also serve as a special envoy for South and Central Asian affairs.\nTrump said on social media that Gor would remain in his current position until he is confirmed for the India post by the US Senate.\n“Sergio is a great friend, who has been at my side for many years. He worked on my Historic Presidential Campaigns, published my Best Selling Books, and ran one of the biggest Super PACs, which supported our Movement,” Trump said, lauding Gor’s work in hiring staff for his second term.\n“For the most populous Region in the World, it is important that I have someone I can fully trust to deliver on my Agenda and help us, MAKE AMERICA GREAT AGAIN,” Trump wrote.\nUS-India ties have been strained by Trump’s trade war, with talks on lower tariff rates collapsing after India, the world’s fifth-largest economy, resisted opening its vast agricultural and dairy sectors."
    },
    {
      "news_title": "Trump picks loyalist Sergio Gor as US ambassador to India, calls him great friend",
      "news_link": "https://www.indiatoday.in/world/us-news/story/trump-appoints-sergio-gor-as-ambassador-to-india-expands-role-in-asian-affairs-glbs-2775525-2025-08-23",
      "bias": "Lean Right",
      "text": "Trump picks loyalist Sergio Gor as US ambassador to India, calls him great friend\nTrump appointed Sergio Gor, White House personnel director, as ambassador to India and special envoy for South and Central Asian affairs.\nUS President Donald Trump on Friday announced he is appointing Sergio Gor, the White House personnel director, as the next ambassador to India and special envoy for South and Central Asian Affairs.\n“I am pleased to announce that I am promoting Sergio Gor to be our next United States Ambassador to the Republic of India, and Special Envoy for South and Central Asian Affairs,” Trump said on Truth Social. “Sergio and his team have hired nearly 4,000 America First Patriots across every Department of our Federal Government in RECORD time — Our Departments and Agencies are over 95% filled!”\nGor, who co-founded Winning Team Publishing with Donald Trump Jr., has been deeply involved in the Trump family’s projects, from publishing two of the president’s books to running one of the largest Super PACs supporting Trump’s campaigns.\n“Sergio is a great friend, who has been at my side for many years. He worked on my historic presidential campaigns, published my best-selling books, and ran one of the biggest Super PACs, which supported our movement,” Trump said.\nThe president emphasised why he wants Gor in India: “For the most populous region in the world, it is important that I have someone I can fully trust to deliver on my agenda and help us MAKE AMERICA GREAT AGAIN. Sergio will make an incredible Ambassador. Congratulations Sergio!”\nGor expressed heartfelt gratitude after being nominated as the next US ambassador to India and special envoy for South and Central Asian affairs.\n“Nothing has made me prouder than to serve the American people through the GREAT work of this Administration!” Gor said on X. “It will be the honor of my life to represent the United States!”\nGor thanked President Trump for his “incredible trust and confidence” in his appointment, calling it a milestone in a career deeply intertwined with the administration.\nHe highlighted the accomplishments of the White House under Trump, citing historic results in “MAKING AMERICA GREAT AGAIN” and praising the team for its work.\nGor has played a central role in Trump’s administration, overseeing the vetting of senior personnel choices across government. That included Trump’s short-lived nomination of tech billionaire Jared Isaacman to lead NASA, a bid that was withdrawn in June.\nBeyond politics, Gor has close ties to the Trump family. He co-founded Winning Team Publishing with Donald Trump Jr., the publishing house behind two of the president’s books. Gor will remain in his current White House role until confirmed by the Senate.\nGor will succeed Eric Garcetti, who served as ambassador from May 11, 2023, to January 20, 2025. Before Garcetti, Kenneth Juster held the role from November 23, 2017, to January 20, 2021.\nSince Garcetti’s exit, interim Charge d’Affaires Jorgan K Andrews has been leading the US Embassy in India, taking over on January 20, 2025."
    },
    {
      "news_title": "Trump nominates close aide Sergio Gor to be next US ambassador to India",
      "news_link": "https://www.straitstimes.com/world/united-states/trump-nominates-sergio-gor-to-be-next-us-ambassador-to-india",
      "bias": "Lean Right",
      "text": "Trump nominates close aide Sergio Gor to be next US ambassador to India\nSign up now: Get ST's newsletters delivered to your inbox\nFollow topic:\nWASHINGTON - President Donald Trump said on Aug 22 he would nominate Mr Sergio Gor, one of his closest aides, to be the next US ambassador to India, where he will oversee frosty relations that have worsened with the planned doubling of US tariffs on India next week.\nMr Gor, who is currently the director of the White House Presidential Personnel Office, would also serve as a special envoy for South and Central Asian affairs.\nMr Trump said in a post on his Truth Social account that Mr Gor would remain in his current position until he is confirmed for the India post by the US Senate.\n“Sergio is a great friend, who has been at my side for many years. He worked on my Historic Presidential Campaigns, published my Best Selling Books, and ran one of the biggest Super PACs, which supported our Movement,” Mr Trump said, lauding Mr Gor’s work in hiring staff for his second term.\n“For the most populous Region in the World, it is important that I have someone I can fully trust to deliver on my Agenda and help us, MAKE AMERICA GREAT AGAIN,” Mr Trump wrote.\nUS-India ties have been strained by Mr Trump’s trade war, with talks on lower tariff rates collapsing after India, the world’s fifth-largest economy, resisted opening its vast agricultural and dairy sectors. Bilateral trade between the two countries is worth more than US$190 billion (S$240 billion).\nMr Trump first imposed additional tariffs of 25 per cent increased purchases of Russian oil.\nUS Treasury Secretary Scott Bessent on Aug 19 accused India of profiteering from its sharply increased purchases of Russian oil during the war in Ukraine and said Washington viewed the situation as unacceptable. REUTERS"
    },
    {
      "news_title": "Donald Trump Appoints Longtime Confidant Sergio Gor As US Ambassador To India",
      "news_link": "https://www.news18.com/world/donald-trump-appoints-longtime-confidant-sergio-gor-as-us-ambassador-to-india-ws-l-9522670.html",
      "bias": "Lean Right",
      "text": "Donald Trump Names Longtime Confidant Sergio Gor As US Ambassador To India\nIn his statement, Trump offered high praise for Gor, calling him “a great friend” and highlighting his long-standing loyalty.\nUS President Donald Trump has announced Sergio Gor as his nominee for the next US Ambassador to the Republic of India. In addition to this diplomatic role, Gor will also serve as Special Envoy for South and Central Asian Affairs. The announcement was made by Trump on Truth Social on Friday.\nSergio Gor currently serves as the Director of the White House Presidential Personnel Office and will continue in this role until his nomination is confirmed. Trump expressed confidence in Gor’s ability to further the “MAKE AMERICA GREAT AGAIN\" agenda in the “most populous region in the world.\"\nRecommended Stories\nIn his statement, Trump offered high praise for Gor, calling him “a great friend\" and highlighting his long-standing loyalty and involvement in the Trump political movement. “He worked on my Historic Presidential Campaigns, published my Best Selling Books, and ran one of the biggest Super PACs, which supported our Movement,\" Trump noted.\nCongratulations to @SergioGor! Sergio helped President Trump put together the best team in history, and he will be a great Ambassador for the Trump Administration overseas. pic.twitter.com/A2ujPZOKje— Karoline Leavitt (@PressSec) August 22, 2025\nReacting to the development, US State Secretary said on X,\" I am excited about the Presidents decisions to nominate @SergioGor to be our next Ambassador to India. He will be an excellent representative of America in one of the most important relationships our nation has in the world.\"\nI am excited about the Presidents decisions to nominate @SergioGor to be our next Ambassador to India. He will be an excellent representative of America in one of the most important relationships our nation has in the world.— Marco Rubio (@marcorubio) August 22, 2025\nGor’s nomination comes nearly seven months after Eric Garcetti stepped down as the 26th US Ambassador to India.\n- Location :\n- First Published:"
    },
    {
      "news_title": "Trump Appoints Trusted Ally Sergio Gor as Ambassador to India.",
      "news_link": "https://thenationalpulse.com/2025/08/22/trump-appoints-trusted-ally-sergio-gor-as-ambassador-to-india/",
      "bias": "Right",
      "text": "❓WHAT HAPPENED: President Trump announced the promotion of his head of personnel, Sergio Gor, to a top new ambassadorial position.\n👤WHO WAS INVOLVED: President Donald Trump and Sergio Gor.\n📍WHEN & WHERE: The announcement was made on President Trump’s Truth Social feed on Friday afternoon.\n💬KEY QUOTE: “Sergio will make an incredible Ambassador. Congratulations Sergio!” – Donald Trump\n🎯IMPACT: Sergio Gor will become the United States Ambassador to the Republic of India, pending confirmation.\nPresident Trump announced the promotion of Sergio Gor to United States Ambassador to the Republic of India and Special Envoy for South and Central Asian Affairs on Friday afternoon through Trump’s Truth Social feed.\nAs Director of Presidential Personnel, Gor and his team have hired nearly 4,000 personnel across various federal departments, achieving a 95% fill rate. He will continue in his current role at the White House until his confirmation as ambassador.\nPresident Trump praised Gor as a long-time friend and crucial ally in his administration, noting Gor’s work on Trump’s presidential campaigns, his involvement in publishing Trump’s bestselling books, and his leadership of a major Super PAC supporting the movement.\nTrump emphasized the importance of having someone he trusts in the ambassadorial role for the world’s most populous region, underscoring Gor’s ability to help advance the agenda of making America great again.\nTrump concluded by expressing confidence in Gor’s future success as an ambassador, stating, “Sergio will make an incredible Ambassador. Congratulations Sergio!”\nThe National Pulse understands Gor has been interested in a senior role in South Asia for some time. He previously worked on Capitol Hill for members such as Rand Paul and Steve King. Age 38, Gor was born Sergey Gorokhovsky in the former U.S.S.R. His family moved to the United States and Gor attended George Washington University. He recently helped President Trump launch Winning Team Publishing, and sits on the board of the Kennedy Center.\nJoin Pulse+ to comment below and receive exclusive email analyses."
    },
    {
      "news_title": "Sergio Gor, Donald Trump’s close political aide, named next U.S. ambassador to India",
      "news_link": "https://www.thehindu.com/news/international/sergio-gor-donald-trumps-close-political-aide-named-next-us-ambassador-to-india/article69966273.ece",
      "bias": "Lean Left",
      "text": "President Donald Trump said on Friday (August 22, 2025) he would nominate Sergio Gor, one of his closest aides, to be the next U.S. Ambassador to India, where he will oversee frosty relations that have worsened with the planned doubling of U.S. tariffs on India next week.\nMr. Gor, who is currently the director of the White House Presidential Personnel Office, would also serve as a special envoy for South and Central Asian affairs.\nMr. Trump said in a post on his Truth Social account that Mr. Gor would remain in his current position until he is confirmed for the India post by the U.S. Senate.\n“Sergio is a great friend, who has been at my side for many years. He worked on my Historic Presidential Campaigns, published my Best Selling Books, and ran one of the biggest Super PACs, which supported our Movement,” Mr. Trump said, lauding Mr. Gor’s work in hiring staff for his second term.\n“For the most populous Region in the World, it is important that I have someone I can fully trust to deliver on my Agenda and help us, MAKE AMERICA GREAT AGAIN,” Mr. Trump wrote.\nU.S.-India ties have been strained by Mr. Trump’s trade war, with talks on lower tariff rates collapsing after India, the world’s fifth-largest economy, resisted opening its vast agricultural and dairy sectors. Bilateral trade between the two countries is worth more than $190 billion.\nMr. Trump first imposed additional tariffs of 25% on imports from India, then said they would double to 50% from August 27 as punishment for New Delhi’s increased purchases of Russian oil. Trump has not imposed similar tariffs on China, the biggest purchaser of Russian oil.\nU.S. Treasury Secretary Scott Bessent on Tuesday accused India of profiteering from its sharply increased purchases of Russian oil during the war in Ukraine and said Washington viewed the situation as unacceptable.\nPublished - August 23, 2025 02:51 am IST"
    },
    {
      "news_title": "Trump Nominates Personnel Aide Sergio Gor as Ambassador to India",
      "news_link": "https://www.bloomberg.com/news/articles/2025-08-22/trump-nominates-personnel-aide-sergio-gor-as-ambassador-to-india",
      "bias": "Lean Left",
      "text": null
    },
    {
      "news_title": "Trump nominates personnel director Sergio Gor for US ambassador to India",
      "news_link": "https://justthenews.com/government/white-house/trump-nominates-personnel-director-sergio-gor-us-ambassador-india",
      "bias": "Lean Right",
      "text": "Trump nominates personnel director Sergio Gor for US ambassador to India\nGor, who has led the Trump administration's staffing operations and employed nearly 4,000 \"America First Patriots,\" across the federal government, will still need to be confirmed by the United States Senate.\nPresident Donald Trump on Friday evening nominated his director of Presidential personnel, Sergio Gor, to become the next United States ambassador to India, and also the Special Envoy for South and Central Asian Affairs.\nGor, who has led the Trump administration's staffing operations and employed nearly 4,000 \"America First Patriots,\" across the federal government, will still need to be confirmed by the United States Senate.\nTrump said Gor will remain in his post at the White House until he is confirmed.\n\"Sergio is a great friend, who has been at my side for many years,\" Trump said in a post on Truth Social. \"He worked on my Historic Presidential Campaigns, published my Best Selling Books, and ran one of the biggest Super [Political Action Committees], which supported our Movement.\n\"Sergio’s role as Director of Presidential Personnel has been essential to delivering on the unprecedented Mandate that we received from the American People,\" he continued. \"For the most populous Region in the World, it is important that I have someone I can fully trust to deliver on my Agenda and help us, MAKE AMERICA GREAT AGAIN. Sergio will make an incredible Ambassador.\"\nSeveral of Trump's allies have praised the selection, including FBI Director Kash Patel who praised Gor as an \"outstanding pick,\" and Homeland Security Secretary Kristi Noem.\n\"I am so excited for my dear friend Sergio Gor, whom President Trump has nominated to be the Ambassador to the Republic of India,\" Noem posted on X. \"For years, he has helped make America great again by putting the right people in the right places at the right time.\n\"He has been an integral part of Trump’s efforts to advance freedom and will continue that work as a part of an administration committed to building relationships and strengthening America First policies in a vital, fast-growing region of the world,\" she added.\nGor thanked Trump for the nomination and said it would \"be the honor of my life to represent the United States\" in India.\nMisty Severi is a news reporter for Just The News. You can follow her on X for more coverage."
    },
    {
      "news_title": "Trump taps Sergio Gor as India ambassador",
      "news_link": "https://thehill.com/homenews/administration/5466616-sergio-gor-trump-india-envoy/",
      "bias": "Center",
      "text": null
    },
    {
      "news_title": "Trump White House personnel honcho Sergio Gor picked as ambassador to India after Post reporting on Musk feud, vetting controversy",
      "news_link": "https://nypost.com/2025/08/22/us-news/trump-white-house-personnel-honcho-sergio-gor-picked-as-ambassador-to-india-after-post-reporting-on-musk-feud-vetting-controversy/",
      "bias": "Lean Right",
      "text": "Trump personnel honcho Sergio Gor picked as ambassador to India after Post reporting on Musk feud, vetting controversy\nWASHINGTON — President Trump announced Friday that his embattled personnel director Sergio Gor is being nominated as ambassador to India — offering Gor a “soft landing” following months of controversy.\nGor, 38, sparked Trump’s explosive falling out in June with billionaire Elon Musk and The Post later revealed that he was dragging his feet on submitting security clearance paperwork, despite vetting thousands of Trump appointees himself.\n“That’s what they call a soft landing in Trumpworld,” an administration insider familiar with the situation told The Post.\nSeveral sources said that the FBI recently completed a background check into Gor after he belatedly submitted his Standard Form 86 (SF-86) paperwork, which begins the process for granting a permanent security clearance.\nThe findings of that review stoked internal intrigue over the past week as they were reviewed by West Wing bosses — with buzz mounting that Gor might be nominated as ambassador to Malta, his professed homeland, in a face-saving off-ramp.\nHe had maintained a temporary security clearance that was believed to have expired last month, though it’s unclear whether an extension was granted.\nGor had not filed the paperwork to begin the formal security-clearance process before The Post’s investigation was published in mid-June.\nStart your day with all you need to know\nMorning Report delivers the latest news, videos, photos and more.\nThanks for signing up!\nSources who worked with Gor over more than a decade said that he spoke often of being from Malta, a small Mediterranean island, but officials in that nation told The Post they had no record of his birth.\nIt was unclear whether Gor’s murky national origin alone explained his reluctance to submit to a background check.\nThe Times of Malta reported in July that Gor was born in Uzbekistan while it was still part of the Soviet Union.\nGor rocketed from obscurity as a longtime aide to Sen. Rand Paul (R-Ky.) by launching a publishing company in 2021 that reaped millions publishing Trump’s books. In 2022 he bought a seven-bedroom mansion near Palm Beach, Fla.\nHe burst into the headlines in June when he convinced Trump to yank the nomination of Musk’s pick to lead NASA, Jared Isaacman, after nursing a grudge and speaking of paying back the world’s richest man for “humiliating” him at a Cabinet meeting.\nMusk, the CEO of Tesla and SpaceX, was departing his role leading Trump’s Department of Government Efficiency when Gor allgedly exacted revenge.\nGor cited Issacman’s prior donations to Democrats, even though a number of high-profile former Democrats serve in Trump’s Cabinet, including former Rep. Tulsi Gabbard (D-Hawaii) and Robert F. Kennedy Jr.\nAlthough Isaacman passed a Senate committee with bipartisan support, Trump withdrew the nomination, outraging Musk.\nIn a seismic political clash, Musk — Trump’s top financial backer during the 2024 campaign — threatened to launch a third party and endorsed Trump’s impeachment, causing indignation inside the White House both over Gor’s actions and their potential impact on the 2026 midterm elections.\nTrump has fired none of his high-profile White House aides so far in his second term — only “promoting” ex-national security adviser Mike Waltz by nominating him to serve as ambassador to the United Nations.\nGor’s promotion maintains that no-scalps policy.\n“I am pleased to announce that I am promoting Sergio Gor to be our next United States Ambassador to the Republic of India, and Special Envoy for South and Central Asian Affairs,” Trump wrote on Truth Social.\nThe special envoy role does not require Senate confirmation, but the ambassador role does.\n“As Director of Presidential Personnel, Sergio and his team have hired nearly 4,000 America First Patriots across every Department of our Federal Government in RECORD time — Our Departments and Agencies are over 95% filled! Sergio will remain in his current role at the White House until his confirmation,” Trump wrote.\n“Sergio is a great friend, who has been at my side for many years. He worked on my Historic Presidential Campaigns, published my Best Selling Books, and ran one of the biggest Super PACs, which supported our Movement.”\n“This nomination has been incredibly well received,” Gor attorney Robert Garson told The Post. “From the Secretary of State to the FBI Director, everyone realizes how loyal, committed and competent Sergio Gor is to President Trump and the America First Movement.”\nIt’s unclear what would happen to Gor’s White House role if the Senate refuses to confirm him as ambassador to New Delhi.\n“First question [in his confirmation hearing will be]: ‘Where were you born?'” predicted a source close to the developments. “Senators are going to motherf— him.”"
    },
    {
      "news_title": "Trump nominates Sergio Gor to be next US ambassador to India",
      "news_link": "https://www.reuters.com/world/india/trump-nominates-sergio-gor-be-next-us-ambassador-india-2025-08-22/",
      "bias": "Center",
      "text": null
    },
    {
      "news_title": "Trump Names Close Political Aide As Ambassador To India",
      "news_link": "https://www.ibtimes.com/trump-names-close-political-aide-ambassador-india-3781496",
      "bias": "Center",
      "text": "Trump Names Close Political Aide As Ambassador To India\nPresident Donald Trump on Friday tapped close political aide Sergio Gor as US ambassador to India, sending one of his feared enforcers at a delicate time in ties with New Delhi.\nThe 38-year-old Gor rose quickly in conservative politics to become one of the most powerful, if low-profile, aides in the White House with a task of vetting some 4,000 appointees to ensure utmost loyalty to Trump.\nGor's enemies include Elon Musk, who following his spectacular falling-out with Trump branded Gor a \"snake\" after he scuttled the tech and aerospace billionaire's choice to lead NASA.\nGor's influence does not include extensive experience in foreign policy, beyond joining travel overseas and leading a purge of National Security Council staffers whose views were called into suspicion.\n\"For the most populous Region in the World, it is important that I have someone I can fully trust to deliver on my Agenda and help us, MAKE AMERICA GREAT AGAIN,\" Trump wrote on his Truth Social platform.\n\"Sergio will make an incredible Ambassador,\" he wrote.\nTrump wrote that Gor would also hold a role of special envoy for South and Central Asia.\nTrump has largely sidelined traditional diplomats and relied for diplomacy on personal friends, with the State Department's top position for South Asia still vacant.\nThe nomination comes after a spike in tensions with India, which the United States has prioritized as an emerging partner since the 1990s.\nTrump has moved to ramp up tariffs on India to pressure it over its purchases of energy from Russia, despite Trump's own diplomacy with counterpart Vladimir Putin.\nIndia in recent days has held top-level meetings with both Russia and China. Successive US administrations have viewed India as a balance against China, seen as the top US global rival.\nTrump has spoken of brokering between India and Pakistan after they reached a ceasefire in a brief conflict in May, although India has been hesitant on any direct US role.\nGor was born in Uzbekistan when it was still in the Soviet Union -- a background on which he has been discreet -- before moving as a child to Malta.\nAfter attending university in the United States, he became active in Republican Party politics, eventually taking top positions with Senator Rand Paul, a leading Republican critic of foreign interventionism, then working as a fund-raiser and book publisher for Trump -- and as an amateur wedding DJ.\nIn his post, Trump hailed Gor's work as director of presidential personnel, saying that 95 percent of positions have been filled and that he will stay on until the Republican-led Senate confirms him as ambassador.\nSecretary of State Marco Rubio quickly endorsed Gor on X, saying he would be an \"excellent representative of America in one of the most important relationships our nation has in the world.\"\nTrump named an ambassador to India later than for many other major countries.\nWhile presidents have often tapped political aides as ambassador -- former president Joe Biden sent former White House chief of staff Rahm Emanuel to Tokyo -- India has an illustrious history of seeing public intellectuals as ambassador.\nUS ambassadors to India have included prominent economist John Kenneth Galbraith and the social scientist and future senator Daniel Patrick Moynihan.\nBiden's ambassador to India was Eric Garcetti, a former mayor of Los Angeles known for his interest in Indian philosophy and who had studied Hindi and Urdu as a young man.\n© Copyright AFP {{Year}}. All rights reserved."
    },
    {
      "news_title": "Staunch Trump loyalist Sergio Gor to be next US envoy to India - Kashmir Media Service",
      "news_link": "https://kmsnews.org/kms/2025/08/24/staunch-trump-loyalist-sergio-gor-to-be-next-us-envoy-to-india.html",
      "bias": "unknown",
      "text": "India\nStaunch Trump loyalist Sergio Gor to be next US envoy to India\nWashington: Sergio Gor, the White House personnel director and a loyal member of President Donald Trump’s inner circle, has been nominated as the next American envoy to India.\nAccording to Kashmir Media Service, President Trump, announcing the nomination of 38-year-old Sergio Gor to the key ambassadorial position, said he will also serve as the special envoy for South and Central Asian Affairs.\n“For the most populous region in the World, it is important that I have someone I can fully trust to deliver on my agenda and help us ‘Make America Great Again’,” the President said on social media."
    },
    {
      "news_title": "Trump taps staunch MAGA ally Sergio Gor as ambassador to India",
      "news_link": "https://www.tag24.com/politics/politicians/donald-trump/trump-taps-staunch-maga-ally-sergio-gor-as-ambassador-to-india-3414308",
      "bias": "unknown",
      "text": "Trump taps staunch MAGA ally Sergio Gor as ambassador to India\nWashington DC - President Donald Trump on Friday tapped close political aide Sergio Gor as US ambassador to India, sending one of his feared enforcers at a delicate time in ties with New Delhi.\nThe 38-year-old Gor rose quickly in conservative politics to become one of the most powerful, if low-profile, aides in the White House with a task of vetting some 4,000 appointees to ensure utmost loyalty to Trump.\nGor's enemies include Elon Musk, who, following his spectacular falling-out with Trump, branded Gor a \"snake\" after he scuttled the tech and aerospace billionaire's choice to lead NASA.\nGor's influence does not include extensive experience in foreign policy, beyond joining travel overseas and leading a purge of National Security Council staffers whose views were called into suspicion.\n\"For the most populous Region in the World, it is important that I have someone I can fully trust to deliver on my Agenda and help us, MAKE AMERICA GREAT AGAIN,\" Trump wrote on his Truth Social platform.\n\"Sergio will make an incredible Ambassador,\" he wrote.\nTrump wrote that Gor would also hold a role of special envoy for South and Central Asia.\nTrump has largely sidelined traditional diplomats and relied for diplomacy on personal friends, with the State Department's top position for South Asia still vacant.\nThe nomination comes after a spike in tensions with India, which the US has prioritized as an emerging partner since the 1990s.\nTrump has moved to ramp up tariffs on India to pressure it over its purchases of energy from Russia, despite Trump's own diplomacy with counterpart Vladimir Putin.\nWho is Sergio Gor?\nIndia, in recent days, has held top-level meetings with both Russia and China. Successive US administrations have viewed India as a balance against China, seen as the top US global rival.\nTrump has spoken of brokering between India and Pakistan after they reached a ceasefire in a brief conflict in May, although India has been hesitant on any direct US role.\nGor was born in Uzbekistan when it was still in the Soviet Union – a background on which he has been discreet – before moving as a child to Malta.\nAfter attending university in the US, he became active in Republican Party politics, eventually taking top positions with Senator Rand Paul, a leading Republican critic of foreign interventionism, then working as a fund-raiser and book publisher for Trump – and as an amateur wedding DJ.\nIn his post, Trump hailed Gor's work as director of presidential personnel, saying that 95% of positions have been filled and that he will stay on until the Republican-led Senate confirms him as ambassador.\nSecretary of State Marco Rubio quickly endorsed Gor on X, saying he would be an \"excellent representative of America in one of the most important relationships our nation has in the world.\"\nTrump named an ambassador to India later than for many other major countries.\nWhile presidents have often tapped political aides as ambassador – former president Joe Biden sent former White House chief of staff Rahm Emanuel to Tokyo – India has an illustrious history of seeing public intellectuals as ambassador.\nUS ambassadors to India have included prominent economist John Kenneth Galbraith and the social scientist and future senator Daniel Patrick Moynihan.\nBiden's ambassador to India was Eric Garcetti, a former mayor of Los Angeles known for his interest in Indian philosophy and who had studied Hindi and Urdu as a young man.\nCover photo: Andrew Harnik / GETTY IMAGES NORTH AMERICA / Getty Images via AFP"
    },
    {
      "news_title": "Sergio Gor tapped as Trump’s pick for Ambassador to India and South Asia envoy - Times Kuwait",
      "news_link": "https://timeskuwait.com/sergio-gor-tapped-as-trumps-pick-for-ambassador-to-india-and-south-asia-envoy/",
      "bias": "unknown",
      "text": "President Donald Trump announced Friday that he is nominating Sergio Gor, his longtime aide and head of presidential personnel appointments, to serve as the next United States Ambassador to India. Mr. Gor will also hold the title of Special Envoy for South and Central Asian Affairs.\nGor is no stranger to Trump’s political orbit. Before his current role, he co-founded a publishing venture that paid Trump millions of dollars for book projects while he was out of office. He also played a central role in managing a super PAC that supported Trump during the 2024 election campaign.\nIn his announcement on Truth Social, Trump praised Gor as both a loyal ally and an effective operator. “I am pleased to announce that I am promoting Sergio Gor to be our next United States Ambassador to the Republic of India, and Special Envoy for South and Central Asian Affairs,” the president wrote.\nTrump went on to claim that Gor and his team had successfully placed nearly 4,000 people across the federal government, although that number has not been independently confirmed. Calling him “a great friend, who has been at my side for many years,” Trump underscored that Gor has his complete trust.\n“For the most populous region in the world, it is important that I have someone I can fully trust to deliver on my agenda,” Trump added. While the ambassadorial nomination requires Senate confirmation, the envoy position can be made by direct presidential appointment.\nThe timing of the announcement is particularly significant. Relations between Washington and New Delhi have recently cooled after Trump threatened to impose punitive tariffs on Indian exports, straining what had previously appeared to be a growing partnership between the two democracies.\n“After a long spell, there is some semblance of good news for India,” said Harsh V. Pant, vice president of studies and foreign policy at the Observer Research Foundation in New Delhi. “Ambassadorial roles are important in relationships going through a rough patch, and all the better that he has Mr. Trump’s ears.”\nGor’s reputation inside Trump’s circle is mixed. He is valued for his loyalty and for his willingness to exclude individuals deemed insufficiently aligned with the president. At the same time, critics describe him as unpredictable, sometimes making capricious personnel decisions that fueled internal tensions.\nHis clashes with Elon Musk, the billionaire adviser tasked with cost-cutting across government agencies, became particularly bitter. Gor was also central to a dispute involving Jared Isaacman, a businessman initially nominated to lead NASA at Musk’s urging.\nGor provided Trump with information that Isaacman had donated to Democrats in the past, prompting Trump to abruptly pull the nomination on Musk’s final day in the White House — even though Isaacman had already disclosed the donations months earlier.\nThat episode left both Trump and several aides dissatisfied with how events unfolded, according to people familiar with the matter. It also highlighted Gor’s role as both gatekeeper and enforcer within Trump’s inner circle.\nIn addition to his recent responsibilities, Gor has faced a wave of negative media coverage that scrutinized his personal background and rapid rise within Trump’s world. His path to influence began with Republican politics; he previously worked for Senator Rand Paul of Kentucky and cultivated close ties with Trump’s extended family, including Donald Trump Jr.\nGor’s political reach expanded further in 2024, when the super PAC he led drew heavy financial support from Isaac Perlmutter, the former Marvel Entertainment executive and longtime Trump ally who is a regular at Mar-a-Lago.\nThese relationships, combined with his reputation for loyalty, appear to have positioned Gor for one of the most strategically important diplomatic posts in Trump’s second term.\nFollow The Times Kuwait on X, Instagram and Facebook for the latest news updates"
    },
    {
      "news_title": "Who Is Sergio Gor: Trump Picks Loyalist As New US Ambassador to India",
      "news_link": "https://www.breezyscroll.com/world/the-us/trump-sergio-gor-ambassador-india/",
      "bias": "unknown",
      "text": "A Key Appointment at a Sensitive Time\nUS President Donald Trump has nominated his longtime political aide Sergio Gor as ambassador to India, a move that places one of his most trusted enforcers in a crucial diplomatic role amid delicate Washington–New Delhi relations.\nIn a post on Truth Social on Friday (Aug 22), Trump praised his pick: “Sergio will make an incredible Ambassador.” He added that Gor would also serve as special envoy for South and Central Asia—a significant regional mandate.\nWho Is Sergio Gor?\nAt 38, Sergio Gor has risen quickly inside Republican politics, becoming a powerful but low-profile figure in Trump’s orbit.\n- Current role: Until recently, he served as White House Director of Presidential Personnel, overseeing the vetting of roughly 4,000 appointees for loyalty to Trump.\n- Political background: Gor previously worked with Senator Rand Paul, built a fundraising career, and co-published books with Trump.\n- Unusual resume: Before entering politics, Gor moonlighted as a wedding DJ.\nBorn in Soviet Uzbekistan, Gor moved first to Malta as a child before emigrating to the United States.\nDespite his influence, Gor has limited foreign policy experience. His exposure has mostly involved accompanying Trump on international trips and managing personnel reshuffles at the National Security Council.\nTrump, however, defended the choice:\n“For the most populous Region in the World, I want someone I can fully trust to deliver on my Agenda and help us, MAKE AMERICA GREAT AGAIN,” he wrote.\nWhy Did Musk Call Gor a “Snake”?\nThe nomination has revived headlines about Gor’s uneasy relationship with Elon Musk.\n- The rift reportedly began when Gor opposed Musk’s preferred pick, Jared Isaacman, for NASA chief.\n- In June 2025, Musk escalated tensions by labeling Gor a “snake” on X (formerly Twitter), in response to a report alleging Gor had failed to complete paperwork for his own security clearance. The White House refuted those claims.\nThe clash highlighted Gor’s role as a gatekeeper in Trump’s administration, where his decisions often angered powerful figures.\nTrump’s Loyalty Over Credentials\nTrump has been clear that loyalty outweighs traditional diplomatic credentials. He credited Gor with shaping his administration and campaigns, publishing his books, and managing a major Super PAC aligned with his movement.\n“Sergio’s role as Director of Presidential Personnel has been essential to delivering on the unprecedented Mandate that we received from the American People,” Trump wrote.\nDiplomatic Context: India as a Strategic Partner\nIf confirmed, Gor would join a notable line of US envoys to India. Past ambassadors have included economist John Kenneth Galbraith, Senator Daniel Patrick Moynihan, and most recently Eric Garcetti, former Los Angeles mayor and a fluent Hindi-Urdu speaker appointed by President Joe Biden.\nUnlike his predecessors, Gor enters with little background in diplomacy or South Asian studies. However, his close ties to Trump signal that Washington’s approach to India under a second Trump administration would be tightly controlled from the top.\nWhy This Matters\nThe appointment underscores Trump’s strategy of installing trusted loyalists rather than seasoned diplomats in critical roles. For India, a country navigating tense trade disputes, technology partnerships, and regional security challenges, the arrival of a politically hardwired envoy could reshape the dynamics of engagement.\nMeanwhile, the Musk feud adds an unusual wrinkle: the next US ambassador to New Delhi may carry into office not only Trump’s confidence but also one of Silicon Valley’s sharpest rivalries."
    },
    {
      "news_title": "Trump Names Sergio Gor As Next U.S. Ambassador To India And Special Envoy For South And Central Asian Affairs",
      "news_link": "https://www.indiandefensenews.in/2025/08/trump-names-sergio-gor-as-next-us.html",
      "bias": "unknown",
      "text": "Trump Names Sergio Gor As Next U.S. Ambassador To India And Special Envoy For South And Central Asian Affairs\nIn a significant diplomatic development, US President Trump announced on Friday (local time) that Sergio Gor will serve as the next United States Ambassador to India as well as Special Envoy for South and Central Asian Affairs. Trump made the announcement on his Truth Social platform, praising Gor for his loyalty, competence, and critical role in staffing the administration.\nThe announcement marks a notable shift in Washington’s foreign policy engagement with New Delhi and reflects the Trump administration’s emphasis on appointing trusted allies to key global positions. Gor, a long time confidant of President Trump and one of his most influential aides, currently serves as Director of Presidential Personnel at the White House.\nIn this role, he has overseen the appointment of nearly 4,000 officials across various federal agencies—an extraordinary pace that the White House has highlighted as evidence of his organisational and strategic skills. According to President Trump, Sergio Gor will remain in his White House role until his Senate confirmation.\nUS Treasury Secretary Scott Bessent was among the first senior officials to publicly congratulate Gor, describing him as an “outstanding pick” with an “unprecedented track record of success.” In a message posted on X, Bessent praised Gor’s close association with Trump and his proven ability to execute high-level strategies effectively.\nHe emphasised that Gor would serve as an “exceptional steward of America’s interests” at a time when South and Central Asia represent one of the most critical geopolitical theatres for Washington. His endorsement underscores the alignment between the Department of the Treasury and Trump’s broader foreign policy agenda, particularly as economic diplomacy and trade negotiations remain key elements of US-India ties.\nPresident Trump’s announcement on his Truth Social account was characteristically personal and enthusiastic, highlighting Gor not only as a political ally but also as a trusted friend. The President cited Gor’s work on his previous campaigns, his role in publishing Trump’s bestselling books, and his leadership in pro-Trump political action committees as vital contributions to the “America First” movement.\nBy appointing Gor to New Delhi, Trump is signalling the importance he places on personal loyalty and alignment with his vision in filling diplomatic positions. India, as the world’s most populous nation and a pivotal player in global geopolitics, is seen as a critical partner in Trump’s second-term foreign policy framework.\nSergio Gor succeeds Eric Garcetti, who served as Ambassador to India from May 2023 until the end of the Biden administration in January 2025. Following Garcetti’s departure, Jorgan K. Andrews has been acting as the interim Charge d’Affaires. The appointment of a permanent envoy is expected to provide momentum to the US-India strategic partnership after a brief phase of transitional leadership at the embassy. Gor now becomes the third full ambassador to India in under a decade, succeeding Garcetti and Kenneth Juster, the latter of whom served during Trump’s first presidential term from 2017 to 2021.\nThe timing of Gor’s appointment coincides with a period of heightened economic and strategic challenges between Washington and New Delhi. India is currently navigating a complex economic climate, including a 50 percent tariff burden on bilateral trade and a controversial 25 percent penalty imposed on crude oil imports from Russia—an issue that has drawn significant international scrutiny.\nAs the new Ambassador, Gor will be expected to manage these sensitive economic disputes while simultaneously strengthening the US-India partnership in defence, technology, and energy. His position as Special Envoy for South and Central Asian Affairs further highlights Washington’s recognition of India’s central role in shaping the regional balance of power, particularly as China deepens its ambitions in Asia and Russia continues to challenge Western influence.\nDiplomatic observers note that Gor’s appointment underscores a personalised diplomacy approach characteristic of President Trump—leveraging deeply trusted inner-circle figures to represent American foreign policy abroad.\nThis move may bring a more politically charged, loyalty-driven dynamic to New Delhi, which could alter the tone of US-India engagement compared to his predecessors, who were career diplomats or seasoned political leaders. Nonetheless, Gor’s mandate is expected to focus on advancing Trump’s agenda of stronger bilateral trade, increased defence cooperation, and a coordinated strategy on regional security issues such as Afghanistan, Pakistan, and the Indo-Pacific.\nThe appointment of Sergio Gor as the next US Ambassador to India and Special Envoy for South and Central Asian Affairs represents both continuity and change. It ensures continuity in Trump’s emphasis on loyalty and the “America First” agenda, while also signalling change in the way Washington intends to manage its critical relationships in Asia with a more political and personalised representative in New Delhi.\nThe coming months will be crucial in determining how Gor navigates the complexities of trade disputes, energy security, and strategic alignments while maintaining the momentum of one of the most consequential diplomatic relationships for the United States in the 21st century.\nBased On ANI Report\nNo comments:\nPost a Comment"
    },
    {
      "news_title": "Trump Nominates Aide Sergio Gor As Next US Ambassador To India",
      "news_link": "https://indtoday.com/trump-nominates-aide-sergio-gor-as-next-us-ambassador-to-india/",
      "bias": "unknown",
      "text": "Trump Nominates Aide Sergio Gor As Next US Ambassador To India\nWashington/Internet/Hyderfabad, Aug 23 (Maxim News) US President Donald Trump has announced the nomination of longtime aide and trusted political strategist Sergio Gor to serve as the next United States Ambassador to India, as well as Special Envoy for South and Central Asian Affairs.\nIn a statement posted on Truth Social, Trump praised Gor’s loyalty, organisational talent, and deep involvement in his political and governmental operations. “I am pleased to announce that I am promoting Sergio Gor to be our next United States Ambassador to the Republic of India, and Special Envoy for South and Central Asian Affairs,” Trump wrote.\nHe continued, “As Director of Presidential Personnel, Sergio and his team have hired nearly 4,000 America First Patriots across every Department of our Federal Government in RECORD time — Our Departments and Agencies are over 95% filled! Sergio will remain in his current role at the White House until his confirmation.”\nTrump highlighted Gor’s wide-ranging contributions to his administration and campaign, saying, “Sergio is a great friend who has been at my side for many years. He worked on my Historic Presidential Campaigns, published my Best Selling Books, and ran one of the biggest Super PACs, which supported our Movement.”\n“For the most populous Region in the World, it is important that I have someone I can fully trust to deliver on my Agenda and help us, MAKE AMERICA GREAT AGAIN. Sergio will make an incredible Ambassador. Congratulations Sergio!” said Trump. (Maxim News)\nNext Story:\nNow you can get the latest stories from Indtoday on Telegram every day. Click the link to subscribe. Click to follow Indtoday’s Facebook page, Twitter, and Instagram. For all the latest Hyderabad News updates"
    },
    {
      "news_title": "Trump nominates loyalist Gor for India role",
      "news_link": "https://minutemirror.com.pk/trump-nominates-loyalist-gor-for-india-role-428151/",
      "bias": "unknown",
      "text": "WASHINGTON_ President Donald Trump Friday announced the nomination of his close aide and friend Sergio Gor as the next United States ambassador to India, charging him with navigating ties at a time of increased trade tensions and strategic tension between Washington and New Delhi.\nGor, now director of the White House Presidential Personnel Office, also will be Trump’s special envoy for South and Central Asian affairs if confirmed. On Truth Social, Trump honored Gor as “a great friend” and “trusted ally” for his work on Trump’s previous election campaigns, getting his books out, and managing one of the biggest pro-Trump political action committees.\n“For the world’s most populous region, it is critical that I have someone on whom I can absolutely rely to get the job done for my agenda and assist us in MAKING AMERICA GREAT AGAIN,” Trump wrote. He also mentioned that Gor would continue in his current role until officially confirmed for the position of ambassador.\nGor replied with appreciation, posting on X that it would be “the honour of my life” to serve the United States in India.\nThe move comes at a time when tensions have been rising in the bilateral relationship. Trump’s government has already slapped 25 percent tariffs on Indian products and will double them to 50 percent next week, blaming New Delhi for its increasing imports of Russian crude. The US Treasury has blasted India for “profiteering” from discounted Russian oil, which now represents 42 percent of Indian oil imports—up sharply from below 1 percent before the Ukraine war.\nIn contrast, Washington has not made public similar tariff actions against China, even though Beijing has also increased Russian oil purchases. This difference has been criticized in India, where officials emphasize the nation’s imperative to acquire cheap energy supplies.\nIndia’s Trade Minister Piyush Goyal on Friday stated that New Delhi was moving with “a very open mind” towards future economic ties with the US, highlighting the “consequential and important” nature of the relationship. Two-way trade between the two nations already surpasses $190 billion a year.\nTrump’s decision to nominate Gor was announced soon after Washington cancelled in a sudden move a scheduled visit by US trade negotiators to New Delhi for August 25-29.\nAnalysts observe that Gor, a political advisor with strong connections to Trump’s inner circle but limited foreign policy experience, will take over one of the most delicate roles in US foreign policy. The appointment indicates Trump’s move to fill important global positions with loyalists as he remakes America’s international outreach.\nWe welcome your contributions! Submit your blogs, opinion pieces, press releases, news story pitches, and news features to opinion@minutemirror.com.pk and minutemirrormail@gmail.com"
    },
    {
      "news_title": "Trump Picks Loyalist Sergio Gor as New US Ambassador to India",
      "news_link": "https://www.prameyanews.com/trump-picks-loyalist-sergio-gor-as-new-us-ambassador-to-india",
      "bias": "unknown",
      "text": "BCI, Bar Associations oppose Delhi LG’s order on police testimonies via video conferencing'\nWomen’s workforce participation in India rises to 40.3% in seven years\nModi's 'Wall of Protection': Reassuring Farmers and Businesses Amid US Trade War\nIn Rare Goodwill Gesture, India Bypasses Frozen Treaty to Warn Pakistan of Floods\nSC restrains Magistrate from proceeding on chargesheet against Ashoka University Professor over Operation Sindoor remarks\nINS Himgiri and Udaygiri Commissioning Boosts India's Naval Might\nHigh-Level PMO Meeting Tomorrow as 50% US Tariffs Kick In\nDharmendra Pradhan chairs 56th IIT Council Meeting to review progress, outline 25-yr roadmap\nEight including child & two women killed as container hits tractor in UP’s Bulandshahr\nCISF launches first-ever all-women commando unit for frontline security\nCrucial Gaganyaan Test Successful, ISRO Completes Air Drop Trial\nMassive cache of Maoist arms and explosives seized in Chhattisgarh’s Sukma\nMonsoon havoc in Himachal Pradesh: 298 dead since June 20, says SDMA\nPM Modi conveys heartfelt greetings on Parkash Purab of Sri Guru Granth Sahib Ji\nBhubaneswar to host Eastern Region Civil Aviation Ministers’ Conference on Monday\nIndia successfully conducts tests of Integrated Air Defence Weapon System off Odisha coast\nWoman set on fire, killed in Delhi for sizeable dowry\nSuccess comes from hard work, not exam scores: CJI Gavai\nCouple held in Delhi for duping actors promising key roles in their films\nRahul Gandhi meets Makhana farmers in Katihar during 'Voter Adhikar Yatra'"
    },
    {
      "news_title": "Trump names close aide Sergio Gor as US ambassador to India, also taps him as South Asia envoy",
      "news_link": "https://www.indiaweekly.biz/trump-names-sergio-gor-us-ambassador-to-india/",
      "bias": "unknown",
      "text": "President Donald Trump has nominated Sergio Gor, a close political confidant with little direct foreign policy experience, as the next US ambassador to India. The appointment, announced Friday via Trump’s social media platform Truth Social, signals a continuation of Trump’s preference for loyal aides over veteran diplomats in diplomatic roles, especially amid heightened tensions with New Delhi.\nGor’s rapid rise and influence in the Trump administration\nAt just 38 years old, Gor has swiftly climbed the ranks of conservative politics, establishing himself as one of Trump’s most powerful aides. As director of presidential personnel, he played a pivotal role in vetting and approving thousands of political appointments based primarily on loyalty to Trump. Gor’s reputation as a stern enforcer is well known in Washington. He has even clashed with high-profile figures, including Elon Musk—who, following a falling-out with Trump, accused Gor of blocking his favored nominee for NASA and labeled him “a snake.”\nDespite his influence in the White House, Gor’s foreign policy credentials are thin. His experience is largely limited to overseeing overseas travel with Trump and conducting a controversial purge of National Security Council staff who were suspected of insufficient allegiance to the president’s agenda.\nTrust, personal ties, and a new diplomatic strategy\nTrump underscored the importance of personal trust with his announcement. “For the most populous Region in the World, it is important that I have someone I can fully trust to deliver on my Agenda and help us, MAKE AMERICA GREAT AGAIN,” he wrote. He added, “Sergio will make an incredible Ambassador.” Trump also revealed that Gor will serve as special envoy for South and Central Asia, highlighting the adviser’s expanding remit in sensitive regional affairs.\nThe choice comes as many traditional diplomatic posts remain unfilled, including the top State Department position for South Asia, and as Trump has increasingly sidestepped seasoned diplomats in favor of trusted insiders. Secretary of State Marco Rubio voiced support, saying on X that Gor would be “an excellent representative of America in one of the most important relationships our nation has in the world.”\nDiplomatic challenges amid rising US-India tensions\nGor’s nomination comes on the heels of renewed friction between the US and India. Trump’s administration has pressed New Delhi with higher tariffs over its continued energy imports from Russia. At the same time, India has been warming diplomatic ties with both Russia and China, holding high-level meetings as global power dynamics evolve rapidly. Though recent US presidents have viewed India as a key counterweight to China in Asia, Trump’s strategies have tested the partnership’s limits.\nEarlier in his presidency, Trump even broached the prospect of brokering talks between India and Pakistan after a brief conflict, though India has remained wary of direct US involvement in bilateral disputes.\nFrom Uzbekistan to Washington insider\nGor was born in Uzbekistan during the last years of the Soviet Union and moved as a child to Malta before immigrating to the United States for university. His career includes roles as an adviser to Republican Senator Rand Paul, prominent anti-interventionist, as well as work as a Trump fundraiser and book publisher—and even as an amateur wedding DJ. Trump praised Gor’s ability to fill senior positions in his administration, noting a 95 percent placement rate.\nA new chapter in US-India relations\nWhile US ambassadors to India have historically been public intellectuals and notable figures—such as economist John Kenneth Galbraith and sociologist Daniel Patrick Moynihan—recent appointments have favored political connections. Former President Biden selected Los Angeles Mayor Eric Garcetti, known for his academic interest in India.\nWith Gor’s confirmation pending Senate approval, his tenure will be watched as a test of Trump’s brand of personalized diplomacy at a delicate juncture in US-India ties.\nSnoop Dogg faces backlash after criticising LGBTQ+ representation in Pixar’s 'Lightyear'"
    },
    {
      "news_title": "Know Who Is Sergio Gor, Trump’s Pick For US Envoy To India",
      "news_link": "https://odishabytes.com/know-who-is-sergio-gor-trumps-pick-for-us-envoy-to-india/",
      "bias": "unknown",
      "text": "New York: Donald Trump has nominated 38-year-old Sergio Gor as the next United States Ambassador to India, also assigning him the role of Special Envoy for South and Central Asian Affairs. The announcement was made by Trump on social media on Friday, describing Gor as a “great friend” who has “been at my side for many years.”\nGor, who currently serves as Director of the White House Presidential Personnel Office, will succeed Eric Garcetti, who served as US envoy to New Delhi from May 2023 until January 2025. The nomination comes at a sensitive time as Washington and New Delhi navigate strained ties following Trump’s recent decision to impose a 50% tariff on Indian goods, a move that has sparked concerns in trade and diplomatic circles.\nThe nomination has drawn strong support from senior US officials. Secretary of State Marco Rubio said Gor would be an “excellent representative of America” to such an important partner, while Vice President J.D. Vance called him a “fantastic ambassador.” Elbridge Colby, Deputy Secretary of Defense for Policy, described Gor as “such a wise and trusted counselor” to take on a critical diplomatic assignment.\nWho is he?\nGor has grown from a conservative political activist for Johm McCain in 2008 to become the head of the White House Presidential Personnel Office during Trump’s second term. “Before taking on the India assignment, Gor, a graduate from the George Washington University, vetted the hiring of 4,000 “America First Patriots across every Department of our Federal Government in record time”, Trump had said in his social media post on August 22.\nWhen Musk called Gor a snake…\nHowever, the announcement has also revived an old controversy. Tesla and SpaceX chief Elon Musk had once branded Sergio Gor as “a snake,” according to a past social media exchange highlighted in media reports."
    },
    {
      "news_title": "Sergio Gor Appointed as US Ambassador to India: Examining His Background and Controversies",
      "news_link": "https://www.reportwire.in/world/sergio-gor-appointed-as-us-ambassador-to-india-examining-his-background-and-controversies/",
      "bias": "unknown",
      "text": "Donald Trump has chosen Sergio Gor as the new US Ambassador to India. Gor, who previously served as the White House Director of Personnel, will also be the Special Envoy for South and Central Asian Affairs. This appointment is noteworthy due to Gor’s close ties with Trump and the controversies surrounding his background. This article delves into the life and career of Sergio Gor.\nTrump announced Gor’s appointment on social media, stating his pleasure. Gor responded, expressing his gratitude and the honor of leading the US.\nBorn in Uzbekistan in 1986, Gor’s family later resided in Malta before immigrating to the United States in 1999. He attended school in Los Angeles and later studied at George Washington University, initially under the name Gorokhovsky before shortening it to Gor.\nGor has been involved in politics, including working on John McCain’s 2008 presidential campaign and with Senator Rand Paul.\nHe served as the Chief of Staff for the Trump Victory Finance Committee in June 2020, and later as an advisor and book publishing manager for Donald Trump Jr. In November 2024, Gor was appointed the White House Director of Personnel.\nGor’s name surfaced in a dispute between Elon Musk and Trump, with Musk referring to Gor as a ‘snake’. This came after claims Gor had not completed security clearance paperwork.\nThe White House maintained that Gor had fulfilled all requirements for his clearance.\nGor’s birthplace is not explicitly stated. While his name is well known, his place of birth has never been clarified. Gor has not provided any information about it. Some sources suggest Kazakhstan. Some reports mentioned that he is a migrant from Malta. Most sources indicate that his place of birth is Tajikistan.\nGor has connections to Russia, including a trip to Moscow with Rand Paul to discuss Russia-US relations. There are also reports of a prior trip to Moscow in 2017, the reason for which is unclear.\nTrump announced Gor’s appointment on social media, highlighting Gor’s long-standing relationship with him. Gor will continue in his current position until his appointment is confirmed.\nGor has expressed his gratitude for the appointment and expressed his honor. Eric Garcetti held the previous position of US Ambassador to India until January 2025. Sergio Gor has been appointed to this position."
    },
    {
      "news_title": "Trump names Sergio Gor as US ambassador to India - THE DESTINATION",
      "news_link": "https://dailythedestination.com/trump-names-sergio-gor-as-us-ambassador-to-india/",
      "bias": "unknown",
      "text": "Trump names Sergio Gor as US ambassador to India\nGor, who is currently the director of the White House Presidential Personnel Office, would also serve as a special envoy for South and Central Asian affairs\nNEW YORK: President Donald Trump said on Friday he would nominate Sergio Gor, one of his closest aides, to be the next US ambassador to India, where he will oversee frosty relations that have worsened with the planned doubling of US tariffs on goods from India next week.\nGor, who is currently the director of the White House Presidential Personnel Office, would also serve as a special envoy for South and Central Asian affairs, Trump said.\nTrump said in a post on his Truth Social account that Gor would remain in his current position until he is confirmed for the India post by the US. Senate.\n“Sergio is a great friend who has been at my side for many years. He worked on my Historic Presidential Campaigns, published my Best Selling Books, and ran one of the biggest Super PACs, which supported our Movement,” Trump said, lauding Gor’s work in hiring staff for his second term.\nRead More: PM Shehbaz Sharif to meet Donald Trump in US next month.\n“For the most populous Region in the World, it is important that I have someone I can fully trust to deliver on my Agenda and help us, MAKE AMERICA GREAT AGAIN,” Trump wrote.\nUS-India ties have been strained by Trump’s trade war, with talks on lower tariff rates collapsing after India, the world’s fifth-largest economy, resisted opening its vast agricultural and dairy sectors. Bilateral trade between the two countries is worth more than $190 billion each year.\nGor, in a posting on X, thanked Trump for the nomination and said it would be “the honour of my life” to represent the United States in the new role.\nTrump first imposed additional tariffs of 25% on imports from India, then said they would double to 50% from August 27 as punishment for New Delhi’s increased purchases of Russian oil.\nTrump has not imposed similar tariffs on goods from China, the biggest purchaser of Russian oil.\nComments are closed, but trackbacks and pingbacks are open."
    },
    {
      "news_title": "Trump announces Sergio Gore as the next US ambassador to India",
      "news_link": "https://www.thelocalreport.in/trump-announces-sergio-gore-as-the-next-us-ambassador-to-india/",
      "bias": "unknown",
      "text": "Washington DC, 23 August: US President Donald Trump declared Sergio Gore on Friday (local time) as a special envoy for the next US Ambassador to India, and South and Central Asian Affairs.\nAnnouncing on Truth Social, Donald Trump said, “I am happy to announce that I am promoting Sergio Gore to become our next United States Ambassador to the Republic of India, and special messengers for South and Central Asian Affairs. White House until my confirmation.”\nAddressing Gore as a “great friend”, Trump expressed his confidence in the President’s personnel keeping his contribution to the White House office.\n“Sergio is a great friend who has been on my side for many years. He worked on my historic presidential campaigns, published my best -selling books, and run one of the biggest super PACs, who supported our movement. The role of Sergio as a director of the President’s personnel is required to fulfill the expected mandate. The US, the US, re -made America great.\nSergio will replace Gor Eric Garccyti, who served from 11 May, 2023 to 20 January 2025. Prior to Garceti, Kenneth Juster held the post from November 23, 2017 to January 20, 2021. Since the departure of Garceti, the US Embassy in India has been led with Interim Charge D ‘Affairs Jorgan Q.\nAndrews, who took over on January 20, 2025\nIn its last weeks, Ambassador Garcheti gave a series of speeches together, celebrating historical progress together for the United States and India, for the planet, for prosperity and for peace.\nThe appointment of Sergio Gore as an US ambassador to India comes at a time when New Delhi is working with 50 percent trade tariff, including 25 percent fine for oil purchases from Russia. (AI)"
    },
    {
      "news_title": "Trump appoints close aide Sergio Gor as US ambassador to India",
      "news_link": "https://madhyamamonline.com/world/trump-appoints-close-aide-sergio-gor-as-us-ambassador-to-india-1440251",
      "bias": "unknown",
      "text": "Trump appoints close aide Sergio Gor as US ambassador to India\ntext_fieldsWashington: US President Donald Trump has nominated Sergio Gor, a longtime aide and White House personnel director, as the next ambassador to India and special envoy for South and Central Asian affairs.\nAnnouncing the decision on Truth Social, Trump said, “I am pleased to announce that I am promoting Sergio Gor to be our next United States Ambassador to the Republic of India, and Special Envoy for South and Central Asian Affairs. Sergio and his team have hired nearly 4,000 America First Patriots across every Department of our Federal Government in RECORD time — Our Departments and Agencies are over 95% filled!”\nTrump described Gor as a “great friend” and highlighted his close association with the Trump family. “He worked on my historic presidential campaigns, published my best-selling books, and ran one of the biggest Super PACs, which supported our movement. For the most populous region in the world, it is important that I have someone I can fully trust to deliver on my agenda and help us MAKE AMERICA GREAT AGAIN. Sergio will make an incredible Ambassador. Congratulations Sergio!” he added.\nGor, who co-founded Winning Team Publishing with Donald Trump Jr., has been central to Trump’s political and publishing ventures. Responding to his nomination, Gor expressed gratitude on X, saying, “Nothing has made me prouder than to serve the American people through the GREAT work of this Administration!” Gor said on X. “It will be the honor of my life to represent the United States!” He thanked Trump for his “incredible trust and confidence”, calling the appointment a milestone in his career.\nIn his White House role, Gor has overseen the vetting of senior personnel across government, including the short-lived nomination of tech billionaire Jared Isaacman to lead NASA, which was withdrawn in June.\nGor will remain in his current position until Senate confirmation. He will succeed Eric Garcetti, who served as US ambassador in New Delhi from May 2023 until January 2025. Since Garcetti’s departure, interim Charge d’Affaires Jorgan K Andrews has been leading the US Embassy in India."
    },
    {
      "news_title": "Trump Nominates Close Aide Sergio Gor as US Ambassador to India amid Rising Trade Tensions – The Indian Awaaz",
      "news_link": "https://theindianawaaz.com/trump-nominates-close-aide-sergio-gor-as-us-ambassador-to-india-amid-rising-trade-tensions/",
      "bias": "unknown",
      "text": "Sergio Gor\nAMN / WEB DESK\nUS President Donald Trump on Friday announced his decision to nominate Sergio Gor, one of his closest aides, as the next US ambassador to India. Gor, who currently serves as the director of the White House Presidential Personnel Office, will also take on the role of special envoy for South and Central Asian affairs. Trump confirmed that Gor will remain in his present position until the Senate approves his appointment.\nIn a post on Truth Social, Trump described Gor as a “great friend” who has stood by him for years. He credited Gor with helping run his historic campaigns, publishing his best-selling books, and managing a major Super PAC supporting the “Make America Great Again” movement. “For the most populous region in the world, it is important that I have someone I fully trust to deliver on my agenda,” Trump said.\nThe nomination comes as US-India ties face growing friction. Bilateral trade, valued at more than $190 billion annually, has been overshadowed by Trump’s decision to double tariffs on Indian goods to 50% from August 27. Washington has voiced concern over India’s surging imports of Russian oil, with Treasury Secretary Scott Bessent accusing New Delhi of “profiteering” during the Ukraine conflict.\nIndia, however, has signaled openness to dialogue. Trade Minister Piyush Goyal reiterated on Friday that India is approaching future ties with the US “with a very open mind,” stressing the critical importance of the partnership.\nReacting to his nomination, Gor expressed gratitude on X, calling it “the honour of my life” to represent the United States in India."
    },
    {
      "news_title": "Trump nominates Sergio Gor as special envoy for South and Central Asia",
      "news_link": "https://amu.tv/194116/",
      "bias": "unknown",
      "text": "President Donald Trump on Friday announced he is promoting Sergio Gor, his longtime aide and current White House director of presidential personnel, to be the next US ambassador to India and special envoy for South and Central Asian affairs.\nIn a statement on his social media platform, Trump praised Gor as “a great friend” who has been at his side for years, crediting him with filling nearly 4,000 administration posts across federal agencies “in record time.” Trump said Gor will remain in his White House role until Senate confirmation.\n“For the most populous region in the world, it is important that I have someone I can fully trust to deliver on my agenda and help us MAKE AMERICA GREAT AGAIN,” Trump wrote. “Sergio will make an incredible ambassador.”\nGor’s background\nSergio Gor, born Sergey Gorokhovsky in Moscow in 1986, is an American businessman and political operative with deep ties to Republican politics. He graduated from George Washington University, where he was active in conservative groups, including College Republicans and Young America’s Foundation.\nGor worked on Sen. John McCain’s 2008 presidential campaign and later for the Republican National Committee. He served as spokesman for several Republican lawmakers, including Reps. Steve King, Michele Bachmann and Randy Forbes, before joining Sen. Rand Paul’s team in 2013, where he rose to deputy chief of staff.\nIn 2020, Gor joined the Trump orbit, first as chief of staff for the Trump Victory Finance Committee, then as a consultant and publishing manager for Donald Trump Jr. He co-founded Winning Team Publishing in 2021, which published multiple books about Trump, including Our Journey Together and Letters to Trump.\nGor later served as senior adviser to MAGA Inc. and led the Right for America political action committee supporting Trump. In November 2024, Trump appointed him director of the White House Presidential Personnel Office."
    },
    {
      "news_title": "Trump nominates close aide Sergio Gor as next US Ambassador to India - Connected to India News I Singapore l UAE l UK l USA l NRI",
      "news_link": "https://www.connectedtoindia.com/trump-nominates-close-aide-sergio-gor-as-next-us-ambassador-to-india/",
      "bias": "unknown",
      "text": "Sergio Gor, a close aide of former US President Donald Trump, has been nominated to serve as the next United States ambassador to India, as announced by Trump on Friday. Gor, who currently heads the White House Presidential Personnel Office, will also take on the additional responsibility of Special Envoy for South and Central Asian Affairs, pending confirmation by the US Senate.\nThe announcement comes at a delicate moment in US-India relations, as Washington is set to double tariffs on Indian goods from 27th August. Bilateral ties have seen increasing strain in recent months, primarily due to trade disagreements and India’s rising energy imports from Russia. With annual trade between the two nations exceeding $190 billion, the development has drawn considerable attention in both capitals.\nTrump, posting on his social media platform Truth Social, praised Gor’s longstanding association with him, saying, “Sergio is a great friend, who has been at my side for many years. He worked on my Historic Presidential Campaigns, published my Best Selling Books, and ran one of the biggest Super PACs, which supported our Movement.”\nHe added, “For the most populous Region in the World, it is important that I have someone I can fully trust to deliver on my Agenda and help us, MAKE AMERICA GREAT AGAIN.” Trump also confirmed that Gor would continue in his current role until the Senate approves his appointment.\nCongratulations to @SergioGor on his appointment as U.S. Ambassador to India.\n— Howard Lutnick (@howardlutnick) August 23, 2025\nThroughout the campaign and administration, Sergio has been a fearless advocate for President Trump and the American people. We all wish him amazing success and India is in great hands. pic.twitter.com/uNy6uUu7CE\nIn response to the nomination, Gor took to X to express his gratitude. “It would be the honor of my life to represent the United States in the new role,” he stated.\nThe nomination comes amidst a backdrop of heightened trade tensions. Trump has previously imposed a 25% tariff on Indian imports, which he now plans to double, citing India’s increasing reliance on Russian oil as a key concern. Notably, similar tariff hikes have not been applied to China, despite it being the largest buyer of Russian oil.\nUS Treasury Secretary Scott Bessent recently criticised India’s oil trade decisions, stating in an interview with CNBC, “profiteering” from the Ukraine conflict was “unacceptable.” He revealed that Russian oil currently makes up 42% of India’s total oil imports, a sharp rise from under 1% before the war. In comparison, China has increased its share only slightly, from 13% to 16%.\nOn the Indian side, Trade Minister Piyush Goyal has reiterated New Delhi’s commitment to a constructive dialogue. Speaking on Friday, he said India approaches its trade relationship with the US with “a very open mind” and emphasised that the partnership holds “consequential and important” value for both countries.\nMeanwhile, a planned visit by US trade negotiators to New Delhi, originally scheduled from 25th to 29th August, was abruptly cancelled, further underscoring the uncertainty surrounding current diplomatic and economic engagements between the two democracies."
    },
    {
      "news_title": "Sergio Gor, Trump Ally, Picked As US Ambassador To India - The Commune",
      "news_link": "https://thecommunemag.com/sergio-gor-trump-ally-picked-as-us-ambassador-to-india/",
      "bias": "unknown",
      "text": "US President Donald Trump has announced the nomination of longtime aide and trusted political strategist Sergio Gor to serve as the next United States Ambassador to India, as well as Special Envoy for South and Central Asian Affairs.\nIn a statement posted on Truth Social, Trump praised Gor’s loyalty, organisational talent, and deep involvement in his political and governmental operations. “I am pleased to announce that I am promoting Sergio Gor to be our next United States Ambassador to the Republic of India, and Special Envoy for South and Central Asian Affairs,” Trump wrote.\nHe continued, “As Director of Presidential Personnel, Sergio and his team have hired nearly 4,000 America First Patriots across every Department of our Federal Government in RECORD time — Our Departments and Agencies are over 95% filled! Sergio will remain in his current role at the White House until his confirmation.”\nTrump highlighted Gor’s wide-ranging contributions to his administration and campaign, saying, “Sergio is a great friend who has been at my side for many years. He worked on my Historic Presidential Campaigns, published my Best Selling Books, and ran one of the biggest Super PACs, which supported our Movement.”\n“For the most populous Region in the World, it is important that I have someone I can fully trust to deliver on my Agenda and help us, MAKE AMERICA GREAT AGAIN. Sergio will make an incredible Ambassador. Congratulations Sergio!” said Trump.\nGor responded with gratitude in a post on X, writing, “Beyond grateful to @realDonaldTrump for his incredible trust and confidence in nominating me to be his next US Ambassador to India and Special Envoy for South and Central Asian Affairs! Nothing has made me prouder than to serve the American people through the GREAT work of this Administration! Our White House has achieved historic results in MAKING AMERICA GREAT AGAIN! It will be the honor of my life to represent the United States!”\nThe nomination drew praise from top Trump administration officials. Vice President JD Vance wrote, “Sergio is a great guy and will make a fantastic ambassador for our country to India. So much of our success over the last few months was due to Sergio’s hard work. I’m grateful to POTUS for giving him this new role.”\nSecretary of State Marco Rubio also weighed in: “I am excited about the President’s decision to nominate @SergioGor to be our next Ambassador to India. He will be an excellent representative of America in one of the most important relationships our nation has in the world.”\nFBI Director Kash Patel added his support, posting simply, “Congrats @SergioGor, outstanding pick for Ambassador to India.” The 38-year-old Gor quickly rose in conservative politics, becoming one of the most powerful, albeit low-profile, aides in the White House. His task was to vet around 4,000 appointees to ensure their utmost loyalty to Trump.\n-IANS\nSubscribe to our channels on Telegram, WhatsApp, and Instagram and get the best stories of the day delivered to you personally."
    },
    {
      "news_title": "Who is Sergio Gor? Trump's Pick For Next US Ambassador To India",
      "news_link": "https://www.ndtvprofit.com/politics/who-is-sergio-gor-trumps-pick-for-next-us-ambassador-to-india",
      "bias": "unknown",
      "text": "Who is Sergio Gor? Trump's Pick For Next US Ambassador To India\nAnnouncing the decision on social media platform Truth Social, Trump said Gor would also serve as his special envoy for South and Central Asian Affairs.\nPresident Donald Trump has nominated longtime aide Sergio Gor as the next US ambassador to India, elevating the Republican operative and campaign fundraiser to one of Washington's most critical diplomatic posts at a time of rising tensions with New Delhi.\nAnnouncing the decision on social media platform Truth Social, Trump said Gor would also serve as his special envoy for South and Central Asian Affairs. He praised Gor's record as head of the White House Presidential Personnel Office, where he oversaw the hiring of nearly 4,000 \"America First Patriots across every Department of our Federal Government in RECORD time.\"\n\"Sergio is a great friend, who has been at my side for many years,\" Trump wrote. \"For the most populous Region in the World, it is important that I have someone I can fully trust to deliver on my Agenda.\"\nGor has little direct experience with India, but that has rarely been a disqualification for ambassadorial appointments, which presidents from both parties often reserve for political allies and donors. Under President Joe Biden, the post was held by Eric Garcetti, the former Los Angeles mayor who served as co-chair of Biden's 2020 campaign.\nMarco Rubio, the US secretary of state, took to X to express his enthusiasm over the President's pick.\nI am excited about the Presidents decisions to nominate @SergioGor to be our next Ambassador to India. He will be an excellent representative of America in one of the most important relationships our nation has in the world.\n— Marco Rubio (@marcorubio) August 22, 2025\n\"Gor will be an excellent representative of America in one of the most important relationships our nation has in the world,\" said Rubio in his post.\nGor's name has not been without controversy. Reports earlier this year suggested that while he oversaw security vetting for thousands of federal employees, Gor himself had not completed paperwork for a permanent clearance and was operating under an interim one. The White House rejected the claims, insisting his clearance was active and his documentation in order.\nHe also reportedly clashed with Tesla CEO Elon Musk during Musk's brief tenure in the Trump administration.\nGor now takes on the ambassadorial role as US–India ties come under strain. New Delhi has refused to curb purchases of Russian oil despite Washington's demands following the Ukraine war. Trump has responded by doubling tariffs on Indian goods to 50% and describing India as a \"dead\" economy with \"obnoxious\" trade barriers."
    },
    {
      "news_title": "Trump Names Sergio Gor As Next US Ambassador To India",
      "news_link": "https://www.newsmobile.in/top-story/trump-names-sergio-gor-as-next-us-ambassador-to-india/",
      "bias": "unknown",
      "text": "US President Donald Trump on Friday announced he is appointing Sergio Gor, the White House personnel director and longtime Trump ally, as the next US ambassador to India and special envoy for South and Central Asian Affairs.\n“I am pleased to announce that I am promoting Sergio Gor to be our next United States Ambassador to the Republic of India, and Special Envoy for South and Central Asian Affairs,” Trump said in a post on Truth Social. “Sergio and his team have hired nearly 4,000 America First Patriots across every Department of our Federal Government in RECORD time — Our Departments and Agencies are over 95% filled!”\nGor has been a prominent figure in Trump’s political and business orbit. He co-founded Winning Team Publishing with Donald Trump Jr., released two of Trump’s books, and helped run one of the largest super PACs backing the former president’s campaigns.\n“Sergio is a great friend, who has been at my side for many years,” Trump added. “He worked on my historic presidential campaigns, published my best-selling books, and ran one of the biggest super PACs, which supported our movement. For the most populous region in the world, it is important that I have someone I can fully trust to deliver on my agenda and help us MAKE AMERICA GREAT AGAIN. Sergio will make an incredible Ambassador. Congratulations Sergio!”\nBeyond grateful to @realDonaldTrump for his incredible trust and confidence in nominating me to the be his next U.S. Ambassador to India and Special Envoy for South and Central Asian Affairs! Nothing has made me prouder than to serve the American people through the GREAT work of…\n— Sergio Gor (@SergioGor) August 22, 2025\nGor, who has overseen personnel decisions across federal agencies during Trump’s second term, expressed gratitude after the nomination.\n“Nothing has made me prouder than to serve the American people through the GREAT work of this Administration!” he wrote on X. “It will be the honor of my life to represent the United States!”\nHe thanked Trump for his “incredible trust and confidence” and praised the administration’s record, highlighting its accomplishments in “MAKING AMERICA GREAT AGAIN.”\nAs personnel director, Gor has been central to staffing the administration, vetting thousands of hires across departments. That included Trump’s short-lived nomination of tech billionaire Jared Isaacman to head NASA, a bid that was withdrawn in June.\nGor will continue in his White House role until the Senate confirms his ambassadorship. He will succeed Eric Garcetti, who served as ambassador from May 2023 until Trump’s inauguration in January 2025. Since Garcetti’s departure, Charge d’Affaires Jorgan K. Andrews has led the US Embassy in New Delhi."
    },
    {
      "news_title": "Trump names close political aide Sergio Gor as ambassador to India",
      "news_link": "https://www.thedailystar.net/news/world/news/trump-names-close-political-aide-sergio-gor-ambassador-india-3968771",
      "bias": "unknown",
      "text": "Trump names close political aide as ambassador to India\nPresident Donald Trump on Friday tapped close political aide Sergio Gor as US ambassador to India, sending one of his feared enforcers at a delicate time in ties with New Delhi.\nThe 38-year-old Gor rose quickly in conservative politics to become one of the most powerful, if low-profile, aides in the White House with a task of vetting some 4,000 appointees to ensure utmost loyalty to Trump.\nGor's influence does not include extensive experience in foreign policy.\n\"For the most populous Region in the World, it is important that I have someone I can fully trust to deliver on my Agenda and help us, MAKE AMERICA GREAT AGAIN,\" Trump wrote on his Truth Social platform. \"Sergio will make an incredible Ambassador,\" he wrote.\nTrump wrote that Gor would also hold a role of special envoy for South and Central Asia.\nComments"
    },
    {
      "news_title": "Who’s Sergio Gor? Trump nominates shut aide as US Ambassador to India; replaces Eric Garcetti – Instances of India",
      "news_link": "https://todayworldnews.in/2025/08/23/whos-sergio-gor-trump-nominates-shut-aide-as-us-ambassador-to-india-replaces-eric-garcetti-instances-of-india/",
      "bias": "unknown",
      "text": null
    },
    {
      "news_title": "Trump Nominates Sergio Gor As Next US Envoy To India",
      "news_link": "https://stratnewsglobal.com/world-news/trump-nominates-sergio-gor-as-next-us-envoy-to-india/",
      "bias": "unknown",
      "text": "US President Donald Trump on Friday announced his intent to nominate longtime aide Sergio Gor as the next ambassador to India, amid strained bilateral ties and an impending hike in US tariffs on Indian goods set to take effect next week.\nGor, who is currently the director of the White House Presidential Personnel Office, would also serve as a special envoy for South and Central Asian affairs, Trump said.\nTrusted Aide\nTrump said in a post on his Truth Social account that Gor would remain in his current position until he is confirmed for the India post by the US Senate.\n“Sergio is a great friend, who has been at my side for many years. He worked on my Historic Presidential Campaigns, published my Best Selling Books, and ran one of the biggest Super PACs, which supported our Movement,” Trump said, lauding Gor’s work in hiring staff for his second term.\n“For the most populous Region in the World, it is important that I have someone I can fully trust to deliver on my Agenda and help us, MAKE AMERICA GREAT AGAIN,” Trump wrote.\nCongratulations to @SergioGor on his appointment as U.S. Ambassador to India.\nThroughout the campaign and administration, Sergio has been a fearless advocate for President Trump and the American people. We all wish him amazing success and India is in great hands. pic.twitter.com/uNy6uUu7CE\n— Howard Lutnick (@howardlutnick) August 23, 2025\n‘Honor Of My Life’\nUS-India ties have been strained by Trump’s trade war, with talks on lower tariff rates collapsing after India resisted opening its vast agricultural and dairy sectors. Bilateral trade between the two countries is worth more than $190 billion each year.\nGor, in a posting on X, thanked Trump for the nomination and said it would be “the honor of my life” to represent the United States in the new role.\nTrump first imposed additional tariffs of 25% on imports from India, then said they would double to 50% from August 27 as punishment for New Delhi’s increased purchases of Russian oil. Trump has not imposed similar tariffs on goods from China, the biggest purchaser of Russian oil.\n‘Profiteering’\nUS Treasury Secretary Scott Bessent on Tuesday accused India of “profiteering” in its sharply increased purchases of Russian oil during the war in Ukraine and said Washington viewed the situation as unacceptable.\nBessent told CNBC in an interview that Russian oil now accounted for 42% of India’s total oil purchases, up from under 1% before the war, while China, the largest purchaser of Russian oil, had increased its share to 16% from 13%.\nIndia is addressing its future trade relationship with the United States with a “very open mind”, Trade Minister Piyush Goyal said on Friday, while underscoring the consequential and important nature of the relationship to both countries.\nTrump’s announcement about Gor’s nomination came shortly after the abrupt cancellation of a planned visit by US trade negotiators to New Delhi from August 25-29.\n(With inputs from Reuters)"
    },
    {
      "news_title": "Sergio Gor - US Ambassador to India 2025 I India CSR",
      "news_link": "https://indiacsr.in/sergio-gor-us-ambassador-to-india-2025/",
      "bias": "unknown",
      "text": "Sergio Gor, currently Director of the White House Presidential Personnel Office since 2025, has been a long-time associate of Trump.\nWashington (India CSR): US President Donald Trump on Friday announced that Sergio Gor will serve as the next United States Ambassador to India and also take on the role of Special Envoy for South and Central Asian Affairs. The announcement was made on Trump’s social media platform, Truth Social.\n“I am pleased to announce that I am promoting Sergio Gor to be our next United States Ambassador to the Republic of India, and Special Envoy for South and Central Asian Affairs,” Trump wrote. “As Director of Presidential Personnel, Sergio and his team have hired nearly 4,000 America First Patriots across every Department of our Federal Government in RECORD time — Our Departments and Agencies are over 95% filled!”\nTrump added that Gor will continue in his current position until the Senate confirms his new role.\nWho is Sergio Gor?\nSergio Gor, currently Director of the White House Presidential Personnel Office since 2025, has been a long-time associate of Trump. Born in Tashkent, Uzbekistan, in 1986—then part of the Soviet Union—Gor later spent some years in Malta before moving to the United States.\nTrump, praising his loyalty, said: “Sergio is a great friend, who has been at my side for many years. He worked on my Historic Presidential Campaigns, published my Best Selling Books, and ran one of the biggest Super PACs, which supported our Movement.”\nPolitical Career and Trump Connection\nGor’s association with Trump dates back to 2020, when he served as chief of staff of the Trump Victory Finance Committee. He later became a senior advisor to MAGA Inc. and also led Right for America, a political action committee backing Trump.\nOver the years, Gor has been a key political operator in conservative circles. He has managed fundraising, overseen campaign messaging, and steered major PACs aligned with Trump’s agenda. His rapid rise in Trump’s inner circle reflects both his political acumen and unwavering loyalty.\nControversies and Criticism\nDespite his close ties with Trump, Gor has not been free of controversy. Reports suggest he was linked to delays in security clearance submissions, even though he personally vetted numerous administration appointees.\nHe has also been cited in accounts of tensions between Trump and Elon Musk, with some alleging that Gor played a role in the deterioration of that relationship. The New York Post noted his involvement in personnel disputes and political infighting inside Trump’s camp.\nTrump’s Trust and Strategic Role\nFor Trump, however, Gor’s loyalty and efficiency outweigh criticism. “Sergio’s role as Director of Presidential Personnel has been essential to delivering on the unprecedented Mandate that we received from the American People,” Trump wrote.\nHighlighting the importance of India in global geopolitics, Trump added: “For the most populous Region in the World, it is important that I have someone I can fully trust to deliver on my Agenda and help us, MAKE AMERICA GREAT AGAIN.”\nWhat This Means for India-US Relations\nIf confirmed, Gor will step into a vital diplomatic position at a time when US-India ties remain strategically significant. Washington and New Delhi have expanded cooperation in defense, technology, and trade, but policy shifts under Trump’s leadership often draw global attention for their unpredictability.\nAs Special Envoy for South and Central Asian Affairs, Gor would also play a critical role in shaping America’s approach to the wider region, balancing ties with India, Pakistan, Afghanistan, and Central Asian republics.\nFor India, Gor’s appointment signals Trump’s intention to keep close allies in key diplomatic roles—individuals he can trust to push forward his vision of an “America First” foreign policy while deepening ties with one of the world’s fastest-growing democracies.\n(India CSR)"
    },
    {
      "news_title": "Trump's close aide Sergio Gor named US Ambassador to India",
      "news_link": "https://www.awazthevoice.in/world-news/trump-s-close-aide-sergio-gor-named-us-ambassador-to-india-40734.html",
      "bias": "unknown",
      "text": "New York/Washington\nPresident Donald Trump has nominated his longtime aide Sergio Gor, who is currently the Director of the White House Presidential Personnel Office, as the next US Ambassador to India.\nIn a social media post on Friday, Trump said Gor, 38, is a \"great friend, who has been at my side for many years\".\n\"I am pleased to announce that I am promoting Sergio Gor to be our next United States Ambassador to the Republic of India,\" he said.\nHe would also serve as a special envoy for South and Central Asian affairs, Trump said.\nThe announcement comes amid tariff tensions between Washington and New Delhi.\nTrump said Gor and his team had overseen the hiring of nearly 4,000 officials across federal departments and agencies “in record time,” adding that over 95 per cent of positions were now filled.\nGor will remain in his current role at the White House until his confirmation by the Senate, he said.\n\"Gor has worked on my historic presidential campaigns, published my best-selling books, and ran one of the biggest Super PACs, which supported our movement,” Trump wrote.\nThe president described Gor’s role in the administration as “essential” in delivering on his political mandate.\n“For the most populous region in the world, it is important that I have someone I can fully trust to deliver on my agenda and help us make America great again. Sergio will make an incredible Ambassador. Congratulations Sergio!” Trump said.\nGor in a social media post said he is \"beyond grateful\" to Trump for his incredible trust and confidence in nominating him to be the next US Ambassador to India and Special Envoy for South and Central Asian Affairs.\n\"It will be the honour of my life to represent the United States,\" he said.\nVice President JD Vance in a social media post said Gor \"will make a fantastic ambassador for our country to India\".\nALSO READ: Dr. Khadeeja Mumtas quit career to crusade for Muslim women's rights within Islam\nGor will succeed Eric Garcetti, who served as ambassador from May 2023 to January 2025."
    },
    {
      "news_title": "Trump nominates loyal aide Sergio Gor as US Ambassador to India",
      "news_link": "https://www.socialnews.xyz/2025/08/22/trump-nominates-loyal-aide-sergio-gor-as-us-ambassador-to-india/",
      "bias": "unknown",
      "text": "Washington, Aug 23 (SocialNews.XYZ) US President Donald Trump has announced the nomination of longtime aide and trusted political strategist Sergio Gor to serve as the next United States Ambassador to India, as well as Special Envoy for South and Central Asian Affairs.\nIn a statement posted on Truth Social, Trump praised Gor’s loyalty, organisational talent, and deep involvement in his political and governmental operations. “I am pleased to announce that I am promoting Sergio Gor to be our next United States Ambassador to the Republic of India, and Special Envoy for South and Central Asian Affairs,” Trump wrote.\nHe continued, “As Director of Presidential Personnel, Sergio and his team have hired nearly 4,000 America First Patriots across every Department of our Federal Government in RECORD time — Our Departments and Agencies are over 95% filled! Sergio will remain in his current role at the White House until his confirmation.”\nTrump highlighted Gor’s wide-ranging contributions to his administration and campaign, saying, “Sergio is a great friend who has been at my side for many years. He worked on my Historic Presidential Campaigns, published my Best Selling Books, and ran one of the biggest Super PACs, which supported our Movement.”\n“For the most populous Region in the World, it is important that I have someone I can fully trust to deliver on my Agenda and help us, MAKE AMERICA GREAT AGAIN. Sergio will make an incredible Ambassador. Congratulations Sergio!” said Trump.\nGor responded with gratitude in a post on X, writing, “Beyond grateful to @realDonaldTrump for his incredible trust and confidence in nominating me to be his next US Ambassador to India and Special Envoy for South and Central Asian Affairs! Nothing has made me prouder than to serve the American people through the GREAT work of this Administration! Our White House has achieved historic results in MAKING AMERICA GREAT AGAIN! It will be the honor of my life to represent the United States!”\nThe nomination drew praise from top Trump administration officials. Vice President JD Vance wrote, “Sergio is a great guy and will make a fantastic ambassador for our country to India. So much of our success over the last few months was due to Sergio’s hard work. I’m grateful to POTUS for giving him this new role.”\nSecretary of State Marco Rubio also weighed in: “I am excited about the President’s decision to nominate @SergioGor to be our next Ambassador to India. He will be an excellent representative of America in one of the most important relationships our nation has in the world.”\nFBI Director Kash Patel added his support, posting simply, “Congrats @SergioGor, outstanding pick for Ambassador to India.”\nThe 38-year-old Gor quickly rose in conservative politics, becoming one of the most powerful, albeit low-profile, aides in the White House. His task was to vet around 4,000 appointees to ensure their utmost loyalty to Trump.\nSource: IANS\nAbout Gopi\nGopi Adusumilli is a Programmer. He is the editor of SocialNews.XYZ and President of AGK Fire Inc.\nHe enjoys designing websites, developing mobile applications and publishing news articles on current events from various authenticated news sources.\nWhen it comes to writing he likes to write about current world politics and Indian Movies. His future plans include developing SocialNews.XYZ into a News website that has no bias or judgment towards any.\nHe can be reached at gopi@socialnews.xyz"
    },
    {
      "news_title": "Trump names Sergio Gor as U.S. ambassador to India amid rising trade tensions",
      "news_link": "https://americanbazaaronline.com/2025/08/22/trump-names-sergio-gor-as-u-s-ambassador-to-india-466630/",
      "bias": "unknown",
      "text": "Gor, 38, currently serves as director of the White House Presidential Personnel Office.\nBy AB Wire\nPresident Donald Trump announced Friday that he will nominate Sergio Gor, a close aide, as the next U.S. ambassador to India, a post that will come with the added role of special envoy for South and Central Asian affairs.\nThe move comes at a time of heightened strain between Washington and New Delhi, with U.S. tariffs on Indian imports set to double next week.\nTrump made the announcement via social media, praising Gor’s work as director of the White House Presidential Personnel Office. He wrote:\n“Sergio’s role as Director of Presidential Personnel has been essential to delivering on the unprecedented Mandate that we received from the American People. For the most populous Region in the World, it is important that I have someone I can fully trust to deliver on my Agenda and help us, MAKE AMERICA GREAT AGAIN.”\nGor, 38, will remain in his personnel post until confirmed by the Senate. Known for his strict approach to vetting candidates for top administration jobs, Gor earned Trump’s confidence—and occasional criticism from detractors—by blocking hires who had previously criticized the president.\nHis methods, which included combing through social media histories of potential appointees, sparked controversy, with former special adviser Elon Musk calling him “a snake” after claiming Gor derailed the nomination of a Musk ally for NASA administrator.\nThe ambassadorial appointment comes amid growing U.S.-India tensions. Trump has announced that tariffs on Indian goods—already raised by 25%—will climb to 50% on August 27. The administration argues that India’s increased purchases of Russian oil during the war in Ukraine justify the hike, a position reinforced by Treasury Secretary Scott Bessent, who this week accused India of “profiteering” from discounted crude.\nTrade talks between the two nations have stalled over Washington’s demand that India open its agricultural and dairy markets, while New Delhi remains resistant. Sharp escalation in tariffs risks further damaging one of America’s most important strategic relationships in Asia.\nIf confirmed, Gor will succeed Eric Garcetti, who served as the U.S. ambassador to India from 2023 to January this year.\nBorn in Tashkent, then part of the Uzbek Soviet Socialist Republic in the Soviet Union, Gor emigrated to the United States with his family in 1999.\nHe attended George Washington University in Washington, D.C., where he was actively involved with the College Republicans and founded the university’s chapter of Young America’s Foundation."
    },
    {
      "news_title": "Elon’s ‘Snake': Trump Nominates His Personnel Chief Sergio Gor as U.S. Ambassador to India Amid Diplomatic Crisis - American Kahani",
      "news_link": "https://americankahani.com/lead-stories/elons-snake-trump-nominates-his-personnel-chief-sergio-gor-as-u-s-ambassador-to-india-amid-diplomatic-crisis/",
      "bias": "unknown",
      "text": "Elon’s ‘Snake’: Trump Nominates His Personnel Chief Sergio Gor as U.S. Ambassador to India Amid Diplomatic Crisis\n- His success or failure in New Delhi may well determine whether the current crisis represents a temporary setback or a fundamental shift in U.S.-India relations.\nPresident Donald Trump’s appointment of Sergio Gor as the next U.S. Ambassador to India comes at one of the most challenging periods in U.S.-India relations in decades, as the two nations grapple with trade disputes, geopolitical tensions, and fundamental disagreements over strategic partnerships.\nThe 38-year-old Sergio Gor, born Sergio Gorokhovsky in Tashkent, Uzbekistan, which was part of the Soviet Union at the time, represents one of Trump’s most trusted advisers. A professing Catholic who tells others he grew up on the tiny Mediterranean island nation of Malta, Gor graduated from high school in suburban Los Angeles before attending George Washington University, where he was active in conservative politics.\nGor has built his career around loyalty to Trump’s agenda. He entered Trump World through his business ties with the president’s eldest son, Donald Trump Jr. In 2021, the two founded Winning Team Publishing, cementing a relationship that would prove crucial to his ascent within Trump’s inner circle.\nAs Director of the Presidential Personnel Office, Gor has wielded considerable influence over the administration’s hiring practices. According to Politico, he “endeared himself to the president and his family for adopting a zero tolerance policy toward job-seekers who had been critical of Trump in the past, often scouring their social media posts and occasionally intervening to block hirings.” This aggressive approach to ensuring loyalty has made him both a trusted confidant and a controversial figure within Republican circles.\nThe appointment has not been without friction. Notably, former special adviser Elon Musk slammed Gor as “a snake,” accusing him of convincing Trump to pull the nomination of a Musk confidant to serve as the next NASA administrator.\nA Critical Diplomatic Mission\nGor’s appointment comes as U.S.-India relations face unprecedented strain. As of mid-August 2025, tariffs stand at 50%, with no formal resolution in sight. The Trump administration imposed a 25 per cent tariff on India on 7 August, followed by a further 25 per cent that is set to go into effect on 27 August.\nThe diplomatic crisis has multiple dimensions. In July 2025, President Trump criticized India for continuing oil trade with Russia despite ongoing Western sanctions. Earlier in July, U.S. Senator Lindsey Graham introduced a sanctions bill proposing tariffs of up to 500% on countries—including India—that continued to trade oil with Russia.\nAccording to analysis from The Diplomat, “The U.S. cannot afford to isolate its most important partner in countering China’s rise in the Indo-Pacific region,” highlighting the strategic importance of the relationship despite current tensions. However, experts suggest that “India won’t give up on Russia or its strategic autonomy, experts say, even as areas of friction with the U.S. grow.”\nTrump’s choice of Gor signals several strategic priorities for his India policy. First, by selecting someone from his innermost circle of advisers, Trump demonstrates the high priority he places on managing this critical relationship. As Trump stated in his announcement, “For the most populous Region in the World, it is important that I have someone I can fully trust to deliver on my Agenda and help us, MAKE AMERICA GREAT AGAIN”.\nSecond, Gor’s background in enforcing loyalty and screening personnel suggests Trump may be seeking to fundamentally reshape how the U.S. approaches India policy, potentially moving away from the traditional diplomatic establishment’s approach. His experience in “President Trump’s efforts to reshape the federal government and appoint loyalists” could translate into a more transactional approach to U.S.-India relations.\nThe appointment also reflects Trump’s preference for personal relationships in diplomacy. The Brookings Institution notes that “The current moment’s frictions were predictable, but the challenge is that they have broken in a bad direction for India-U.S. ties”, suggesting that traditional diplomatic channels may have proven insufficient.\nGor will face immediate challenges upon confirmation. Carnegie Endowment warns that “The repoliticization of bilateral relations is a slow-motion catastrophe”, while Bloomberg reports that “In the weeks after India and Pakistan agreed to a ceasefire in May, officials in New Delhi seethed over Donald Trump’s claims that he brokered an end to a four-day armed conflict.”\nThe new ambassador will need to navigate complex trade negotiations, address Indian concerns about U.S. tariff policies, and manage the fundamental disagreement over India’s relationship with Russia. India’s multipolar alignments—balancing ties with the West, China, and Russia—were seen as both strategic pragmatism and a point of U.S. concern.\nDespite these challenges, some analysts remain cautiously optimistic. Chatham House suggests that “relations will endure in the long run”, pointing to the underlying strategic interests that bind the two democracies together, particularly in countering China’s rise in the Indo-Pacific.\nGor’s appointment represents a significant test of whether Trump’s loyalty-first approach to personnel can translate into effective diplomacy in one of America’s most important bilateral relationships. His success or failure in New Delhi may well determine whether the current crisis represents a temporary setback or a fundamental shift in U.S.-India relations.\n(Top image, Sergio Gor/Facebook)"
    },
    {
      "news_title": "Who Is Sergio Gor? Trump Picks Him as Next US Ambassador to India",
      "news_link": "https://loudfact.com/who-is-sergio-gor-trump-picks-him-as-next-us-ambassador-to-india/",
      "bias": "unknown",
      "text": "President Donald Trump announced that he has nominated Sergio Gor to serve as the next US Ambassador to India and Special Envoy for South and Central Asian Affairs. The announcement was made on Trump’s Truth Social account.\n“I am pleased to announce that I am promoting Sergio Gor to be our next United States Ambassador to the Republic of India, and Special Envoy for South and Central Asian Affairs,” Trump wrote.\nTrump Praises Gor’s Loyalty and Record\nTrump highlighted Gor’s achievements as Director of Presidential Personnel, saying:\n“Sergio and his team have hired nearly 4,000 America First Patriots across every Department of our Federal Government in RECORD time — Our Departments and Agencies are over 95% filled!”\nTrump added that Gor is someone he can “fully trust” to deliver on his foreign policy agenda. “For the most populous region in the world, it is important that I have someone I can fully trust to deliver on my agenda and help us MAKE AMERICA GREAT AGAIN,” Trump stated.\nGor will continue in his current role at the White House until his Senate confirmation.\nAppointment Comes Amid US-India Tensions\nGor’s nomination comes at a time of increasing tensions between the US and India. The relations between the US and India have cooled due to India’s ongoing oil trade with Russia amid the Ukraine conflict.\nTrump plans to impose a 50% tariff on Indian imports starting August 27, including a 25% penalty tied to Russian oil purchases.\nWho Is Sergio Gor?\nSergio Gor is a longtime Trump loyalist and currently serves as the Director of Presidential Personnel at the White House. He played a key role in hiring America First Patriots, filling over 95% of federal positions, according to Trump.\nGor previously worked on Trump’s presidential campaigns, helped publish Trump’s best-selling books, and led a major Super PAC supporting the former president. He is widely considered one of the most influential figures shaping Trump’s political movement and government staffing strategy.\nWhat’s Next?\nGor will maintain his White House responsibilities until the Senate confirms his appointment as Ambassador to India. If confirmed, his role will be crucial in managing US-India relations amid economic and geopolitical challenges in South and Central Asia."
    }
  ]
}