{
  "story_id": "GN_20250823_202556_632fa19d",
  "metadata": {
    "title": "Judge blocks Trump from cutting funding from 34 cities and counties over 'sanctuary' policies",
    "timestamp": "2025-08-23T20:25:56.841157",
    "url": "https://ground.news/article/judge-blocks-trump-from-cutting-funding-from-34-cities-and-counties-over-sanctuary-policies_66ca03"
  },
  "bias_distribution": {
    "total_sources": "116",
    "leaning_left": "32",
    "center": "51",
    "leaning_right": "6"
  },
  "perspective_summaries": {
    "left": [
      "A judge ruled that the Trump administration cannot deny funding to Boston, Chicago, Denver, Los Angeles, and 30 other cities over 'sanctuary' policies, as stated by U.S. District Judge William Orrick.",
      "U.S. District Judge William Orrick issued a preliminary injunction to protect sanctuary jurisdictions from stripped federal funds.",
      "The Trump administration seeks to pressure these communities to support immigration enforcement, as stated in one of their executive orders.",
      "Cities that sued claim that billions of dollars in funding are at risk due to the administration's actions against sanctuary policies."
    ],
    "center": [
      "On Friday evening, U.S. District Judge William Orrick issued a ruling preventing the Trump administration from withholding federal funds from a group of cities and counties—including major municipalities such as Boston, Chicago, Denver, and Los Angeles—due to their sanctuary policies that restrict collaboration with federal immigration authorities.",
      "This decision came after President Trump issued executive orders instructing federal officials to withhold funding from jurisdictions that implement policies protecting undocumented immigrants from federal immigration enforcement.",
      "In May, a list identifying over 500 sanctuary jurisdictions as noncompliant was released by Homeland Security, while the Justice Department initiated lawsuits against several cities, including New York and Los Angeles, regarding their sanctuary policies.",
      "Judge Orrick called the administration's actions an unconstitutional coercive threat and extended a preliminary injunction blocking funding cuts, noting the administration offered no opposition to the extension.",
      "The ruling preserves billions of dollars in federal funds for sanctuary jurisdictions and signals judicial resistance to the administration's efforts to punish cities limiting immigration enforcement cooperation."
    ],
    "right": [
      "A federal judge ruled that the Trump administration cannot deny funding to 34 cities and counties due to their 'sanctuary' policies, which limit cooperation with federal immigration enforcement.",
      "U.S. District Judge William Orrick extended an injunction blocking the administration from withholding federal money from local jurisdictions.",
      "Judge Orrick described the administration's actions as an unconstitutional 'coercive threat' and noted that no opposition was provided against the injunction.",
      "Cities and counties successfully challenged the federal government's actions in court, stressing that billions of dollars were at risk."
    ]
  },
  "sources": [
    {
      "news_title": "Judge blocks Trump from cutting funding from 34 cities and counties — including Denver — over \"sanctuary’\"policies",
      "news_link": "https://coloradosun.com/2025/08/23/denver-immigration-funding-trump-administration-court-ruling/",
      "bias": "Lean Left",
      "text": "By Sudhin Thanawala, The Associated Press\nA judge ruled late Friday the Trump administration cannot deny funding to Boston, Chicago, Denver, Los Angeles and 30 other cities and counties because of policies that limit cooperation with federal immigration efforts.\nU.S. District Judge William Orrick in San Francisco extended a preliminary injunction blocking the administration from cutting off or conditioning the use of federal funds for so-called “sanctuary” jurisdictions. His earlier order protected more than a dozen other cities and counties, including San Francisco, Portland and Seattle.\nAn email to the White House late Friday was not immediately returned. In his ruling, Orrick said the administration had offered no opposition to an extended injunction except to say the first injunction was wrong. It has appealed the first order.\nOrrick also blocked the administration from imposing immigration-related conditions on two particular grant programs.\nThe Trump administration has ratcheted up pressure on sanctuary communities as it seeks to make good on President Donald Trump’s campaign promise to remove millions of people in the country illegally.\nOne executive order issued by Trump directs Attorney General Pam Bondi and Homeland Security Secretary Kristi Noem to withhold federal money from sanctuary jurisdictions. Another order directs every federal agency to ensure that payments to state and local governments do not “abet so-called ‘sanctuary’ policies that seek to shield illegal aliens from deportation.”\nThe cities and counties that sued said billions of dollars were at risk.\nOrrick, who was nominated by President Barack Obama, said the executive orders and the “executive actions that have parroted them” were an unconstitutional “coercive threat.”\nIn May, the Department of Homeland Security published a list of more than 500 “sanctuary jurisdictions,” saying each one would receive formal notification that the government had deemed them noncompliant. It also said it would inform them if they were believed to be in violation of any federal criminal statutes.\nThe list was later removed from the department’s website after critics noted it included localities that have actively supported the administration’s tough immigration policies.\nThe Justice Department has also sued New York, Los Angeles and other cities over their sanctuary policies.\nThere is no strict definition for sanctuary cities, but the terms generally describe places that limit cooperation with Immigration and Customs Enforcement. ICE enforces immigration laws nationwide but seeks help from state and local authorities to identify immigrants wanted for deportation and hold them for federal officers."
    },
    {
      "news_title": "Judge blocks Trump admin from slashing ‘sanctuary city’ funding",
      "news_link": "https://thehill.com/regulation/court-battles/5467172-federal-judge-trump-administration-sanctuary-cities-funding/",
      "bias": "Center",
      "text": null
    },
    {
      "news_title": "The judge has a little explaining to do",
      "news_link": "https://www.americanthinker.com/blog/2025/08/the_judge_has_a_little_explaining_to_do.html",
      "bias": "Far Right",
      "text": "The judge has a little explaining to do\nIt finally happened. Sensible New Yorkers have come to terms with the damage that “getting Trump” has done to their image as a place to invest money. After all, why would any investor or business owner want to operate in a state where a “fraud” case can be invented against you? I have a feeling that a lot of people with wealth in New York started making plans to pack up to Florida or elsewhere. You can’t blame them for saying: “They ‘got’ Trump, I’m next.” Last, but not least, who remembers Kevin O’Leary telling a CNN host: “What fraud? This is not about Trump anymore”?\nAs always, we check with Professor Jonathan Turley for some perspective:\nFor some of us who covered that trial, the most vivid image of Engoron came at the start. He indicated that he did not want cameras in the courtroom, but when the networks showed up, Engoron took off his glasses and seemed to pose for the cameras.\nIt was a ‘Sunset Boulevard’ moment. We only need Gloria Swanson looking into the camera to speak to ‘those wonderful people out there in the dark!’ and announcing ‘all right, [Ms. James], I’m ready for my close-up.’\nThe close-up was not a good idea, and, on appeal, it was perfectly disastrous. The court found little legal or factual basis for his fine. The purported witnesses not only did not lose a dime, but they testified that they made money on the loans and wanted new loans with the Trump administration. That did not move Engoron. From the start, he was speaking to those ‘wonderful people out there.’\nYou did not have to go far. In both the civil and criminal trials of Trump in New York, there was a carnival atmosphere in the street outside the courthouse. It was really not derangement as much as delirium. Democrat New York Attorney General Letitia James had injected lawfare directly into the veins of New Yorkers. Pledging in her campaign to bag Trump (without bothering to name any crime or violation), James was elected based on her recreational rather than legal appeal.\nYet, James could not have succeeded if she had not had a judge willing to ignore reality and cook the books on the fines. She needed a partner in lawfare. She needed Engoron.\nEven for some anti-Trump commentators, the judgment was impossible to defend, and some acknowledged that they had never seen any case like this one brought in New York.\nYes, no one had seen justice like that before. Why? Because there was no justice here. It was using the legal system to get Trump, or something that our judicial system was not supposed to do.\nWe can understand, not defend but understand, how highly partisan AG James brought this case. She was out to get Trump and couldn’t restrain her TDS. However, the judge should have stopped her and asked: “Where is the fraud or crime?” Instead, the judge added to the lie by inventing his own definition of fraud.\nSo, Judge Engoron has a little explaining to do, and I hope it’s before the Bar Association. This man should never preside over another trial in New York or elsewhere.\nP.S. Check out my blog for posts, podcasts, and videos.\nImage generated by AI."
    },
    {
      "news_title": "Trump admin blocked from slashing funding from dozens of local governments over 'sanctuary' policies",
      "news_link": "https://www.foxnews.com/politics/trump-admin-blocked-slashing-funding-dozens-local-governments-sanctuary-policies",
      "bias": "Right",
      "text": "A federal judge ruled on Friday that the Trump administration cannot cut funding to 34 cities and counties in response to so-called \"sanctuary\" policies that limit cooperation with federal immigration enforcement.\nU.S. District Judge William Orrick, who issued a previous order protecting more than a dozen other cities and counties, extended a preliminary injunction blocking the administration from pulling federal money or conditioning the use of the funds for local jurisdictions.\nThe judge also blocked the administration from placing immigration-related conditions on two grant programs.\nOrrick said the administration's only opposition to an extended injunction was claiming that the first injunction was wrong after it appealed the first order.\nFEDERAL JUDGE TOSSES TRUMP DOJ LAWSUIT AGAINST SANCTUARY POLICIES IN CHICAGO\nThe administration has increased pressure on sanctuary jurisdictions under President Donald Trump's mass deportation plan.\nTrump issued an executive order directing Attorney General Pam Bondi and Department of Homeland Security Secretary Kristi Noem to withhold federal money from sanctuary communities. He also tasked all federal agencies with ensuring that payments to state and local governments do not \"abet so-called 'sanctuary' policies that seek to shield illegal aliens from deportation,\" The Associated Press reported.\nTRUMP DOJ SUES NEW YORK CITY OVER LONG-STANDING SANCTUARY IMMIGRATION POLICIES\nMany cities and counties sued the federal government, emphasizing that billions of dollars in funding were threatened. The Justice Department has also sued several cities, including New York and Los Angeles, over sanctuary policies.\nOrrick said Trump's orders, and the \"executive actions that have parroted them,\" demonstrated a \"coercive threat\" he ruled unconstitutional.\nEarlier this year, DHS posted a list of more than 500 sanctuary jurisdictions that the federal government determined to be noncompliant with the administration's directives, adding that they would each be formally notified.\nCLICK HERE TO GET THE FOX NEWS APP\nDHS also said it would notify the local communities if they were potentially violating any federal criminal statutes.\nThe list was later removed from the DHS website after the department was made aware that it included communities in support of the administration’s immigration policies, the AP reported.\nThe Associated Press contributed to this report."
    },
    {
      "news_title": "Judge Stops Trump from Cutting Federal Funds to Sanctuary Cities - teleSUR English",
      "news_link": "https://www.telesurenglish.net/judge-stops-trump-from-cutting-federal-funds-to-sanctuary-cities/",
      "bias": "Left",
      "text": "Judge Stops Trump from Cutting Federal Funds to Sanctuary Cities\n(FILE). Photo: EFE.\nAugust 23, 2025 Hour: 12:19 am\nA federal judge halted U.S. President Donald Trump’s plan to withhold federal funds from so-called “sanctuary” cities, including Chicago, Los Angeles, Denver, and 31 others nationwide.\nRELATED: Amnesty: Trump Administration’s AI Tools Target Migrants and Pro-Palestinian Supporters\nJudge William Orrick of San Francisco issued a preliminary ruling preventing the reduction of federal funds to these cities, stopping Trump’s contentious policy designed to punish jurisdictions that opposed the Republican Administration’s far right anti-immigration measures enforced by Immigration and Customs Enforcement (ICE).\nWith this new ruling, cities like Boston, Santa Fe, Los Angeles, Portland, Chicago, Oakland, Sacramento, San Diego, and two dozen others won’t lose their funding, as the judge affirmed that doing so would be unconstitutional.\nThree months ago, the Department of Homeland Security (DHS) published a list of over 500 “sanctuary jurisdictions” and stated that each would receive a formal notification that the government considered them non-compliant.\nIn 2017, Judge Orrick had opposed Trump’s initial effort, during his first term, to cut federal funds, stating that this measure was not only unconstitutional but also violated the “separation of powers.”\nThis is the second judicial setback Trump has faced in 24 hours because on Thursday, a judge in Florida ordered the closure of the ‘Alligator Alcatraz’ jail within the next 60 days and added that no more migrants can be transferred to this facility.\nCivil associations in Florida warned on Friday that “horrible conditions” persist for migrants remaining in the immigration detention center despite the court’s decision.\nAuthor: vmmh\nSource: EFE"
    },
    {
      "news_title": "Judge blocks Trump from cutting funding to dozens of \"sanctuary\" cities, including Los Angeles and Chicago",
      "news_link": "https://www.cbsnews.com/news/judge-blocks-trump-cutting-funding-sanctuary-cities-los-angeles-chicago/",
      "bias": "Lean Left",
      "text": "Judge blocks Trump from cutting funding to dozens of \"sanctuary\" cities, including Los Angeles and Chicago\nA federal judge on Friday blocked the Trump administration from cutting off federal funding to dozens of \"sanctuary\" cities and counties — covering several of the largest cities in the U.S.\nThe judge had previously ruled in April that it was unconstitutional for President Trump to freeze funding for local governments that limit their cooperation with Immigration and Customs Enforcement — commonly known as sanctuary cities. That ruling applied to more than a dozen cities and counties that had sued the Trump administration for threatening to cut off funding, including San Francisco, Sacramento, Minneapolis and Seattle.\nOn Friday, San Francisco-based U.S. District Judge William Orrick extended his order to dozens of other places that joined the lawsuit. Those include the second- and third-largest cities in the U.S. — Los Angeles and Chicago — as well as Boston, Baltimore, Denver and Albuquerque.\nCBS News has reached out to the White House for comment.\nAs Mr. Trump seeks to dramatically boost arrests and deportations of undocumented immigrants, top administration officials have pushed local governments to assist — and they've sought to punish so-called sanctuary jurisdictions with laws on the books that prevent police from helping ICE.\nWithin hours of returning to office in January, Mr. Trump ordered his administration to ensure sanctuary jurisdictions \"do not receive access to Federal funds.\" Weeks later, the president ordered that federal funding shouldn't \"facilitate the subsidization or promotion of illegal immigration,\" and Attorney General Pam Bondi said the Justice Department will not offer grants to sanctuary cities. The administration argues sanctuary cities are interfering with federal law enforcement and making it harder for ICE to arrest undocumented immigrants, including violent criminals.\nThe cities and counties that are suing the administration call those policies an \"abuse of power\" and allege they violate the Tenth Amendment, which says any powers that aren't given to the federal government should be reserved to the states. They argue that local governments are entitled to choose not to assist ICE, often casting sanctuary policies as a way of building trust between police and local residents whose immigration status may make them wary of reporting crimes.\n\"In flagrant disregard of the law, President Trump seeks once again to punish those who disagree with him, coerce local authorities, and commandeer them into carrying out his agenda,\" the cities' lawsuit says.\nThe Trump administration's moves against sanctuary cities have generated a flurry of lawsuits, including one suit filed earlier this week by 20 states over the Justice Department's decision to tie crime victim grants to immigration enforcement.\nThe Justice Department has also vowed to sue dozens of alleged sanctuary jurisdictions, including both cities and states. The administration sued New York City and the state of Illinois over their sanctuary policies earlier this year, though the Illinois suit was tossed out by a judge last month."
    },
    {
      "news_title": "Judge blocks Trump from cutting funding from 34 cities and counties",
      "news_link": "https://www.arabnews.com/node/2612724/world",
      "bias": "Lean Right",
      "text": "Judge blocks Trump from cutting funding from 34 cities and counties over ‘sanctuary’ policies\nJudge blocks Trump from cutting funding from 34 cities and counties over ‘sanctuary’ policies/node/2612724/world\nJudge blocks Trump from cutting funding from 34 cities and counties over ‘sanctuary’ policies\nProtesters hold signs during a demonstration at the governor's mansion in Lincoln, Nebraska, on Aug. 22, 2025, against the planned ICE detention center in McCook. (Lincoln Journal Star via AP)\nJudge blocks Trump from cutting funding from 34 cities and counties over ‘sanctuary’ policies\nThe Trump administration has been trying to remove millions of people in the country illegally\nDistrict Judge William Orrick said Trump's “executive actions” were an unconstitutional “coercive threat”\nUpdated 8 sec ago\nAP\nA judge ruled late Friday the Trump administration cannot deny funding to Boston, Chicago, Denver, Los Angeles and 30 other cities and counties because of policies that limit cooperation with federal immigration efforts.\nUS District Judge William Orrick in San Francisco extended a preliminary injunction blocking the administration from cutting off or conditioning the use of federal funds for so-called “sanctuary” jurisdictions. His earlier order protected more than a dozen other cities and counties, including San Francisco, Portland and Seattle.\nAn email to the White House late Friday was not immediately returned. In his ruling, Orrick said the administration had offered no opposition to an extended injunction except to say the first injunction was wrong. It has appealed the first order.\nOrrick also blocked the administration from imposing immigration-related conditions on two particular grant programs.\nThe Trump administration has ratcheted up pressure on sanctuary communities as it seeks to make good on President Donald Trump’s campaign promise to remove millions of people in the country illegally.\nOne executive order issued by Trump directs Attorney General Pam Bondi and Homeland Security Secretary Kristi Noem to withhold federal money from sanctuary jurisdictions. Another order directs every federal agency to ensure that payments to state and local governments do not “abet so-called ‘sanctuary’ policies that seek to shield illegal aliens from deportation.”\nThe cities and counties that sued said billions of dollars were at risk.\nOrrick, who was nominated by President Barack Obama, said the executive orders and the “executive actions that have parroted them” were an unconstitutional “coercive threat.”\nIn May, the Department of Homeland Security published a list of more than 500 “sanctuary jurisdictions,” saying each one would receive formal notification that the government had deemed them noncompliant. It also said it would inform them if they were believed to be in violation of any federal criminal statutes.\nThe list was later removed from the department’s website after critics noted it included localities that have actively supported the administration’s tough immigration policies.\nThe Justice Department has also sued New York, Los Angeles and other cities over their sanctuary policies.\nThere is no strict definition for sanctuary cities, but the terms generally describe places that limit cooperation with Immigration and Customs Enforcement. ICE enforces immigration laws nationwide but seeks help from state and local authorities to identify immigrants wanted for deportation and hold them for federal officers.\nTrump turns $11.1 billion in US government funds into a 10 percent stake in downtrodden Intel\nUS govt getting the stake through the conversion of $11.1 billion in previously issued funds and pledges, making a gain of $1.9 billion, on paper\nRemarkable turn of events comes at a time that the chipmaker is in the process of laying off more than 20,000 workers in bid to bounce back from years of missteps\nUpdated 23 August 2025\nAP\nWASHINGTON: President Donald Trump on Friday announced the US government has secured a 10 percent stake in struggling Silicon Valley pioneer Intel in a deal that was completed just a couple weeks after he was depicting the company’s CEO as a conflicted leader unfit for the job.\n“The United States of America now fully owns and controls 10 percent of INTEL, a Great American Company that has an even more incredible future,” Trump wrote in a post.\nThe US government is getting the stake through the conversion of $11.1 billion in previously issued funds and pledges. All told, the government is getting 433.3 million shares of non-voting stock priced at $20.47 apiece — a discount from Friday’s closing price at $24.80. That spread means the US government already has a gain of $1.9 billion, on paper.\nThe remarkable turn of events makes the US government one of Intel’s largest shareholders at a time that the Santa Clara, California, company is in the process of jettisoning more than 20,000 workers as part of its latest attempt to bounce back from years of missteps taken under a variety of CEOs.\nIntel’s current CEO, Lip-Bu Tan, has only been on the job for slightly more than five months, and earlier this month, it looked like he might be on shaky ground already after some lawmakers raised national security concerns about his past investments in Chinese companies while he was a venture capitalist. Trump latched on to those concerns in an August 7 post demanding that Tan resign.\nBut Trump backed off after the Malaysian-born Tan professed his allegiance to the US in a public letter to Intel employees and went to the White House to meet with the president, leading to a deal that now has the US government betting that the company is on the comeback trail after losing more than $22 billion since the end of 2023. Trump hailed Tan as “highly respected” CEO in his Friday post.\nIn a statement, Tan applauded Trump for “driving historic investments in a vital industry” and resolved to reward his faith in Intel. “We are grateful for the confidence the President and the Administration have placed in Intel, and we look forward to working to advance US technology and manufacturing leadership,” Tan said.\nIntel’s current stock price is just slightly above where it was when Tan was hired in March and more than 60 percent below its peak of about $75 reached 25 years ago when its chips were still dominating the personal computer boom before being undercut by a shift to smartphones a few years later. The company’s market value currently stands at about $108 billion — a fraction of the current chip kingpin, Nvidia, which is valued at $4.3 trillion.\nThe stake is coming primarily through US government grants to Intel through the CHIPS and Science Act that was started under President Joe Biden’s administration as a way to foster more domestic manufacturing of computer chips to lessen the dependence on overseas factories.\nBut the Trump administration, which has regularly pilloried the policies of the Biden administration, saw the CHIPs act as a needless giveaway and is now hoping to make a profit off the funding that had been pledged to Intel.\n“We think America should get the benefit of the bargain,” US Commerce Secretary Howard Lutnick said earlier this week. “It’s obvious that it’s the right move to make.”\nAbout $7.8 billion had been been pledged to Intel under the incentives program, but only $2.2 billion had been funded so far. Another $3.2 billion of the government investment is coming through the funds from another program called “Secure Enclave.”\nAlthough US government can’t vote with its shares and won’t have a seat on Intel’s board of directors, critics of the deal view it as a troubling cross-pollination between the public and private sectors that could hurt the tech industry in a variety of ways.\nFor instance, more tech companies may feel pressured to buy potentially inferior chips from Intel to curry favor with Trump at a time that he is already waging a trade war that threatens to affect their products in a potential scenario cited by Scott Lincicome, vice president of general economics for the Cato Institute.\n“Overall, it’s a horrendous move that will have real harms for US companies, US tech leadership, and the US economy overall,” Lincicome posted Friday.\nThe 10 percent stake could also intensify the pressure already facing Tan, especially if Trump starts fixating on Intel’s stock price while resorting to his penchant for celebrating his past successes in business.\nNancy Tengler, CEO of money manager Laffer Tengler Investments, is among the investors who abandoned Intel years ago because of all the challenges facing Intel.\n“I don’t see the benefit to the American taxpayer, nor do I see the benefit, necessarily to the chip industry,” Tengler said while also raising worries about Trump meddling in Intel’s business.\n“I don’t care how good of businessman you are, give it to the private sector and let people like me be the critic and let the government get to the business of government.,” Tengler said.\nAlthough rare, it’s not unprecedented for the US government to become a significant shareholder in a prominent company. One of the most notable instances occurred during the Great Recession in 2008 when the government injected nearly $50 billion into General Motors in return for a roughly 60 percent stake in the automaker at a time it was on the verge of bankruptcy. The government ended up with a roughly $10 billion loss after it sold its stock in GM.\nThe US government’s stake in Intel coincides with Trump’s push to bring production to the US, which has been a focal point of the trade war that he has been waging throughout the world. By lessening the country’s dependence on chips manufactured overseas, the president believes the US will be better positioned to maintain its technological lead on China in the race to create artificial intelligence.\nEven before gaining the 10 percent stake in Intel, Trump had been leveraging his power to reprogram the operations of major computer chip companies. The administration is requiring Nvidia and Advanced Micro Devices, two companies whose chips are powering the AI craze, to pay a 15 percent commission on their sales of chips in China in exchange for export licenses.\nGambian man sentenced to more than 67 years after US conviction for torture\nMichael Sang Correa, a member of former Gambian dictator Jammeh’s death squad, was convicted by US jury in April\nRights groups say Jammeh carried out brutalities against critics and political dissenters\nUpdated 23 August 2025\nReuters\nA Gambian man who was part of an armed unit run by former dictator Yahya Jammeh and was convicted of torture by a US jury in April has been sentenced to more than 67 years in prison, the US Justice Department said on Friday.\nA Colorado jury convicted the Gambian national, Michael Sang Correa, for his participation in the torture of numerous victims in Gambia in 2006, including beating and flesh burning, because of the victims’ purported involvement in a coup plot against the then-president, the Justice Department said.\nCorrea, 46, was sentenced to 810 months in prison by Senior Judge Christine Arguello for the District of Colorado after conviction on one count of conspiracy to commit torture and five counts of torture, the department said in a statement.\nThe case marked the first criminal prosecution over involvement in the feared armed group known as “the Junglers,” which operated in Gambia’s police state during Jammeh’s rule. The former president seized power in 1994 and foiled several attempts to overthrow him before he lost a 2016 election.\nCorrea was arrested in 2020 under a law which makes it a crime for anyone in the US to commit torture abroad.\nJammeh denied torture during his rule.\nThe Junglers were a secretive offshoot of the Gambian army that took orders from Jammeh. Rights groups and former victims say they carried out brutalities that worsened after a failed coup in 2006.\nSuspected coup plotters and other outspoken opponents of Jammeh were taken to the National Intelligence Agency near one of the capital Banjul’s white sand beaches, according to victims.\nSome found themselves in a torture chamber where they were subjected to electric shocks, beatings and burning with acid, they said. (Reporting by Kanishka Singh in Washington; Editing by Edmund Klamann)\nBeing Muslim and American in the nation’s heartland\nThe Muslim presence across the Midwest grew exponentially after a 1965 immigration law eliminated the quotas that had blocked arrivals from many parts of the world since the mid-1920s, Curtis said\nFaroz Waziri jokes that he and his wife Mena might have been the first Afghans in town when they came in the mid-2010s on a special visa for those who had worked for the US armed forces overseas\n“You can be a Muslim that’s practicing your religion and still coexist with everybody else around you,” said Hassan Igram, who chairs the center’s board of trustees\nUpdated 23 August 2025\nAP\nCEDAR RAPIDS, Iowa: The oldest surviving place of worship for Muslims in the United States is a white clapboard building on a grassy corner plot, as unassumingly Midwestern as its neighboring houses in Cedar Rapids – except for a dome.\nThe descendants of the Lebanese immigrants who constructed “the Mother Mosque” almost a century ago — along with newcomers from Afghanistan, East Africa and beyond — are defining what it can mean to be both Muslim and American in the nation’s heartland just as heightened conflicts in the Middle East fuel tensions over immigration and Islam in the United States.\nStanding by the door in a gold-embroidered black robe, Fatima Igram Smejkal greeted the faithful with a cheerful “salaam” as they hurried into the Islamic Center of Cedar Rapids for Friday prayers. In 1934, her family helped open what the National Register of Historic Places calls “the first building designed and constructed specifically as a house of worship for Muslims in the United States.”\n“They all came from nothing … so they wanted to give back,” Smejkal said of families like hers, who arrived at the turn of the 20th century. “That’s why I’m so kind to the ones that come in from Somalia and the Congo and Sudan and Afghanistan. I have no idea what they left, what they’re thinking when they walk in that mosque.”\nThe community now gathers in the Islamic Center. It was built in the 1970s when they became too many for the Mother Mosque’s living-room-sized prayer hall, and now they’re have outgrown its prayer hall, as well. Hundreds of fifth-generation Muslim Iowans, recent refugees and migrants pray on industrial carpets rolled onto the gym’s basketball court — the elderly on walkers, babies in car seats, women in headscarves and men sporting headgear from African kufi and Afghan pakol caps to baseball hats.\nThis physical space where diverse groups gather helps sustain community as immigrants try to preserve their heritage while assimilating into US culture and society.\n“You can be a Muslim that’s practicing your religion and still coexist with everybody else around you,” said Hassan Igram, who chairs the center’s board of trustees. He shares the same first and last names as his grandfather and Smejkal’s grandfather – two cousins who came to Iowa as boys in the 1910s.\nLebanese migrants ‘Mother Mosque’\nTens of thousands of young men, both Christians and Muslims, settled in booming Midwestern towns after fleeing the Ottoman Empire, many with little more than a Bible or a Qur’an in their bags. They often worked selling housewares off their backs to widely scattered farms, earning enough to buy horses and buggies, and then opened grocery stores.\nThrough bake sales and community dinners, a group of Muslim women raised money in the 1920s to build what was called the “Muslim Temple.” Like the Igrams, Anace Aossey remembers attending prayer there with his parents – though as children they were more focused on the Dixie Cream donuts that would follow.\n“We weren’t raised real strict religiously,” said Aossey, whose father sold goods along the tracks from a 175-pound sack. “They were here to integrate themselves into the American society.” Growing up Muslim in America\nMuslims sometimes faced institutional discrimination. After serving in World War II, Smejkal’s father, Abdallah Igram, successfully campaigned for soldiers’ dog tags to include Muslim as an option, along with Catholic, Protestant and Jewish.\nBut in Cedar Rapids, immigrants found mutual acceptance, fostered through houses of worship and friendships between US-born children and their non-Muslim neighbors. Smejkal’s best friend was Catholic, and her father kept beef hot dogs in the kitchen to respect the Muslim prohibition against pork. Smejkal’s father, in turn, made sure Friday meals included fish sticks.\n“Arab-speaking Muslims were part and parcel of the same stories that inform our sense of what the Midwest is and its values are,” said Indiana University professor Edward E. Curtis, IV. “They participated in the making of the American heartland.”\nAbdallah Igram is buried in the city’s hilltop Muslim cemetery, among the first in the United States when it was built in the 1940s. It’s next to the Czech cemetery – for the descendants of the migrants who helped establish Cedar Rapids in the 1850s — and the Jewish cemetery, whose operators donated trees to the Muslim one after damage from a derecho five years ago. Smejkal wishes the whole world’s faiths could collaborate this way.\n“That’s when there’s no barriers anymore. I pray one day it’s really like that,” Smejkal said.\nBeing Muslim in the Heartland\nThe Muslim presence across the Midwest grew exponentially after a 1965 immigration law eliminated the quotas that had blocked arrivals from many parts of the world since the mid-1920s, Curtis said.\nMistrust flared again after the Sept. 11, 2001, attacks, especially in farming communities whose young people were fighting in Afghanistan and Iraq, said Ako Abdul-Samad, an African-American who represented Des Moines for nearly two decades in the Iowa House of Representatives. He feared being Muslim would prevent his election when he first ran for office, but voters re-elected him again and again.\nImmigration, including from Muslim countries, remains a contentious issue, even as Muslim communities flourish and increase their political influence in major cities like Minneapolis and Detroit.\nBut daily interactions between Muslims and their neighbors have provided some protection from prejudice, according to the Mother Mosque imam, a Palestinian who immigrated in the 1980s. “Stereotypes and things did not work” in Cedar Rapids, Taha Tawil said.\nBosnian Muslims say they’ve had similar experiences near Des Moines, where a new multimillion dollar mosque and cultural center is opening next month, an expansion of the first center established by war refugees 20 years ago.\n“Our neighbors have been great to us, including the farmers we got the land from,” said its treasurer, Moren Blazevic. “We’re finally Iowans.”\nBecoming Midwesterners\nFaroz Waziri jokes that he and his wife Mena might have been the first Afghans in town when they came in the mid-2010s on a special visa for those who had worked for the US armed forces overseas. After struggling with “culture shock” and language barriers, they’ve become naturalized US citizens, and he’s the refugee resources manager at a non-profit founded by Catholic nuns.\nWhile grateful for the aid and the safety they feel, the Waziris miss their families and homeland. And they fear that cultural differences — especially the individualism Americans express, like when they sit around a table for meals, instead of together on a rug — remain too vast.\n“Mentally and emotionally, I never think I’m American,” said Mena Waziri. She’s a college graduate now, and loves the independence and women’s rights that remain unattainable in Taliban-run Afghanistan. But the family is keen for their US-born son, Rayan, to have Muslim friends and values.\nThese tensions are familiar for the descendants of the city’s first Muslim settlers, like Aossey, who keeps exhibit panels about Lebanese immigration and integration in the same garage where he stores ATVs on his recreational farm.\n“My story is the American story,” Aossey said. “It’s not the Islamic story.”\nTrump threatens federal intervention in Chicago, government takeover in D.C.\nChicago, other cities do not share D.C.’s federal status\nViolent crime has fallen in Washington, Chicago, data shows\nUpdated 23 August 2025\nReuters\nWASHINGTON: US President Donald Trump said on Friday he would probably expand his crime crackdown to Chicago, intervening in another city governed by Democrats, and threatened to take full control of Washington, D.C., rather than only its policing.\nSaying without evidence that violent crime was out of control in the nation’s capital, Trump deployed D.C. National Guard soldiers and federal agents on the streets last week with a mandate to reduce crime.\n“It was horrible and Mayor Bowser better get her act straight or she won’t be mayor very long, because we’ll take it over with the federal government, run it like it’s supposed to be run,” Trump told reporters, referring to Washington Mayor Muriel Bowser.\nRecent statistics, which Trump dismissed, show crime has declined in the US capital since a 2023 peak.\nWashington is a unique federal enclave, established in the US Constitution and falling under the jurisdiction of Congress, not belonging to any state.\nIn 1973, Congress passed the District of Columbia Home Rule Act, allowing residents to elect a mayor and council members.\nContinuing his off-the-cuff remarks at the White House, Trump mused about extending his efforts to other cities. He has declined to explain how the federal government could intervene in local law enforcement in cities outside of the federal enclave of D.C.\n“Chicago is a mess,” Trump said, deriding its mayor. “And we’ll straighten that one out probably next.”\nTrump said some of his supporters in Chicago have been “screaming for us to come.”\n“I did great with the Black vote, as you know, and they want something to happen,” he said. “So I think Chicago will be our next, and then we’ll help with New York.”\nAs in Washington, crime, including murders, has declined in Chicago in the last year.\nChicago Mayor Brandon Johnson said he took Trump’s comments seriously but has not received formal communication from the administration about federal law enforcement or military deployments.\nThe mayor said Trump’s approach has been “uncoordinated, uncalled for and unsound.” He added: “There are many things the federal government could do to help us reduce crime and violence in Chicago, but sending in the military is not one of them.”\nNew York City, also criticized by Trump, has reported a steady decline in violent crime in recent decades, and now has a relatively low murder rate among big American cities. Trump also threatened federal government intervention in San Francisco, another city governed by Democrats.\nWhile the Republican president has cast his efforts as an urgent move to help residents feel safe again, Democrats and other critics say he aims to expand the powers of the president beyond the bounds of the Constitution and assert federal control over cities run by Democratic officials.\nThe US Constitution’s Tenth Amendment generally prevents the federal government from commandeering state or municipal officials and from intervening in states’ legal and criminal justice systems unless citizens’ constitutional rights are being violated.\nWith no Ukraine peace deal, Trump again threatens Russia sanctions\nRussia says agenda ‘not ready’ for Zelensky meeting\nWork on Ukraine’s proposed security guarantees underway\nUpdated 23 August 2025\nReuters\nWASHINGTON/KYIV: US President Donald Trump renewed a threat to impose sanctions on Russia on Friday if there is no progress toward a peaceful settlement in Ukraine in two weeks, showing frustration at Moscow a week after his meeting with Russian President Vladimir Putin in Alaska.\n“I’m going to make a decision as to what we do and it’s going to be, it’s going to be a very important decision, and that’s whether or not it’s massive sanctions or massive tariffs or both, or we do nothing and say it’s your fight,” Trump said.\nHe was unhappy about Russia’s deadly strike on a factory in Ukraine this week, he said.\n“I’m not happy about it, and I’m not happy about anything having to do with that war,” Trump told reporters at the White House.\nUkrainian President Volodymyr Zelensky, meanwhile, said on Friday that Russia was doing everything it could to prevent a meeting between him and Putin, while Russia’s foreign minister said the agenda for such a meeting was not ready.\nZelensky has repeatedly called for Putin to meet him, saying it is the only way to negotiate an end to the war.\nTrump had said he had begun the arrangements for a Putin-Zelensky meeting after a call with the Russian leader on Monday that followed their Alaska meeting on August 15.\nZelensky accused Russia of stalling.\n“The meeting is one of the components of how to end the war,” he said on Friday at a press conference in Kyiv with NATO Secretary General Mark Rutte. “And since they don’t want to end it, they will look for space to (avoid it).”\nRussian Foreign Minister Sergei Lavrov told NBC there was no agenda for such a summit.\n“Putin is ready to meet with Zelensky when the agenda would be ready for a summit. And this agenda is not ready at all,” he said.\nThe statement echoed Moscow’s established rhetoric about a leaders’ meeting being impossible unless certain conditions were met.\nAsked for his response to Lavrov’s comments and what the next steps are, Trump told reporters earlier on Friday: “Well, we’ll see. We’re going to see if Putin and Zelensky will be working together. It’s like oil and vinegar a little bit.”\n‘He may be coming’\nTrump had taken sanctions off the table in preparation for his summit in Anchorage with Putin. But at the same White House event where he mentioned possible sanctions, he showed a photograph of his meeting with Putin on the red carpet in Alaska, saying Putin wanted to attend the World Cup 2026 soccer tournament in the United States.\n“I’m going to sign this for him. But I was sent one, and I thought you would like to see it, it’s a man named Vladimir Putin, who I believe will be coming, depending on what happens. He may be coming, and he may not, depending on what happens,” Trump said.\nTrump’s comments did not address the fact that Russia was banned from international competitions such as the World Cup after the 2022 invasion of Ukraine and has not taken part in qualification for the 2026 tournament, which will be hosted by the US, Canada and Mexico.\nDuring a visit to a nuclear research center on Friday, Putin said Trump’s leadership qualities would help restore US-Russia relations.\n“With the arrival of President Trump, I think that a light at the end of the tunnel has finally loomed. And now we had a very good, meaningful and frank meeting in Alaska,” Putin said.\nThousands of Ukrainian civilians have been killed in the full-scale invasion of Ukraine that Russia launched in 2022. Analysts estimate that more than a million soldiers on both sides have been killed or wounded and fighting is continuing unabated, with both sides also attacking energy facilities.\nRussia has maintained its longstanding demand for Ukraine to give up land it still holds in two eastern regions while proposing to freeze the front line in two more southerly regions Moscow claims fully as its own and possibly hand back small pieces of other Ukrainian territory it controls.\nZelensky meanwhile has dropped his demand for a lengthy ceasefire as a prerequisite for a leaders’ meeting, although he has previously said Ukraine cannot negotiate under the barrel of a gun.\nAt the press conference with Rutte, Zelensky said they had discussed security guarantees for Ukraine. He said the guarantees ought to be similar to NATO’s Article 5, which considers an attack on one member of the alliance as an attack against all.\nRutte said NATO allies and Ukraine are working together to ensure security guarantees are strong enough that Russia will never try to attack again.\n“Robust security guarantees will be essential, and this is what we are now working on to define,” he said."
    },
    {
      "news_title": "Judge blocks Trump from withholding funds from Los Angeles, other sanctuary cities",
      "news_link": "https://gazette.com/news/us-world/judge-blocks-trump-from-withholding-funds-from-los-angeles-other-sanctuary-cities/article_b80a19b3-13c1-566e-a690-461d0b131f31.html",
      "bias": "Center",
      "text": "By Dietrich Knauth and Nate Raymond\n(Reuters) -A U.S. federal judge on Friday blocked Donald Trump's administration from withholding federal funding from more than 30 so-called sanctuary jurisdictions including Los Angeles, Baltimore, Boston and Chicago that have declined to cooperate with the Republican president's hardline immigration crackdown.\nU.S. District Judge William Orrick expanded an injunction that he initially issued in April covering 16 cities and counties including San Francisco, where he is based, to cover a new batch of local governments that recently joined the case and sought to be protected under his court order.\nThe lawsuit was filed after Trump signed two executive orders in January and February that the cities and counties said unlawfully threatened to cut off funding to them unless they cooperated with federal immigration law enforcement, including U.S. Immigration and Customs Enforcement.\nThose orders targeted so-called sanctuary jurisdictions that have laws and policies that limit or prevent local law enforcement from assisting federal officers with civil immigration arrests.\nOrrick on Friday said Trump's orders \"threaten to withhold all federal funding from the plaintiffs as sanctuary jurisdictions if they do not adapt their policies and practices to conform with the Trump administration's preferences.\"\n\"That coercive threat (and any actions agencies take to realize that threat, or additional Executive Orders the President issues to the same end) is unconstitutional, so I enjoined its effect,\" Orrick wrote. \"I do so again today for the protection of the new parties in this case.\"\nThe White House did not immediately respond to a request for comment. The Trump administration is already appealing Orrick's earlier ruling.\nAmong the cities covered by Orrick's new order is Los Angeles. Trump's deployment in June of the National Guard to patrol Los Angeles after protests against intensified federal immigration raids is the subject of a separate lawsuit by California Governor Gavin Newsom.\n(Reporting by Dietrich Knauth in New York and Nate Raymond in Boston; Editing by Kim Coghill)"
    },
    {
      "news_title": "Judge Blocks Trump's Funding Cuts to Sanctuary Cities",
      "news_link": "https://www.newsmax.com/newsfront/trump-sanctuary-cities-funding/2025/08/22/id/1223622/",
      "bias": "Right",
      "text": "A judge ruled late Friday the Trump administration cannot deny funding to Boston, Chicago, Denver, Los Angeles and 30 other cities and counties because of policies that limit cooperation with federal immigration efforts.\nU.S. District Judge William Orrick in San Francisco extended a preliminary injunction blocking the administration from cutting off or conditioning the use of federal funds for “sanctuary” jurisdictions. His earlier order protected more than a dozen other cities and counties, including San Francisco, Portland and Seattle.\nAn email to the White House late Friday was not immediately returned. In his ruling, Orrick said the administration had offered no opposition to an extended injunction except to say the first injunction was wrong. It has appealed the first order.\nOrrick also blocked the administration from imposing immigration-related conditions on two particular grant programs.\nThe Trump administration has ratcheted up pressure on sanctuary communities as it seeks to make good on President Donald Trump’s campaign promise to remove millions of people in the country illegally.\nOne executive order issued by Trump directs Attorney General Pam Bondi and Homeland Security Secretary Kristi Noem to withhold federal money from sanctuary jurisdictions. Another order directs every federal agency to ensure that payments to state and local governments do not “abet so-called ‘sanctuary’ policies that seek to shield illegal aliens from deportation.”\nThe cities and counties that sued said billions of dollars were at risk.\nOrrick, who was nominated by President Barack Obama, said the executive orders and the “executive actions that have parroted them” were an unconstitutional “coercive threat.”\nIn May, the Department of Homeland Security published a list of more than 500 “sanctuary jurisdictions,” saying each one would receive formal notification that the government had deemed them noncompliant. It also said it would inform them if they were believed to be in violation of any federal criminal statutes.\nThe list was later removed from the department’s website after critics noted it included localities that have actively supported the administration’s tough immigration policies.\nThe Justice Department has also sued New York, Los Angeles and other cities over their sanctuary policies.\nThere is no strict definition for sanctuary cities, but the terms generally describe places that limit cooperation with Immigration and Customs Enforcement. ICE enforces immigration laws nationwide but seeks help from state and local authorities to identify immigrants wanted for deportation and hold them for federal officers.\nCopyright 2025 The Associated Press. All rights reserved. This material may not be published, broadcast, rewritten or redistributed without permission."
    },
    {
      "news_title": "Judge blocks President Trump from cutting funding from Chicago and other cities over ‘sanctuary’ policies",
      "news_link": "https://www.chicagotribune.com/2025/08/22/trump-sanctuary-city-funding-ruling/",
      "bias": "Center",
      "text": "A judge ruled late Friday the Trump administration cannot deny funding to Boston, Chicago, Denver, Los Angeles and 30 other cities and counties because of policies that limit cooperation with federal immigration efforts.\nU.S. District Judge William Orrick in San Francisco extended a preliminary injunction blocking the administration from cutting off or conditioning the use of federal funds for so-called “sanctuary” jurisdictions. His earlier order protected more than a dozen other cities and counties, including San Francisco, Portland and Seattle.\nAn email to the White House late Friday was not immediately returned. In his ruling, Orrick said the administration had offered no opposition to an extended injunction except to say the first injunction was wrong. It has appealed the first order.\nOrrick also blocked the administration from imposing immigration-related conditions on two particular grant programs.\nThe Trump administration has ratcheted up pressure on sanctuary communities as it seeks to make good on President Donald Trump’s campaign promise to remove millions of people in the country illegally.\nOne executive order issued by Trump directs Attorney General Pam Bondi and Homeland Security Secretary Kristi Noem to withhold federal money from sanctuary jurisdictions. Another order directs every federal agency to ensure that payments to state and local governments do not “abet so-called ‘sanctuary’ policies that seek to shield illegal aliens from deportation.”\nThe cities and counties that sued said billions of dollars were at risk.\nOrrick, who was nominated by President Barack Obama, said the executive orders and the “executive actions that have parroted them” were an unconstitutional “coercive threat.”\nIn May, the Department of Homeland Security published a list of more than 500 “sanctuary jurisdictions,” saying each one would receive formal notification that the government had deemed them noncompliant. It also said it would inform them if they were believed to be in violation of any federal criminal statutes.\nThe list was later removed from the department’s website after critics noted it included localities that have actively supported the administration’s tough immigration policies.\nThe Justice Department has also sued New York, Los Angeles and other cities over their sanctuary policies.\nThere is no strict definition for sanctuary cities, but the terms generally describe places that limit cooperation with Immigration and Customs Enforcement. ICE enforces immigration laws nationwide but seeks help from state and local authorities to identify immigrants wanted for deportation and hold them for federal officers."
    },
    {
      "news_title": "Judge blocks Trump from denying funds to 34 more ‘sanctuary’ cities, counties",
      "news_link": "https://www.oregonlive.com/nation/2025/08/judge-blocks-trump-from-denying-funds-to-34-more-sanctuary-cities-counties.html",
      "bias": "Center",
      "text": "A judge ruled late Friday the Trump administration cannot deny funding to Boston, Chicago, Denver, Los Angeles and 30 other cities and counties because of policies that limit cooperation with federal immigration efforts.\nU.S. District Judge William Orrick in San Francisco extended a preliminary injunction blocking the administration from cutting off or conditioning the use of federal funds for so-called “sanctuary” jurisdictions. His earlier order protected more than a dozen other cities and counties, including Portland, San Francisco and Seattle.\nThe Trump administration has ratcheted up pressure on those communities as it seeks to make good on President Donald Trump’s campaign promise to remove millions of people in the country illegally.\nOne executive order issued by Trump directs Attorney General Pam Bondi and Homeland Security Secretary Kristi Noem to withhold federal money from sanctuary jurisdictions. Another order directs every federal agency to ensure that payments to state and local governments do not “abet so-called ‘sanctuary’ policies that seek to shield illegal aliens from deportation.”\nThe cities and counties that sued said billions of dollars were at risk.\nAn email to the White House late Friday was not immediately returned.\nIn May, the Department of Homeland Security published a list of more than 500 “sanctuary jurisdictions,” saying each one would receive formal notification that the government had deemed them noncompliant. It also said it would inform them if they were believed to be in violation of any federal criminal statutes.\nThe list was later removed from the department’s website after critics noted it included localities that have actively supported the administration’s tough immigration policies.\nThe Justice Department has sued New York, Los Angeles and other cities over their sanctuary policies.\nThere is no strict definition for sanctuary cities, but the terms generally describes places that limit cooperation with Immigration and Customs Enforcement. ICE enforces immigration laws nationwide but seeks help from state and local authorities to identify immigrants wanted for deportation and hold them for federal officers.\nMore business\n- Local chocolatier to open new build-your-own-bar lab in NE Portland\n- Liz Weston: Are all your credit cards in your spouse’s name only? Time to change that\n- Aftermarket stereo installer Car Toys aims to sell 5 Oregon stores in bankruptcy\n- Promised housing vouchers abruptly canceled for a dozen Portland-area families\n- Men’s apparel store to close downtown flagship after 19 years, reopen around the corner\n-- Sudhin Thanawala, The Associated Press"
    },
    {
      "news_title": "Judge Blocks Trump From Cutting Funding From 34 Cities And Counties Over ‘Sanctuary’ Policies",
      "news_link": "https://www.huffpost.com/entry/ap-us-trump-sanctuary-cities_n_68a91c30e4b0d5177beaa564",
      "bias": "Left",
      "text": "A judge ruled late Friday the Trump administration cannot deny funding to Boston, Chicago, Denver, Los Angeles and 30 other cities and counties because of policies that limit cooperation with federal immigration efforts.\nU.S. District Judge William Orrick in San Francisco extended a preliminary injunction blocking the administration from cutting off or conditioning the use of federal funds for so-called “sanctuary” jurisdictions. His earlier order protected more than a dozen other cities and counties, including San Francisco, Portland and Seattle.\nThe Trump administration has ratcheted up pressure on those communities as it seeks to make good on President Donald Trump’s campaign promise to remove millions of people in the country illegally.\nOne executive order issued by Trump directs Attorney General Pam Bondi and Homeland Security Secretary Kristi Noem to withhold federal money from sanctuary jurisdictions. Another order directs every federal agency to ensure that payments to state and local governments do not “abet so-called ‘sanctuary’ policies that seek to shield illegal aliens from deportation.”\nThe cities and counties that sued said billions of dollars were at risk.\nAn email to the White House late Friday was not immediately returned.\nIn May, the Department of Homeland Security published a list of more than 500 “sanctuary jurisdictions,” saying each one would receive formal notification that the government had deemed them noncompliant. It also said it would inform them if they were believed to be in violation of any federal criminal statutes.\nThe list was later removed from the department’s website after critics noted it included localities that have actively supported the administration’s tough immigration policies.\nThe Justice Department has sued New York, Los Angeles and other cities over their sanctuary policies.\nThere is no strict definition for sanctuary cities, but the terms generally describes places that limit cooperation with Immigration and Customs Enforcement. ICE enforces immigration laws nationwide but seeks help from state and local authorities to identify immigrants wanted for deportation and hold them for federal officers."
    },
    {
      "news_title": "Judge blocks Trump from cutting funding from 34 cities and counties over ‘sanctuary’ policies",
      "news_link": "https://apnews.com/article/trump-sanctuary-cities-immigrants-chicago-los-angeles-a39891a127c06a6062d74ac2eac50544",
      "bias": "Lean Left",
      "text": "Judge blocks Trump from cutting money to Chicago, LA and other cities over ‘sanctuary’ policies\nA judge ruled late Friday the Trump administration cannot deny funding to Boston, Chicago, Denver, Los Angeles and 30 other cities and counties because of policies that limit cooperation with federal immigration efforts.\nU.S. District Judge William Orrick in San Francisco extended a preliminary injunction blocking the administration from cutting off or conditioning the use of federal funds for so-called “sanctuary” jurisdictions. His earlier order protected more than a dozen other cities and counties, including San Francisco, Portland and Seattle.\nAn email to the White House late Friday was not immediately returned. In his ruling, Orrick said the administration had offered no opposition to an extended injunction except to say the first injunction was wrong. It has appealed the first order.\nOrrick also blocked the administration from imposing immigration-related conditions on two particular grant programs.\nThe Trump administration has ratcheted up pressure on sanctuary communities as it seeks to make good on President Donald Trump’s campaign promise to remove millions of people in the country illegally.\nOne executive order issued by Trump directs Attorney General Pam Bondi and Homeland Security Secretary Kristi Noem to withhold federal money from sanctuary jurisdictions. Another order directs every federal agency to ensure that payments to state and local governments do not “abet so-called ‘sanctuary’ policies that seek to shield illegal aliens from deportation.”\nThe cities and counties that sued said billions of dollars were at risk.\nOrrick, who was nominated by President Barack Obama, said the executive orders and the “executive actions that have parroted them” were an unconstitutional “coercive threat.”\nIn May, the Department of Homeland Security published a list of more than 500 “sanctuary jurisdictions,” saying each one would receive formal notification that the government had deemed them noncompliant. It also said it would inform them if they were believed to be in violation of any federal criminal statutes.\nThe list was later removed from the department’s website after critics noted it included localities that have actively supported the administration’s tough immigration policies.\nThe Justice Department has also sued New York, Los Angeles and other cities over their sanctuary policies.\nThere is no strict definition for sanctuary cities, but the terms generally describe places that limit cooperation with Immigration and Customs Enforcement. ICE enforces immigration laws nationwide but seeks help from state and local authorities to identify immigrants wanted for deportation and hold them for federal officers."
    },
    {
      "news_title": "Judge blocks Trump from cutting funding over 'sanctuary' policies",
      "news_link": "https://www.npr.org/2025/08/23/g-s1-84863/judge-blocks-trump-from-cutting-funding-sanctuary-cities",
      "bias": "Lean Left",
      "text": "Judge blocks Trump from cutting funding over 'sanctuary' policies\nA judge ruled late Friday the Trump administration cannot deny funding to Boston, Chicago, Denver, Los Angeles and 30 other cities and counties because of policies that limit cooperation with federal immigration efforts.\nU.S. District Judge William Orrick in San Francisco extended a preliminary injunction blocking the administration from cutting off or conditioning the use of federal funds for so-called \"sanctuary\" jurisdictions. His earlier order protected more than a dozen other cities and counties, including San Francisco, Portland and Seattle.\nAn email to the White House late Friday was not immediately returned. In his ruling, Orrick said the administration had offered no opposition to an extended injunction except to say the first injunction was wrong. It has appealed the first order.\nOrrick also blocked the administration from imposing immigration-related conditions on two particular grant programs.\nThe Trump administration has ratcheted up pressure on sanctuary communities as it seeks to make good on President Donald Trump's campaign promise to remove millions of people in the country illegally.\nOne executive order issued by Trump directs Attorney General Pam Bondi and Homeland Security Secretary Kristi Noem to withhold federal money from sanctuary jurisdictions. Another order directs every federal agency to ensure that payments to state and local governments do not \"abet so-called 'sanctuary' policies that seek to shield illegal aliens from deportation.\"\nThe cities and counties that sued said billions of dollars were at risk.\nOrrick, who was nominated by President Barack Obama, said the executive orders and the \"executive actions that have parroted them\" were an unconstitutional \"coercive threat.\"\nIn May, the Department of Homeland Security published a list of more than 500 \"sanctuary jurisdictions,\" saying each one would receive formal notification that the government had deemed them noncompliant. It also said it would inform them if they were believed to be in violation of any federal criminal statutes.\nThe list was later removed from the department's website after critics noted it included localities that have actively supported the administration's tough immigration policies.\nThe Justice Department has also sued New York, Los Angeles and other cities over their sanctuary policies.\nThere is no strict definition for sanctuary cities, but the terms generally describe places that limit cooperation with Immigration and Customs Enforcement. ICE enforces immigration laws nationwide but seeks help from state and local authorities to identify immigrants wanted for deportation and hold them for federal officers."
    },
    {
      "news_title": "Judge blocks Trump from cutting funding from cities over ‘sanctuary' policies",
      "news_link": "https://www.nbcphiladelphia.com/news/local/judge-blocks-trump-from-cutting-funding-from-cities-over-sanctuary-policies/4258528/",
      "bias": "Lean Left",
      "text": "What to Know\n- A judge has ruled the Trump administration cannot deny funding to Boston, Chicago, Denver, Los Angeles and 30 other cities and counties because of policies that limit cooperation with federal immigration efforts.\n- U.S. District Judge William Orrick on Friday extended a preliminary injunction blocking the administration from cutting off or conditioning the use of federal funds for so-called “sanctuary” jurisdictions.\n- His earlier order protected more than a dozen other cities and counties, including San Francisco, Portland and Seattle.\n- The Trump administration has ratcheted up pressure on those communities as it seeks to make good on President Donald Trump’s campaign promise to remove millions of people in the country illegally.\nA judge ruled late Friday that the Trump administration cannot deny funding to Boston, Chicago, Denver, Los Angeles and 30 other cities and counties because of policies that limit cooperation with federal immigration efforts.\nStream Philadelphia News for free, 24/7, wherever you are with NBC10.\nU.S. District Judge William Orrick in San Francisco extended a preliminary injunction blocking the administration from cutting off or conditioning the use of federal funds for so-called “sanctuary” jurisdictions.\nHis earlier order protected more than a dozen other cities and counties, including San Francisco, Portland and Seattle.\nAn email to the White House late Friday was not immediately returned.\nIn his ruling, Orrick said the administration had offered no opposition to an extended injunction except to say the first injunction was wrong. It has appealed the first order.\nOrrick also blocked the administration from imposing immigration-related conditions on two particular grant programs.\nThe Trump administration has ratcheted up pressure on sanctuary communities as it seeks to make good on President Donald Trump’s campaign promise to remove millions of people in the country illegally.\nOne executive order issued by Trump directs Attorney General Pam Bondi and Homeland Security Secretary Kristi Noem to withhold federal money from sanctuary jurisdictions.\nAnother order directs every federal agency to ensure that payments to state and local governments do not “abet so-called ‘sanctuary’ policies that seek to shield illegal aliens from deportation.”\nThe cities and counties that sued said billions of dollars were at risk.\nOrrick, who was nominated by President Barack Obama, said the executive orders and the “executive actions that have parroted them” were an unconstitutional “coercive threat.”\nIn May, the Department of Homeland Security published a list of more than 500 “sanctuary jurisdictions,\" saying each one would receive formal notification that the government had deemed them noncompliant. It also said it would inform them if they were believed to be in violation of any federal criminal statutes.\nThe list was later removed from the department’s website after critics noted it included localities that have actively supported the administration’s tough immigration policies.\nThe Justice Department has also sued New York, Los Angeles and other cities over their sanctuary policies.\nThere is no strict definition for sanctuary cities, but the terms generally describe places that limit cooperation with Immigration and Customs Enforcement.\nICE enforces immigration laws nationwide but seeks help from state and local authorities to identify immigrants wanted for deportation and hold them for federal officers."
    },
    {
      "news_title": "Judge Blocks Trump From Cutting Funding From 34 Cities and Counties Over ‘Sanctuary’ Policies",
      "news_link": "https://www.usnews.com/news/us/articles/2025-08-22/judge-blocks-trump-from-cutting-funding-from-34-cities-and-counties-over-sanctuary-policies",
      "bias": "Lean Left",
      "text": null
    },
    {
      "news_title": "Judge blocks Trump from cutting funding to sanctuary cities",
      "news_link": "https://www.ktvu.com/news/judge-blocks-trump-from-cutting-funding-sanctuary-cities",
      "bias": "Center",
      "text": "Judge blocks Trump from cutting funding to sanctuary cities\nSAN FRANCISCO - A judge ruled late Friday the Trump administration cannot deny funding to Boston, Chicago, Denver, Los Angeles and 30 other cities and counties because of policies that limit cooperation with federal immigration efforts.\nTrump can't withhold federal funds\nWhat we know:\nU.S. District Judge William Orrick in San Francisco extended a preliminary injunction blocking the administration from cutting off or conditioning the use of federal funds for so-called \"sanctuary\" jurisdictions. His earlier order protected more than a dozen other cities and counties, including San Francisco, Portland and Seattle.\nAn email to the White House late Friday was not immediately returned. In his ruling, Orrick said the administration had offered no opposition to an extended injunction except to say the first injunction was wrong. It has appealed the first order.\nOrrick also blocked the administration from imposing immigration-related conditions on two particular grant programs.\nThe Trump administration has ratcheted up pressure on sanctuary communities as it seeks to make good on President Donald Trump’s campaign promise to remove millions of people in the country illegally.\nCities claim billions of dollars were at stake\nDig deeper:\nOne executive order issued by Trump directs Attorney General Pam Bondi and Homeland Security Secretary Kristi Noem to withhold federal money from sanctuary jurisdictions. Another order directs every federal agency to ensure that payments to state and local governments do not \"abet so-called ‘sanctuary’ policies that seek to shield illegal aliens from deportation.\"\nThe cities and counties that sued said billions of dollars were at risk.\nOrrick, who was nominated by President Barack Obama, said the executive orders and the \"executive actions that have parroted them\" were an unconstitutional \"coercive threat.\"\nIn May, the Department of Homeland Security published a list of more than 500 \"sanctuary jurisdictions,\" saying each one would receive formal notification that the government had deemed them noncompliant. It also said it would inform them if they were believed to be in violation of any federal criminal statutes.\nThe list was later removed from the department’s website after critics noted it included localities that have actively supported the administration’s tough immigration policies.\nThe Justice Department has also sued New York, Los Angeles and other cities over their sanctuary policies.\nThere is no strict definition for sanctuary cities, but the terms generally describe places that limit cooperation with Immigration and Customs Enforcement. ICE enforces immigration laws nationwide but seeks help from state and local authorities to identify immigrants wanted for deportation and hold them for federal officers.\nThe Source: Assocaited Press"
    },
    {
      "news_title": "Trump can't cut funding from 30+ 'sanctuary' cities, including LA, judge rules",
      "news_link": "https://www.foxla.com/news/trump-los-angeles-sanctuary-city-funding",
      "bias": "Center",
      "text": "Trump can't cut funding from 30+ 'sanctuary' cities, including LA, judge rules\nLOS ANGELES - A federal judge ruled on Friday that President Donald Trump cannot withhold funding from more than 30 \"sanctuary\" cities across the U.S.\nWhat we know:\nU.S. District Judge William Orrick extended his earlier preliminary injunction, blocking the Trump administration from withholding federal funding from \"sanctuary\" cities.\nLos Angeles, Boston, Chicago and Denver were among 34 so-called \"sanctuary cities\" included in the order. Orrick's Friday order expanded on his earlier ruling, which secured funding for more than a dozen other cities and counties, including San Francisco.\nSUGGESTED: Some California lawmakers want to repeal sanctuary state laws\nThe backstory:\nOver the last few months, Trump has issued several executive orders targeting sanctuary cities and policies that the administration says inhibit federal immigration enforcement. Sanctuary policies typically limit local officials' cooperation with federal immigration officials.\nSUGGESTED: LA County not in DOJ's new 'sanctuary jurisdictions' list\nThe Justice Department has published a list of cities, counties and states that they allege are \"obstructing federal immigration law enforcement\" with their sanctuary policies. That list was updated earlier this month, and includes the state of California, the city of Los Angeles and more than 30 other jurisdictions across the U.S.\nThe Justice Department has also sued several cities, including Los Angeles, over sanctuary policies.\nWhat they're saying:\nTrump has claimed that sanctuary cities \"protect the Criminals, not the Victims. They are disgracing our Country, and are being mocked all over the World. Working on papers to withhold all Federal Funding for any City or State that allows these Death Traps to exist!!!\"\nTrump has not pubically commented on Friday's ruling.\nThe Source: Information in this story is from the Associated Press, the U.S. Justice Department, the White House website and previous FOX 11 reports."
    },
    {
      "news_title": "Judge blocks Trump from cutting funding from 34 cities and counties over 'sanctuary' policies",
      "news_link": "https://www.krem.com/article/news/nation-world/judge-blocks-trump-funding-cut-sanctuary-cities/507-11d76773-853e-480e-81f1-14ac69cc0645",
      "bias": "Center",
      "text": "WASHINGTON D.C., DC — A judge ruled late Friday the Trump administration cannot deny funding to Boston, Chicago, Denver, Los Angeles and 30 other cities and counties because of policies that limit cooperation with federal immigration efforts.\nU.S. District Judge William Orrick in San Francisco extended a preliminary injunction blocking the administration from cutting off or conditioning the use of federal funds for so-called “sanctuary” jurisdictions. His earlier order protected more than a dozen other cities and counties, including San Francisco, Portland and Seattle.\nThe Trump administration has ratcheted up pressure on those communities as it seeks to make good on President Donald Trump’s campaign promise to remove millions of people in the country illegally.\nOne executive order issued by Trump directs Attorney General Pam Bondi and Homeland Security Secretary Kristi Noem to withhold federal money from sanctuary jurisdictions. Another order directs every federal agency to ensure that payments to state and local governments do not “abet so-called ‘sanctuary’ policies that seek to shield illegal aliens from deportation.”\nThe cities and counties that sued said billions of dollars were at risk.\nAn email to the White House late Friday was not immediately returned.\nIn May, the Department of Homeland Security published a list of more than 500 “sanctuary jurisdictions,” saying each one would receive formal notification that the government had deemed them noncompliant. It also said it would inform them if they were believed to be in violation of any federal criminal statutes.\nThe list was later removed from the department’s website after critics noted it included localities that have actively supported the administration’s tough immigration policies.\nThe Justice Department has sued New York, Los Angeles and other cities over their sanctuary policies.\nThere is no strict definition for sanctuary cities, but the terms generally describes places that limit cooperation with Immigration and Customs Enforcement. ICE enforces immigration laws nationwide but seeks help from state and local authorities to identify immigrants wanted for deportation and hold them for federal officers.\nCopyright 2025 Associated Press. All rights reserved. This material may not be published, broadcast, rewritten, or redistributed."
    },
    {
      "news_title": "Judge blocks Trump from cutting funding over 'sanctuary' policies - TPR: The Public's Radio",
      "news_link": "https://thepublicsradio.org/npr/judge-blocks-trump-from-cutting-funding-over-sanctuary-policies/",
      "bias": "unknown",
      "text": "A judge ruled late Friday the Trump administration cannot deny funding to Boston, Chicago, Denver, Los Angeles and 30 other cities and counties because of policies that limit cooperation with federal immigration efforts.\nU.S. District Judge William Orrick in San Francisco extended a preliminary injunction blocking the administration from cutting off or conditioning the use of federal funds for so-called “sanctuary” jurisdictions. His earlier order protected more than a dozen other cities and counties, including San Francisco, Portland and Seattle.\nAn email to the White House late Friday was not immediately returned. In his ruling, Orrick said the administration had offered no opposition to an extended injunction except to say the first injunction was wrong. It has appealed the first order.\nOrrick also blocked the administration from imposing immigration-related conditions on two particular grant programs.\nThe Trump administration has ratcheted up pressure on sanctuary communities as it seeks to make good on President Donald Trump’s campaign promise to remove millions of people in the country illegally.\nOne executive order issued by Trump directs Attorney General Pam Bondi and Homeland Security Secretary Kristi Noem to withhold federal money from sanctuary jurisdictions. Another order directs every federal agency to ensure that payments to state and local governments do not “abet so-called ‘sanctuary’ policies that seek to shield illegal aliens from deportation.”\nThe cities and counties that sued said billions of dollars were at risk.\nOrrick, who was nominated by President Barack Obama, said the executive orders and the “executive actions that have parroted them” were an unconstitutional “coercive threat.”\nIn May, the Department of Homeland Security published a list of more than 500 “sanctuary jurisdictions,” saying each one would receive formal notification that the government had deemed them noncompliant. It also said it would inform them if they were believed to be in violation of any federal criminal statutes.\nThe list was later removed from the department’s website after critics noted it included localities that have actively supported the administration’s tough immigration policies.\nThe Justice Department has also sued New York, Los Angeles and other cities over their sanctuary policies.\nThere is no strict definition for sanctuary cities, but the terms generally describe places that limit cooperation with Immigration and Customs Enforcement. ICE enforces immigration laws nationwide but seeks help from state and local authorities to identify immigrants wanted for deportation and hold them for federal officers."
    },
    {
      "news_title": "Judge blocks Trump from cutting funding to dozens of \"sanctuary\" citi...",
      "news_link": "https://areyoupop.com/judge-blocks-trump-from-cutting-funding-to-dozens-of-sanctuary-citi/",
      "bias": "unknown",
      "text": "A federal judge on Friday blocked the Trump administration from cutting off federal funding to dozens of “sanctuary” cities and counties — covering several of the largest cities in the U.S.\nThe judge had previously ruled in April that it was unconstitutional for President Trump to freeze funding for local governments that limit their cooperation with Immigration and Customs Enforcement…\n…\nContinue reading this article at;\nhttps://www.cbsnews.com/news/judge-blocks-trump-cutting-funding-sanctuary-cities-los-angeles-chicago/\nhttps://www.cbsnews.com/news/judge-blocks-trump-cutting-funding-sanctuary-cities-los-angeles-chicago/\nwww.cbsnews.com\nFeed Name : Home – CBSNews.com\nhashtags : #Judge #blocks #Trump #cutting #funding #dozens #sanctuary #citi..\n[gs-fb-comments]"
    },
    {
      "news_title": "Obama Judge Blocks Trump Admin From Withholding Funds From More Than 30 ‘Sanctuary Cities’ - Politics, Policy, Political Views",
      "news_link": "https://politicom.com.au/obama-judge-blocks-trump-admin-from-withholding-funds-from-more-than-30-sanctuary-cities/",
      "bias": "unknown",
      "text": null
    },
    {
      "news_title": "Judge blocks Trump from cutting funding from 34 cities and counties over ‘sanctuary’ policies - The Morning Sun",
      "news_link": "https://www.morningsun.net/stories/judge-blocks-trump-from-cutting-funding-from-34-cities-and-counties-over-sanctuary-policies,237475",
      "bias": "unknown",
      "text": null
    },
    {
      "news_title": "Judge blocks Trump from withholding funds from Los Angeles, other sanctuary cities - Regional Media News",
      "news_link": "https://www.regionalmedianews.com/news/national/politics/judge-blocks-trump-from-withholding-funds-from-los-angeles-other-sanctuary-cities/",
      "bias": "unknown",
      "text": "By Dietrich Knauth and Nate Raymond\n(Reuters) -A U.S. federal judge on Friday blocked Donald Trump’s administration from withholding federal funding from more than 30 so-called sanctuary jurisdictions including Los Angeles, Baltimore, Boston and Chicago that have declined to cooperate with the Republican president’s hardline immigration crackdown.\nU.S. District Judge William Orrick expanded an injunction that he initially issued in April covering 16 cities and counties including San Francisco, where he is based, to cover a new batch of local governments that recently joined the case and sought to be protected under his court order.\nThe lawsuit was filed after Trump signed two executive orders in January and February that the cities and counties said unlawfully threatened to cut off funding to them unless they cooperated with federal immigration law enforcement, including U.S. Immigration and Customs Enforcement.\nThose orders targeted so-called sanctuary jurisdictions that have laws and policies that limit or prevent local law enforcement from assisting federal officers with civil immigration arrests.\nOrrick on Friday said Trump’s orders “threaten to withhold all federal funding from the plaintiffs as sanctuary jurisdictions if they do not adapt their policies and practices to conform with the Trump administration’s preferences.”\n“That coercive threat (and any actions agencies take to realize that threat, or additional Executive Orders the President issues to the same end) is unconstitutional, so I enjoined its effect,” Orrick wrote. “I do so again today for the protection of the new parties in this case.”\nThe White House did not immediately respond to a request for comment. The Trump administration is already appealing Orrick’s earlier ruling.\nAmong the cities covered by Orrick’s new order is Los Angeles. Trump’s deployment in June of the National Guard to patrol Los Angeles after protests against intensified federal immigration raids is the subject of a separate lawsuit by California Governor Gavin Newsom.\n(Reporting by Dietrich Knauth in New York and Nate Raymond in Boston; Editing by Kim Coghill)\nBrought to you by www.srnnews.com"
    }
  ]
}