{
  "story_id": "GN_20250826_012659_1a7ef125",
  "metadata": {
    "title": "Dutch foreign minister resigns after failing to secure sanctions against Israel",
    "timestamp": "2025-08-26T01:26:59.709657",
    "url": "https://ground.news/article/dutch-foreign-minister-resigns-after-failing-to-secure-sanctions-against-israel_8a9eeb"
  },
  "bias_distribution": {
    "total_sources": "154",
    "leaning_left": "32",
    "center": "23",
    "leaning_right": "26"
  },
  "perspective_summaries": {
    "left": [
      "Dutch Foreign Minister Caspar Veldkamp resigned on August 22, 2025, after failing to secure cabinet support for new sanctions against Israel regarding the conflict in Gaza.",
      "Following Veldkamp's resignation, all members of the New Social Contract party also quit, leading to political instability in the Netherlands.",
      "The United Nations confirmed that Gaza City is experiencing famine, with conditions expected to deteriorate further without humanitarian aid.",
      "Opposition politicians criticized Veldkamp for inaction, leading to calls for a no-confidence vote, reflecting public demand for stronger measures against Israel's actions."
    ],
    "center": [
      "On August 22, 2025, Caspar Veldkamp stepped down from his role as the Netherlands' foreign minister following a cabinet impasse over proposed sanctions on Israel.",
      "His resignation followed unresolved cabinet debates over stronger measures amid internal government disagreement on Israel's Gaza war response.",
      "Veldkamp advocated for sanctions and restrictions on goods from settlements but encountered opposition within the cabinet, leading him to express that he faced resistance to taking further action.",
      "He expressed that he encountered resistance within the cabinet regarding further actions and acknowledged his inability to implement significant new measures.",
      "His resignation increased political tensions as his New Social Contract Party withdrew from the coalition, complicating the October 29 election campaign."
    ],
    "right": [
      "Dutch Foreign Minister Caspar Veldkamp resigned due to a deadlock over sanctions against Israel after an unresolved cabinet debate, according to Dutch news agency ANP.",
      "The cabinet was divided over responses to Israel's operations, and Veldkamp pushed for stronger actions but lacked support from colleagues.",
      "Following his resignation, all ministers from Veldkamp's party resigned in solidarity, causing a political crisis for Prime Minister Mark Rutte's coalition government.",
      "Following the resignations, protests erupted in The Hague against Israeli policies, reflecting growing dissent among Dutch citizens on the issue."
    ]
  },
  "sources": [
    {
      "news_title": "Tanaiste wants 'real sanction' moves against Israel over breach of EU agreement",
      "news_link": "https://www.irishmirror.ie/news/irish-news/politics/tanaiste-wants-real-sanction-moves-35784768",
      "bias": "Lean Left",
      "text": "The Tanaiste is to \"seek real sanction\" measures against Israel after a review found it violated the terms of the country’s agreement with the EU.\nSimon Harris will meet fellow foreign ministers in Copenhagen this week, where he said he will seek \"concrete actions\" from the bloc in response to the catastrophic situation in Gaza.\nSpeaking ahead of the meeting, Mr Harris said that \"famine is a spectre no Irish person can endure\".\nHis comments come after the United Nations officially declared famine in Gaza City.\nUN secretary general Antonio Guterres said it is a \"man-made disaster\" and a \"failure of humanity\".\nIrish president Michael D Higgins echoed similar comments this weekend, saying it is a \"tragic period\" in the world’s history.\nMr Harris said that Israel is in clear breach of its human rights obligations under the Association Agreement.\nThe Tanaiste said: \"The scenes that we are witnessing in Gaza and the now famine conditions that families are facing is nothing short of catastrophic.\n\"Famine is a spectre no Irish person can endure.\n\"People in Ireland, and across the world, will not turn a blind eye.\n\"I along with my EU counterparts, are calling once again on Israel to completely and immediately lift its blockade and allow the full resumption of humanitarian aid, in line with humanitarian principles, into Gaza.\n\"All hostages must be released.\n\"There needs to be an immediate and permanent ceasefire.\n\"This week I will travel to Copenhagen where I will meet fellow EU foreign ministers and call for concrete action against Israel for the genocide being committed against the people of Gaza.\"\nMr Harris has pledged to pass the Israeli Settlements in the Occupied Palestinian Territory Bill.\nThe Fine Gael leader said he \"can move forward\" after receiving the Oireachtas Committee Report.\nHe called for other EU foreign ministers to work at an EU and UN level and with like-minded Arab countries to \"seek a ceasefire, hostages released and a surge in humanitarian aid\".\nMr Harris said he wants to increase its funding to programmes like the World Food Programme and will advance a National Day of Solidarity for Gaza and intends to encourage other countries to do likewise.\nSubscribe to our newsletter for the latest news from the Irish Mirror direct to your inbox: Sign up here."
    },
    {
      "news_title": "Dutch government in crisis as ministers resign over Gaza policy",
      "news_link": "https://www.tehrantimes.com/news/517090/Dutch-government-in-crisis-as-ministers-resign-over-Gaza-policy",
      "bias": "Right",
      "text": "Dutch government in crisis as ministers resign over Gaza policy\nThe Netherlands’ caretaker government plunged into a political crisis as all ministers and state secretaries from the New Social Contract (NSC) party resigned on Friday following Foreign Minister Caspar Veldkamp’s departure over the government’s refusal to impose stronger sanctions on Israel regarding its military operations in Gaza.\nThe mass walkout included Acting Deputy Prime Minister and Social Affairs Minister Eddy van Hijum, Interior Minister Judith Uitermark, Education Minister Eppo Bruins, Health Minister Daniëlle Jansen, and four state secretaries, who stepped down in solidarity with Veldkamp.\nTheir resignations came after prolonged cabinet disputes over implementing tougher measures against Israel.\nVeldkamp, who resigned earlier that day, stated he felt “resistance inside the cabinet” and was “insufficiently able to take meaningful additional measures to increase pressure on Israel” despite the ongoing situation in Gaza.\nHis proposed measures included an import ban on settlement goods, entry bans for far‑right Israeli ministers Bezalel Smotrich and Itamar Ben‑Gvir, suspension of certain military export licenses, and pushing for a freeze of the EU‑Israel trade agreement.\nThe liberal People’s Party for Freedom and Democracy (VVD), part of the ruling coalition, criticized the resignations. The government had already collapsed on June 3 over immigration disputes, with elections scheduled for October 29.\nHamas praised the resignations as a “courageous and ethical” stance that “embodies humanitarian values and reaffirms commitment to international law,” and called for other governments to follow suit in imposing sanctions on Israel.\nThe Netherlands, like many EU members, has faced criticism for its perceived complicity in Israel’s actions. Despite some limited measures – such as banning extremist Israeli ministers and revoking three export permits for naval components – the EU has not implemented comprehensive sanctions.\nHuman rights organizations and UN agencies have documented extensive civilian casualties in Gaza, with at least 62,000 Palestinians killed and over 157,000 injured since October 2023, according to Gaza’s Health Ministry. Women and children make up a large proportion of the dead.\nMultiple UN experts and international bodies have described the situation as meeting the legal definition of genocide, and a UN‑backed food security body has declared famine in Gaza City and surrounding areas.\nThis perceived complicity has proven highly unpopular among European citizens. In the Netherlands, between 100,000 and 150,000 people demonstrated against Israeli policies in The Hague on June 15 — one of the largest protests in the country in two decades.\nPolls across EU countries show a majority support for arms embargoes and sanctions against Israel, with growing public pressure on governments to take stronger action.\nLeave a Comment"
    },
    {
      "news_title": "Dutch Ministers Resign Due To Dispute Over Sanctions Against Israel - teleSUR English",
      "news_link": "https://www.telesurenglish.net/dutch-ministers-resign-due-to-dispute-over-sanctions-against-israel/",
      "bias": "Left",
      "text": "Dutch Ministers Resign Due To Dispute Over Sanctions Against Israel\nA street ad in Amsterdam, Netherlands, 2025. @OnlinePalEng\nAugust 23, 2025 Hour: 12:24 pm\nThe Israeli actions are in direct conflict with international treaties, Deputy PM Van Hijum said.\nOn Friday, four ministers and four state secretaries in the Dutch caretaker cabinet announced their resignation due to deadlock within the coalition over efforts to take measures against Israel.\nRELATED:\n“I feel resistance within the cabinet to taking further steps related to what is happening in Gaza City and the West Bank. I’m going home to write a resignation letter,” said Foreign Minister Caspar Veldkamp.\n“I do not have enough confidence that, in the coming weeks, months or year, I can adequately act as foreign minister if my room to carry out my own policy and set the course I consider necessary is so limited,” he added, after which other colleagues from his party also decided to leave the government.\n“Put simply, we’ve had enough. There was no progress. There was no willingness to give space to the foreign minister. The actions of the Israeli government are in direct conflict with international treaties. A line must be drawn,” said Dutch Deputy Prime Minister and leader of the center-right NSC party, Eddy Van Hijum.\nAlong with Veldkamp, the resignations included the ministers of Interior, Education and Health, as well as four state secretaries.\nVeldkamp had promised Parliament on Thursday to present additional necessary measures against Israel, but he had not coordinated this politically with other cabinet members, including the right-wing liberals of VVD and the farmers’ party BBB, who oppose toughening the stance toward the administration of Prime Minister Benjamin Netanyahu, who faces an International Criminal Court arrest warrant for war crimes and crimes against humanity in Gaza.\nThe Council of Ministers met Friday to discuss whether to adopt new measures against Israel. NSC ministers fully supported banning imports of products from Israeli settlements, but the other two parties argued the step went “too far.”\nThat same day, a parliamentary debate on measures against Israel unfolded chaotically, with pressure on Veldkamp to harden the cabinet’s stance toward Netanyahu, but also criticism from lawmakers more sympathetic to Israel. The debate ended without a vote on a no-confidence motion against Veldkamp.\nInterim Prime Minister Dick Schoof’s cabinet has governed in caretaker mode since June, after the collapse of the coalition when its largest partner, Geert Wilders’ far-right PVV party, withdrew over migration policy disagreements. The Netherlands will hold early elections on Oct. 29.\n“Veldkamp felt very strongly the need to take additional measures against the Israeli government, but the brakes kept being applied. He was hardly given space to assume his responsibility. We hoped that after PVV’s exit things would be different, but that has not been the case,” Van Hijum said.\nEarlier, on Wednesday, Israel approved a plan to expand settlements near East Jerusalem in the area known as “E1,” which would block access to the city from the occupied West Bank and hinder the creation of a contiguous Palestinian state.\nOn behalf of the Dutch government, Veldkamp rejected the plan, saying it represented “a clear violation of international law and would make a future Palestinian state practically impossible.”\nIn late July, Veldkamp barred entry to ultranationalist Finance Minister Bezalel Smotrich and National Security Minister Itamar Ben Gvir for inciting “ethnic cleansing” in Gaza, and summoned the Israeli ambassador over the “intolerable and indefensible” humanitarian situation in the enclave.\nAt the European level, he pushed for suspending the trade component of the EU-Israel association agreement and pledged to press Brussels to propose trade measures against imports from illegal settlements.\nteleSUR/ JF\nSource: EFE"
    },
    {
      "news_title": "Dutch FM quits after failing to advance anti-Israel measures",
      "news_link": "https://www.clevelandjewishnews.com/jns/dutch-fm-quits-after-failing-to-advance-anti-israel-measures/article_5ead97c8-1005-5c31-8a34-d9037b4f6624.html",
      "bias": "Lean Right",
      "text": null
    },
    {
      "news_title": "Dutch Caretaker Govt Fragments as Dutch Right Splits on Israel - The Ron Paul Institute for Peace & Prosperity",
      "news_link": "https://ronpaulinstitute.org/dutch-caretaker-govt-fragments-as-dutch-right-splits-on-israel/",
      "bias": "Right",
      "text": null
    },
    {
      "news_title": "Dutch MPs vote against Palestinian state recognition amid government fallout over Israel",
      "news_link": "https://www.politico.eu/article/dutch-vote-against-palestinian-statehood-recognition-amid-coaltion-fallout-veldkamp-resign-israel/",
      "bias": "Lean Left",
      "text": "Dutch lawmakers on Saturday rejected a motion to recognize an independent Palestinian state, and also voted against punitive measures against Israel, as political deadlock over Israel continued to weaken the Netherlands’ caretaker government.\nThe proposed measures included boycotting products coming from illegally occupied territories in the West Bank, as well as a ban on the purchase of weapons from Israel.\nThe votes follow the sudden resignation of Dutch Foreign Minister Caspar Veldkamp late Friday in protest against the government’s reluctance to impose tougher sanctions against Israel over the humanitarian crisis in Gaza."
    },
    {
      "news_title": "Dutch foreign minister resigns over Gaza",
      "news_link": "https://www.middleeasteye.net/news/dutch-foreign-minister-resigns-over-gaza",
      "bias": "Left",
      "text": "Dutch foreign minister resigns over Gaza\nDutch Foreign Minister Caspar Veldkamp, part of a caretaker government, resigned on Friday after a cabinet meeting failed to reach consensus on new sanctions against Israel.\nFollowing his resignation, the centre-right New Social Contract party, to which Veldkamp belongs, withdrew from the governing coalition, deepening the political crisis in the Netherlands.\nThe Dutch government collapsed on 3 June, and the caretaker minority administration is expected to remain in office until a new coalition is formed following October’s elections, a process that could take several months.\nVeldkamp, a former ambassador to Israel, called for fresh measures against Israel on Thursday in response to its war on Gaza and its plans for the occupied West Bank.\nEarlier this week, Israel approved an illegal and highly controversial project to build more than 3,400 settlements in the West Bank, which would effectively split the territory in half.\nNew MEE newsletter: Jerusalem Dispatch\nSign up to get the latest insights and analysis on Israel-Palestine, alongside Turkey Unpacked and other MEE newsletters\nLast month, the Netherlands declared far-right Israeli ministers Itamar Ben Gvir and Bezalel Smotrich persona non grata. It also joined 20 other countries in signing a joint declaration condemning Israel’s West Bank settlement project as “unacceptable and contrary to international law”.\nHowever, the cabinet reached a deadlock on Friday over potential new steps to pressure Israel.\nVeldkamp told Dutch news agency ANP that he felt “insufficiently able to take meaningful additional measures” and that he was constrained in pursuing the course he deemed necessary as foreign minister.\nHe added that the measures he had proposed were “seriously discussed” but repeatedly met with resistance in cabinet meetings.\nLast month, Amsterdam named Israel as a foreign threat to its national security for the first time, citing disinformation campaigns endangering the lives of Dutch citizens.\nThe Dutch government has faced mounting pressure from public protests over Israel’s war. Demonstrations in The Hague drew between 100,000 and 150,000 people - the largest in the country in two decades. Protesters demanded sanctions on Israel and humanitarian access for civilians in Gaza.\nOn Friday, the United Nations officially declared a famine in the enclave, citing “systematic obstruction” of aid by Israel.\nMeanwhile, EU foreign ministers have repeatedly failed to agree on collective sanctions against Israel, despite lobbying from several member states.\nMiddle East Eye delivers independent and unrivalled coverage and analysis of the Middle East, North Africa and beyond. To learn more about republishing this content and the associated fees, please fill out this form. More about MEE can be found here."
    },
    {
      "news_title": "Dutch FM quits over cabinet refusal to punish Israel over Gaza genocide",
      "news_link": "https://thecradle.co/articles-id/32729",
      "bias": "Left",
      "text": null
    },
    {
      "news_title": "Dutch Foreign Minister resigns after failing to secure sanctions against Israel",
      "news_link": "https://www.thehindu.com/news/international/dutch-foreign-minister-resigns-after-failing-to-secure-sanctions-against-israel/article69967816.ece",
      "bias": "Lean Left",
      "text": "Dutch Foreign Minister Caspar Veldkamp resigned Friday (August 22, 2025) evening, after he failed to secure new sanctions against Israel over the war in Gaza.\nMr. Veldkamp had informed the country's Parliament he intended to bring in new measures in response to Israel's planned offensive in Gaza City and other heavily populated areas but was unable to secure the support of his coalition partners.\nThe 61-year-old former Ambassador to Israel told reporters he felt he was unable “to implement policy myself and chart the course I deem necessary”.\nFollowing Mr. Veldkamp's resignation, the remaining Cabinet members of his center-right New Social Contract party also quit, leaving the Dutch government in disarray.\n“In short we are done with it,” party leader Eddy Van Hijum said, calling the Israeli government's actions “diametrically opposed to international treaties”.\nThe Dutch Government already collapsed in June when anti-Islam lawmaker Geert Wilders pulled out of the country's four-party coalition over a fight about immigration.\nThe three remaining parties stayed on in a caretaker Government until elections could be held in October.\nPrime Minister Dick Schoof was set to address Parliament later Friday evening over the crisis.\nThe world's leading authority on food crises said earlier on Friday the Gaza Strip's largest city is gripped by famine, and that it's likely to spread across the territory without a ceasefire and an end to restrictions on humanitarian aid.\nThe Netherlands' Parliament had repeatedly delayed a debate on sanctions against Israel, a discussion that was already postponed from Thursday, as the Friday afternoon Cabinet meeting dragged on.\n“There's a famine, ethnic cleansing, and genocide going on,” Kati Piri of the merged Green Left/Labour parties told Parliament, “And our cabinet has been deliberating for hours about whether to take any action at all. Shameful.” Mr. Veldkamp had proposed a ban on imports from Israeli settlements in the occupied Palestinian territories in response to the planned military escalation.\nOpposition politicians had called for a no-confidence vote for the Minister, frustrated at what they saw as a lack of action against Israel.\nPublished - August 23, 2025 01:28 pm IST"
    },
    {
      "news_title": "Dutch foreign minister steps down after failed push for sanctions against Israel",
      "news_link": "https://presstv.ir/Detail/2025/08/23/753592/Dutch-Foreign-Minister-resigns-after-failing-to-impose-sanctions-on-Israel",
      "bias": "Right",
      "text": null
    },
    {
      "news_title": "Dutch Foreign Minister Resigns After Failing to Secure Sanctions Against Israel",
      "news_link": "https://english.aawsat.com/world/5178146-dutch-foreign-minister-resigns-after-failing-secure-sanctions-against-israel",
      "bias": "Lean Right",
      "text": "Dutch Foreign Minister Caspar Veldkamp resigned Friday evening, after he failed to secure new sanctions against Israel over the war in Gaza.\nVeldkamp had informed the country’s Parliament he intended to bring in new measures in response to Israel's planned offensive in Gaza City and other heavily populated areas but was unable to secure the support of his coalition partners.\nThe 61-year-old former ambassador to Israel told reporters he felt he was unable “to implement policy myself and chart the course I deem necessary.”\nFollowing Veldkamp’s resignation, the remaining Cabinet members of his center-right New Social Contract party also quit, leaving the Dutch government in disarray.\n“In short we are done with it,” party leader Eddy Van Hijum said, calling the Israeli government’s actions “diametrically opposed to international treaties.”\nThe Dutch government already collapsed in June when anti-Islam lawmaker Geert Wilders pulled out of the country’s four-party coalition over a fight about immigration.\nThe three remaining parties stayed on in a caretaker government until elections could be held in October.\nPrime Minister Dick Schoof was set to address Parliament later Friday evening over the crisis.\nThe world’s leading authority on food crises said earlier on Friday the Gaza Strip’s largest city is gripped by famine, and that it’s likely to spread across the territory without a ceasefire and an end to restrictions on humanitarian aid.\nThe Netherlands’ Parliament had repeatedly delayed a debate on sanctions against Israel, a discussion that was already postponed from Thursday, as the Friday afternoon Cabinet meeting dragged on.\n“There’s a famine, ethnic cleansing, and genocide going on,” Kati Piri of the merged Green Left/Labor parties told Parliament, “And our cabinet has been deliberating for hours about whether to take any action at all. Shameful.”\nVeldkamp had proposed a ban on imports from Israeli settlements in the occupied Palestinian territories in response to the planned military escalation.\nOpposition politicians had called for a no-confidence vote for the minister, frustrated at what they saw as a lack of action against Israel."
    },
    {
      "news_title": "Trump says less than 20 hostages alive in Gaza, Former IDF official Aharon Haliva slams Netanyahu",
      "news_link": "https://www.jpost.com/israel-news/defense-news/2025-08-23/live-updates-865051",
      "bias": "Center",
      "text": "Gantz calls on party heads to form new gov't, Two bodies found inside a burned-down car\nIrish president calls for a UN military intervention in Gaza • Lt. Ori Gerlic killed in operational explosive accident in southern Gaza Strip • Security cabinet to meet on Tuesday\nTwo bodies found inside a burned-down car.(photo credit: MAGEN DAVID ADOM)\nIsrael Police arrest 61-year-old woman during protest over alleged 'incitement to violence'\nThe woman, whose name hasn’t been shared, is a resident of northern Israel who chanted the slogan “with spirit and blood, we redeemed Gaza.\"\nByHODIA RANThousands of people gathered to protest the possible firing of A-G Gali Baharav-Miara, August 3, 2025.(photo credit: AVSHALOM SASSONI/MAARIV)Go to the full article > >\nIrish president calls for a UN military intervention in Gaza\nAccording to Higgins, the UN General Assembly should establish “a force to be put together to guarantee humanitarian access\" even if the Security Council vetoes the initiative.\nGantz calls on Netanyahu, Lapid, Liberman to form temp. gov't to return Israeli hostages\nGantz outlined two main goals of the temporary government: Returning all the hostages and passing the haredi draft law. Afterwards, he said it would dissolve and Israel would go to elections,\nByKESHET NEEV, JERUSALEM POST STAFF Leader of the National Unity Party MK Benny Gantz leads a faction meeting at the Knesset, the Israeli parliament in Jerusalem, on May 26, 2025.(photo credit: NOAM REVKIN FENTON/FLASH90)Go to the full article > >\nLt. Ori Gerlic killed in operational explosive accident in southern Gaza Strip\nGerlic served as a platoon commander in the Shimshon Battalion (92) of the Kfir Brigade. He died after an IDF explosive charge detonated unintentionally during an operation.\nWhy Gantz's six-month 'hostage government' is the right idea, but probably won't happen - analysis\nBenny Gantz's six-month government proposal to return all of the hostages and pass a haredi draft law is just what Israel needs, but it doesn't address the major roadblocks.\nByZVIKA KLEIN (L-R): Prime Minister Benjamin Netanyahu, War cabinet minister Benny Gantz on June 8, 2024(photo credit: FLASH90, POOL)Go to the full article > >\nGantz to hold press conference in Ramat Gan amid coalition rumors\nByAVI SOLOMON\nICYMI: IDF intercepts Houthi missile fired on Friday, fragments fall in central Israeli backyard\nByJERUSALEM POST STAFFThe scene where fragments of a ballistic missile fired from Yemen hit an open area in Moshav Ginaton, central Israel, August 23, 2025(photo credit: YOSSI ALONI/FLASH90)Go to the full article > >\nIsraeli infant seriously injured after falling in Haifa\nHamas launched a massive attack on October 7, with thousands of terrorists infiltrating from the Gaza border and taking some 240 hostages into Gaza.\nOver 1,200 Israelis and foreign nationals were murdered, including over 350 at the Supernova music festival and hundreds of Israeli civilians across the Gaza border communities.\n50 hostages remain in Gaza, while 49 hostages in total have been killed in captivity.\nThe IDF launched large-scale attacks on Iranian nuclear facilities on June 13, 2025.\nIsrael struck key nuclear sites and killed senior Iranian military and IRGC officials.\n28 Israelis killed, over 1,300 wounded, including several IDF soldiers, in Iranian attacks."
    },
    {
      "news_title": "Dutch Foreign Minister Veldkamp resigns after failing to pass Israel sanctions",
      "news_link": "https://www.indiatoday.in/world/story/dutch-foreign-minister-veldkamp-resigns-after-failing-to-pass-israel-sanctions-glbs-2775529-2025-08-23",
      "bias": "Lean Right",
      "text": "Dutch Foreign Minister Veldkamp resigns after failing to pass Israel sanctions\nDutch Foreign Minister Caspar Veldkamp resigned after failing to secure new sanctions on Israel over Gaza. His departure prompted his entire party's cabinet to quit, leaving the government in turmoil.\nDutch Foreign Minister Caspar Veldkamp resigned Friday evening, after he failed to secure new sanctions against Israel over the war in Gaza.\nVeldkamp had informed the country’s Parliament he intended to bring in new measures in response to Israel's planned offensive in Gaza City and other heavily populated areas but was unable to secure the support of his coalition partners.\nThe 61-year-old former ambassador to Israel told reporters he felt he was unable “to implement policy myself and chart the course I deem necessary.”\nFollowing Veldkamp’s resignation, the remaining Cabinet members of his center-right New Social Contract party also quit, leaving the Dutch government in disarray.\n“In short we are done with it,” party leader Eddy Van Hijum said, calling the Israeli government’s actions “diametrically opposed to international treaties.”\nThe Dutch government already collapsed in June when anti-Islam lawmaker Geert Wilders pulled out of the country’s four-party coalition over a fight about immigration.\nThe three remaining parties stayed on in a caretaker government until elections could be held in October.\nPrime Minister Dick Schoof was set to address Parliament later Friday evening over the crisis.\nThe world’s leading authority on food crises said earlier on Friday the Gaza Strip’s largest city is gripped by famine, and that it’s likely to spread across the territory without a ceasefire and an end to restrictions on humanitarian aid.\nThe Netherlands’ Parliament had repeatedly delayed a debate on sanctions against Israel, a discussion that was already postponed from Thursday, as the Friday afternoon Cabinet meeting dragged on.\n“There’s a famine, ethnic cleansing, and genocide going on,” Kati Piri of the merged Green Left/Labor parties told Parliament, “And our cabinet has been deliberating for hours about whether to take any action at all. Shameful.”\nVeldkamp had proposed a ban on imports from Israeli settlements in the occupied Palestinian territories in response to the planned military escalation.\nOpposition politicians had called for a no-confidence vote for the minister, frustrated at what they saw as a lack of action against Israel."
    },
    {
      "news_title": "Dutch Foreign Minister resigns after failing to impose sanctions on Israel",
      "news_link": "https://www.israelnationalnews.com/news/413722",
      "bias": "Lean Right",
      "text": null
    },
    {
      "news_title": "Dutch Foreign Minister Quits Over Government’s Gaza Policy - Quds News Network",
      "news_link": "https://qudsnen.co/dutch-foreign-minister-quits-over-governments-gaza-policy/",
      "bias": "Lean Left",
      "text": "Dutch Foreign Minister Quits Over Government’s Gaza Policy\nThe Hague (Quds News Network)- Dutch Foreign Minister Caspar Veldkamp resigned on Friday. He said he could not continue in a government that refused stronger action against Israel’s genocide in Gaza and its settlement plans in the West Bank.\nVeldkamp, part of the caretaker cabinet, told reporters that his decision came after weeks of frustration. “I have felt pushback in the cabinet for additional measures,” he said. He will formally submit his resignation.\nThe Dutch government collapsed on June 3. Since then, a caretaker minority has been running the country until elections in October. Analysts say it could take months before a new coalition is formed.\nVeldkamp’s departure highlights growing splits in Europe over Israel’s crimes. He wanted tougher measures. But the rest of the cabinet opposed them. The government declined to support new sanctions or diplomatic moves.\nIsrael launched its latest offensive in Gaza with the stated aim of seizing Gaza City, forcing over one million civilians south.\nEarlier on Friday, a global hunger monitor declared that famine is now present in Gaza City and surrounding areas. The report said starvation has reached critical levels after months of blockade and bombardment.\nAt the same time, Israel approved a major new settlement in the occupied West Bank. The project would cut across the territory and divide Palestinian villages. Experts warn it would make a future Palestinian state impossible.\nVeldkamp’s resignation leaves the caretaker government weaker. With elections still months away, the Netherlands faces political uncertainty at home while navigating a growing international crisis abroad."
    },
    {
      "news_title": "Dutch foreign minister quits caretaker government over Gaza",
      "news_link": "https://www.channelnewsasia.com/world/dutch-foreign-minister-quits-caretaker-government-over-gaza-5309981",
      "bias": "Center",
      "text": "Dutch foreign minister quits caretaker government over Gaza\nTHE HAGUE: Dutch Foreign Minister Caspar Veldkamp, part of a caretaker government, quit his cabinet post on Friday (Aug 22) ahead of schedule over the government's position on Israel's war in Gaza, he told reporters.\nHe said the government did not support additional measures against Israel over Gaza and plans for the occupied West Bank.\n\"I have felt pushback in the cabinet for additional measures,\" he said, adding he would formally tender his resignation.\nThe Dutch government collapsed on June 3, and the caretaker minority government is expected to stay in place until a coalition government is formed after October elections, which may take months.\nIsrael has launched a military offensive aimed at seizing control of Gaza City, relocating civilians to the south, dismantling Hamas and creating pressure for hostage releases.\nEarlier on Friday a global hunger monitor determined people in Gaza City and its surroundings were officially suffering from famine. Israel has dismissed the findings as false and biased.\nIsrael this week gave final approval to plans to construct a settlement that would bisect the occupied West Bank and fragment territory Palestinians seek for an independent state."
    },
    {
      "news_title": "Dutch foreign minister resigns over Israel sanctions deadlock",
      "news_link": "https://www.aljazeera.com/news/2025/8/22/dutch-foreign-minister-resigns-over-israel-sanctions-deadlock",
      "bias": "Lean Left",
      "text": "Dutch foreign minister resigns over Israel sanctions deadlock\nCaspar Veldkamp and other ministers step down after cabinet rejects sanctions against Israel, prompting broader political upheaval.\nDutch Foreign Minister Caspar Veldkamp has resigned after failing to secure cabinet support for additional sanctions against Israel over its military onslaught in Gaza.\nVeldkamp, a member of the centre-right New Social Contract party, said on Friday that he could not achieve agreement on “meaningful measures” and had repeatedly faced resistance from colleagues over sanctions already in place.\nRecommended Stories\nlist of 3 itemsChildren in Gaza play games with aid drop parachute\nThis is the human tragedy caused by Israel’s famine in Gaza\nHis efforts included imposing entry bans on far-right Israeli ministers, Bezalel Smotrich and Itamar Ben-Gvir, citing their role in inciting settler violence against Palestinians.\nVeldkamp also revoked three export permits for navy ship components, warning of “deteriorating conditions” in Gaza and the “risk of undesirable end use”.\n“I also see what is happening on the ground in Gaza, the attack on Gaza City, and what is happening in the West Bank, the building decision for the disputed settlement E1, and East Jerusalem,” Veldkamp told reporters.\nHis departure leaves the Netherlands without a foreign minister as the European Union navigates security guarantees for Ukraine and continues talks with the United States over tariffs.\nFollowing his resignation, all New Social Contract ministers and state secretaries confirmed their support for Veldkamp and resigned from the caretaker government in solidarity.\nAl Jazeera’s Step Vaessen, reporting from Berlin on developments in the Netherlands, said Veldkamp was “under increasing pressure from lawmakers in parliament, especially from the opposition who have been requesting stricter sanctions against Israel”.\nWhile Veldkamp had announced travel bans for two Israeli ministers a few weeks ago, Vaessen said the foreign minister was facing growing demands after Israel’s attacks on Gaza City and the “increasing aggression” that the Dutch government “should be doing more”.\n“Veldkamp has also been pushing for a suspension of the trade agreement that the EU has with Israel,” Vaessen added, noting that the Dutch foreign minister had “increasingly become frustrated because Germany was blocking that. So there was also this push from the Dutch parliament that the Netherlands shouldn’t wait anymore for any European sanctions but should put sanctions on Israel alone.”\nEurope-Israel relations\nDespite limited Dutch sanctions on Israel, the country continues to support the supply chain of Israel’s F-35 fighter jet.\nResearch from the Palestinian Youth Movement shared with Al Jazeera in June shows that ships carrying F-35 components frequently dock at the port of Rotterdam, operated by Danish shipping company Maersk.\nThe F-35 jets have been used by Israel in air strikes on Gaza, which have left much of the Strip in ruins and contributed to the deaths of more than 62,000 people since October 2023.\nEarlier this week, the Netherlands joined 20 other nations in condemning Israel’s approval of a large West Bank settlement expansion, calling it “unacceptable and contrary to international law”.\nMeanwhile, Israel’s military attacks on Gaza continue, forcing civilians from Gaza City southwards amid mounting famine. A global hunger monitor confirmed on Friday that residents of Gaza City and surrounding areas are officially facing famine conditions.\nNo successor to Veldkamp has been announced. The caretaker Dutch government, which has been in place since the collapse of the previous coalition on June 3, is expected to remain until a new coalition is formed following elections in October, a process that could take months."
    },
    {
      "news_title": "Dutch foreign minister resigns over Israel sanctions showdown",
      "news_link": "https://www.kake.com/dutch-foreign-minister-resigns-over-israel-sanctions-showdown/article_d1c17638-e7b7-5616-83f2-80b460c1a405.html",
      "bias": "Center",
      "text": null
    },
    {
      "news_title": "Dutch foreign minister resigns after failing to secure sanctions against Israel",
      "news_link": "https://apnews.com/article/netherlands-government-veldkamp-dutch-israel-0cb5b9b3c0fab86d39a4202d2231f091",
      "bias": "Lean Left",
      "text": "Dutch foreign minister resigns after failing to secure sanctions against Israel\nAMSTERDAM (AP) — Dutch Foreign Minister Caspar Veldkamp resigned Friday evening, after he failed to secure new sanctions against Israel over the war in Gaza.\nVeldkamp had informed the country’s Parliament he intended to bring in new measures in response to Israel’s planned offensive in Gaza City and other heavily populated areas but was unable to secure the support of his coalition partners.\nThe 61-year-old former ambassador to Israel told reporters he felt he was unable “to implement policy myself and chart the course I deem necessary.”\nFollowing Veldkamp’s resignation, the remaining Cabinet members of his center-right New Social Contract party also quit, leaving the Dutch government in disarray.\n“In short we are done with it,” party leader Eddy Van Hijum said, calling the Israeli government’s actions “diametrically opposed to international treaties.”\nThe Dutch government already collapsed in June when anti-Islam lawmaker Geert Wilders pulled out of the country’s four-party coalition over a fight about immigration.\nThe three remaining parties stayed on in a caretaker government until elections could be held in October.\nPrime Minister Dick Schoof was set to address Parliament later Friday evening over the crisis.\nThe world’s leading authority on food crises said earlier on Friday the Gaza Strip’s largest city is gripped by famine, and that it’s likely to spread across the territory without a ceasefire and an end to restrictions on humanitarian aid.\nThe Netherlands’ Parliament had repeatedly delayed a debate on sanctions against Israel, a discussion that was already postponed from Thursday, as the Friday afternoon Cabinet meeting dragged on.\n“There’s a famine, ethnic cleansing, and genocide going on,” Kati Piri of the merged Green Left/Labor parties told Parliament, “And our cabinet has been deliberating for hours about whether to take any action at all. Shameful.”\nVeldkamp had proposed a ban on imports from Israeli settlements in the occupied Palestinian territories in response to the planned military escalation.\nOpposition politicians had called for a no-confidence vote for the minister, frustrated at what they saw as a lack of action against Israel."
    },
    {
      "news_title": "Dutch foreign minister resigns over Israel sanctions: report",
      "news_link": "https://www.ctvnews.ca/world/israel-hamas-war/article/dutch-foreign-minister-resigns-over-israel-sanctions-report/",
      "bias": "Center",
      "text": "ADVERTISEMENT\nDutch foreign minister resigns over Israel sanctions: report\nPublished:\n20 Useful Amazon Canada Finds That Ring In Under $15\n18 Of The Best Budget-Friendly Dorm Essentials For Anyone Starting University In 2025\nI Tried It: To Help You Get the Best Sleep Of Your Life, I Tested Two Popular Pillows\nLittle Luxuries Are Important, So Let Me Introduce You To A Few Of Our Favourite Tinted Lip Balms From Canadian Brands\nLittle Luxuries Are Important, So Let Me Introduce You To A Few Of Our Favourite Hair Oils From Canadian Brands\nThe Absolute Best False Eyelashes You Can Get In Canada Right Now\n10 Of The Best Back-To-School Deals And Discounts You'll Find On Amazon Canada Right Now\nFYI: This Brightening Moisturizer From Laneige Is 22% Off Today\nThis Wearable Fan Will Keep You Cool On The Hottest Of Days, And It’s Over 40% Off Right Now\nThe Best Kids’ Water Bottles For Back To School 2025\nThe Shopping Trends team is independent of the journalists at CTV News. We may earn a commission when you use our links to shop. Read about us."
    },
    {
      "news_title": "Top Dutch diplomat steps down after measures against Israel blocked",
      "news_link": "https://www.dailysabah.com/world/europe/top-dutch-diplomat-steps-down-after-measures-against-israel-blocked",
      "bias": "Right",
      "text": "Dutch Foreign Minister Caspar Veldkamp resigned after coalition partners blocked his push for tougher measures against Israel, saying he felt compelled to do more over the crises in Gaza City and the West Bank.\nVeldkamp said the government had already taken significant steps, but he felt pressure to act further regarding the situation in Gaza City and the West Bank.\nWith parties VVD and BBB opposing any new measures, he said he no longer trusted that he could implement his plans and decided to step down.\n\"I see that I am insufficiently able to take meaningful additional measures to increase pressure on Israel,\" Veldkamp told ANP after a cabinet debate on possible sanctions against Israel was deadlocked.\nLast month Veldkamp declared far-right Israeli ministers Itamar Ben-Gvir and Bezalel Smotrich unwelcome in the Netherlands.\nOn Thursday, he said he wanted to take further steps against Israel, but later acknowledged he lacked confidence he could act effectively in the coming weeks or months.\nThe minister said the steps he had proposed were \"seriously discussed\" but encountered resistance in successive cabinet meetings.\n\"I feel constrained in setting the course I consider necessary as foreign minister,\" he said.\nThe Netherlands was among 21 countries that signed a joint declaration on Thursday condemning Israel's approval of a major West Bank settlement project as \"unacceptable and contrary to international law\".\nThe U.N. agency for Palestinian refugees confirmed on Friday that famine in Gaza was deliberately caused by the Israeli government, following a formal confirmation by the U.N.-backed global hunger monitoring system IPC.\nIsrael has killed nearly 62,300 Palestinians in Gaza since October 2023. The military campaign has devastated the enclave, which is facing famine.\nLast November, the International Criminal Court issued arrest warrants for Israeli Prime Minister Benjamin Netanyahu and his former Defense Minister Yoav Gallant for war crimes and crimes against humanity in Gaza.\nIsrael also faces a genocide case at the International Court of Justice for its war on the enclave."
    },
    {
      "news_title": "Dutch Foreign Minister Quits as Israel Sanctions Split Cabinet",
      "news_link": "https://www.bloomberg.com/news/articles/2025-08-22/dutch-foreign-minister-quits-as-israel-sanctions-split-cabinet",
      "bias": "Lean Left",
      "text": null
    },
    {
      "news_title": "Dutch foreign minister resigns over Israel sanctions",
      "news_link": "https://timesofmalta.com/article/dutch-foreign-minister-resigns-israel-sanctions.1115084",
      "bias": "Center",
      "text": "Dutch Foreign Minister Caspar Veldkamp resigned on Friday after a cabinet meeting failed to agree sanctions against Israel.\n\"I see that I am insufficiently able to take meaningful additional measures to increase pressure on Israel,\" Veldkamp told ANP after a cabinet debate on possible sanctions against Israel was deadlocked.\nLast month Veldkamp declared far-right Israeli ministers Itamar Ben-Gvir and Bezalel Smotrich unwelcome in the Netherlands.\nOn Thursday he said he wanted to take further steps against Israel, but later acknowledged he lacked confidence he could act effectively in the coming weeks or months.\nThe minister said the steps he had proposed were \"seriously discussed\" but encountered resistance in successive cabinet meetings.\n\"I feel constrained in setting the course I consider necessary as foreign minister,\" he said.\nThe Netherlands was among 21 countries that signed a joint declaration on Thursday condemning Israel's approval of a major West Bank settlement project as \"unacceptable and contrary to international law\"."
    },
    {
      "news_title": "Dutch foreign minister resigns after measures against Israel blocked",
      "news_link": "https://www.aa.com.tr/en/europe/dutch-foreign-minister-resigns-after-measures-against-israel-blocked/3666781",
      "bias": "Right",
      "text": "Dutch foreign minister resigns after measures against Israel blocked\nCaspar Veldkamp says government had already taken significant steps, but he felt pressure to act further regarding situation in Gaza City and West Bank\nLONDON\nDutch Foreign Minister Caspar Veldkamp has resigned after his proposals for additional measures against Israel were blocked by coalition partners.\nAccording to local reports, Veldkamp said the government had already taken significant steps, but he felt pressure to act further regarding the situation in Gaza City and the West Bank.\nWith parties VVD and BBB opposing any new measures, he said he no longer trusted that he could implement his plans and decided to step down.\nThe resignation follows a promise Veldkamp made to the Dutch Parliament to introduce what he called “necessary” measures against Israel, a move he had not coordinated with his coalition partners.\n'Line must be drawn'\nAfter Veldkamp's resignation over blocked measures against Israel, Dutch political party NSC withdrew all its ministers and state secretaries from the caretaker government.\nNSC leader and Deputy Prime Minister Eddy van Hijum said the party could no longer credibly remain in government, saying: \"The Israeli government’s actions violate international treaties. A line must be drawn.”\nThe resignations leave key ministries, including Interior, Education, and Health, without leadership, adding to uncertainty in the already fragile caretaker cabinet of Prime Minister Dick Schoof.\nVVD and BBB criticized NSC’s decision, calling it \"irresponsible.\"\nThe UN agency for Palestinian refugees confirmed on Friday that famine in Gaza was deliberately caused by the Israeli government, following a formal confirmation by the UN-backed global hunger monitoring system IPC.\nIsrael has killed nearly 62,300 Palestinians in Gaza since October 2023. The military campaign has devastated the enclave, which is facing famine.\nLast November, the International Criminal Court issued arrest warrants for Israeli Prime Minister Benjamin Netanyahu and his former Defense Minister Yoav Gallant for war crimes and crimes against humanity in Gaza.\nIsrael also faces a genocide case at the International Court of Justice for its war on the enclave.\nAnadolu Agency website contains only a portion of the news stories offered to subscribers in the AA News Broadcasting System (HAS), and in summarized form. Please contact us for subscription options."
    },
    {
      "news_title": "'I am insufficiently able to...': Dutch foreign minister resigns over cabinet deadlock on Israel sanctions",
      "news_link": "https://www.firstpost.com/world/i-am-insufficiently-able-to-dutch-foreign-minister-resigns-over-cabinet-deadlock-on-israel-sanctions-13927251.html",
      "bias": "Lean Right",
      "text": "Dutch Foreign Minister Caspar Veldkamp on Friday resigned following an unresolved cabinet debate on whether to impose sanctions on Israel, Dutch news agency ANP reported.\nIn a statement to ANP after the meeting, Veldkamp said the lack of consensus within the government had left him unable to take meaningful action.\n“I see that I am insufficiently able to take meaningful additional measures to increase pressure on Israel,” he said.\nThe cabinet had reportedly been divided over the next steps in response to Israel’s ongoing military operations, with growing domestic and international calls for accountability.\nVeldkamp had been pushing for stronger measures, including potential sanctions, but failed to gain the backing of his colleagues.\nHis resignation adds further strain to Prime Minister Mark Rutte’s coalition government, which has faced internal rifts over its Middle East policy.\nLast month, Veldkamp declared far-right Israeli ministers Itamar Ben-Gvir and Bezalel Smotrich persona non grata in the Netherlands.\nOn Thursday, Veldkamp signaled his intention to push for further action against Israel, but later conceded he lacked the confidence to implement meaningful measures in the coming weeks or months.\nWhile the proposals he put forward were “seriously discussed,” they faced resistance within successive cabinet meetings.\n“I feel constrained in setting the course I consider necessary as foreign minister,” he said, citing the lack of internal consensus as a key reason for his resignation.\nImpact Shorts\nView AllThe Netherlands was also one of 21 countries that signed a joint statement on Thursday condemning Israel’s recent approval of a major West Bank settlement project, calling it “unacceptable and contrary to international law.”\nWith inputs from agencies"
    },
    {
      "news_title": "Has Israel turn into a divisive challenge in Europe?",
      "news_link": "https://pokonews.com/has-israel-turn-into-a-divisive-challenge-in-europe-gaza/",
      "bias": "unknown",
      "text": "Verifying that you are not a robot..."
    },
    {
      "news_title": "Middle East Eye: Dutch foreign minister resigns over Gaza - Brave New Europe",
      "news_link": "https://braveneweurope.com/middle-east-eye-dutch-foreign-minister-resigns-over-gaza",
      "bias": "unknown",
      "text": "A Free Trade Agreement between the EU and four South American countries, known as the Mercosur trade bloc, has been voted down by the Dutch parliament. This not only puts the largest-ever EU trade deal […]\nGreece’s recent elections saw two new far-right parties enter parliament for the first time. Grinding austerity is not fueling continued popular resistance but the rise of conspiracy theorist cranks who promote war among the poor. […]\nBe the first to comment"
    },
    {
      "news_title": "Dutch foreign minister resigns after failing to secure sanctions against Israel - Egypt Independent",
      "news_link": "https://www.egyptindependent.com/dutch-foreign-minister-resigns-after-failing-to-secure-sanctions-against-israel/",
      "bias": "unknown",
      "text": "Dutch Foreign Minister Caspar Veldkamp resigned Friday evening, after he failed to secure new sanctions against Israel over the war in Gaza.\nVeldkamp had informed the country’s parliament he intended to bring in new measures in response to Israel’s planned offensive in Gaza City and other heavily populated areas but was unable to secure the support of his coalition partners.\nThe 61-year-old former ambassador to Israel told reporters he felt he was unable “to implement policy myself and chart the course I deem necessary.”\nFollowing Veldkamp’s resignation, the remaining Cabinet members of his center-right New Social Contract party also quit, leaving the Dutch government in disarray.\n“In short we are done with it,” party leader Eddy Van Hijum said, calling the Israeli government’s actions “diametrically opposed to international treaties.”\nThe Dutch government already collapsed in June when anti-Islam lawmaker Geert Wilders pulled out of the country’s four-party coalition over a fight about immigration.\nThe three remaining parties stayed on in a caretaker government until elections could be held in October.\nThe world’s leading authority on food crises said earlier on Friday the Gaza Strip’s largest city is gripped by famine, and that it’s likely to spread across the territory without a ceasefire and an end to restrictions on humanitarian aid.\nThe Netherlands’ Parliament had repeatedly delayed a debate on sanctions against Israel, a discussion that was already postponed from Thursday, as the Friday afternoon Cabinet meeting dragged on.\n“There’s a famine, ethnic cleansing, and genocide going on,” Kati Piri of the merged Green Left/Labor parties told Parliament, “And our cabinet has been deliberating for hours about whether to take any action at all. Shameful.”\nVeldkamp had proposed a ban on imports from Israeli settlements in the occupied Palestinian territories in response to the planned military escalation.\nOpposition politicians had called for a no-confidence vote for the minister, frustrated at what they saw as a lack of action against Israel."
    },
    {
      "news_title": "Dutch foreign minister quits after Israel sanctions blocked - The Press United",
      "news_link": "https://thepressunited.com/updates/dutch-foreign-minister-quits-after-israel-sanctions-blocked/",
      "bias": "unknown",
      "text": "Coalition government partners refused to back Caspar Veldkamp’s call for punitive measures against the Jewish state over the Gaza conflict\nDutch Foreign Minister Caspar Veldkamp has stepped down in protest over the coalition government’s refusal to impose sanctions on Israel for its actions in Gaza.\nThe Dutch Foreign Ministry announced the resignations of Veldkamp and Minister for Foreign Trade Hanneke Boerma in a statement on Saturday. It said that “after a meeting of the cabinet on the situation in Gaza,” the Social Contract (NSC) party, of which both officials are members, decided to withdraw from the caretaker coalition government.\nIn a statement on its website on Friday, the party said that it had sought “additional measures” against Israel in light of the “increasingly deteriorating humanitarian situation in Gaza.” However, the other two coalition partners refused to back sanctions, prompting the NSC to pull out in protest.\nVeldkamp, who previously served as Dutch ambassador to Israel, had advocated a ban on imports from Israeli settlements in occupied Palestinian territories in response to Israel’s continued military offensive in Gaza.\nRead more\nOn Thursday, the Netherlands, along with 20 other nations, signed a joint declaration condemning Israeli plans to build an illegal settlement in the occupied West Bank. Last month, Amsterdam declared two hardline Israeli ministers persona non grata.\nBack in June, Spanish Foreign Minister Jose Manuel Albares called on the EU to “immediately suspend” the EU‑Israel association agreement and impose a ban on arms sales to Israel.\nIn light of the ongoing Israeli military operation in Gaza, a growing number of traditionally pro-Israel Western countries, including France and the UK, have expressed in recent months a readiness to officially recognize Palestinian statehood.\nEarlier this week, the Israel Defense Forces (IDF) announced the start of an operation to take full control of Gaza City.\nThe conflict erupted after a Hamas incursion into southern Israel on October 7, 2023, which left about 1,200 people dead and 250 taken hostage. According to Gaza’s Hamas-controlled Health Ministry, more than 62,000 people, most of them civilians, have been killed by Israeli strikes in the enclave since then.\nAugust 24, 2025 at 12:52AM\nRT"
    },
    {
      "news_title": "Dutch foreign minister resigns over govt’s Gaza policy – Pakistan Times Today",
      "news_link": "https://pakistantimestoday.com/dutch-foreign-minister-resigns-over-govts-gaza-policy/",
      "bias": "unknown",
      "text": "Dutch Foreign Minister Caspar Veldkamp, part of a caretaker government, quit his cabinet post on Friday ahead of schedule over the government’s position on Israel’s war in Gaza, he told reporters. He said the government did not support additional measures against Israel over Gaza and plans for the occupied West Bank. “I have felt pushback in the cabinet for additional measures,” he said, adding he would formally tender his resignation.\nYou May Also Like\nPlane crashes in Nepal with 18 dead, pilot sole survivor\nA passenger plane crashed on takeoff in Kathmandu on Wednesday, with the…\n- Hafsa Mustafa\n- July 24, 2024\nScholars in Kunar declare their support for the Islamic Emirate\nIn a meeting with religious scholars, Kunar Governor Maulvi Mohammad Qasim stated…\n- Sanniah Hassan\n- October 11, 2021\nRussia launches war’s largest drone attack ahead of Putin-Trump call\nRussia launched on Sunday its largest drone attack on Ukraine since the…\n- Hafsa Mustafa\n- May 19, 2025\nMali gold mine collapse kills scores of workers\nMore than 70 people have been killed after a tunnel collapsed at…\n- Hafsa Mustafa\n- January 24, 2024"
    },
    {
      "news_title": "Netherlands government shaken after ministers resign in protest of Israel's war crimes",
      "news_link": "https://easternherald.com/2025/08/23/dutch-ministers-resign-israel-sanctions-deadlock/",
      "bias": "unknown",
      "text": null
    },
    {
      "news_title": "Dutch foreign minister, Caspar Veldkamp quits caretaker government over Gaza",
      "news_link": "https://www.tvcnews.tv/dutch-foreign-minister-caspar-veldkamp-quits-caretaker-government-over-gaza/",
      "bias": "unknown",
      "text": "Dutch Foreign Minister Caspar Veldkamp, who is part of a caretaker administration, resigned from his cabinet role on Friday ahead of schedule due to the government’s position on Israel’s attack in Gaza, he told reporters.\nAccording to sources, he stated that the administration does not support any more measures against Israel over Gaza or plans for the occupied West Bank.\nThe Dutch government dissolved on June 3, and the caretaker minority administration is expected to remain in place until a coalition government is established following the October elections, which might take several months.\nRead Also\n- Famine officially confirmed in Gaza as global hunger monitor calls for immediate response\n- Slovenia becomes first EU member state to ban weapons trade with Israel over Gaza\n- Dutch govt bars two Israeli ministers from entering country over comments on Gaza\n- Keir Starmer says UK will aidrop aid in Gaza as warnings of starvation intensify\nIsrael has initiated a military attack aimed at gaining control of Gaza City, moving residents to the south, weakening Hamas, and increasing pressure for hostage release.\nA global hunger monitor declared earlier Friday that famine was officially affecting residents in Gaza City and the surrounding area. Israel has rejected the results as biased and untrue.\nPlans to build a settlement that will divide the occupied West Bank and split the land Palestinians want for an independent state were approved by Israel this week."
    },
    {
      "news_title": "Dutch Foreign Minister and NSC Ministers resign over blocked Israel sanctions",
      "news_link": "https://www.milletnews.com/europe/dutch-foreign-minister-and-nsc-ministers-resign-over-blocked-israel-sanctions",
      "bias": "unknown",
      "text": "Dutch Foreign Minister and NSC Ministers resign over blocked Israel sanctions\nFollowing a cabinet meeting, Veldkamp told reporters that he could no longer continue in his role:\n\"The cabinet has already taken several steps [against Israel]. Holland should not be ashamed of that. But given what is happening in Gaza and the West Bank, I felt pressure from within the cabinet not to go further. That left me no room to act.\"\nVeldkamp said the lack of support made it impossible to fulfill his duties and announced he would submit his resignation letter to the King.\nShortly after, other NSC ministers also stepped down. NSC leader and Deputy Prime Minister Eddy van Hijum confirmed the move, declaring: “In short, our patience has run out.” He added that the group unanimously decided to follow Veldkamp’s lead, citing deadlock in negotiations with the other two coalition partners – the People’s Party for Freedom and Democracy (VVD) and the Farmer–Citizen Movement (BBB).\nVan Hijum argued that Israel’s settlement expansion plan required “very clear measures,” saying it violated international agreements and undermined the two-state solution. He stressed that the cabinet failed to show real willingness to act: “When European measures take too long, a minister must be able to act nationally on behalf of the government. Veldkamp did not feel that space, and neither do we.”\nPrime Minister Schoof: “We respect the decision, but regret it”\nCaretaker Prime Minister Dick Schoof confirmed that Veldkamp and NSC’s ministers had submitted their resignations: “We respect their decision, though we regret it, especially in this interim period when cabinet responsibility is so important.”\nHe acknowledged that the government failed to reach agreement on Gaza: “The worsening situation there is dramatic. We all see the suffering and want to improve the humanitarian situation today, not tomorrow. But the three parties could not reach a common position.”\nSchoof said the government would consult on how to proceed and present a roadmap in the coming days.\nPolitical Consequences\nThe resignations leave the three-party caretaker coalition weakened ahead of the October 29 snap elections. Opposition parties criticized Schoof’s response as “deeply insufficient” and demanded a parliamentary debate next week on the government’s stability.\nThe outgoing NSC ministers include the ministers for Social Affairs, Interior, Education, Health, and several state secretaries. Their departure follows that of far-right leader Geert Wilders, who pulled his Freedom Party (PVV) from the coalition in June over migration policy disputes.\nThe Dutch parliament is expected to hold a comprehensive debate on the resignations and their impact on the government in the coming days."
    },
    {
      "news_title": "Dutch foreign minister quits over failure to secure sanctions against Israel",
      "news_link": "https://www.einnews.com/article_detail/842465795/u1ZUkL-rPd0dYgqo?ref=rss&lcode=aqXaJgwF01GHZU7P9Wq2bQ%3D%3D",
      "bias": "unknown",
      "text": null
    },
    {
      "news_title": "Netherlands: Foreign Minister resigns after failure to reach agreement on sanctions against Israel",
      "news_link": "https://www.arabobserver.com/netherlands-foreign-minister-resigns-after-failure-to-reach-agreement-on-sanctions-against-israel/",
      "bias": "unknown",
      "text": "Netherlands: Foreign Minister resigns after failure to reach agreement on sanctions against Israel\n“I feel limited in charting the course I consider necessary,” said Caspar Veldkamp\nThe Foreign Minister of the Netherlands, Caspar Veldkamp, resigned after a cabinet meeting failed to reach an agreement on sanctions against Israel. The Dutch news agency “PNA” reported this, to which Veldkamp stated: “I see myself as not being sufficiently capable of taking significant additional measures to increase pressure on Israel.”\nThe minister added that the measures he proposed had been “seriously discussed” but had met with resistance in subsequent cabinet meetings. “I feel limited in charting the course I consider necessary as Foreign Minister,” Veldkamp concluded."
    },
    {
      "news_title": "NSC ministers resign after Foreign Minister Veldkamp quits over blocked Israel sanctions",
      "news_link": "https://nltimes.nl/2025/08/23/nsc-ministers-resign-foreign-minister-veldkamp-quits-blocked-israel-sanctions",
      "bias": "unknown",
      "text": "NSC ministers resign after Foreign Minister Veldkamp quits over blocked Israel sanctions\nUpdated at 17:05 to include which ministers will replace their outgoing colleagues\nAll ministers and state secretaries from Nieuw Sociaal Contract (NSC) resigned on Friday after Foreign Minister Caspar Veldkamp quit in protest over blocked sanctions against Israel, NOS reported.\nVeldkamp announced his resignation after a tense ministerial meeting, saying he could not carry out the foreign policy he deemed necessary in response to Israel’s latest military offensive in Gaza City and the approval of new settlement plans in the West Bank.\n“We have as a cabinet already taken quite a number of steps. The Netherlands does not have to be ashamed of that. But I felt resistance in the cabinet against further measures in connection with what is happening in Gaza City and on the West Bank,” Veldkamp told reporters after the meeting. “I have insufficient confidence that in the coming weeks or months that will be different, if I am so limited in my space to conduct the policy that I consider necessary. I am going home to write a resignation letter.”\nHis decision came one day after he told the Tweede Kamer he would introduce additional measures against Israel, calling them “necessary” in a letter to lawmakers. That pledge had not been coordinated with coalition partners. The VVD and BoerBurgerBeweging (BBB) reportedly opposed new steps, leaving Veldkamp isolated.\nWithin hours of his resignation, all NSC members of the caretaker cabinet followed suit, including Deputy Prime Minister and Social Affairs Minister Eddy van Hijum, Interior Minister Judith Uitermark, Education Minister Eppo Bruins, and Health Minister Daniëlle Jansen, who had only taken office this summer after the PVV ministers resigned.\nState secretaries Teun Struycken (Legal Protection), Tjebbe van Oostenbruggen (Taxes), Sandra Palmen (Allowances), and Hanneke Boerma (Foreign Trade) also stepped down. Boerma, like Jansen, had only served a few months.\nCaretaker Prime Minister Dick Schoof confirmed in the Tweede Kamer that the entire NSC contingent had quit. “We have to respect these decisions, but we very much regret them, especially in light of the responsibility that the cabinet has in this demissionary phase,” Schoof said.\nThe crisis erupted as the Tweede Kamer debated possible responses to the conflict in Gaza. A majority of lawmakers declared that “the Islamic terrorist organization Hamas must be totally destroyed” and must “play no role whatsoever” in Gaza’s future. They demanded maximum pressure on countries that shield Hamas leaders.\nBut proposals from opposition parties — backed by NSC — to boycott goods from Israeli settlements, recognize the Palestinian state, or ban Dutch arms purchases from Israel failed to pass.\nThe chamber reportedly did agree to urge Israel to allow international and domestic journalists and observers into Gaza. Brekelmans promised to raise the settlement boycott issue at the European level and said a unilateral Dutch ban could still be considered if that fails.\nVVD and BBB denied blocking sanctions outright, reportedly insisting negotiations were ongoing when NSC pulled out. “NSC called itself the party of good governance but now leaves the Netherlands rudderless,” BBB said in a statement. The VVD wrote on X that it was “very surprised that NSC suddenly leaves the cabinet.”\nNine departing caretaker ministers and state secretaries from NSC were given honorable discharges by King Willem-Alexander on Friday. Their ministries will now be temporarily run by colleagues from the remaining VVD and BoerBurgerBeweging (BBB) parties.\nDefense Minister Ruben Brekelmans (VVD) has taken over the Ministry of Foreign Affairs. Justice Minister David van Weel (VVD) is taking the responsibility for the Ministry of the Interior. Climate and Green Growth Minister Sophie Hermans (VVD) is taking over the Ministry of Education.\nVice Prime Minister and Minister of Social Affairs Mona Keijzer (BBB) is covering the Ministry of Social Affairs. Infrastructure and Water Management Minister Robert Tieman (BBB) is managing the Ministry of Health.\nThe government said Saturday that this arrangement is temporary, noting it is nearly impossible for ministers to run two ministries at once.\nLawmakers will reconvene Wednesday to address the political fallout. Parliament has again cut short its summer recess, which officially runs until September 1.\nThe resignations also forced Schoof to cancel a planned trip to Kyiv, where he was to meet Ukrainian President Volodymyr Zelensky and discuss peace efforts with Russia.\nReporting by ANP and NL Times"
    },
    {
      "news_title": "Dutch FM Resigns Over Israel Sanctions Dispute",
      "news_link": "https://time.news/dutch-fm-resigns-over-israel-sanctions-dispute/",
      "bias": "unknown",
      "text": "Dutch Goverment Collapses Amidst Sanctions Dispute Over Gaza Conflict\nThe Dutch government plunged into crisis Friday evening with the resignation of Foreign Minister Caspar Veldkamp, triggered by his failure to garner support for new sanctions against Israel in response to the ongoing war with Hamas in Gaza.\nVeldkamp had informed the Dutch parliament of his intention to introduce measures targeting Israel, specifically in response to the planned military offensive in Gaza City and other densely populated areas.However, he was unable to secure the backing of his coalition partners to move forward with these proposals.\nthe 61-year-old former ambassador to Israel explained to reporters that he felt constrained in his ability to “implement policy myself and chart the course I deem necessary.”\nFollowing veldkamp’s departure, the remaining members of his center-right New Social Contract party also resigned, leaving the Dutch government in a state of disarray. “In short we are done with it,” stated party leader Eddy Van Hijum, who characterized the Israeli government’s actions as “diametrically opposed to international treaties.”\nThis latest political upheaval comes after the Dutch government initially collapsed in June when anti-Islam lawmaker Geert Wilders withdrew from the four-party coalition due to disagreements over immigration policy.The remaining parties continued as a caretaker government, pending elections scheduled for October.\nPrime Minister Dick Schoof addressed parliament later Friday, expressing regret over Veldkamp’s resignation and the withdrawal of his party. Schoof acknowledged that events in Gaza were “worsening” and “dramatic,” stating, “Everyone is aware of that.”\nThe crisis unfolds as international concern grows over the humanitarian situation in Gaza. Earlier Friday, the UN’s hunger monitor reported that Gaza’s largest city is experiencing famine, with the potential for it to spread across the territory without a ceasefire and increased humanitarian aid. Israel vehemently rejected these reports, labeling them “lies” and “modern blood libel,” while the United States appeared to dismiss the famine declaration as part of a “false narrative of intentional mass starvation” originating from Hamas, which initiated the conflict with its October 7, 2023, terror attacks in southern Israel.\nThe Dutch parliament had repeatedly postponed a debate on potential sanctions against Israel,most recently delaying discussions from thursday until a lengthy cabinet meeting on Friday afternoon. “There’s a famine, ethnic cleansing, and genocide going on,” Kati Piri of the merged Green Left/Labor parties told Parliament, “And our cabinet has been deliberating for hours about whether to take any action at all. Shameful.”\nVeldkamp had specifically proposed a ban on imports from israeli settlements as a response to the planned military offensive. Opposition politicians had also threatened a vote of no confidence in the minister, frustrated by what they perceived as inaction.\nHere’s a substantive news report answering the “why, Who, What, and How” questions:\nWhy: The Dutch government collapsed due to a basic disagreement over how to respond to the ongoing war between Israel and Hamas in Gaza. Foreign Minister Caspar Veldkamp sought to impose sanctions on Israel,particularly a ban on imports from Israeli settlements,in response to the planned military offensive in Gaza City and other densely populated areas. This stance clashed with his coalition partners,who did not support the measures.\nWho: Key figures involved include Foreign Minister Caspar Veldkamp, who resigned after failing to secure support for his proposed sanctions; Prime Minister Dick Schoof, who expressed regret over the situation; Eddy Van Hijum, leader of the"
    },
    {
      "news_title": "Dutch FM Quits over Blocked “Israel” Sanctions",
      "news_link": "https://www.islamtimes.com/en/news/1228606/dutch-fm-quits-over-blocked-israel-sanctions",
      "bias": "unknown",
      "text": "In his resignation statement, Veldkamp noted that the government had \"already taken significant steps,\" but added: \"I felt resistance within the government against taking additional actions in response to what is happening in Gaza City and the occupied West Bank at this moment.\"\nHe concluded that he had lost hope of shifting this stance: \"This is something that will not change in the coming months and years, and if my room for maneuver is this limited, I will go home and write my resignation letter,\" according to Dutch News.\nVeldkamp resigned after a tense five-hour debate revealed deep Cabinet divisions, with BBB and VVD rejecting tougher action. Current Dutch measures only ban entry for extremist \"Israeli\" ministers Ben Gvir and Smotrich.\nVeldkamp’s resignation sparked a wider split, with four ministers and four state secretaries from his NSC party also stepping down, shaking the caretaker coalition’s stability.\nEric van der Burg of the VVD said he was \"shocked by the resignation,\" while left-wing opposition parties expressed disappointment, accusing Veldkamp of failing to rally sufficient support to push his proposals through.\nThe Hague has grown more confrontational toward \"Israel”, condemning West Bank settlements as illegal and, for the first time, listing \"Israel\" as a national security threat.\nBeyond the EU, The Hague has hosted major \"Red Line\" pro-Palestinian protests, the largest in decades, signaling rising public demand for a tougher stance on “Israeli” aggression in Gaza.\nVeldkamp resigned amid 23 months of relentless war on Gaza, with over 62,000 martyrs and 157,000 wounded, according to Gaza’s Health Ministry."
    },
    {
      "news_title": "Dutch gov't crisis deepens as NSC ministers step down",
      "news_link": "https://www.dailyfinland.fi/europe/44822/Dutch-govt-crisis-deepens-as-NSC-ministers-step-down",
      "bias": "unknown",
      "text": "Dutch gov't crisis deepens as NSC ministers step down\nPublished : 23 Aug 2025, 02:42\nThe political crisis in the Netherlands escalated on Friday after all ministers from the New Social Contract (NSC) party resigned from the caretaker government, following the departure of Foreign Minister Caspar Veldkamp earlier in the day, reported Xinhua.\nVeldkamp announced his resignation in The Hague, citing frustration over restrictions on measures against Israel. \"I see that I cannot take sufficiently meaningful additional measures to increase pressure on Israel,\" he told reporters after a Council of Ministers meeting.\nHis departure triggered a collective exit by fellow NSC ministers -- Eddy van Hijum (Social Affairs), Eppo Bruins (Education), Judith Uitermark (Interior), Danielle Jansen (Health) -- as well as four state secretaries. The move further destabilizes the fragile coalition.\nAccording to NSC, coalition partners the People's Party for Freedom and Democracy (VVD) and the Farmer-Citizen Movement (BBB) refused to back tougher measures against Israel.\nThe Dutch cabinet has been in a caretaker state since June 3, when the far-right Party for Freedom (PVV) withdrew over asylum policy. With NSC's exit, only VVD and BBB remain in government. Snap elections are scheduled for October 29.\nPrime Minister Dick Schoof said he \"deeply regretted\" the NSC decision. \"Further deliberation on the political situation is now necessary,\" he said.\nOn Gaza, Schoof added: \"We all want the humanitarian situation to improve. Unfortunately, that has not led to a common conclusion.\""
    },
    {
      "news_title": "Top Dutch diplomat resigns over Israeli sanctions fail",
      "news_link": "https://www.perthnow.com.au/news/politics/top-dutch-diplomat-resigns-over-israeli-sanctions-fail-c-19775315",
      "bias": "unknown",
      "text": "Top Dutch diplomat resigns over Israeli sanctions fail\nDutch Foreign Minister Caspar Veldkamp has resigned after he failed to secure new sanctions against Israel over the war in Gaza, a move that has left the Dutch government in disarray.\nVeldkamp had informed the country's Parliament he intended to bring in new measures in response to Israel's planned offensive in Gaza City and other heavily populated areas.\nBut he was unable to secure the support of his coalition partners.\nThe 61-year-old former ambassador to Israel told reporters he felt he was unable \"to implement policy myself and chart the course I deem necessary\".\nFollowing Veldkamp's resignation, the remaining Cabinet members of his centre-right New Social Contract party also quit, leaving the Dutch government in disarray.\n\"In short we are done with it,\" party leader Eddy Van Hijum said, calling the Israeli government's actions \"diametrically opposed to international treaties\".\nThe Dutch government already collapsed in June when anti-Islam lawmaker Geert Wilders pulled out of the country's four-party coalition over a fight about immigration.\nThe three remaining parties stayed on in a caretaker government until elections could be held in October.\nPrime Minister Dick Schoof was set to address parliament later on Friday evening over the crisis.\nThe world's leading authority on food crises said earlier on Friday that the Gaza Strip's largest city is gripped by famine, and that it's likely to spread across the territory without a ceasefire and an end to restrictions on humanitarian aid.\nThe Netherlands' parliament had repeatedly delayed a debate on sanctions against Israel, a discussion that was already postponed from Thursday, as the Friday afternoon Cabinet meeting dragged on.\n\"There's a famine, ethnic cleansing, and genocide going on,\" Kati Piri of the merged Green Left/Labor parties told parliament.\n\"And our cabinet has been deliberating for hours about whether to take any action at all. Shameful.\"\nVeldkamp had proposed a ban on imports from Israeli settlements in the occupied Palestinian territories in response to the planned military escalation.\nOpposition politicians had called for a no-confidence vote for the minister, frustrated at what they saw as a lack of action against Israel."
    },
    {
      "news_title": "No extra measures against Israel: NSC abandons ship - DutchNews.nl",
      "news_link": "https://www.dutchnews.nl/2025/08/no-extra-measures-against-israel-dutch-foreign-minister-resigns/",
      "bias": "unknown",
      "text": "No extra measures against Israel: NSC abandons ship\nCaretaker foreign affairs minister Caspar Veldkamp resigned on Friday, followed by his fellow ministers from the Nieuw Sociaal Contract party, in an escalating row within the Dutch coalition over its policy on Israel.\nVeldkamp said his attempts to take more measures against Israel were being blocked by the other two parties in the cabinet.\nPrime minister Dick Schoof said he would take advice before deciding how to proceed with a rump administration whose constituent parties have just 32 of the 150 seats in parliament.\nSchoof has cancelled a scheduled visit to Ukraine next week to deal with the unfolding domestic crisis and decide how the vacant ministerial posts should be filled.\n“We have to respect these decisions, but we deeply regret them,” he said. “Especially in light of the responsibility that the cabinet has in this caretaker period.”\nHe said ministers had been unable to agree on how to respond to the situation in Gaza despite “intense” efforts.\n“We all see the enormous suffering and we all want the humanitarian situation to improve. However, this point of view has not led to a collective decision by the three parties.”\nNSC follows PVV\nThe walkout of the entire NSC team leaves just the right-wing liberal VVD and farmers’ party BBB, of the four parties that formed the right-wing coalition less than 14 months ago.\nGeert Wilders pulled the far-right PVV out at the start of July after demanding a guarantee from the other partners that they would bring in harsher migration rules.\nVeldkamp told media on Thursday that he wanted to put pressure on Israel following its invasion of Gaza City and the publication of plans to build new settlements on the West Bank.\nBut during a five-hour parliamentary debate it became clear that the caretaker government was divided and Veldkamp had not coordinated his wishes with the rest of the cabinet.\nBBB and VVD did not wish to go beyond the measures already in place and accused the NSC ministers of walking out of talks to resolve the impasse.\nThe other four NSC ministers – social affairs minister Eddy van Hijum, home affairs minister Judith Uitermark, education minister Eppo Bruins and health minister Daniëlle Jansen – and four junior ministers quit shortly after Veldkamp made his statement.\nEntry bans\nUntil now, Dutch unilateral action has been limited to the largely symbolic gesture of imposing entry bans on far-right Israeli ministers Itamar Ben-Gvir and Bezalel Smotrich.\nIn a statement, Veldkamp said the cabinet “had already taken considerable steps”. “I felt resistance in the cabinet against more measures as a result of what is happening in Gaza City and the occupied West Bank at the moment,” he said.\nHe added that he felt the other ministers would not support him. “That is not something that will change in the coming months and years, and if my room for manoeuvre is so limited in this respect, I shall go home and write my letter of resignation,” he said.\n“Flabbergasted”\nVVD MP Eric van der Burg said he had been “flabbergasted” by the minister’s decision, the NRC quoted him as saying, while BBB MP Henk Vermeer said the decision was “a personal one”. The left-wing opposition parties said they are mainly disappointed Veldkamp failed to rally support for the measures.\nNSC party leader Van Hijum said Veldkamp faced a lack of willingness to give him space and that his credibility and that of the party was on the line.\n“We are done”, Van Hijum said. “The actions of the Israeli government are contrary to international agreements. We need to draw a line.”\nThank you for donating to DutchNews.nl.\nWe could not provide the Dutch News service, and keep it free of charge, without the generous support of our readers. Your donations allow us to report on issues you tell us matter, and provide you with a summary of the most important Dutch news each day.\nMake a donation"
    }
  ]
}