{
  "story_id": "GN_20250825_231131_46599df6",
  "metadata": {
    "title": "Texas lawmakers give final approval to Trump-backed election map, sending it to governor",
    "timestamp": "2025-08-25T23:11:31.690691",
    "url": "https://ground.news/article/texas-lawmakers-give-final-approval-to-trump-backed-election-map-sending-it-to-governor_1e3655"
  },
  "bias_distribution": {
    "total_sources": "211",
    "leaning_left": "37",
    "center": "88",
    "leaning_right": "20"
  },
  "perspective_summaries": {
    "left": [
      "Texas lawmakers approved a redrawn election map to increase Republican seats, following a request from President Donald Trump.",
      "The new map could give Republicans up to five additional U.S. House seats in the upcoming midterm elections.",
      "This decision sparked a national redistricting conflict, particularly influencing California's efforts.",
      "Democrats claimed the map would unconstitutionally suppress Black and Latino votes in Texas."
    ],
    "center": [
      "Early Saturday, the Texas state Senate approved a new Republican-leaning congressional map, sending it to Governor Greg Abbott who is expected to sign it into law.",
      "National GOP pressure led Republican-controlled states, including Texas, to redraw maps aimed at helping the GOP retain a slim House majority for 2026.",
      "Democrats delayed passage with prolonged debate and a walkout as state senators voted 18-11 along party lines after more than eight hours, with Republicans ending a filibuster using a rare motion.",
      "Governor Greg Abbott is expected to quickly sign the maps into law, while Democrats vow court challenges and Democratic Representative Lloyd Doggett announced Thursday he will not seek reelection if the new map takes effect.",
      "The effort has triggered a nationwide wave of redistricting, with California Democrats and Governor Gavin Newsom proposing a special election in November and the U.S. Supreme Court setting limits on partisan and race-based map drawing."
    ],
    "right": [
      "The Texas Senate approved a new Republican-favoring congressional map that is expected to gain five additional seats for the GOP ahead of the 2026 midterms, as reported by ABC News.",
      "Governor Greg Abbott will sign the map into law, despite Democratic challenges claiming violations of the Voting Rights Act, according to ABC News.",
      "The redistricting process, urged by President Donald Trump, has sparked similar efforts nationwide, affecting Democratic representatives like Lloyd Doggett, who announced he won't seek reelection if the map takes effect."
    ]
  },
  "sources": [
    {
      "news_title": "'Much harder': HB 24 changes how Texans can fight residential developments",
      "news_link": "https://www.kxxv.com/news/local-news/in-your-neighborhood/much-harder-hb-24-changes-how-texans-can-fight-residential-developments",
      "bias": "Center",
      "text": "GATESVILLE, Texas (KXXV) — A new Texas law taking effect in September will make it harder for residents to formally protest certain types of residential developments.\n“It does still allow for protests with that, but it is much harder,” said Blayr Barnard, who lives in Coryell County.\nWatch the full story here:\nHouse Bill 24 does not eliminate public input, but it does limit when residents can force a supermajority vote to block a zoning change. The legislation also requires cities to post hearing notices online and on the property in question, in addition to the newspaper and mail notices already required.\nThe Gatesville city manager described the changes as mostly procedural.\n“We were hoping to see more change from that perspective, helping rural areas that do not have the infrastructure in place to really fight these big land developers that are usually backed by hedge fund-type money to not come in and chop up our land,” Barnard said.\nBarnard pointed to subdivisions in Coryell County that she says remain largely empty after developers made promises and then failed to follow through.\n“We have a lot of subdivision developments in Coryell County that are sitting largely empty because developers come in, make a lot of promises, and then half finished, don't finish, stretch their timeline much farther or do these questionable sales techniques,” she said.\nResidents also worry about subdivisions being built in areas without reliable water or roads.\n“We really do need to start looking at preserving our Texas lands. Once a large piece of land, say 1,000 acres, goes into 5-acre tracts, it will sit dormant before it ever goes back to farming and ranching, and I think that agricultural encroachment is going to be a much bigger problem for the state of Texas than anyone is realizing right now,” Barnard said.\nHouse Bill 24 will take effect Sept. 1."
    },
    {
      "news_title": "TRUMP REDISTRICTING PLAN CLEARS TEXAS HOUSE",
      "news_link": "https://aframnews.com/trump-redistricting-plan-clears-texas-house/",
      "bias": "Left",
      "text": "By: Apple News\nOn Wednesday, August 20, 2025, the Texas House of Representatives approved a new congressional redistricting plan backed by former President Donald Trump, aiming to expand Republican dominance in the state. Passed along party lines with a vote of\n88–52, the map could potentially give the GOP up to five additional U.S. House seats in the upcoming 2026 midterms. Republican leaders, including Rep. Todd Hunter, acknowledged that the redistricting was crafted to enhance Republican electoral performance. Critics have labeled the move a blatant attempt at partisan gerrymandering, designed to solidify long-term GOP control in a state already leaning red.\nThe vote came after a dramatic standoff that saw Democratic lawmakers walk out and leave the state, delaying the process for nearly two weeks. Democrats voiced strong opposition, arguing the new map unfairly dilutes the political influence of Black and Hispanic voters—an accusation they claim may violate the Voting Rights Act. Despite Republican claims that the map reflects population changes and includes new minority majority districts, civil rights advocates remain unconvinced. They say the adjustments still amount to racial gerrymandering and plan to challenge the new boundaries in court.\nNow that the bill has cleared the Texas House, it moves on to the Republican- controlled Senate, where swift approval is expected before it lands on Governor Greg Abbott’s desk for final signature. The redistricting has sparked national debate and could trigger responses from Democratic-led states, potentially escalating into a broader legal and politi- cal battle over the balance\nof power in Congress. With lawsuits already in motion, Texas’s map could become the centerpiece of a major courtroom fight over voting rights and partisan redistricting in the months ahead."
    },
    {
      "news_title": "Texas Legislature gives final approval to redistricting map - West Hawaii Today",
      "news_link": "https://www.westhawaiitoday.com/2025/08/24/nation-world-news/texas-legislature-gives-final-approval-to-redistricting-map/",
      "bias": "Lean Left",
      "text": "Texas Legislature gives final approval to redistricting map\nHOUSTON — The Texas Legislature gave final approval Saturday to an aggressively redrawn congressional map that kicked off a redistricting race between the parties that is likely to affect the fight for Congress long before any ballots are cast in the 2026 midterm elections.\nGov. Greg Abbott has said he would sign the map into law once it reaches his desk.\nThe state Senate passed the map in a party-line vote just days after it was approved by the Texas House on Wednesday. The new lines on Texas’ congressional districts were drawn to deliver Republicans up to five U.S. House seats and help preserve the party’s thin majority.\n“I’m convinced that if Texas does not take this action, that there is an extreme risk that that Republican majority will be lost,” said state Sen. Phil King during the floor debate Friday. He said at several points that he did not “look at any racial data.”\n“This map is legal in all respects,” King said.\nTexas Democrats, who temporarily blocked the passage of the map with a walkout in the state House, said the newly drawn lines illegally diminished the voting strength of Black and Hispanic Texans. They have vowed to file suit against the map after it is adopted.\nAfter more than eight hours of debate Friday, the adoption of a procedural motion by the Republicans denied the Democrats a chance to filibuster, moving the chamber to the final vote. The motion argued that a Democratic state senator who had planned to filibuster, Carol Alvarado, had promoted it as a campaign fundraising event.\nThe bill passed on a vote of 18-11 just after 12:30 a.m. Lt. Gov. Dan Patrick called for people in the gallery — who were shouting “shame” and “fascist” — to be removed. The Senate adjourned until Tuesday at 3 p.m.\nThe repercussions of the push for redistricting in Texas have proved dramatic. President Donald Trump first broached the Texas gerrymander months ago to initially skeptical Republicans, hoping to stave off Democratic victories in U.S. House elections that would cost his party control of the chamber in 2027. Since then, mid-decade redistricting — once a rarity in American politics — is threatening to reverse decades of movement toward less partisan political mapmaking.\nOn Thursday, Democratic lawmakers in California approved a new map of their state designed to swing five Republican seats to Democrats, a numerical counter to Texas that is likely to go before California voters in a November referendum. Trump is also pressing Republican legislators to counter in Missouri, Indiana and Ohio, where more Republican seats could be squeezed out of maps that already favor the GOP. Florida’s Republican House speaker has also vowed to enter his state into the race.\nThe hours of discussion in the Texas Senate on Friday included some details on how the effort had been organized behind-the-scenes.\nKing said that the National Republican Redistricting Trust, which helps coordinate the party’s redistricting strategy, had been involved in Texas’ redistricting. He had spoken to its executive director, Adam Kincaid, early in the state’s process and as recently as Monday.\n“I know he has been involved in some of the early map drawing,” King said at one point while engaging with a Democratic colleague Friday. “Everyone knows, senator, that he has been involved since the beginning.”\nKincaid did not respond to a request for comment.\nThe results of the nationwide redistricting push might not save Republican control of the U.S. House, where the party currently holds a slender four-seat majority.\nOff-year elections almost always favor the party out of power in the White House. Even without the states most likely to redistrict — Texas, California, Missouri, Indiana and Ohio — 27 House seats that were decided by fewer than 5 percentage points in 2024 will remain in play; 14 of them are held by Republicans.\nBut the spasm of mid-decade redistricting could make the House even more fiercely partisan than it is now, as both parties move to take seats from their rivals.\nRegardless, the Texas map’s passage was a major victory for Trump. Gov. Gavin Newsom of California may have numerically nullified the president’s gains in Texas, but he still faces a campaign to get his maps approved by voters who overwhelmingly backed the nonpartisan redistricting commission that the new map would temporarily supplant.\nIn New York, Gov. Kathy Hochul met with state Democratic leaders Thursday, but they still face legal impediments that are likely to stop any redistricting there before 2026. Other Democratic states, such as Maryland and Illinois, are running into similar hurdles.\nNo such impediments faced Texas, where the Republican-dominated state Legislature completely controls the process around redistricting. The redrawing of congressional districts usually happens only after the decennial U.S. census, in order to account for changes in population over time.\nBut with encouragement from Trump, state leaders in Texas said they were legally permitted to redraw the lines at any time. And they said that recent U.S. Supreme Court precedent allowed them to do so with the explicit goal of boosting the number of Republicans in the U.S. House.\n“Partisanship, political performance, pro-Republican is fine. It’s legal,” said state Rep. Todd Hunter, a Republican, as he defended the map during eight hours of floor debate in the Texas House on Wednesday.\nEven before the lines are signed into law, they were already having a political impact. U.S. Rep. Lloyd Doggett, a Democrat from Austin in his 30th year in the House, said in a statement Thursday that he would not seek reelection if his redrawn district — which would merge with the district of another Democrat, U.S. Rep. Greg Casar — survived a court challenge.\nInstead, he would step aside for Casar, a 36-year-old leader of the party’s youthful progressive wing.\n“If Trump extreme gerrymandering prevails, I wish Congressman Casar the best,” said Doggett, 78, who would join other older Democrats in the U.S. House and Senate planning to retire to give way to an eager next generation.\nThis article originally appeared in The New York Times.\n© 2025 The New York Times Company"
    },
    {
      "news_title": "Texas Legislature gives final approval to redistricting map - Hawaii Tribune-Herald",
      "news_link": "https://www.hawaiitribune-herald.com/2025/08/24/nation-world-news/texas-legislature-gives-final-approval-to-redistricting-map/",
      "bias": "Center",
      "text": "Texas Legislature gives final approval to redistricting map\nHOUSTON — The Texas Legislature gave final approval Saturday to an aggressively redrawn congressional map that kicked off a redistricting race between the parties that is likely to affect the fight for Congress long before any ballots are cast in the 2026 midterm elections.\nGov. Greg Abbott has said he would sign the map into law once it reaches his desk.\nADVERTISING\nThe state Senate passed the map in a party-line vote just days after it was approved by the Texas House on Wednesday. The new lines on Texas’ congressional districts were drawn to deliver Republicans up to five U.S. House seats and help preserve the party’s thin majority.\n“I’m convinced that if Texas does not take this action, that there is an extreme risk that that Republican majority will be lost,” said state Sen. Phil King during the floor debate Friday. He said at several points that he did not “look at any racial data.”\n“This map is legal in all respects,” King said.\nTexas Democrats, who temporarily blocked the passage of the map with a walkout in the state House, said the newly drawn lines illegally diminished the voting strength of Black and Hispanic Texans. They have vowed to file suit against the map after it is adopted.\nAfter more than eight hours of debate Friday, the adoption of a procedural motion by the Republicans denied the Democrats a chance to filibuster, moving the chamber to the final vote. The motion argued that a Democratic state senator who had planned to filibuster, Carol Alvarado, had promoted it as a campaign fundraising event.\nThe bill passed on a vote of 18-11 just after 12:30 a.m. Lt. Gov. Dan Patrick called for people in the gallery — who were shouting “shame” and “fascist” — to be removed. The Senate adjourned until Tuesday at 3 p.m.\nThe repercussions of the push for redistricting in Texas have proved dramatic. President Donald Trump first broached the Texas gerrymander months ago to initially skeptical Republicans, hoping to stave off Democratic victories in U.S. House elections that would cost his party control of the chamber in 2027. Since then, mid-decade redistricting — once a rarity in American politics — is threatening to reverse decades of movement toward less partisan political mapmaking.\nOn Thursday, Democratic lawmakers in California approved a new map of their state designed to swing five Republican seats to Democrats, a numerical counter to Texas that is likely to go before California voters in a November referendum. Trump is also pressing Republican legislators to counter in Missouri, Indiana and Ohio, where more Republican seats could be squeezed out of maps that already favor the GOP. Florida’s Republican House speaker has also vowed to enter his state into the race.\nThe hours of discussion in the Texas Senate on Friday included some details on how the effort had been organized behind-the-scenes.\nKing said that the National Republican Redistricting Trust, which helps coordinate the party’s redistricting strategy, had been involved in Texas’ redistricting. He had spoken to its executive director, Adam Kincaid, early in the state’s process and as recently as Monday.\n“I know he has been involved in some of the early map drawing,” King said at one point while engaging with a Democratic colleague Friday. “Everyone knows, senator, that he has been involved since the beginning.”\nKincaid did not respond to a request for comment.\nThe results of the nationwide redistricting push might not save Republican control of the U.S. House, where the party currently holds a slender four-seat majority.\nOff-year elections almost always favor the party out of power in the White House. Even without the states most likely to redistrict — Texas, California, Missouri, Indiana and Ohio — 27 House seats that were decided by fewer than 5 percentage points in 2024 will remain in play; 14 of them are held by Republicans.\nBut the spasm of mid-decade redistricting could make the House even more fiercely partisan than it is now, as both parties move to take seats from their rivals.\nRegardless, the Texas map’s passage was a major victory for Trump. Gov. Gavin Newsom of California may have numerically nullified the president’s gains in Texas, but he still faces a campaign to get his maps approved by voters who overwhelmingly backed the nonpartisan redistricting commission that the new map would temporarily supplant.\nIn New York, Gov. Kathy Hochul met with state Democratic leaders Thursday, but they still face legal impediments that are likely to stop any redistricting there before 2026. Other Democratic states, such as Maryland and Illinois, are running into similar hurdles.\nNo such impediments faced Texas, where the Republican-dominated state Legislature completely controls the process around redistricting. The redrawing of congressional districts usually happens only after the decennial U.S. census, in order to account for changes in population over time.\nBut with encouragement from Trump, state leaders in Texas said they were legally permitted to redraw the lines at any time. And they said that recent U.S. Supreme Court precedent allowed them to do so with the explicit goal of boosting the number of Republicans in the U.S. House.\n“Partisanship, political performance, pro-Republican is fine. It’s legal,” said state Rep. Todd Hunter, a Republican, as he defended the map during eight hours of floor debate in the Texas House on Wednesday.\nEven before the lines are signed into law, they were already having a political impact. U.S. Rep. Lloyd Doggett, a Democrat from Austin in his 30th year in the House, said in a statement Thursday that he would not seek reelection if his redrawn district — which would merge with the district of another Democrat, U.S. Rep. Greg Casar — survived a court challenge.\nInstead, he would step aside for Casar, a 36-year-old leader of the party’s youthful progressive wing.\n“If Trump extreme gerrymandering prevails, I wish Congressman Casar the best,” said Doggett, 78, who would join other older Democrats in the U.S. House and Senate planning to retire to give way to an eager next generation.\nThis article originally appeared in The New York Times.\n© 2025 The New York Times Company"
    },
    {
      "news_title": "Lawmakers OK GOP-boosting map",
      "news_link": "https://mtstandard.com/article_54a4c03f-2221-5647-ab35-91af7272d246.html",
      "bias": "Center",
      "text": null
    },
    {
      "news_title": "LAWMAKERS OK GOP-BOOSTING MAP",
      "news_link": "https://gazettetimes.com/article_10a2b0ab-9459-556b-8787-3eaaefcbae8f.html",
      "bias": "Center",
      "text": null
    },
    {
      "news_title": "Texas legislators OK map",
      "news_link": "https://www.nwitimes.com/article_8f0e609c-2345-57eb-b664-45e8b026a6fe.html",
      "bias": "Center",
      "text": null
    },
    {
      "news_title": "'Tremendous opportunity': Trump hails new Texas electoral map",
      "news_link": "https://www.nzherald.co.nz/world/trump-hails-new-texas-electoral-map-aimed-at-keeping-grip-on-congress/Y2TCT4SLSRAJ7AF7WYPQRGV2AY/",
      "bias": "Center",
      "text": "US President Donald Trump praised a newly passed Texas electoral map as a “tremendous opportunity” to help his Republican Party retain control of Congress in next year’s midterm elections.\nTexas legislators overnight gave final approval to the redistricting effort engineered to create five new Republican-leaning seats, as the state senatevoted along party lines to pass the map 18-11, following more than eight hours of heated debate.\nLast week the state legislature’s lower chamber adopted the bill, after Democrats delayed the votes for weeks by denying Republicans a quorum to do legislative business.\nTrump, posting on his Truth Social platform, said the new map “will give the wonderful people of Texas the tremendous opportunity to elect 5 new MAGA Republicans in the 2026 Midterm Elections — A HUGE VICTORY for our America First Agenda”.\nGovernor Gregg Abbott said he would swiftly sign the bill into law.\nDemocratic Senator Carol Alvarado’s last-ditch plans to filibuster the map were thwarted when Republicans used a rare procedural motion to halt debate, end the filibuster and proceed directly to the final vote.\nFellow Democrat Sarah Eckhardt said shutting down a filibuster was “unprecedented”.\n“This is not democracy, this is disgraceful,” she posted on X.\nThe vote caps weeks of dramatic political theatre, with Democratic lawmakers fleeing the state in July to deny Republicans the quorum needed to pass the redistricting plan, and drawing nationwide attention to partisan redistricting, known as gerrymandering.\nCalifornia countermove\nThe Democrats claim the new electoral map dilutes the votes of African-American and Hispanic electorates who usually vote for them.\nThe Texas Senate Democratic Caucus said on Friday on X that the state “has a shameful history of racial discrimination. These maps are just the latest entry in that history”.\nThat stance echoed in the floor debate.\nDemocratic Senator Borris Miles denounced Republican complicity in “racist actions”, saying the new map “does not reflect the truth of Texas, but instead manipulates and whitewashes it”.\nSpeaking on the floor, Republican Phil King was clear about the redistricting effort: “I’m convinced that if Texas does not take this action, there is an extreme risk that the Republican majority will be lost.”\nThe cut-throat political gambit spurred California’s Democratic Governor, Gavin Newsom, to launch a process for redrawing his state’s map – this time creating five potentially new seats for Democrats.\n“If Texas wants to play hardball, we’ll play hardball right back,” Newsom said in announcing the California initiative.\nAlthough Newsom hopes to cancel out the Republicans’ advantages gained in Texas, his plan still requires voter approval in an election this November.\nBoth parties are now looking to other states where the rules might allow hasty redrawing of maps in ways that would create more seats.\nBeyond Texas, Trump encouraged Florida, Indiana and Missouri to redraw their maps to Republican advantage.\nThe redistricting battle adds a volatile and high-stakes new element to next year’s elections.\nRepublicans currently control the US Senate and the House of Representatives.\nBeleaguered Democrats hope the unpopularity of many of Trump’s policies will help flip the House. If Democrats did win, they would immediately gain power to investigate Trump and his controversial government members."
    },
    {
      "news_title": "Texas Senate Approves New Congressional Maps",
      "news_link": "https://dailycaller.com/2025/08/23/texas-senate-approves-new-congressional-maps/",
      "bias": "Right",
      "text": "The Texas Senate approved a Republican-favoring congressional map early Saturday morning, ABC News reported.\nThe map creates five new GOP-leaning districts that President Donald Trump championed to protect the party’s narrow House majority ahead of 2026. Republican Gov. Greg Abbott will sign the legislation despite Democrats’ promises to mount legal challenges claiming Voting Rights Act violations, according to ABC News. The map’s passage followed a dramatic showdown where Republicans blocked Democratic State Sen. Carol Alvarado’s planned filibuster by accusing her of violating Senate rules through campaign fundraising.\nRepublican State Sen. Phil King, who sponsored the measure, stated his intentions plainly: “I had two goals in mind: That all maps would be legal and would be better for Republican congressional candidates in Texas.” He said that “There is extreme risk the Republican majority will be lost” without the new map, the outlet reported.\nJUST IN: Texas Republicans approved new congressional maps in a late-night vote, weeks after Democrats fled the state in an attempt to block them. pic.twitter.com/XfnJ5jl6xD\n— Fox News (@FoxNews) August 23, 2025\nThe Texas action triggered California Democrats to approve their own redistricting plan Thursday, requiring voter approval in November. Democratic Gov. Gavin Newsom called it “a reaction to an assault on our democracy in Texas.” (RELATED: ‘Hell No’: Why Some Californians Want Zero Part In Newsom’s Gerrymandering Scheme)\nThe redistricting battle has spread nationally, with Trump urging Indiana, Missouri, and Ohio to redraw their maps. Democrats currently sit three seats away from a House majority, according to ABC News.\nThe Texas map has already forced Democratic Rep. Lloyd Doggett to announce he won’t seek reelection if it takes effect, as his district would overlap with another Democratic incumbent’s territory, the outlet reported. Abbott dismissed California’s response as “a joke” while declaring, “Republicans are not finished in the United States.”"
    },
    {
      "news_title": "Texas’ new congressional map heads to Gov. Abbott’s desk",
      "news_link": "https://san.com/cc/texas-new-congressional-map-heads-to-gov-abbotts-desk/",
      "bias": "Center",
      "text": "The Texas Senate approved a new congressional map early Saturday morning, which is meant to bolster Republicans’ standing in the House going into the 2026 midterm elections. Hours after the map was approved, Gov. Greg Abbott said he would “swiftly” sign it into law.\nThe Senate adopted the bill on a party-line vote, 18 to 11.\nAbbott pledges to ‘swiftly’ sign the map into law\n“The One Big Beautiful Map has passed the Senate and is on its way to my desk, where it will be swiftly signed into law,” Abbott said in a statement Saturday. “I promised we would get this done, and delivered on that promise.”\nAbbott added that the new maps “reflect Texans’ voting preferences.” However, the state’s Democratic caucus disagrees.\nDownload the SAN app today to stay up-to-date with Unbiased. Straight Facts™.\nPoint phone camera here\nIn a video posted to social media following the map’s approval, state Sen. Carol Alvarado said, “What we have seen in this redistricting process has been maneuvers and mechanisms to shut down people’s voices.”\nAlvarado, who leads the Senate Democratic caucus, had announced her plans to filibuster the new congressional maps. However, the Senate took a three-hour dinner break before that could happen. When the chamber reconvened, the Senate’s GOP members accused Alvarado of attempting to fundraise off her filibuster in violation of Senate rules.\n“The Texas Senate used to be known as ‘the most deliberative body in the world. Those days are over,’” Democratic Dean Sen. Judith Zaffirini said before casting her “no” vote on Saturday. “Today the majority will prevail, but the rights of the minority were ignored. Outnumbered, outvoted, and outgunned, Democrats will go down fighting, having used every available legislative tool.”\nMeanwhile, in a post on Truth Social Saturday, President Donald Trump lauded the efforts of Texas’ lieutenant general, Dan Patrick, writing “Dan’s leadership was pivotal in the passage of the new, fair, and much improved, Congressional Map, that will give the wonderful people of Texas the tremendous opportunity to elect 5 new MAGA Republicans in the 2026 Midterm Elections.”\nSaturday’s vote followed approvals from the state’s House of Representatives on Wednesday. House lawmakers voted 88-52 in favor of the new maps.\nThe political move fulfills Trump’s hopes of possibly gaining five more GOP seats in the U.S. House during the 2026 midterm elections. Democrats need to net three additional seats to flip the House next year. They have already vowed to challenge the new map in court.\nStraight Arrow News spoke with Jonathan Cervas, an assistant teaching professor at Carnegie Mellon University and contributor to Princeton’s Gerrymandering Project, about the impact of Texas’ new congressional map.\n“In addition to a potential violation of the Voting Rights Act, this might be viewed in federal court as an intentional act to decrease minority representation, which would be a violation of the 14th Amendment,” Cervas said.\nGOP, Dems at odds over voter representation\nRedistricting is typically done once every 10 years, following the Census. During hours of debate prior to Saturday’s vote, Senate Democrats accused Republican Sen. Phil King of attempting to disenfranchise voters with his measure.\nIn response, King said he “had two goals in mind: That all maps would be legal and would be better for Republican congressional candidates in Texas.”\nSimilarly, Republican Rep. Katrina Pearson said that the new maps increase Black majority districts from zero to two.\n“They say we’re diluting the minority districts. They call us racist. But the facts don’t match your rhetoric,” Pearson said. “Texas currently has zero Black CVAP (citizen voting age population) districts, and under the new map, there are two.”\nDemocrats have pushed back, including Rep. Nicole Collier, who spent the night in the state Capitol building on Tuesday, protesting the GOP’s maps.\n“My constituents sent me to Austin to protect their voices and rights,” Collier said at the time. “My community is majority-minority, and they expect me to stand up for their representation … I know these maps will harm my constituents — I won’t just go along quietly with their intimidation or their discrimination.”\nCervas, meanwhile, described the new map as “perhaps the most biased map in modern American history.” He added that nearly half of Texas voters have a “diluted vote,” meaning their vote is useless against the majority party.\n“Nearly 100% of the population growth in Texas has come from minority populations,” Cervas said. “After the 2020 census, Texas got two additional congressional districts. Both of those districts were drawn so that white voters were able to elect candidates of their choice. This new map appears to have eroded representation for these voters, making it more difficult for people of color to elect candidates of their choice.\nA larger redistricting effort grips the nation\nSaturday’s vote was the culmination of a nearly month-long saga that saw Texas’ Democratic lawmakers flee the state to delay a vote on the GOP’s redistricting effort. The lawmakers left Texas on Aug. 3, the day before a vote was scheduled.\nMore than 50 lawmakers left for blue states like Illinois and New York, denying Republicans a quorum. However, by Monday, they began returning to the Lone Star State.\nLikewise, Saturday’s vote is also part of a larger push, spearheaded by Trump, to redraw maps across the country, potentially boosting the GOP’s slim congressional majority during the 2026 midterms.\nTexas had received the lion’s share of attention, not only because it was furthest along in the process but also because of the high-profile standoff between the state’s Democrat and Republican lawmakers. However, Florida, Ohio, Missouri and Indiana are also laying the groundwork for similar measures.\nMeanwhile, California Gov. Gavin Newsom is leading a strategy to “meet fire with fire,” and redraw maps in blue states.\n“We have got to recognize the cards that have been dealt. And we have got to meet fire with fire. And we’ve got to be held to a high level of accountability. So that’s what this is about,” Newsom said. “It’s not complicated. We’re doing this in reaction to a president of the United States that called a sitting governor of the state of Texas and said find me five seats. We’re doing it in reaction to that act.”\nOn Thursday, Newsom signed the Election Rigging Response Act, which paves the way for a special election on Nov. 4 in which Californians will vote on a new, temporary Congressional map."
    },
    {
      "news_title": "Even this ruby red state doesn't like what Trump's doing",
      "news_link": "https://www.rawstory.com/texas-2673911010/",
      "bias": "Left",
      "text": "I’m writing to you from Houston, Texas, where I’m flogging Coming Up Short: A Memoir of My America to every Texan who might be interested. So far, I think I’ve sold two copies.\nJust kidding. Last night, in fact, I met hundreds of Texans who seemed interested.\nTexas wasn’t always the bastion of right-wing extremism it seems today. Remember Ann Richards? She was the progressive firebrand governor of Texas from 1991 to 1995. I recall her keynote speech at the 1988 Democratic National Convention in Atlanta when she said of then-President George H.W. Bush, “Poor George, he can’t help it — he was born with a silver foot in his mouth.”\nToday, the progressive torch is being carried in Texas by people like Beto O’Rourke, Rep. Greg Casar (from Texas’s 35th congressional district), and State Rep. Nicole Collier.\nEarlier this week, Collier remained in the Texas House chamber overnight to protest a Republican-imposed requirement that Democrats agree to a mandatory police escort to leave the Capitol after a redistricting walkout. She viewed the requirement as restriction on her constitutional rights.\nCollier was right, of course. Texas Republicans are treating Texas Democrats as if they’re sworn enemies. Trump has stoked this by telling Texas Governor Greg Abbott to find five additional Republican congressional seats by gerrymandering the state even more wildly than it was already gerrymandered.\nOn Wednesday, the newly redrawn map finally passed.\nTrump is putting pressure on other red states to do the same. It’s all part of Trump’s plot to keep Republicans in control of Congress in the 2026 midterms.\nThe stakes are huge. Republicans could easily lose their current seven-vote majority in the House, or possibly their six-vote majority in the Senate.\nHopefully, blue state governors and legislatures — starting with Gavin Newsom’s California — will stop this assault on voting rights by credibly threatening to gerrymander an equal number of additional Democratic congressional seats.\nWith blue states mobilized, it wouldn’t be a race to the bottom. It would be a race to save democracy by removing any incentive for red states to try to gerrymander their way to more Republican seats.\nTwo other parts to Trump’s plot to keep Republicans in control of Congress are also coming into view.\nHe’s attacking mail-in ballots. As he wrote on Monday in a social media post, he intends to “lead a movement to get rid of MAIL-IN BALLOTS.”\nHe also intends to target what he says are “Highly ‘Inaccurate,’ Very Expensive, and Seriously Controversial VOTING MACHINES, which cost Ten Times more than accurate and sophisticated Watermark Paper, which is faster, and leaves NO DOUBT, at the end of the evening, as to who WON, and who LOST, the Election.”\nCan anyone doubt what Trump is trying to do?\nAsked about his effort to end mail-in voting and rid the election process of voting machines, he told reporters, “We’re going to start with an executive order that’s being written right now by the best lawyers in the country to end mail-in ballots because they’re corrupt.”\nThe third part of Trump’s plot is to occupy major cities, mostly led by Democratic mayors, which are centers of Democratic voting. He probably figures that militarizing these cities will intimidate voters to stay away from the polls.\nHe’s doing a trial run now in his occupation of Washington, D.C. — deploying ICE agents, National Guard troops, and the Army. To justify it, he charged that: \"Our capital city has been overtaken by violent gangs and bloodthirsty criminals, roving mobs of wild youth, drugged-out maniacs and homeless people.”\nRubbish. According to the Justice Department’s own data (which, of course, Trump rejects), violent crime in the city hit a 30-year low last year. City data shows homicides are down by more than 10%, robbery down by almost 30%, and carjackings down nearly 40%.\nLet’s be clear about what’s going on here.\nThe man who instituted a coup against the United States when he failed to win the 2020 presidential elections — demanding that Republican governors “give” him the votes he needed, instructing his vice president not certify the election, and encouraging a mob to attack the Capitol — does not want free and fair elections in 2026 or beyond.\nThat’s why the rest of us — Democrats, independents, and Republicans who still believe in democracy — must organize a counter-offensive, now.\nPart of that counter-offensive begins with Newsom’s California; other blue states must join in. Trump’s attacks on mail-in ballots and voting machines, and his occupation of our cities, should be challenged in the federal courts. A wide coalition of state and city officials should participate.\nThe rest of us must make good trouble by ensuring that Trump’s plot is widely known, and that we will resist it.\nMost of the Texans I’ve talked with over the last few days (including at a coffee bar where we’ll be doing Saturday’s Coffee Klatch) tell me they don’t support what Greg Abbott is doing.\nTexans relish their freedoms. They don’t want to be controlled by Washington. They don’t want to live in a dictatorship. The spirit of Ann Richards lives on.\n- Robert Reich is a professor of public policy at Berkeley and former secretary of labor. His writings can be found at https://robertreich.substack.com"
    },
    {
      "news_title": "Texas Senate approves GOP congressional map, sending plan to Abbott’s desk",
      "news_link": "https://www.valleycentral.com/news/state-news/texas-senate-approves-gop-congressional-map-sending-plan-to-abbotts-desk/",
      "bias": "Center",
      "text": null
    },
    {
      "news_title": "Texas’ Abbott Promises Quick Signature of Redistricting Plan Following Overnight Senate Vote",
      "news_link": "https://www.nysun.com/article/texas-abbott-promises-quick-signature-of-redistricting-plan-following-overnight-senate-vote",
      "bias": "Right",
      "text": "Texas’ Abbott Promises Quick Signature of Redistricting Plan Following Overnight Senate Vote\nHours earlier, California Democrats approved legislation setting up a special election to redraw that state’s congressional map.\nGovernor Greg Abbott says he will “swiftly” sign a redrawn Texas congressional map into law.\nThe Texas senate voted shortly after midnight on Saturday to approve a redrawn congressional map designed to flip five seats from Democrats to Republicans in next year’s midterm election.\nIn a statement, Mr. Abbott called it “One Big Beautiful Map.”\n“I promised we would get this done, and delivered on that promise,” Mr. Abbott said. “I thank Lieutenant Governor Dan Patrick for leading the passage in the Senate of a bill that ensures our maps reflect Texans’ voting preferences.”\nThe vote came a day after California Democrats pushed through a series of bills in an effort to counter Texas’ move with its own redistricting.\nGovernor Newsom asked lawmakers to approve spending of up to $250 million on a November special election in which voters would be asked to approve the new districts. California’s plan is intended to flip five seats from Republicans to Democrats, though in neither state is the intended outcome assured.\nCalifornia has 52 congressional representatives and only nine are currently Republicans. Republicans outnumber Democrats in Texas by 25 to 12.\nPresident Trump has asked Republican governors to redistrict to make sure the party retains control of Congress for the remainder of his administration. The sitting president’s political party usually loses congressional seats during the midterm elections and Democrats are within three seats of taking control, which would make it easier for them to obstruct the president’s agenda.\nMissouri is expected to join the redistricting fight next. “The Great State of Missouri is now IN. I’m not surprised,” Mr. Trump wrote in a Truth Social post on Thursday.\n“It is a great State with fabulous people. I won it, all 3 times, in a landslide. We’re going to win the Midterms in Missouri again, bigger and better than ever before!” Mr. Trump wrote in his Truth Social message.\nThe easiest way for the Missouri GOP to add one seat in the House would be to “crack up” a deeply blue district based around Kansas City, spreading its reliably Democratic voters among surrounding red districts.\nOhio Republicans also plan to redraw their maps and the Trump administration is urging Indiana Republicans to do the same.\nThat could prompt more Democrat-controlled states to retaliate. Maryland and New York are considering redoing their districts to boost Democratic-controlled districts.\nThe United States Supreme Court opened the door to the latest wave of partisan redistricting when it ruled in 2019 that the Constitution does not prohibit gerrymandering."
    },
    {
      "news_title": "Trump hails new Texas electoral map aimed at keeping grip on Congress",
      "news_link": "https://www.insidenova.com/news/national/trump-hails-new-texas-electoral-map-aimed-at-keeping-grip-on-congress/article_57b7413f-282b-5865-a667-7bf33ce427ac.html",
      "bias": "Center",
      "text": null
    },
    {
      "news_title": "Florida eyes redistricting amid national political arms race",
      "news_link": "https://www.fox13news.com/news/florida-eyes-redistricting-amid-national-political-arms-race",
      "bias": "Center",
      "text": "Florida eyes redistricting amid national political arms race\nFLORIDA - Texas has passed a new congressional map that adds five Republican-leaning districts, aligning with former President Trump’s call for more GOP seats.\nCalifornia’s Governor, Gavin Newsom, announced plans to counter this by creating five new Democratic districts in California.\nGovernor DeSantis has suggested Florida’s map may need adjustments due to population growth (again, the state constitution bans partisan gerrymandering).\nWhat we don't know:\nIt is uncertain whether Florida lawmakers will push the boundaries of the state’s redistricting amendment when the legislature reconvenes, how aggressively courts will enforce Florida’s ban on partisan map-drawing if challenged, or whether Congress or the president could call for a mid-decade census.\nTimeline:\n- Early 1800s: \"Gerrymandering\" coined after Massachusetts Gov. Elbridge Gerry drew distorted districts to help his party.\n- 2019: U.S. Supreme Court rules partisan gerrymandering is outside federal court jurisdiction, setting the legal justification Texas will later use to redraw maps for the specific purpose of benefitting the Republican party.\n- 2025: Texas Republicans approve a map favoring the GOP. California Democrats retaliate by pursuing their own map changes (pending results of an upcoming election)\n- 2025: Florida Republicans consider new changes, setting the stage for another fight.\nAs parties polarized, red states tilted more Republican, and blue states tilted more Democratic—opening the door to more aggressive map-drawing.\n- President Donald Trump: \"I got the highest vote in the history of Texas… and we are entitled to five more seats.\"\n- Gov. Gavin Newsom (D-CA): \"The idea the president is entitled to five seats should sicken everyone.\"\n- State Rep. Anna Eskamani (D-FL): \"This is purely about a power grab by the Republican Party.\"\n- State Rep. Todd Hunter (R-TX): \"The Supreme Court says we can use politics and partisanship to do congressional redistricting.\"\n- Gov. Ron DeSantis (R-FL): Argues changes are needed to reflect population growth and \"raw deals\" in census counts. \"I think the state is malapportioned, so I do think it would be appropriate to do a redistricting here.\"\n- Terri Ann Lowenthal, Census Consultant: \"This country has never taken a mid-decade census… The law is very clear, it cannot be used to reapportion Congress or to redraw congressional district lines.\"\nREAD: FDOT denies St. Pete's request to keep several street murals on roadways\nWhy you should care:\nCongressional maps will help decide which party controls the U.S. House in 2026 and beyond.\nFlorida’s map could determine the balance of power in Washington, especially in tight midterm elections.\nMinority representation may be at risk if Florida redraws districts meant to amplify diverse communities.\nBy the numbers\n- 5 seats: Texas Republicans added to benefit the GOP.\n- 5 seats: California Democrats now seek to add to counterbalance Texas.\n- 1 seat: Florida gained in the last census, though DeSantis argues it should have been at least two.\n- 5 years: Until the next national census, unless Congress authorizes one sooner (an unlikely scenario).\nBig picture view:\nThe clash over redistricting underscores the deep partisan divide in American politics. What began as a tactical move in Texas has triggered responses in California and possibly Florida, setting the stage for a nationwide battle over the shape of political power itself.\nCLICK HERE:>>> Follow FOX 13 on YouTube\nThe Source: Information for this story was gathered by FOX 13's Craig Patrick."
    },
    {
      "news_title": "Texas lawmakers approve new congressional map",
      "news_link": "https://www.taipeitimes.com/News/world/archives/2025/08/24/2003842590",
      "bias": "Lean Left",
      "text": "The Texas Senate gave final approval to a new, Republican-leaning congressional voting map early yesterday, sending it to Texas Governor Greg Abbott for his signature.\nUS President Donald Trump has pushed for the map to help the Republican Party maintain its slim majority in the US Congress in next year’s midterm elections. It has five new districts that would favor Republicans.\nAbbott, a Republican, is expected to quickly sign it into law, although Democrats have vowed to challenge it in court.\nPhoto: AP\nThe effort by Trump and Texas’ Republican-majority legislature prompted state Democrats to hold a two-week walkout and began a wave of redistricting efforts across the country.\nDemocrats had prepared for a final show of resistance, with plans to push the Senate vote into the early morning hours in a last-ditch attempt to delay passage.\nTexas State Senator Carol Alvarado, leader of the Senate Democratic caucus, said that she planned to filibuster the bill with a long speech and intended to speak for several hours. However, just when she expected to start, the Senate broke for a long dinner break.\nWhen members returned, Alvarado never had a chance to filibuster, because Republicans accused her of breaking Senate rules by attempting to fundraise off the coming filibuster.\n“Shutting down a filibuster over a fundraising e-mail is unprecedented,” Democratic Senator Sarah Eckhardt wrote on X. “It exposes the hypocrisy of Republicans, who will turn around and raise millions off stealing Texans’ votes while silencing their voices.”\nDemocrats had already delayed the bill’s passage during hours of debate, pressing Republican Senator Phil King, the measure’s sponsor, on the proposal’s legality, with many alleging that the redrawn districts contravene the Voting Rights Act by diluting voters’ influence based on race.\nKing denied the accusation, saying: “I had two goals in mind: That all maps would be legal and would be better for Republican congressional candidates in Texas.”\n“There is extreme risk the Republican majority will be lost” in the House if the map does not pass, King said.\nThe showdown has also inflamed a broader, state-by-state redistricting battle, with governors from both parties pledging to redraw congressional maps.\nCalifornia Democrats approved legislation on Thursday calling for a special election in November for residents to vote on a redrawn congressional map designed to help Democrats win five more US House seats next year. Governor Gavin Newsom quickly signed it.\nAbbott called California’s redistricting “a joke” and asserted that Texas’ new map is constitutional, but California’s would be overturned.\nOn a national level, the partisan makeup of existing districts puts Democrats within three seats of a majority. The incumbent president’s party usually loses seats in the midterms.\nTrump has pushed other Republican-controlled states, including Indiana and Missouri, to also revise their maps to add more winnable Republican Party seats.\nOhio Republicans were also already scheduled to revise their maps to make them more partisan.\nThe US Supreme Court has said the US Constitution does not outlaw partisan gerrymandering, only using race to redraw district lines.\nBoth sides have shown concern over what the redistricting war could lead to.\nCalifornia Assemblyman James Gallagher, the Republican minority leader, said Trump was “wrong” to push for new Republican seats elsewhere.\nHe also warned that Newsom’s approach is dangerous.\n“You move forward fighting fire with fire, and what happens?” Gallagher asked. “You burn it all down.”\nELECTION DISTRACTION? When attention shifted away from the fight against the militants to politics, losses and setbacks in the battlefield increased, an analyst said Recent clashes in Somalia’s semi-autonomous Jubaland region are alarming experts, exposing cracks in the country’s federal system and creating an opening for militant group al-Shabaab to gain ground. Following years of conflict, Somalia is a loose federation of five semi-autonomous member states — Puntland, Jubaland, Galmudug, Hirshabelle and South West — that maintain often fractious relations with the central government in the capital, Mogadishu. However, ahead of elections next year, Somalia has sought to assert control over its member states, which security analysts said has created gaps for al-Shabaab infiltration. Last week, two Somalian soldiers were killed in clashes between pro-government forces and\nTen cheetah cubs held in captivity since birth and destined for international wildlife trade markets have been rescued in Somaliland, a breakaway region of Somalia. They were all in stable condition despite all of them having been undernourished and limping due to being tied in captivity for months, said Laurie Marker, founder of the Cheetah Conservation Fund, which is caring for the cubs. One eight-month-old cub was unable to walk after been tied up for six months, while a five-month-old was “very malnourished [a bag of bones], with sores all over her body and full of botfly maggots which are under the\nBRUSHED OFF: An ambassador to Australia previously said that Beijing does not see a reason to apologize for its naval exercises and military maneuvers in international areas China set off alarm bells in New Zealand when it dispatched powerful warships on unprecedented missions in the South Pacific without explanation, military documents showed. Beijing has spent years expanding its reach in the southern Pacific Ocean, courting island nations with new hospitals, freshly paved roads and generous offers of climate aid. However, these diplomatic efforts have increasingly been accompanied by more overt displays of military power. Three Chinese warships sailed the Tasman Sea between Australia and New Zealand in February, the first time such a task group had been sighted in those waters. “We have never seen vessels with this capability\n‘NO INTEGRITY’: The chief judge expressed concern over how the sentence would be perceived given that military detention is believed to be easier than civilian prison A military court yesterday sentenced a New Zealand soldier to two years’ detention for attempting to spy for a foreign power. The soldier, whose name has been suppressed, admitted to attempted espionage, accessing a computer system for a dishonest purpose and knowingly possessing an objectionable publication. He was ordered into military detention at Burnham Military Camp near Christchurch and would be dismissed from the New Zealand Defence Force at the end of his sentence. His admission and its acceptance by the court marked the first spying conviction in New Zealand’s history. The soldier would be paid at half his previous rate until his dismissal"
    },
    {
      "news_title": "Texas lawmakers approve new GOP-leaning voting map in power grab pushed by Trump",
      "news_link": "https://www.the-express.com/news/politics/181259/texas-lawmakers-congressional-map-redistricting",
      "bias": "Right",
      "text": "Texas lawmakers approve new GOP-leaning congressional map in power grab pushed by Trump\nThe Texas Senate gave final approval to a new, Republican-leaning congressional voting map early Saturday, sending it to Gov. Greg Abbott for his signature\nThe Texas Senate has given the green light to a new, Republican-favoring congressional voting map which now awaits Governor Greg Abbott's signature.\nFormer President Donald Trump has been a vocal advocate for this map, viewing it as a tool to help the GOP maintain its narrow majority in Congress in the 2026 midterm elections. The map introduces five new districts that would likely lean Republican.\nGovernor Abbott, a fellow Republican, is anticipated to promptly sign it into law, despite Democrats' promise to contest it in court.\n- Donald Trump's blunt remark to Vladimir Putin decoded by lip reader\n- King Charles reduced to tears after overhearing Prince William's conversation\nThis move by Trump and Texas' Republican-dominated Legislature sparked state Democrats to stage a two-week walkout and ignited a flurry of redistricting efforts nationwide.\nDemocrats had geared up for a final act of defiance, planning to extend the Senate vote into the wee hours of the morning in a desperate bid to stall passage.\nState Sen. Carol Alvarado, head of the Senate Democratic caucus, revealed on social media her plan to filibuster the bill with an extended speech, intending to speak for several hours. However, just as she was about to begin, the Senate adjourned for a lengthy dinner break.\nUpon their return, Alvarado was denied the opportunity to filibuster as Republicans accused her of violating Senate rules by attempting to fundraise off the impending filibuster.\nSen. Charles Perry deemed it \"appears to be potentially unlawful, at least unethical, using state resources for a campaign purpose.\"\nMany have claimed that the redrawn districts infringe upon the Voting Rights Act by diminishing voters' influence based on race.\nKing strongly refuted this claim, stating, \"I had two goals in mind: That all maps would be legal and would be better for Republican congressional candidates in Texas.\n\"There is extreme risk the Republican majority will be lost\" in the House if the map does not pass, King warned.\nThis standoff has also ignited a wider, state-by-state redistricting battle, with governors from both parties vowing to redraw congressional maps.\nCalifornia Democrats greenlit legislation Thursday calling for a special election in November for residents to vote on a redrawn congressional map designed to bolster Democrats' chances of securing five more House seats next year. Gov. Gavin Newsom promptly signed it.\n\"This is not something six weeks ago that I ever imagined that I'd be doing,\" Newsom admitted. \"This is a reaction to an assault on our democracy in Texas.\"\nCalifornia's map requires voter approval because, unlike in Texas, a nonpartisan commission typically draws the map to sidestep the kind of political skirmish currently unfolding.\nNationally, the partisan composition of current districts places Democrats just three seats away from a majority. Historically, the sitting president's party tends to lose seats during midterm elections.\nThe Texas redraw is already transforming the 2026 race, with Democratic Rep. Lloyd Doggett, the senior member of the state's congressional delegation, announcing Thursday that he won't pursue reelection to his Austin-based seat should the new map be implemented. Under the proposed map, Doggett's district would merge with that of another Democratic incumbent, Rep. Greg Casar.\nThe president has encouraged other Republican-led states, including Indiana and Missouri to similarly revise their maps to create more competitive GOP seats. Ohio Republicans were also previously scheduled to modify their maps for increased partisan advantage.\n\"Republicans are not finished in the United States,\" Abbott said.\nRedistricting traditionally happens once per decade, right after a census. While certain states impose their own restrictions, no federal barrier prevents a state from redrawing districts mid-decade."
    },
    {
      "news_title": "Texas Senate approves GOP congressional map, sending plan to Abbott's desk",
      "news_link": "https://abc13.com/post/texas-senate-approves-gop-congressional-map-sending-plan-abbotts-desk-amid-democratic-opposition/17623034/",
      "bias": "Lean Left",
      "text": "The Texas Senate early Saturday morning approved a new congressional map gerrymandered to maximize Republican representation, sending the plan to the governor's desk after weeks of intense partisan clashing.\nRepublican lawmakers pushed the plan through over fierce Democratic opposition, launching a national redistricting war from Albany to Sacramento while positioning the GOP to net up to five additional seats in Texas.\nThe Senate adopted the new lines on a party-line vote, 18 to 11, just after 12:30 a.m. Saturday following more than eight hours of at times tense debate.\nSen. Carol Alvarado, D-Houston, had planned to filibuster the map well into Saturday as a last stand against the effort, but a rare procedural motion by Senate Republicans just after midnight ended the debate and killed the filibuster, moving the chamber straight on to the final vote. Some observers in the gallery were removed for shouting \"shame,\" and \"fascist,\" shortly after the vote.\nRELATED: Sen. Carol Alvarado plans to filibuster in last-ditch effort to prevent Texas redistricting bill\nThe map, demanded by President Donald Trump to fortify the GOP's U.S. House majority in next year's midterm election, hands up to five additional U.S. House seats to Republicans by dismantling Democratic bastions around Austin, Dallas and Houston, and by making two Democrat-held seats in South Texas redder. The new lines also keep all 25 seats already held by Republicans safely red.\nThe plan \"meets the critically important goals of legality, of political performance for Republicans and of improved compactness,\" said Sen. Phil King, R-Weatherford and House Bill 4's sponsor, while repeatedly insisting under questioning from Democrats that he did not consider racial population data in his role shepherding the map through the upper chamber.\nThe pickups are meant to help the GOP hold onto its razor-thin congressional majority in a midterm election year that is expected to favor Democrats - potentially making the difference between a continued Republican trifecta in Washington, or a divided government with one chamber intent on investigating Trump and bottlenecking his agenda.\nThat has put Texas lawmakers at the front lines of an issue with national stakes. Republicans earned kudos from Trump for pushing the new boundaries through the state House, while Democrats won support from national party figures, including former President Barack Obama, Democratic National Committee Chair Ken Martin and U.S. House Minority Leader Hakeem Jeffries of New York.\nIn his closing statement, King made clear that the case for the map rested purely on maintaining Republican control of the federal government - and that if Texas did not push the gerrymander through, the GOP would likely lose control of the U.S. House in next year's midterm election.\nThe \"amazing progress that's been made in just eight months - all of this will end if the Republicans lose the Congress,\" King said after citing a list of policy achievements he attributed to a Republican trifecta. \"I'm convinced that if Texas does not take this action, there is an extreme risk that that Republican majority will be lost. If it does, the next two years after the midterm, there will be nothing but inquisitions and impeachments and humiliation for our country.\"\nThough congressional lines are typically redrawn once every 10 years following the decennial census, Republicans justified the aggressive and unusual move to do so in the middle of the decade by saying it was legal to craft new boundaries at any point and for purely partisan gain. They also pointed to the party's margins of victory in 2024 and the need to counter blue-state gerrymandering to further support their push.\nThe U.S. Supreme Court ruled in 2019 that states can draw electoral maps on partisan grounds. But under Section 2 of the Voting Rights Act, the lines cannot diminish people's voting power based on race.\nSEE ALSO: California moving forward with partisan redistricting effort to counter Texas' move\nDemocrats argued that the new map increased Republicans' advantage by unconstitutionally suppressing the vote of Black and Latino Texans. They framed the push as a power grab by Trump meant to stack the deck in next year's election.\n\"Today, the majority will prevail, but the rights of minorities were ignored, outnumbered, outvoted and outgunned,\" said Sen. Judith Zaffirini, D-Laredo and dean of the Senate. \"Democrats will go down fighting, having used every available legislative tool. My prayer is that the pendulum will swing sooner rather than later, and that when it does, Democrats will respect all minorities, including political.\"\nTexas' approval of the map has set off a tit-for-tat redistricting push in California, where Gov. Gavin Newsom has proposed a map voters would have to approve that could yield five new Democratic-leaning seats, effectively offsetting GOP gains in Texas. Other blue-state governors and national Democratic leaders are backing retaliatory gerrymandering as the Trump administration also pushes GOP-controlled Florida, Indiana, Missouri and Ohio to draw more red seats.\nAlvarado, with assistance from other Senate Democrats, had planned to filibuster the map Friday, donning sneakers and receiving a catheter in preparation. Sen. Sarah Eckhardt, D-Austin, had compiled over 12 hours of testimony from constituents on the map to read from during the marathon speech.\nBut after a three-hour dinner break called by Lt. Gov. Dan Patrick and objected to by Democrats, Republicans returned late Friday night with a procedural motion up their sleeves. Sen. Charles Perry, R-Lubbock, moved to cut off debate early. He cited a campaign email Alvarado sent out promoting the filibuster Friday afternoon, calling it \"potentially unlawful,\" and \"at least unethical,\" for ostensibly using state resources, such as staff and Capitol facilities, for fundraising purposes.\n\"It's disrespectful. It violates the decorum of the Senate, and personally, I'm offended by it,\" Perry said. All Republicans signed onto the motion.\nDemocrats condemned the explanation as an excuse to kill the filibuster and move the vote along, noting that senators routinely drew from their legislative work in their fundraising campaigns and that lawmakers were not under a fundraising moratorium as they are during the regular session.\n\"When they do it, it seems to be fair game, and when other people do it, then it's a gotcha,\" Alvarado said after the vote. \"It was a mechanism to shut down the discussion, the debate on this issue.\"\nThe filibuster would have delayed the map's passage, but almost certainly would not have blocked it. Alvarado would have to had to sustain the filibuster for three weeks straight to run out the clock on the Legislature's special session.\nThe new Texas map cleared its biggest hurdle Wednesday when, after more than eight hours of tense debate, the state House adopted the plan along party lines.\nLacking the votes to stop the map in the GOP-dominated Texas Legislature, more than 50 House Democrats staged a two-week walkout earlier this month, grinding the lower chamber to a halt by denying the quorum needed to conduct business.\nRepublicans unleashed an unprecedented response to drag them back to Texas, issuing civil arrest warrants, asking a court to extradite them from Illinois, seeking to declare over a dozen Democrats' seats vacant and clamoring for legislative punishments upon their return.\nAfter most Democratic lawmakers returned to Austin Monday, Republican Speaker Dustin Burrows, seeking to maintain a quorum, required each of them to agree to a police escort to leave the Capitol building. Rep. Nicole Collier, D-Fort Worth, refused and was confined to the Capitol for the next 54 hours, prompting a national media frenzy.\nDemocrats portrayed the walkout as a victory for sparking a national movement in support of retaliatory redistricting, and as just the first part of a longer fight against the map. In the House on Wednesday, Democratic lawmakers pressed their Republican colleagues on the plan's impact on voters of color, working to establish a record they could use in a legal challenge seeking to kill the lines before next year's election.\n\"This fight is far from over,\" Rep. Gene Wu of Houston, chair of the House Democratic Caucus, said after the map's passage in the lower chamber. \"Our best shot is in the courts. This part of the fight is over, but it is merely the first chapter.\"\nThe Texas Tribune is a nonprofit, nonpartisan media organization that informs Texans - and engages with them - about public policy, politics, government and statewide issues. Drew Shaw is a government accountability reporter for the Fort Worth Report."
    },
    {
      "news_title": "Trump praises Dan Patrick for role in Texas GOP’s approved congressional map",
      "news_link": "https://www.oann.com/newsroom/trump-praises-dan-patrick-for-role-in-texas-gops-approved-congressional-map/",
      "bias": "Right",
      "text": "OAN Staff Katherine Mosack\n2:30 PM – Saturday, August 23, 2025\nPresident Donald Trump celebrated Texas Lieutenant Governor Dan Patrick for his role in the completion of Texas’s new congressional map.\nOn Saturday, the Texas Senate sent its redistricted map with its final approval to Governor Greg Abbott (R-Texas), who promised to sign it “swiftly.” On the same day, Trump expressed his glowing support for their redistricting efforts to Truth Social, mentioning Patrick (R-Texas) specifically.\n“Dan Patrick is a terrific and powerful Lieutenant Governor for the Great State of Texas, a place I truly love,” Trump’s lengthy post began.\nAdvertisement\nTrump’s overall plan is to secure “100 more seats” in the House for the Republicans, while also eliminating mail-in voting, which he called in another Truth Social post on Wednesday “a total fraud that has no bounds.”\n“Dan’s leadership was pivotal in the passage of the new, fair, and much improved, Congressional Map, that will give the wonderful people of Texas the tremendous opportunity to elect 5 new MAGA Republicans in the 2026 Midterm Elections — A HUGE VICTORY for our America First Agenda,” the president continued. “A True Friend to MAGA from the very beginning, Dan Patrick has my Complete and Total Endorsement for Re-Election – HE WILL NEVER LET YOU DOWN!”\nStay informed! Receive breaking news alerts directly to your inbox for free. Subscribe here. https://www.oann.com/alerts\nWhat do YOU think? Click here to jump to the comments!Sponsored Content Below"
    },
    {
      "news_title": "Texas Senate passes GOP redistricting maps, sending to Abbott for final approval",
      "news_link": "https://denvergazette.com/news/nation-world/texas-senate-passes-gop-redistricting-maps-sending-to-abbott-for-final-approval/article_da285dbe-d8dc-5f33-820d-39f62638ed6f.html",
      "bias": "Center",
      "text": "The Texas Legislature passed a new GOP-drawn congressional map early Saturday that is designed to net Republicans in Congress up to five additional House seats, capping off a weeks-long sprint to redraw districts in the party's favor at the request of President Donald Trump.\nThe legislation was approved by Republicans along party lines in the state Senate after clearing the House. The measure now goes to Gov. Greg Abbott (R-TX), who has vowed to swiftly sign it into law.\n\"The intent of all district changes were to make sure that we had a legal map, one that performed better for Republicans, and hopefully improved compactness in some districts,\" state GOP Sen. Phil King, who authored the Senate version of the bill, said during hours of floor debate with Democrats, who one by one peppered him with questions and criticism before passage.\nDemocratic lawmakers and aligned groups are expected to quickly file legal challenges once Abbott signs off on the new map, and blue states like California have already taken steps to counter Republicans with partisan redistricting efforts of their own.\nSenate passage came two days after the Texas House passed the redistricting bill 88-52. The votes, which came during a special legislative session called by Abbott, followed a two-week standoff featuring Democrats fleeing the Lone Star State to deny the Republican-dominated House the required quorum to operate.\n“While Democrats shirked their duty, in futility, and ran away to other states, Republicans stayed the course, stayed at work and stayed true to Texas,” Abbott stated Wednesday. “I will sign this bill once it passes the Senate and gets to my desk.”\nTrump, following the Wednesday House vote, called the new map a “big WIN for the Great State of Texas!!!”\n“Everything Passed, on our way to FIVE more Congressional seats and saving your Rights, your Freedoms, and your Country, itself,” he posted on Truth Social. “Texas never lets us down.”\nAfter returning from Democratic states like California and Illinois that harbored those who fled, Democrats were allowed to leave the chamber on Monday pending a final vote only if they agreed to be in the custody of a state Department of Public Safety officer. One Democrat, state Rep. Nicole Collier, refused. Instead, she remained in the chamber until it reconvened on Wednesday.\nThe redistricting saga, initiated by Trump and carried out by Texas Republicans, alters current districts in ways that could safeguard U.S. House Republicans’ slim majority in next year’s midterms. But it’s kicked off a nationwide mid-decade redistricting war between red and blue states over what is typically a once-a-decade process that follows the decennial U.S. census.\nHowever, retaliation efforts by Democrats in other states like California are likely to prove far harder than in Texas, where Republicans had the power to redraw districts in a more partisan fashion. In Democratic-led California, the process is controlled by an independent commission, a hurdle Gov. Gavin Newsom (D-CA) and state Democrats are attempting to circumvent by putting new maps in front of voters for approval in a November special election.\nTEXAS HOUSE PASSES GOP MAPS IN REDISTRICTING FIGHT WITH DEMOCRATS\n“You will now go down in history as one of Donald Trump's most loyal lapdogs,” Newsom posted of Abbott on social media. “Shredding our nation's founding principles. What a legacy.\"\nIn a subsequent post, he wrote: “It's on, Texas.”"
    },
    {
      "news_title": "Texas Legislature sends Trump-backed congressional redistricting plan to Gov. Abbott's desk",
      "news_link": "https://www.tpr.org/government-politics/2025-08-23/texas-legislature-sends-trump-backed-congressional-redistricting-plan-to-gov-abbotts-desk",
      "bias": "Center",
      "text": "The Texas Senate gave final approval early Saturday to House Bill 4, the controversial redistricting bill that shifts the state's congressional districts in Republican's favor. The new map could give the GOP as many as five new seats in Congress after the 2026 midterm election.\nThe bill now heads to Gov. Greg Abbott's desk for his signature.\nThe governor has been a fierce supporter of the unconventional mid-decade redistricting plan and directed state lawmakers to take it on last month when he officially announced Texas' first special session.\nAbbott's move came at the request of President Donald Trump and the Department of Justice.\nThe Senate's Friday vote on HB 4 marks the end to a contentious month in Texas politics filled with protests, arrest threats and legislative deadlock — plus a persistent war of words and finger pointing between the state's Republicans and Democrats.\nThe redistricting effort has drawn national attention, especially after a quorum-breaking walkout earlier this month by Texas House Democrats which left the chamber at a standstill.\nIt also sparked a reactive redistricting push from Democratic-led California, which passed its own new map this week designed to cancel out any Republican gains in Texas. California Gov. Gavin Newsom labeled his state's effort a \"fight to save democracy.\" Voters there get a chance to approve those maps in a November election.\nTexas House Democrats returned to Austin on Monday. With a quorum back intact, the chamber quickly moved to take up redistricting legislation. House Bill 4 passed on Wednesday after eight hours of extensive debate in the House.\nThe state Senate's debate on Friday lasted 14 hours from start to finish, and could've gone longer if Sen. Carol Alvarado (D-Houston) was able to carry out her plan to filibuster. Despite those efforts to stall final passage, the Senate passed HB 4 on a 18 - 8 vote around 12:40 am on Saturday.\nA key debate point for Texas Senators: Is this map legal?\nThroughout the state's redistricting battle, Texas Democrats have called Republicans' effort to redraw district lines an opportunistic power grab. Republicans supporting the redistricting push have openly said their aim is to give their party an advantage in the U.S. House of Representatives ahead of next year's election — but have also consistently stressed that their actions are legal.\nThose talking points were on full display again Friday on the Senate floor as the chamber debated the new map.\nState Sen. Phil King (R-Weatherford) carried the bill in the chamber and said that, while he had nothing to do with the way the map was drawn, he backed the legislation's redistricting objectives.\n\"I believe HB 4 meets the critically important goals of legality, of political performance for Republicans, and of improved compactness,\" King said.\nSenate Democrats leaned heavily into his first point: legality. Throughout the day, they argued the new congressional map wouldn't stand up to legal scrutiny because the way they're drawn would negatively impact and dilute the votes of Black and Hispanic Texans, especially in Houston.\nThat's where Democratic Congressman Al Green's district is located. Under the current maps he represents Texas' 9th Congressional District, a seat the Houstonian's held since 2005. But the new districts outlined in HB 4 have drawn Green out, moving him into District 18.\nOn the Senate floor Friday, Sen. Borris Miles (D-Houston) asked King if that was done in retaliation for Rep. Green's criticism of Trump, which included filing letters of impeachment against the president.\n\"Was the dismantling of CD 9 retribution for Congressman Green's fighting for civil rights for his constituents,\" Miles asked King.\n\"No, of course not,\" King said, reiterating that he had nothing to do with how the maps are drawn. \"It met with the goals that I had set for legislation. And I was also assured that it was legal in all regards.\"\nSen. Miles didn't buy it. He said he believes the maps are both illegal and designed with racial bias.\n\"I want you to know, I thoroughly disagree with you, because Congressional District 18 is more than packed,\" Miles said. \"Senate District 9 was cracked.\"\nSen. Judith Zaffirini of Laredo, the chamber's longest-tenured Democrat, told lawmakers there are multiple reasons they oppose the maps.\n\"It disregards the growth and diversity of our state,\" Zaffirini said. \"It further erodes the strength of minority districts, diminishing our ability to elect candidates of our choice and silencing voices that deserve to be heard.\"\nNext steps for the Texas Democratic Party\nAlthough the redistricting legislation has passed the Texas Legislature, the Texas Democratic Party said it isn't done fighting.\n\"The sooner we can get to court the better,\" Zaffirini said during the Senate debate.\nAt this point, that's the one defense that Democrats in the state have put forth in an attempt to stop the maps from taking effect.\nIf legal challenges are unsuccessful and Texas' maps do take effect ahead of the 2026 midterm election, Democrats nationally will be looking to California. If those maps are approved by voters, it'll give Democrats a chance to flip as many as five seats in the midterms.\nWhether or not Texas and California will be the only states to follow through with mid-decade congressional redistricting is unclear.\nThe idea has also been floated in Missouri, Ohio and Florida, among other states.\nCopyright 2025 KUT 90.5"
    },
    {
      "news_title": "Texas Legislature sends Trump-backed congressional redistricting plan to Gov. Abbott’s desk",
      "news_link": "https://www.texasstandard.org/stories/texas-redistricting-map-bill-passes-senate-legislature-congressional-abbott/",
      "bias": "Center",
      "text": "From The Texas Newsroom:\nThe Texas Senate gave final approval early Saturday to House Bill 4, the controversial redistricting bill that shifts the state’s congressional districts in Republican’s favor. The new map could give the GOP as many as five new seats in Congress after the 2026 midterm election.\nThe bill now heads to Gov. Greg Abbott’s desk for his signature.\nThe governor has been a fierce supporter of the unconventional mid-decade redistricting plan and directed state lawmakers to take it on last month when he officially announced Texas’ first special session.\nAbbott’s move came at the request of President Donald Trump and the Department of Justice.\nThe Senate’s Friday vote on HB 4 marks the end to a contentious month in Texas politics filled with protests, arrest threats and legislative deadlock — plus a persistent war of words and finger pointing between the state’s Republicans and Democrats.\nThe redistricting effort has drawn national attention, especially after a quorum-breaking walkout earlier this month by Texas House Democrats which left the chamber at a standstill.\nIt also sparked a reactive redistricting push from Democratic-led California, which passed its own new map this week designed to cancel out any Republican gains in Texas. California Gov. Gavin Newsom labeled his state’s effort a “fight to save democracy.” Voters there get a chance to approve those maps in a November election.\nTexas House Democrats returned to Austin on Monday. With a quorum back intact, the chamber quickly moved to take up redistricting legislation. House Bill 4 passed on Wednesday after eight hours of extensive debate in the House.\nThe state Senate’s debate on Friday lasted 14 hours from start to finish, and could’ve gone longer if Sen. Carol Alvarado (D-Houston) was able to carry out her plan to filibuster. Despite those efforts to stall final passage, the Senate passed HB 4 on a 18 – 8 vote around 12:40 am on Saturday.\nA key debate point for Texas Senators: Is this map legal?\nThroughout the state’s redistricting battle, Texas Democrats have called Republicans’ effort to redraw district lines an opportunistic power grab. Republicans supporting the redistricting push have openly said their aim is to give their party an advantage in the U.S. House of Representatives ahead of next year’s election — but have also consistently stressed that their actions are legal.\nThose talking points were on full display again Friday on the Senate floor as the chamber debated the new map."
    },
    {
      "news_title": "Texas Senate Passes Redistricting Map, Sends It to Governor",
      "news_link": "https://www.newsmax.com/politics/redistricting-texas-california/2025/08/23/id/1223629/",
      "bias": "Right",
      "text": "The Texas Senate gave final approval to a new, Republican-leaning congressional voting map early Saturday, sending it to Gov. Greg Abbott for his signature.\nPresident Donald Trump has pushed for the map to help the GOP maintain its slim majority in Congress in the 2026 midterm elections. It has five new districts that would favor Republicans.\nAbbott, a Republican, is expected to quickly sign it into law, though Democrats have vowed to challenge it in court.\nThe effort by Trump and Texas’ Republican-majority Legislature prompted state Democrats to hold a two-week walkout and kicked off a wave of redistricting efforts across the country.\nDemocrats had prepared for a final show of resistance, with plans to push the Senate vote into the early morning hours in a last-ditch attempt to delay passage.\nState Sen. Carol Alvarado, leader of the Senate Democratic caucus, announced on social media that she planned to filibuster the bill with a long speech and intended to speak for several hours. But just when she expected to start, the Senate broke for a long dinner break.\nWhen members returned, Alvarado never had a chance to filibuster because Republicans accused her of breaking a rule, saying she used a campaign email to promote her filibuster as fundraising.\nSen. Charles Perry said it “appears to be potentially unlawful, at least unethical, using state resources for a campaign purpose.”\nA spokesperson for Alvarado did not immediately respond to a request for comment.\nThe weekslong showdown has roiled the Texas Legislature, marked by a Democratic walkout and threats of arrest from Republicans. Much of the drama unfolded in the House, where the map ultimately passed Wednesday.\nDemocrats had already delayed the bill's passage during hours of debate, pressing Republican Sen. Phil King, the measure’s sponsor, on the proposal's legality, with many alleging that the redrawn districts violate the Voting Rights Act by diluting voters’ influence based on race.\nKing vehemently denied that accusation, saying, “I had two goals in mind: That all maps would be legal and would be better for Republican congressional candidates in Texas.”\n“There is extreme risk the Republican majority will be lost” in the House if the map does not pass, King said.\nThe showdown has also inflamed a broader, state-by-state redistricting battle, with governors from both parties pledging to redraw congressional maps.\nCalifornia Democrats approved legislation Thursday calling for a special election in November for residents to vote on a redrawn congressional map designed to help Democrats win five more House seats next year. Gov. Gavin Newsom quickly signed it.\n“This is not something six weeks ago that I ever imagined that I’d be doing,” Newsom said. “This is a reaction to an assault on our democracy in Texas.”\nCalifornia’s map needs voter approval because, unlike in Texas, a nonpartisan commission normally draws the map to avoid the sort of political battle that is playing out.\nOn Friday, Abbott called California’s redistricting “a joke” and asserted that Texas’ new map is constitutional but California’s would be overturned.\nOn a national level, the partisan makeup of existing districts puts Democrats within three seats of a majority. The incumbent president’s party usually loses seats in the midterms.\nThe Texas redraw is already reshaping the 2026 race, with Democratic Rep. Lloyd Doggett, the dean of the state's congressional delegation, announcing Thursday that he will not seek reelection to his Austin-based seat if the new map takes effect. Under the proposed map, Doggett's district would overlap with that of another Democratic incumbent, Rep. Greg Casar.\nThe president has pushed other Republican-controlled states including Indiana and Missouri, to also revise their maps to add more winnable GOP seats. Ohio Republicans were also already scheduled to revise their maps to make them more partisan.\n“Republicans are not finished in the United States,” Abbott said.\nRedistricting typically occurs once a decade, immediately after a census. While some states have their own limitations, there is no national impediment to a state trying to redraw districts in the middle of the decade.\nThe U.S. Supreme Court has said the Constitution does not outlaw partisan gerrymandering, only using race to redraw district lines.\nMore Democratic-run states have commission systems like California’s or other redistricting limits than Republican ones do, leaving the GOP with a freer hand to swiftly redraw maps. New York, for example, cannot draw new maps until 2028 — and even then, only with voter approval.\nRepublicans and some Democrats championed a 2008 ballot measure that established California’s nonpartisan redistricting commission, along with a 2010 one that extended its role to drawing congressional maps.\nBoth sides have shown concern over what the redistricting war could lead to.\nCalifornia Assemblyman James Gallagher, the Republican minority leader, said Trump was “wrong” to push for new Republican seats elsewhere. But he warned that Newsom’s approach, which the governor has dubbed “fight fire with fire,” is dangerous.\n“You move forward fighting fire with fire, and what happens?” Gallagher asked. “You burn it all down.”\nCopyright 2025 The Associated Press. All rights reserved. This material may not be published, broadcast, rewritten or redistributed without permission."
    },
    {
      "news_title": "Texas Senate Passes New Congressional Map, Sending Bill To Abbott’s Desk",
      "news_link": "https://www.forbes.com/sites/zacharyfolk/2025/08/23/texas-senate-passes-new-congressional-map-sending-bill-to-abbotts-desk/",
      "bias": "Center",
      "text": "Topline\nPresident Donald Trump celebrated a “HUGE VICTORY” after the Texas Senate passed a bill creating new congressional districts that could boost Republicans’s chances of midterm victory after a weeks-long battle — and a retaliatory effort by California Gov. Gavin Newsom to redraw his districts to favor Democrats.\nKey Facts\nThe Texas Senate voted 18-11 along party lines to approve the bill around 12:30 a.m. on Saturday morning, just days after the Texas House of Representatives approved the map on a similar 88-52 party line vote.\nThe bill will now go to Gov. Greg Abbott’s desk to sign into law, and the governor has previously expressed support for the redistricting effort.\n“The One Big Beautiful Map has passed the Senate,” Abbott said in a statement posted on social media, decrying the Democrats’ “petty stunts” and stating he would sign it into law.\nThe redrawn districts could help Republicans pick up as many as five more House seats in the 2026 midterm elections.\nState Sen. Phil King, a Republican who sponsored the bill, has repeatedly defended the new map as a means to improve “political performance” for his party, and claimed they had “no reason to look at racial data.”\nDemocrats are promising to further challenge the new map, with Rep. Gene Wu, the chair of the Texas House Democratic Caucus, insisting they are “not done fighting” and that the “next step is the courts.”\nThe quick passage comes only days after California’s legislature passed a bill that would seek approval for a new congressional map from voters in November, the first state leading the Democrats’ efforts to combat the Republicans’ redistricting.\nCrucial Quote\nTrump praised Texas Lt. Gov. Dan Patrick for role in passing the legislation, calling him “a terrific and powerful Lieutenant Governor for the Great State of Texas, a place I truly love” and crediting him with helping him win the state in past presidential primaries and elections. “Dan’s leadership was pivotal in the passage of the new, fair, and much improved, Congressional Map, that will give the wonderful people of Texas the tremendous opportunity to elect 5 new MAGA Republicans in the 2026 Midterm Elections — A HUGE VICTORY for our America First Agenda,” Trump wrote in a post on Truth Social.\nSurprising Fact\nState Sen. Carol Alvarado, a Democrat representing a district in Houston, planned to filibuster the bill and speak for hours to delay its passage. Republicans used a procedural maneuver, however, to block the filibuster. State Sen. Charles Perry accused Alvarado of violating rules by sending a fundraising email before the filibuster, the Washington Post reported. Republicans then quickly called for a vote, passing the bill around 12:30 a.m. “They created an excuse to shut it down,” Alvarado said in a video posted on social media. “What we have seen in this redistricting process has been maneuvers and mechanisms to shut down people’s voices,” she continued.\nKey Background\nStates typically redraw their congressional districts every 10 years after the census. However, Texas Republicans, who control majorities in the state legislature and the governorship, made the rare choice to pursue mid-decade redistricting after pressure from President Donald Trump in an effort to help Republicans maintain their razor-thin majority in the House of Representatives. In response, Texas Democrats fled the state to deny Republicans quorum in the legislature, effectively freezing the redistricting efforts for weeks. The Democrats accrued fines and faced legal pressure from Republicans before returning last week."
    },
    {
      "news_title": "Texas lawmakers send the governor a new congressional map that favors Republicans",
      "news_link": "https://www.votebeat.org/texas/2025/08/23/republicans-house-congressional-map-mid-decade-redistricting-alvarado/",
      "bias": "Center",
      "text": "Votebeat is a nonprofit news organization reporting on voting access and election administration across the U.S. Sign up for Votebeat Texas’ free newsletter here.\nThis story was first published by The Texas Tribune, a nonprofit, nonpartisan media organization that informs Texans — and engages with them — about public policy, politics, government and statewide issues.\nThe Texas Senate early Saturday morning approved a new congressional map gerrymandered to maximize Republican representation, sending the plan to the governor’s desk after weeks of intense partisan clashing.\nRepublican lawmakers pushed the plan through over fierce Democratic opposition, launching a national redistricting war from Albany to Sacramento while positioning the GOP to net up to five additional seats in Texas.\nThe Senate adopted the new lines on a party-line vote, 18 to 11, just after 12:30 a.m. Saturday following more than eight hours of at times tense debate.\nSen. Carol Alvarado, D-Houston, had planned to filibuster the map well into Saturday as a last stand against the effort, but a rare procedural motion by Senate Republicans just after midnight ended the debate and killed the filibuster, moving the chamber straight on to the final vote. Some observers in the gallery were removed for shouting “shame,” and “fascist,” shortly after the vote.\nThe map, demanded by President Donald Trump to fortify the GOP’s U.S. House majority in next year’s midterm election, hands up to five additional U.S. House seats to Republicans by dismantling Democratic bastions around Austin, Dallas and Houston, and by making two Democrat-held seats in South Texas redder. The new lines also keep all 25 seats already held by Republicans safely red.\nThe plan “meets the critically important goals of legality, of political performance for Republicans and of improved compactness,” said Sen. Phil King, R-Weatherford and House Bill 4’s sponsor, while repeatedly insisting under questioning from Democrats that he did not consider racial population data in his role shepherding the map through the upper chamber.\nThe pickups are meant to help the GOP hold onto its razor-thin congressional majority in a midterm election year that is expected to favor Democrats — potentially making the difference between a continued Republican trifecta in Washington, or a divided government with one chamber intent on investigating Trump and bottlenecking his agenda.\nThat has put Texas lawmakers at the front lines of an issue with national stakes. Republicans earned kudos from Trump for pushing the new boundaries through the state House, while Democrats won support from national party figures, including former President Barack Obama, Democratic National Committee Chair Ken Martin and U.S. House Minority Leader Hakeem Jeffries of New York.\nIn his closing statement, King made clear that the case for the map rested purely on maintaining Republican control of the federal government — and that if Texas did not push the gerrymander through, the GOP would likely lose control of the U.S. House in next year’s midterm election.\nThe “amazing progress that’s been made in just eight months — all of this will end if the Republicans lose the Congress,” King said after citing a list of policy achievements he attributed to a Republican trifecta. “I’m convinced that if Texas does not take this action, there is an extreme risk that that Republican majority will be lost. If it does, the next two years after the midterm, there will be nothing but inquisitions and impeachments and humiliation for our country.”\nRepublicans justify a partisan gerrymander as legal\nThough congressional lines are typically redrawn once every 10 years following the decennial census, Republicans justified the aggressive and unusual move to do so in the middle of the decade by saying it was legal to craft new boundaries at any point and for purely partisan gain. They also pointed to the party’s margins of victory in 2024 and the need to counter blue-state gerrymandering to further support their push.\nThe U.S. Supreme Court ruled in 2019 that states can draw electoral maps on partisan grounds. But under Section 2 of the Voting Rights Act, the lines cannot diminish people’s voting power based on race.\nDemocrats argued that the new map increased Republicans’ advantage by unconstitutionally suppressing the vote of Black and Latino Texans. They framed the push as a power grab by Trump meant to stack the deck in next year’s election.\n“Today, the majority will prevail, but the rights of minorities were ignored, outnumbered, outvoted and outgunned,” said Sen. Judith Zaffirini, D-Laredo and dean of the Senate. “Democrats will go down fighting, having used every available legislative tool. My prayer is that the pendulum will swing sooner rather than later, and that when it does, Democrats will respect all minorities, including political.”\nTexas’ approval of the map has set off a tit-for-tat redistricting push in California, where Gov. Gavin Newsom has proposed a map voters would have to approve that could yield five new Democratic-leaning seats, effectively offsetting GOP gains in Texas. Other blue-state governors and national Democratic leaders are backing retaliatory gerrymandering as the Trump administration also pushes GOP-controlled Florida, Indiana, Missouri and Ohio to draw more red seats.\nDemocratic plan for filibuster falls through\nAlvarado, with assistance from other Senate Democrats, had planned to filibuster the map Friday, donning sneakers and receiving a catheter in preparation. Sen. Sarah Eckhardt, D-Austin, had compiled over 12 hours of testimony from constituents on the map to read from during the marathon speech.\nBut after a three-hour dinner break called by Lt. Gov. Dan Patrick and objected to by Democrats, Republicans returned late Friday night with a procedural motion up their sleeves. Sen. Charles Perry, R-Lubbock, moved to cut off debate early. He cited a campaign email Alvarado sent out promoting the filibuster Friday afternoon, calling it “potentially unlawful,” and “at least unethical,” for ostensibly using state resources, such as staff and Capitol facilities, for fundraising purposes.\n“It’s disrespectful. It violates the decorum of the Senate, and personally, I’m offended by it,” Perry said. All Republicans signed on to the motion.\nDemocrats condemned the explanation as an excuse to kill the filibuster and move the vote along, noting that senators routinely drew from their legislative work in their fundraising campaigns and that lawmakers were not under a fundraising moratorium as they are during the regular session.\n“When they do it, it seems to be fair game, and when other people do it, then it’s a gotcha,” Alvarado said after the vote. “It was a mechanism to shut down the discussion, the debate on this issue.”\nRepublicans dragged Democrats back for special session\nThe filibuster would have delayed the map’s passage, but almost certainly would not have blocked it. Alvarado would have to had to sustain the filibuster for three weeks straight to run out the clock on the Legislature’s special session.\nThe new Texas map cleared its biggest hurdle Wednesday when, after more than eight hours of tense debate, the state House adopted the plan along party lines.\nLacking the votes to stop the map in the GOP-dominated Texas Legislature, more than 50 House Democrats staged a two-week walkout earlier this month, grinding the lower chamber to a halt by denying the quorum needed to conduct business.\nRepublicans unleashed an unprecedented response to drag them back to Texas, issuing civil arrest warrants, asking a court to extradite them from Illinois, seeking to declare over a dozen Democrats’ seats vacant and clamoring for legislative punishments upon their return.\nAfter most Democratic lawmakers returned to Austin Monday, Republican Speaker Dustin Burrows, seeking to maintain a quorum, required each of them to agree to a police escort to leave the Capitol building. Rep. Nicole Collier, D-Fort Worth, refused and was confined to the Capitol for the next 54 hours, prompting a national media frenzy.\nDemocrats portrayed the walkout as a victory for sparking a national movement in support of retaliatory redistricting, and as just the first part of a longer fight against the map. In the House on Wednesday, Democratic lawmakers pressed their Republican colleagues on the plan’s impact on voters of color, working to establish a record they could use in a legal challenge seeking to kill the lines before next year’s election.\n“This fight is far from over,” Rep. Gene Wu of Houston, chair of the House Democratic Caucus, said after the map’s passage in the lower chamber. “Our best shot is in the courts. This part of the fight is over, but it is merely the first chapter.”"
    },
    {
      "news_title": "DCCC Chair Statement on Texas Adopting New Gerrymandered Congressional Map",
      "news_link": "https://dccc.org/dccc-chair-statement-on-texas-adopting-new-gerrymandered-congressional-map/",
      "bias": "Lean Left",
      "text": "Following the formal adoption by the Texas legislature of a new gerrymandered map, DCCC Chair Suzan DelBene released the following statement:\n“Because of this unprovoked, unwarranted Texas gerrymander, we are seeing Democrats around the country respond and fight back to make sure DC Republicans cannot steal the House Majority. I applaud the Texas Democratic lawmakers who have been at the forefront of this fight and inspired people across the country to stand up and fight back against Republicans’ shameful attempt to cling onto power. Today is not the final word on this gerrymandered map, and the fight to preserve equal and fair representation for everyone in Texas shall continue in the courts.\n“Republicans know they are poised to lose the majority next year because of their disastrous record: as prices continue to rise, Americans see that, under Republican leadership, only the wealthiest few are prioritized. House Democrats are ready for the fight ahead and will take back the majority in 2026.”"
    },
    {
      "news_title": "Texas House approves new congressional map",
      "news_link": "https://helenair.com/article_3d9ba7d1-edf5-5c34-8410-77c36a36096a.html",
      "bias": "Center",
      "text": "AUSTIN, Texas — The Texas House approved a redrawn congressional map Wednesday that would give Republicans a bigger edge in 2026, muscling through a partisan gerrymander that launched weeks of protests by Democrats and a widening national battle over redistricting.\nPresident Donald Trump pushed for the mid-decade revision of congressional maps to give his party a better chance at holding on to the U.S. House of Representatives in the 2026 elections.\nThe approval of the Texas maps on an 88-52 party-line vote is likely to prompt California's Democratic-controlled state Legislature this week to approve of a new House map creating five new Democratic-leaning districts.\nFRAUD CASE: A New York appeals court on Thursday threw out the massive financial penalty a state judge imposed on President Donald Trump but narrowly upheld a finding that he engaged in fraud by exaggerating his wealth for decades. The ruling bans him and his two eldest sons from serving in corporate leadership for a few years.\nFEDERAL RESERVE: President Donald Trump called on Federal Reserve governor Lisa Cook to resign Wednesday after a member of his administration accused Cook of committing mortgage fraud, in another eff ort to gain control over the central bank.\nEPSTEIN: A federal judge rejected the Trump administration's request to unseal grand jury transcripts from late financier Jeff rey Epstein's sex trafficking case Wednesday, joining two other judges in denying the public release of material from the probes."
    },
    {
      "news_title": "Texas Senate Passes Big Beautiful Congressional Redistricting Map After 8-Hour Debate",
      "news_link": "https://www.breitbart.com/border/2025/08/23/texas-senate-passes-big-beautiful-congressional-redistricting-map-after-8-hour-debate/",
      "bias": "Right",
      "text": "The Texas Senate passed the “Big Beautiful Map” shortly after midnight Saturday morning. The party-line vote to approve the map came after a planned filibuster by Senator Carol Alvarado (D-Houston) was canceled by Republican senators using a parliamentary procedure.\nThe Texas Senate voted 18-11 to pass the Senate bill authorizing a new mid-census congressional redistricting map. The vote took place at 12:30 a.m. on Saturday, following more than eight hours of debate. Senator Alvarado announced plans to filibuster the bill and continue the debate well into Saturday. Her plans were cut short when the Senate Republican Caucus discovered Alvarado planned to use the filibuster as a fund-raising gimmick.\nIn a letter to Lt. Governor Dan Patrick (R), Alvarado described the bill as an “extraordinary attempt to redraw the lines in the middle of the decade.” She said the bill would create a “dangerous precedent where politicians could redraw maps to pick their voters before every election.”\n“I intend to use every procedural tool available under Senate rules” to oppose the bill.\nApparently, according to the New York Post, Alvarado also planned to use a catheter and a urine bag to assist her in carrying out the extended filibuster.\nShortly before Alvarado was to begin her debate, the Senate announced a long break for dinner.\nRELATED ARTICLES:\n- Texas House Democrats Flee State in Order to Block GOP Redistricting Plan\n- Gov. Abbott to Texas House Dems: Show Up to Work Monday or Be Fired\n- Gov. Abbott Orders Arrest of Texas’s ‘Delinquent House Democrats’\n- Texas Governor Orders Criminal Investigation of House Democrats for Possible Bribery Charges\n- FBI Asked to Assist Texas Authorities in Locating, Arresting Texas House Dems Who Fled the State\n- More than Four Dozen Texas House Democrats Fled the State\n- Abbott Files Lawsuit to Start Removal ‘Derelict Democrat Texas House Members’ Who Fled State to Block Redistricting Bill\n- Texas AG Launches Investigation into Beto O’Rourke’s Political Group’s Financial Support of Quorum-Breaking Democrats\n- NO QUORUM: House Speaker Hits Fleeing Texas Dems in Pocketbook, Paychecks Held at Capitol, Budgets Cut\n- Texas Court Blocks ‘Beto Bribes’ Supporting Runaway House Democrats — O’Rourke Loses Again\n- Governor Abbott Delivers George Strait Checks to Texas Flood Victims Ignored by Fleeing House Democrats\n- Gerrymandering by the Numbers: Democrat-Run State Congressional Maps Disenfranchise Republican Voters\n- Report: Texas Democrat Fugitives Concede, Will Return to Austin\n- Texas Democrat Rep. Locks Self in House Chamber After Refusing Police Escort\n- Texas House Passes One Big Beautiful Congressional Redistricting Map\n- Gavin Newsom Signs Gerrymandering Bills; California Moves BEFORE Texas\n- REPORT: Runaway Texas Democrats Fined $9K for Quorum-Busting Stunt\nHer plans came to an abrupt end when Republicans discovered an Alvarado campaign email promoting “her filibuster as a fundraising opportunity,” the Senate Republican Caucus wrote in a statement Saturday morning.\nThe Republican senators said Alvarado’s campaign email violated the “long-standing traditions, ethics, and decorum of the Texas Senate.” The senators seized the opportunity to exercise a parliamentary procedure by “calling the question,” forcing a vote on the measure.\n“Shutting down a filibuster over a fundraising email is unprecedented,” Democratic Sen. Sarah Eckhardt (D-Bastrop) said in a post on social media. “It exposes the hypocrisy of Republicans, who will turn around and raise millions off stealing Texans’ votes while silencing their voices.”\nRepublicans responded, writing:\nUsing the Senators, the employees, and support resources to bolster Sen. Alvarado’s fundraising activities effectively holds hostage the entire Senate and forces emplaoyees to assist and participate in her campaign. Every other Senate member and each employee is a ‘prop’ to support Sen. Alavarado’s campaign.\nGiven this unprededented situation, as the Republican Caucus, we move to call the previous question and end this political debate.\nThe Republican senators also claimed that Alavarado’s filibuster and fundraising campaign would appear to be “unlawfully and unethiclally using state resources for a campaign purpose.”\nAs the vote was called, 18 Republicans voted yea and 11 Democrats voted nay.\nThe Texas House passed the redistricting map earlier this week on a partisan vote of 88-52.\nThe measure now proceeds to Governor Greg Abbott for signature into law.\nAbbott responded to the passage, writing, “The One Big Beautiful Map has passed the Senate and is on its way to my desk, where it will be swiftly signed into law. I promised we would get this done, and delivered on that promise. I thank Lieutenant Governor Dan Patrick for leading the passage in the Senate of a bill that ensures our maps reflect Texans’ voting preferences.”\nBob Price is the Breitbart Texas-Border team’s associate editor and senior news contributor. He is an original member of the Breitbart Texas team. Price is a regular panelist on Fox 26 Houston’s What’s Your Point? Sunday morning talk show. He is a U.S. Air Force veteran and serves as president of Blue Wonder Gun Care Products.\nCOMMENTS\nPlease let us know if you're having issues with commenting."
    },
    {
      "news_title": "Texas Senate approves new map, sending it to Abbott’s desk",
      "news_link": "https://thehill.com/homenews/campaign/5464117-texas-senate-approves-gop-redistricting-map/",
      "bias": "Center",
      "text": null
    },
    {
      "news_title": "Can Trump and the GOP keep a grip on power? A fully MAGA party prepares for 2026",
      "news_link": "https://www.usatoday.com/story/news/politics/2025/08/23/trump-republicans-midterms-redistricting/85769182007/",
      "bias": "Lean Left",
      "text": "Can Trump and the GOP keep a grip on power? A fully MAGA party prepares for 2026\nTrump is laying down an aggressive midterm strategy, and the GOP is gearing up to follow his lead with a new Republican National Committee chair.\nATLANTA — The Georgia Suite sits on the 68th floor of this city's towering Westin hotel downtown, with floor-to-ceiling windows showcasing skyscrapers and city views. From that high perch, the new chair of the Republican National Committee contemplated the high stakes of the 2026 election.\nIf Democrats win back control of Congress, Donald Trump’s presidency “is basically over,” RNC Chair Joe Gruters, 48, an early Trump backer from Florida, told USA TODAY. Although Trump's approval rating has fallen, it's still unclear whether Democrats can muster up enough support to re-take Congress.\nGruters and others are taking no chances.\nHe and the nation's top Republican leaders have been fanning out across a cavernous Atlanta hotel this week, putting more meat on the bones for their next nationwide campaign plan. While Trump may be term-limited, the president is also right there working to ensure his party remains in power and that Democrats don't win subpoena power to launch investigations or try for a third impeachment against him.\nTrump has urged GOP states to redistrict to create more Republican-leaning House seats. He has trumpeted a possible executive order to curtail mail-in ballots. He is laying down an aggressive midterm strategy, and Republicans are gearing up to follow his lead.\n“The president’s committed to winning,” Gruters said. “The party’s committed to winning.\"\nTheir early maneuvering has Democrats crying foul, while also trying to keep up as the 2026 chessboard rapidly gets rearranged.\n\"Trump has come to terms with the fact that he and his goons are going to get their (expletive) handed to them in the 2026 midterms, so they're doing everything they can to rig the system,\" Texas Democratic Party Chair Kendall Scudder told USA TODAY as Republicans in his state advanced a new House map this week. California Democrats then quickly moved forward with their own redrawn House map to counter Texas.\nRNC members at the party's summer meeting told USA TODAY that Trump is right to push a rare mid-decade redistricting. They staunchly defended the president's agenda in the face of polling showing aspects of it are unpopular, and they dug in on a full throttle MAGA midterm message led by the president’s handpicked RNC chair.\n“I’m a true believer that he is an agent of change,” said Gruters, a former Florida GOP chair who co-chaired the president's Florida campaign efforts in 2016.\nRiding the Trump train into 2026\nRepublicans from across the country gathered at the downtown Westin for campaign strategy sessions, a pep talk from Vice President JD Vance on Aug. 21 and to anoint Gruters as the new RNC chair on Aug. 22.\nThe confab brought blue state, red state and swing state GOP leaders together. They face different midterm equations, from the feasibility of redistricting to the level of competitive races, but were unified in one message: Trump is delivering on his promises, the party is fully behind his agenda and it’s the Democrats who are extreme.\n“It’s nothing short of remarkable what the president has been able to accomplish in such a short time,” said New Hampshire GOP National Committeewoman Mary Jane Beauregard.\nDemocrats say Trump has pushed radical policies and is a budding authoritarian.\nThe opening stretch of Trump’s second term has pushed the limits of executive power as he works to overhaul the federal government, universities and leading cultural institutions. It has been marked by a disruptive trade agenda, punishment of perceived adversaries and a massive deportation effort that has been challenged by civil liberties advocates.\nBeauregard said the president’s policies are “common sense” and will appeal to moderates, adding his record is “going to help us in the midterms.” She pointed to Trump’s positions on immigration and transgender athletes.\nTrump has emphasized cultural issues to portray Democrats as out of touch with voters, and RNC members said that will continue to be an effective strategy.\nMichigan GOP Chair Jim Runestad said Trump’s executive orders targeting “a lot of this woke stuff” have been a highlight of his second term and a record to run on.\nGirding for battle\nRunestad was meeting with RNC staff in Atlanta to game out everything from where to locate GOP campaign offices to voter outreach and data analysis.\nMichigan has a number of competitive races that could help determine control of Congress. Trump carried the state in 2024. Runestad said the challenge will be to get his voters to turn out for the midterms.\n“I’m not saying that’s going to be easy, that’s going to be a yeoman’s job,” he said.\nThe party in power typically loses congressional seats in the midterms, but Trump’s aggressive agenda is turbocharging the opposition, which sees an opportunity in his sagging poll numbers to at least win the House and check his presidency.\nFlorida model\nA Pew Research Center survey released this month found just 38% of Americans approve of the job Trump’s doing, down 9 points from right after his inauguration.\nTrump’s tariffs are opposed by 61% of U.S. adults. A majority think the president is hurting how the federal government functions, and more people oppose his signature legislative achievement – dubbed the “One Big Beautiful Bill” – than support it, according to the Pew survey.\nRecent economic reports also show inflation creeping back up and job growth slowing, presenting more potential challenges for the party in power.\nRepublicans believe Trump’s new law, which cuts taxes and programs such as Medicaid, will eventually gain in popularity as they ramp up to sell it, which Vance did with an event in Georgia on Aug. 21.\n“As people understand what’s in it, they’re going to be a lot happier,” said Florida GOP Chair Evan Power.\nYet even as the party argues that Trump’s agenda will prove a winning formula, GOP leaders are maneuvering to improve their midterm chances through efforts such as redistricting.\nMissouri and Florida are among the GOP-controlled states contemplating joining Texas in drawing more Republican-leaning House seats.\n“It’s our turn,” David Lightner, a Republican national committeeman from Missouri, said of redistricting, adding: “The strongest will survive, and I think we feel strong right now.”\nPower said a Florida redistricting push backed by Gov. Ron DeSantis could create up to four more GOP-leaning seats. Like many Republicans, he countered criticism of the effort by arguing that Democrats have engaged in their own gerrymandering, the drawing of seats for political gain.\nFlorida has been at the forefront of much of what the GOP is focused on for the 2026 cycle.\nThe Republican-controlled Legislature drew new GOP seats during the last redistricting and has pushed through multiple changes to election laws that put new restrictions on voting. Meanwhile, Florida has shifted from purple to solidly red thanks in part to a strong voter registration push by the Florida GOP that erased a Democratic registration advantage. The state’s voting restrictions are in line with an “election integrity” push by the RNC largely centered around legal actions, which will remain a top priority, Gruters said.\nFlorida’s shift from a swing state to a red state – Trump carried Florida by 3.3 points in 2020 and 13.1 in 2024 – occurred when Gruters was the chair of the Florida GOP and is partly, he said, why the president tapped him to lead the national party."
    },
    {
      "news_title": "Texas senate approves redrawn congressional map favoring GOP, sends to governor",
      "news_link": "https://www.wtae.com/article/texas-senate-approves-redrawn-congressional-map/65876845",
      "bias": "Center",
      "text": "Texas lawmakers give final approval to redrawn congressional map favoring GOP, send to governor\nThe Texas Senate gave final approval to a new, Republican-leaning congressional voting map early Saturday, sending it to Gov. Greg Abbott for his signature.\nPresident Donald Trump has pushed for the map to help the GOP maintain its slim majority in Congress in the 2026 midterm elections. It has five new districts that would favor Republicans.\nAbbott, a Republican, is expected to quickly sign it into law, though Democrats have vowed to challenge it in court.\nThe effort by Trump and Texas’ Republican-majority Legislature prompted state Democrats to hold a two-week walkout and kicked off a wave of redistricting efforts across the country.\nDemocrats had prepared for a final show of resistance, with plans to push the Senate vote into the early morning hours in a last-ditch attempt to delay passage.\nState Sen. Carol Alvarado, leader of the Senate Democratic caucus, announced on social media that she planned to filibuster the bill with a long speech and intended to speak for several hours. But just when she expected to start, the Senate broke for a long dinner break.\nWhen members returned, Alvarado never had a chance to filibuster because Republicans accused her of breaking Senate rules by attempting to fundraise off the coming filibuster.\nSen. Charles Perry said it “appears to be potentially unlawful, at least unethical, using state resources for a campaign purpose.”\nA spokesperson for Alvarado did not immediately respond to an email and phone call from The Associated Press.\n“Shutting down a filibuster over a fundraising email is unprecedented,” Democratic Sen. Sarah Eckhardt said in a post on social media platform X. “It exposes the hypocrisy of Republicans, who will turn around and raise millions off stealing Texans’ votes while silencing their voices.”\nThe weekslong showdown has roiled the Texas Legislature, marked by a Democratic walkout and threats of arrest from Republicans. Much of the drama unfolded in the House, where the map ultimately passed Wednesday.\nDemocrats had already delayed the bill's passage during hours of debate, pressing Republican Sen. Phil King, the measure’s sponsor, on the proposal's legality, with many alleging that the redrawn districts violate the Voting Rights Act by diluting voters’ influence based on race.\nKing vehemently denied that accusation, saying, “I had two goals in mind: That all maps would be legal and would be better for Republican congressional candidates in Texas.”\n“There is extreme risk the Republican majority will be lost” in the House if the map does not pass, King said.\nThe showdown has also inflamed a broader, state-by-state redistricting battle, with governors from both parties pledging to redraw congressional maps.\nCalifornia Democrats approved legislation Thursday calling for a special election in November for residents to vote on a redrawn congressional map designed to help Democrats win five more House seats next year. Gov. Gavin Newsom quickly signed it.\n“This is not something six weeks ago that I ever imagined that I’d be doing,” Newsom said. “This is a reaction to an assault on our democracy in Texas.”\nCalifornia’s map needs voter approval because, unlike in Texas, a nonpartisan commission normally draws the map to avoid the sort of political battle that is playing out.\nOn Friday, Abbott called California’s redistricting “a joke” and asserted that Texas’ new map is constitutional but California’s would be overturned.\nBattle for the House waged via redistricting\nOn a national level, the partisan makeup of existing districts puts Democrats within three seats of a majority. The incumbent president’s party usually loses seats in the midterms.\nThe Texas redraw is already reshaping the 2026 race, with Democratic Rep. Lloyd Doggett, the dean of the state's congressional delegation, announcing Thursday that he will not seek reelection to his Austin-based seat if the new map takes effect. Under the proposed map, Doggett's district would overlap with that of another Democratic incumbent, Rep. Greg Casar.\nThe president has pushed other Republican-controlled states, including Indiana and Missouri, to also revise their maps to add more winnable GOP seats. Ohio Republicans were also already scheduled to revise their maps to make them more partisan.\n“Republicans are not finished in the United States,” Abbott said.\nRedistricting typically occurs once a decade, immediately after a census. While some states have their own limitations, there is no national impediment to a state trying to redraw districts in the middle of the decade.\nThe U.S. Supreme Court has said the Constitution does not outlaw partisan gerrymandering, only using race to redraw district lines.\n‘Fight fire with fire’\nMore Democratic-run states have commission systems like California’s or other redistricting limits than Republican ones do, leaving the GOP with a freer hand to swiftly redraw maps. New York, for example, cannot draw new maps until 2028, and even then, only with voter approval.\nRepublicans and some Democrats championed a 2008 ballot measure that established California’s nonpartisan redistricting commission, along with a 2010 one that extended its role to drawing congressional maps.\nBoth sides have shown concern over what the redistricting war could lead to.\nCalifornia Assemblyman James Gallagher, the Republican minority leader, said Trump was “wrong” to push for new Republican seats elsewhere. But he warned that Newsom’s approach, which the governor has dubbed “fight fire with fire,” is dangerous.\n“You move forward fighting fire with fire, and what happens?” Gallagher asked. “You burn it all down.”\nCappelletti reported from Washington and Golden from Seattle."
    },
    {
      "news_title": "Texas Senate approves redrawn congressional map favouring Republicans",
      "news_link": "https://www.aljazeera.com/news/2025/8/23/texas-senate-approves-redrawn-congressional-map-favouring-republicans",
      "bias": "Lean Left",
      "text": "Texas Senate approves redrawn congressional map favouring Republicans\nGovernor Greg Abbott is expected to quickly sign it into law, though Democrats have vowed to challenge it in court.\nThe Texas Senate has given final approval to a new Republican-leaning congressional voting map, sending it to Governor Greg Abbott for his signature.\nThe state senate voted along party lines to pass the map 18-11 shortly after midnight on Saturday, following more than eight hours of heated debate.\nRecommended Stories\nlist of 4 itemsUS lawmakers approve Democrat redistricting plan in California\nWhat’s the Texas redistricting fight about, and how has California reacted?\nUS court blocks Texas law requiring Ten Commandments in school classrooms\nPresident Donald Trump has pushed for the map to help the GOP maintain its slim majority in Congress in the 2026 midterm elections. It has five new districts that would favour Republicans.\nAbbott, a Republican, is expected to quickly sign it into law, though Democrats have promised to challenge it in court.\nThe effort by Trump and Texas’s Republican-majority legislature prompted state Democrats to hold a two-week walkout and kicked off a wave of redistricting efforts across the country.\nThe weeks-long showdown has roiled the Texas Legislature. Much of the drama unfolded in the House, where the map ultimately passed on Wednesday.\nThe showdown has also inflamed a broader, state-by-state redistricting battle, with governors from both parties pledging to redraw congressional maps.\nCalifornia Democrats approved legislation on Thursday calling for a special election in November for residents to vote on a redrawn congressional map designed to help Democrats win five more House seats next year. Governor Gavin Newsom quickly signed it.\nCalifornia’s map needs voter approval because, unlike in Texas, a nonpartisan commission normally draws the map to avoid the sort of political battle that is playing out.\nOn Friday, Abbott called California’s redistricting “a joke” and asserted that Texas’s new map is constitutional but California’s would be overturned.\nTrump wants more states to revise maps\nOn a national level, the partisan makeup of existing districts puts Democrats within three seats of a majority. The incumbent president’s party usually loses seats in the midterms.\nThe Texas redraw is already reshaping the 2026 race, with Democratic Representative Lloyd Doggett, the dean of the state’s congressional delegation, announcing on Thursday that he will not seek re-election to his Austin-based seat if the new map takes effect.\nUnder the proposed map, Doggett’s district would overlap with that of another Democratic incumbent, Republican Greg Casar.\nTrump has pushed other Republican-controlled states, including Indiana and Missouri, to also revise their maps to add more winnable GOP seats.\nOhio Republicans were also already scheduled to revise their maps to make them more partisan.\nRedistricting typically occurs once a decade, immediately after a census. While some states have their own limitations, there is no national impediment to a state trying to redraw districts in the middle of the decade.\nThe US Supreme Court has said the Constitution does not outlaw partisan gerrymandering, only using race to redraw district lines."
    },
    {
      "news_title": "Week in Politics: Trump and Putin; possible rate cuts; lawmakers and redistricting",
      "news_link": "https://www.npr.org/2025/08/23/nx-s1-5509911/week-in-politics-trump-and-putin-possible-rate-cuts-lawmakers-and-redistricting",
      "bias": "Lean Left",
      "text": "Week in Politics: Trump and Putin; possible rate cuts; lawmakers and redistricting\nWeek in Politics: Trump and Putin; possible rate cuts; lawmakers and redistricting\nWe discuss the latest political developments, including President Trump's crackdown in Wahington, D.C., and redistricting efforts in Texas and California.\nSCOTT SIMON, HOST:\nPresident Trump continued his attacks on the Federal Reserve this week for not lowering interest rates. Then yesterday, the Fed chair, Jerome Powell, said a possible cut might be in the offing. We're joined now by NPR's Ron Elving. Ron, thanks so much for being with us.\nRON ELVING, BYLINE: Good to be with you, Scott.\nSIMON: Just the hint of that possibility sent up the stock market. Is it potentially good news for the economy?\nELVING: Well, a lot of investors surely think so, or at least they think a lot of other investors will think so, and stock prices will therefore rise. And they certainly spiked yesterday. But it's good to remember that Powell was teasing a possible rate cut because he says he sees potential weakness in the economy. A softer labor market, among other things. He also worried out loud about stubborn inflation and the impact of tariffs. But he does not want his tight money policy to tip the economy into recession. So much depends on what the numbers say in September. If Powell sees the tariffs driving up inflation more than he expected, he could pull back on the rate cut. But if he likes the trends in a month, he can make a modest cut and hint at more to come. A rate cut of any size would be a trophy for Trump and his high-pressure style of governing.\nSIMON: Republican lawmakers in Texas have voted to redraw congressional maps to try to boost the party's electoral odds. Democrats in California have retaliated, starting down the same kind of path. Now Missouri, Indiana, other states contemplating the same. Is there a gerrymandering arms race going on?\nELVING: Oh, it's on. Trump is letting the red states know he expects them to report for duty. He wants them to lay claim to some swing district seats in the House that, in a midterm year, like next year, might well vote against the party in the White House. And if it's an arms race, the Republicans are better armed. There are more states where they control the governorship and the legislature. So if it's going to be an all-out war with everybody pushing super-partisan mapping to the max, the likely winners, at least in the short run, would be Republicans.\nThe losers, once again, are the voters in all the districts where they thought they'd be able to cast a meaningful vote for Congress in a competitive race. It's obviously not good for democracy. It's an abuse of power, but it's been practiced by both parties back to the 1700s. It was greatly enhanced, of course, by modern computing and contemporary data applications. So we see the newest tech serving the oldest of political motives.\nSIMON: Ron, the week began with the hopes for peace between Russia and Ukraine. Trump has now set a new two-week deadline. Closer to any kind of agreement, do you think?\nELVING: One hates to say no, after all the effort that's been made, after all the show of unity by the European allies. But it's hard to see what's brought peace any closer this month or might do so in Trump's latest two-week window. Trump dropped his demand for a ceasefire as a precondition for a deal. Putin gave up. Well, Putin gave up what? He has yet to commit even to a meeting with Ukrainian President Zelenskyy. Putin continues to bomb Ukraine's cities and the people who live there. He continues to insist that Ukraine give up land seized by the Russian army and maybe more besides.\nAnd where is Trump in all this? It seems clear that he does want peace to happen for the combatants and for his own legacy. But do the Russians? Trump needs a tool or a tactic to turn Putin around. And unless he's willing to commit U.S. forces, he has to fall back on more economic sanctions. And when he's threatened tougher economic measures of late, he's backed off again. So the present moment has to be very discouraging for Ukraine and its defenders.\nSIMON: District of Columbia, the troop deployments going into its third week. The president says he'll ask Congress for more money for upgrades in the city. Says it'll be maxed out in terms of beauty. Is this going to happen in other cities?\nELVING: Well, we're not sure yet it's going to happen in D.C. for starters. But if it does, it will surely tempt Trump to take on the larger constitutional and political problems of taking over cities that are in states that are not as subject to federal orders as D.C. This city is a unique situation. As for maxing out on beauty, perhaps the model here would be the new Oval Office. This may be the ultimate case of beauty being in the eye of the beholder.\nSIMON: NPR's Ron Elving. Thanks so much.\nELVING: Thank you, Scott.\nCopyright © 2025 NPR. All rights reserved. Visit our website terms of use and permissions pages at www.npr.org for further information.\nAccuracy and availability of NPR transcripts may vary. Transcript text may be revised to correct errors or match updates to audio. Audio on npr.org may be edited after its original broadcast or publication. The authoritative record of NPR’s programming is the audio record."
    },
    {
      "news_title": "Texas Senate Passes GOP Congressional Redistricting Map 2025: Republicans Expect to Gain 5 House Seats",
      "news_link": "https://coveringkaty.com/texas-senate-passes-gop-congressional-redistricting-map-2025/",
      "bias": "Center",
      "text": "AUSTIN, Texas (Covering Katy News) – In the early hours of Saturday morning, the Texas Senate gave final approval to a controversial congressional redistricting map aimed at strengthening Republican control, concluding weeks of heated political battles and advancing the GOP redistricting legislation to Governor Greg Abbott for his expected signature.\nThe Texas redistricting measure passed along strict party lines despite vigorous Democratic resistance. Following more than eight hours of sometimes heated floor discussion, senators voted 18-11 to adopt the new district boundaries shortly after 12:30 a.m. on Saturday.\nDemocratic Senator Carol Alvarado of Houston had intended to mount an extended filibuster through Saturday morning in a final attempt to block the redistricting effort. However, Senate Republicans employed an unusual procedural maneuver just past midnight that cut off debate and prevented the filibuster, forcing an immediate vote on the proposal. Democrat supporting Gallery spectators were escorted out after shouting \"shame,\" and \"fascist,\" following the final tally.\nThe redistricting effort faced significant Democratic resistance, with most of the Texas House's 62 Democrats fleeing the state on August 3rd to deny Republicans the quorum needed to conduct legislative business. The lawmakers traveled to Democratic strongholds including Chicago, Boston, and Albany, where they received support from governors in Illinois, Massachusetts, and New York. The walkout lasted two weeks, during which Texas House Speaker Dustin Burrows signed civil arrest warrants for the absent Democrats and suspended their direct deposit payments. The Democrats eventually returned to Texas on August 19th, allowing the redistricting vote to proceed.\nTom Bevan, the RealClearPolitics co-founder and president, wrote on X, \"The idea that Texas Democrats would flee to Illinois, a state where Dems have abused gerrymandering to comical levels, is perfection.\"\nAdditional Drama\n“After recessing, it was discovered Sen. Alvarado had issued a campaign email approximately 3:00 this afternoon to promote her filibuster as a campaign fundraising event,” said Sen. Charles Perry (R-Lubbock) on the floor, adding it was “unprecedented” and “highly offensive to the body.”\nThe Texas congressional redistricting plan, which President Donald Trump has pushed to strengthen Republican control of the U.S. House ahead of next year's 2026 midterm elections, could deliver up to five new GOP congressional seats by breaking apart Democratic strongholds in the Austin, Dallas, and Houston metropolitan areas while making two currently Democrat-held South Texas districts more favorable to Republican candidates. The new voting district boundaries also preserve all 25 existing Republican-held seats as safely red districts.\nLocal Impact\nIn the Houston area, the proposed map would remake four Democratic districts. The biggest change would be in the 9th Congressional District, a majority-minority seat represented by Democrat Rep. Al Green that currently covers the southern part of Harris County and its direct southern neighbors. It would shift to the eastern parts of Houston, where no current member of Congress lives. Instead of being a seat that Vice President Kamala Harris won by 44 percent under the current boundary, Trump would have won it by 15 percent.\nThe plan \"meets the critically important goals of legality, of political performance for Republicans and of improved compactness,\" said Sen. Phil King, R-Weatherford and House Bill 4's sponsor, while repeatedly insisting under questioning from Democrats that he did not consider racial population data in his role shepherding the map through the upper chamber.\nThese anticipated Texas House seat gains are intended to help Republicans maintain their narrow House majority during 2026 midterm elections that historically favor the opposing party – potentially determining whether unified Republican control continues in Washington or whether divided government emerges with one chamber focused on investigating Trump and obstructing his legislative priorities.\nThis dynamic has placed Texas Republican legislators at the center of a nationally significant political battle over congressional maps and voting rights. Trump praised Republican lawmakers for advancing the new redistricting map through the state House, while Democratic opposition received backing from prominent national figures including former President Barack Obama, Democratic National Committee Chair Ken Martin and U.S. House Minority Leader Hakeem Jeffries of New York.\nThere has been \"amazing progress that's been made in just eight months — all of this will end if the Republicans lose the Congress,\" King said after citing a list of policy achievements he attributed to President Trump and Republican control of Congress.\n\"I'm convinced that if Texas does not take this action, there is an extreme risk that that Republican majority will be lost. If it does, the next two years after the midterm, there will be nothing but inquisitions and impeachments and humiliation for our country.\"\nWhile congressional district maps are traditionally redrawn only once per decade following the U.S. Census, Texas Republicans defended this extraordinary mid-decade redistricting by arguing that state law permits new boundaries to be drawn at any time for partisan advantage. They also cited their substantial electoral victories in 2024 and the necessity of responding to Democratic redistricting efforts in blue states as additional justification for their congressional map changes.\nThis map is already causing a ripple effect across the 2026 ballot. The new 37th Congressional District paired Congressmen Lloyd Doggett (D-TX-37) and Greg Casar (D-TX-35), as the latter's district was moved to the outskirts of San Antonio. Doggett announced he would not seek re-election if this map remains in effect next year after pressure from progressive circles to let Casar take the seat; state Sen. Sarah Eckhardt (D-Austin) is also considering a run for it.\nState Rep. Briscoe Cain (R-Deer Park) filed paperwork to run in the new 9th Congressional District, one of the expected GOP pickups, and other state legislators are mulling runs for other districts."
    },
    {
      "news_title": "Texas congressional map favouring Republicans passed",
      "news_link": "https://www.newcastleherald.com.au/story/9048114/texas-congressional-map-favouring-republicans-passed/",
      "bias": "Lean Left",
      "text": "The Texas Senate has approved a bill to redraw the state's congressional maps at the behest of President Donald Trump in an effort to flip five seats held by Democrats to Republicans.\nSubscribe today for the news that matters\nor signup to continue reading\nThe approval comes after the state House passed it on Wednesday, US media reported.\nThe measure goes to Governor Greg Abbott, like Trump a Republican, to be signed into law amid a nationwide redistricting battle.\nState senator Carol Alvarado, a Democrat, said on social media on Friday that she planned to delay the measure by speaking continuously about it in the legislature, a move known as a filibuster.\nBut a rare procedural motion by Senate Republicans just after midnight on Saturday ended the debate and killed the filibuster, moving the chamber straight to the final vote, the Texas Tribune reported.\nThe Senate adopted the bill on a party-line vote, 18 to 11, after more than eight hours of debate, the report said.\nRepublicans have acknowledged they believe winning more congressional seats in Texas will help the party maintain its slim majority in the US House of Representatives in the 2026 midterm elections, despite polls showing headwinds for the party.\nMore states controlled by Republicans are considering similar action.\nCalifornia and other states where Democrats hold power vow to counter such moves.\nThe California legislature on Thursday approved a redistricting plan aimed at giving Democrats five more congressional seats - a move that must be approved by voters in November.\nThe Texas plan does not need voter approval, but Democrats have indicated they will challenge it in court.\nThe Texas bill was delayed for two weeks after more than 50 Democratic state House members staged a walkout that denied Republicans the legislative quorum needed. They have returned.\nDuring debate on Friday, some lawmakers echoed criticism that Democrats raised in the House, that the new Texas map violates federal law by diluting Hispanic and Black voting power and discriminating on the basis of race.\nSenator Royce West, a Democrat, predicted the new map would reduce the number of African Americans representing Texas in Washington from four to two.\n\"I call that retrogression,\" West said.\nTexas senator Phil King, a Republican who sponsored the bill, said repeatedly he had not considered race and lawyers had assured him the bill met all legal requirements.\n\"From my perspective, why would I use racial data?\" he told his fellow senators.\n\"Voting history is just much more accurate and is well established as a legal way to draw maps.\"\nMost Americans believe redrawing congressional lines for the sake of maximising political gain, known as gerrymandering, is bad for democracy, a Reuters/Ipsos poll found this week.\nAustralian Associated Press"
    },
    {
      "news_title": "Texas lawmakers give final approval to redrawn congressional map favoring GOP",
      "news_link": "https://abcnews.go.com/Politics/wireStory/texas-lawmakers-give-final-approval-redrawn-congressional-map-124879229",
      "bias": "Lean Left",
      "text": "Texas lawmakers give final approval to redrawn congressional map favoring GOP\nThe Texas Senate has given final approval to a new, Republican-leaning congressional voting map, sending it to Gov. Greg Abbott for his signature\nAUSTIN, Texas -- The Texas Senate gave final approval to a new, Republican-leaning congressional voting map early Saturday, sending it to Gov. Greg Abbott for his signature.\nPresident Donald Trump has pushed for the map to help the GOP maintain its slim majority in Congress in the 2026 midterm elections. It has five new districts that would favor Republicans.\nAbbott, a Republican, is expected to quickly sign it into law, though Democrats have vowed to challenge it in court.\nThe effort by Trump and Texas’ Republican-majority Legislature prompted state Democrats to hold a two-week walkout and kicked off a wave of redistricting efforts across the country.\nDemocrats had prepared for a final show of resistance, with plans to push the Senate vote into the early morning hours in a last-ditch attempt to delay passage.\nState Sen. Carol Alvarado, leader of the Senate Democratic caucus, announced on social media that she planned to filibuster the bill with a long speech and intended to speak for several hours. But just when she expected to start, the Senate broke for a long dinner break.\nWhen members returned, Alvarado never had a chance to filibuster because Republicans accused her of breaking Senate rules by attempting to fundraise off the coming filibuster.\nSen. Charles Perry said it “appears to be potentially unlawful, at least unethical, using state resources for a campaign purpose.”\nA spokesperson for Alvarado did not immediately respond to an email and phone call from The Associated Press.\n“Shutting down a filibuster over a fundraising email is unprecedented,” Democratic Sen. Sarah Eckhardt said in a post on social media platform X. “It exposes the hypocrisy of Republicans, who will turn around and raise millions off stealing Texans’ votes while silencing their voices.”\nThe weekslong showdown has roiled the Texas Legislature, marked by a Democratic walkout and threats of arrest from Republicans. Much of the drama unfolded in the House, where the map ultimately passed Wednesday.\nDemocrats had already delayed the bill's passage during hours of debate, pressing Republican Sen. Phil King, the measure’s sponsor, on the proposal's legality, with many alleging that the redrawn districts violate the Voting Rights Act by diluting voters’ influence based on race.\nKing vehemently denied that accusation, saying, “I had two goals in mind: That all maps would be legal and would be better for Republican congressional candidates in Texas.”\n“There is extreme risk the Republican majority will be lost” in the House if the map does not pass, King said.\nThe showdown has also inflamed a broader, state-by-state redistricting battle, with governors from both parties pledging to redraw congressional maps.\nCalifornia Democrats approved legislation Thursday calling for a special election in November for residents to vote on a redrawn congressional map designed to help Democrats win five more House seats next year. Gov. Gavin Newsom quickly signed it.\n“This is not something six weeks ago that I ever imagined that I’d be doing,” Newsom said. “This is a reaction to an assault on our democracy in Texas.”\nCalifornia’s map needs voter approval because, unlike in Texas, a nonpartisan commission normally draws the map to avoid the sort of political battle that is playing out.\nOn Friday, Abbott called California’s redistricting “a joke” and asserted that Texas’ new map is constitutional but California’s would be overturned.\nOn a national level, the partisan makeup of existing districts puts Democrats within three seats of a majority. The incumbent president’s party usually loses seats in the midterms.\nThe Texas redraw is already reshaping the 2026 race, with Democratic Rep. Lloyd Doggett, the dean of the state's congressional delegation, announcing Thursday that he will not seek reelection to his Austin-based seat if the new map takes effect. Under the proposed map, Doggett's district would overlap with that of another Democratic incumbent, Rep. Greg Casar.\nThe president has pushed other Republican-controlled states including Indiana and Missouri, to also revise their maps to add more winnable GOP seats. Ohio Republicans were also already scheduled to revise their maps to make them more partisan.\n“Republicans are not finished in the United States,” Abbott said.\nRedistricting typically occurs once a decade, immediately after a census. While some states have their own limitations, there is no national impediment to a state trying to redraw districts in the middle of the decade.\nThe U.S. Supreme Court has said the Constitution does not outlaw partisan gerrymandering, only using race to redraw district lines.\nMore Democratic-run states have commission systems like California’s or other redistricting limits than Republican ones do, leaving the GOP with a freer hand to swiftly redraw maps. New York, for example, cannot draw new maps until 2028, and even then only with voter approval.\nRepublicans and some Democrats championed a 2008 ballot measure that established California’s nonpartisan redistricting commission, along with a 2010 one that extended its role to drawing congressional maps.\nBoth sides have shown concern over what the redistricting war could lead to.\nCalifornia Assemblyman James Gallagher, the Republican minority leader, said Trump was “wrong” to push for new Republican seats elsewhere. But he warned that Newsom’s approach, which the governor has dubbed “fight fire with fire,” is dangerous.\n“You move forward fighting fire with fire, and what happens?” Gallagher asked. “You burn it all down.”\n___\nCappelletti reported from Washington and Golden from Seattle."
    },
    {
      "news_title": "Texas adopts electoral map aimed at preserving Trump’s Congress grip",
      "news_link": "https://www.straitstimes.com/world/united-states/texas-adopts-electoral-map-aimed-at-preserving-trumps-congress-grip",
      "bias": "Lean Right",
      "text": "Texas adopts electoral map aimed at preserving Trump’s Congress grip\nSign up now: Get ST's newsletters delivered to your inbox\nFollow topic:\nWASHINGTON - Texas legislators early on Aug 23 approved a new electoral map aimed at carving out five new Republican-leaning seats in the state to help the party retain control of Congress in next year’s midterm elections.\nThe senators voted along party lines to pass the map 18-11 shortly after midnight on Aug 23, following more than eight hours of debate.\nLast week, the state legislature’s lower chamber adopted the Bill.\nDemocratic Senator Carol Alvarado’s plans to filibuster the map as a final protest were thwarted when Republicans used a rare procedural motion to halt debate, end the filibuster, and proceed directly to the final vote.\nIt now heads to the governor’s office for final approval, where Governor Greg Abbot is expected to swiftly approve it.\nDemocratic Senator Sarah Eckhardt said on X that shutting down a filibuster was “unprecedented”.\nShe added: “This is not democracy, this is disgraceful.”\nThe legislation is the culmination of a weeks-long drama that saw Democrats flee the state in an effort to block the vote and drew nationwide attention to the issue of partisan redistricting, known as “gerrymandering.”\nPresident Donald Trump had pressured Republican-run Texas to create the new map\nThe cutthroat political gambit spurred California’s Democratic governor, Mr Gavin Newsom, to launch a process for redrawing his state’s map – this time creating five potentially new seats for Democrats.\nAlthough Mr Newsom hopes to cancel out the Republicans’ advantages gained in Texas, his plan still requires voter approval in an election this November.\nBoth parties are now looking to other states where the rules might allow hasty redrawing of maps in ways that would create more seats.\nThe redistricting battle adds a volatile and high-stakes new element to 2026’s elections.\nRepublicans currently control both houses of Congress and the party’s legislators largely operate to carry out Mr Trump’s wishes.\nBeleaguered Democrats are hoping that the unpopularity of many of Mr Trump’s policies will help spark a takeover of the lower house. If Democrats did win, they would immediately gain power to investigate Mr Trump and his controversial government members. AFP"
    },
    {
      "news_title": "Texas lawmakers approve new electoral map designed to secure Trump's hold on Congress",
      "news_link": "https://www.france24.com/en/americas/20250823-texas-lawmakers-approve-new-electoral-map-designed-to-secure-trump-s-hold-on-congress",
      "bias": "Center",
      "text": "Texas lawmakers approve new electoral map designed to secure Trump's hold on Congress\nTexas lawmakers approved a new electoral map early Saturday that would likely give the Republicans five new seats in next year's midterm elections in a move explicitly designed to preserve US President Donald Trump's grip on Congress. Republican State Governor Greg Abbott is expected to quickly sign it into law.\nTexas legislators early Saturday approved a new electoral map aimed at carving out five new Republican-leaning seats in the state to help the party retain control of Congress in next year's midterm elections.\nThe senators voted along party lines to pass the map 18-11 shortly after midnight on Saturday, following more than eight hours of debate.\nDemocratic Senator Carol Alvarado's plans to filibuster the map as a final protest were thwarted when Republicans used a rare procedural motion to halt debate, end the filibuster, and proceed directly to the final vote.\nIt now heads to the governor's office for final approval. Governor Greg Abbott, a Republican, is expected to quickly sign it into law, though Democrats have vowed to challenge it in court.\nTo display this content from YouTube, you must enable advertisement tracking and audience measurement.\nOne of your browser extensions seems to be blocking the video player from loading. To watch this content, you may need to disable it on this site.\nDemocrats had already delayed the bill's passage during hours of debate, pressing Republican Senator Phil King, the measure’s sponsor, on the proposal's legality, with many alleging that the redrawn districts violate the Voting Rights Act by diluting voters’ influence based on race.\nKing vehemently denied that accusation, saying, “I had two goals in mind: That all maps would be legal and would be better for Republican congressional candidates in Texas.”\n“There is extreme risk the Republican majority will be lost” in the House if the map does not pass, King said.\nPresident Donald Trump had pressured Republican-run Texas to create the new map to help prevent Democratic opponents from taking over the House of Representatives in 2026, halfway through his term.\nThe cutthroat political gambit spurred California's Democratic governor, Gavin Newsom, to launch a process for redrawing his state's map – this time creating five potentially new seats for Democrats.\n\"This is not something six weeks ago that I ever imagined that I’d be doing,” Newsom said. “This is a reaction to an assault on our democracy in Texas.”\nTo display this content from YouTube, you must enable advertisement tracking and audience measurement.\nOne of your browser extensions seems to be blocking the video player from loading. To watch this content, you may need to disable it on this site.\nAlthough Newsom hopes to cancel out the Republicans' advantages gained in Texas, his plan still requires voter approval in an election this November. Unlike in Texas, a nonpartisan commission normally draws the map to avoid the sort of political battle that is playing out.\nBoth parties are now looking to other states where the rules might allow hasty redrawing of maps in ways that would create more seats.\nMore Democratic-run states have commission systems like California’s or other redistricting limits than Republican ones do, leaving the GOP with a freer hand to swiftly redraw maps. New York, for example, cannot draw new maps until 2028 – and even then, only with voter approval.\nThe redistricting battle adds a volatile and high-stakes new element to next year's elections.\nRepublicans currently control both houses of Congress and the party's legislators largely operate to carry out Trump's wishes.\nBeleaguered Democrats are hoping that the unpopularity of many of Trump's policies will help spark a takeover of the lower house. If Democrats did win, they would immediately gain power to investigate Trump and his controversial government members.\n(FRANCE 24 with AFP and AP)"
    },
    {
      "news_title": "Texas Senate Passes Congressional Map That’s Backed by Trump",
      "news_link": "https://www.bloomberg.com/news/articles/2025-08-23/texas-senate-passes-congressional-map-that-s-backed-by-trump",
      "bias": "Lean Left",
      "text": null
    },
    {
      "news_title": "Texas lawmakers pass Trump-backed election map, sending it to governor",
      "news_link": "https://www.washingtonpost.com/politics/2025/08/23/texas-republicans-redistricting-trump-map/",
      "bias": "Lean Left",
      "text": null
    },
    {
      "news_title": "Texas Senate approves redrawn GOP congressional maps, sending bill to Gov. Abbott",
      "news_link": "https://www.khou.com/article/news/local/texas/texas-senate-redistricting-vote-approvaed/285-6cb94724-dcc4-42a2-82a6-2a3fe0adec91",
      "bias": "Center",
      "text": "AUSTIN, Texas — The Texas Senate gave final approval to a new, Republican-leaning congressional voting map early Saturday, sending it to Gov. Greg Abbott for his signature.\nPresident Donald Trump has pushed for the map to help the GOP maintain its slim majority in Congress in the 2026 midterm elections. It has five new districts that would favor Republicans.\nAbbott, a Republican, is expected to quickly sign it into law, though Democrats have vowed to challenge it in court.\nThe effort by Trump and Texas’ Republican-majority Legislature prompted state Democrats to hold a two-week walkout and kicked off a wave of redistricting efforts across the country.\nDemocrats had prepared for a final show of resistance, with plans to push the Senate vote into the early morning hours in a last-ditch attempt to delay passage.\nState Sen. Carol Alvarado, leader of the Senate Democratic caucus, announced on social media that she planned to filibuster the bill with a long speech and intended to speak for several hours. But just when she expected to start, the Senate broke for a long dinner break.\nWhen members returned, Alvarado never had a chance to filibuster because Republicans accused her of breaking Senate rules by attempting to fundraise off the coming filibuster.\nSen. Charles Perry said it “appears to be potentially unlawful, at least unethical, using state resources for a campaign purpose.”\nA spokesperson for Alvarado did not immediately respond to an email and phone call from The Associated Press.\n“Shutting down a filibuster over a fundraising email is unprecedented,” Democratic Sen. Sarah Eckhardt said in a post on social media platform X. “It exposes the hypocrisy of Republicans, who will turn around and raise millions off stealing Texans’ votes while silencing their voices.”\nThe weekslong showdown has roiled the Texas Legislature, marked by a Democratic walkout and threats of arrest from Republicans. Much of the drama unfolded in the House, where the map ultimately passed Wednesday.\nDemocrats had already delayed the bill's passage during hours of debate, pressing Republican Sen. Phil King, the measure’s sponsor, on the proposal's legality, with many alleging that the redrawn districts violate the Voting Rights Act by diluting voters’ influence based on race.\nKing vehemently denied that accusation, saying, “I had two goals in mind: That all maps would be legal and would be better for Republican congressional candidates in Texas.”\n“There is extreme risk the Republican majority will be lost” in the House if the map does not pass, King said.\nThe showdown has also inflamed a broader, state-by-state redistricting battle, with governors from both parties pledging to redraw congressional maps.\nCalifornia Democrats approved legislation Thursday calling for a special election in November for residents to vote on a redrawn congressional map designed to help Democrats win five more House seats next year. Gov. Gavin Newsom quickly signed it.\n“This is not something six weeks ago that I ever imagined that I’d be doing,” Newsom said. “This is a reaction to an assault on our democracy in Texas.”\nCalifornia’s map needs voter approval because, unlike in Texas, a nonpartisan commission normally draws the map to avoid the sort of political battle that is playing out.\nOn Friday, Abbott called California’s redistricting “a joke” and asserted that Texas’ new map is constitutional but California’s would be overturned.\nBattle for the House waged via redistricting\nOn a national level, the partisan makeup of existing districts puts Democrats within three seats of a majority. The incumbent president’s party usually loses seats in the midterms.\nThe Texas redraw is already reshaping the 2026 race, with Democratic Rep. Lloyd Doggett, the dean of the state's congressional delegation, announcing Thursday that he will not seek reelection to his Austin-based seat if the new map takes effect. Under the proposed map, Doggett's district would overlap with that of another Democratic incumbent, Rep. Greg Casar.\nThe president has pushed other Republican-controlled states including Indiana and Missouri, to also revise their maps to add more winnable GOP seats. Ohio Republicans were also already scheduled to revise their maps to make them more partisan.\n“Republicans are not finished in the United States,” Abbott said.\nRedistricting typically occurs once a decade, immediately after a census. While some states have their own limitations, there is no national impediment to a state trying to redraw districts in the middle of the decade.\nThe U.S. Supreme Court has said the Constitution does not outlaw partisan gerrymandering, only using race to redraw district lines.\n‘Fight fire with fire’\nMore Democratic-run states have commission systems like California’s or other redistricting limits than Republican ones do, leaving the GOP with a freer hand to swiftly redraw maps. New York, for example, cannot draw new maps until 2028, and even then only with voter approval.\nRepublicans and some Democrats championed a 2008 ballot measure that established California’s nonpartisan redistricting commission, along with a 2010 one that extended its role to drawing congressional maps.\nBoth sides have shown concern over what the redistricting war could lead to.\nCalifornia Assemblyman James Gallagher, the Republican minority leader, said Trump was “wrong” to push for new Republican seats elsewhere. But he warned that Newsom’s approach, which the governor has dubbed “fight fire with fire,” is dangerous.\n“You move forward fighting fire with fire, and what happens?” Gallagher asked. “You burn it all down.”\nCopyright 2025 Associated Press. All rights reserved. This material may not be published, broadcast, rewritten, or redistributed."
    },
    {
      "news_title": "Texas passes midterm redistricting sought by Trump as California plans to counter",
      "news_link": "https://www.gpb.org/news/2025/08/23/texas-passes-midterm-redistricting-sought-by-trump-california-plans-counter",
      "bias": "Lean Left",
      "text": "Section Branding\nHeader Content\nTexas passes midterm redistricting sought by Trump as California plans to counter\nPrimary Content\nThe Texas Legislature has passed a plan for redrawing the state's congressional districts that could help Republicans win five more seats in the U.S. House, as called for last month by President Trump. It goes next for expected signing by Gov. Greg Abbott.\nThe after-midnight vote of 18 to 11 was the latest major development in what's shaping up as a competition set off by Trump between Texas, California and possibly several other states around the country over the map for the midterm election.\nTexas State Sen. Phil King, who led the defense of the plan in the Senate, noted the political motivation for the rare mid-decade redistricting. \"For the map to be legal in all respects, that was the first goal,\" King said. \"And the second one was that it would perform better for Republican congressional candidates in Texas.\"\nTrump had lauded the Texas plan earlier, saying \"Texas never lets us down\" and noted the importance that control of Congress holds for his agenda. \"More seats equals less Crime, a great Economy, and a STRONG SECOND AMENDMENT,\" he wrote.\nDemocrats have threatened to challenge the new map in court. They argued that it dilutes the voting strength of Black and Latino voters and creates vast districts that broke off urban areas and connected them to suburban and rural areas.\nDemocratic State Sen. Judith Zaffirini said she opposed the plan \"not only because it disregards the growth and diversity of our state but also because it further erodes the strength of minority districts, diminishing our ability to elect candidates of our choice and silencing voices that deserve to be heard.\"\nThe final approval from the Senate came after questions and debate that went throughout Friday.\nThe weeks of redistricting debate in Texas — initiated by a call from the governor and President Trump last month — had prompted Democratic leaders in California to counter with their own redistricting in that state.\nThursday night, California Gov. Gavin Newsom signed a plan for a new voting map there that could help give Democrats five additional seats in Congress. Lawmakers have also approved sending a measure to voters in a special election in November asking to allow the state to implement the map, bypassing its independent citizen redistricting commission.\nRedistricting is usually done after the national census at the start of each decade, and how voters are grouped into congressional districts can be critical in determining who wins the seats.\nAbbott put a proposed redraw on the Legislature's agenda last month when Trump called for more Republican-leaning districts in Texas. The state currently has 38 seats in the House — 25 held by Republicans, 13 by Democrats.\nThe debate in California\nNewsom has argued that California, where Democrats hold 43 of 52 House seats, must \"fight fire with fire.\" He and other Democrats said that if Texas is going to try to tilt its map to aid President Trump's agenda, California has to respond.\n\"This isn't politics as usual,\" said Democratic Assemblymember Anamarie Avila Farias during a debate on the map. \"This is an emergency for our state. This is an emergency for our country. This is an emergency for democracy.\"\nRepublicans countered that only the state's redistricting commission should change the maps. \"You move forward fighting fire with fire, what happens? You burn it all down. In this case, it affects our most fundamental American principle. Representation,\" Republican Minority Leader James Gallagher said during that same debate. \"Now he's pushing this redistricting plan, this Gavinmander, illegally, against the constitution.\"\nDemocrats in the legislature have said that by sending the final decision to voters, they've made their proposal more transparent.\nThe White House has asked Republicans in other states to consider redistricting in their favor, too.\nIn Texas, Democrats broke quorum to disrupt Republicans' plans\nPassage of the new Texas map would come after the return of Democrats who had left the state to block the presence of a quorum that would permit a vote. Abbott and other Texas leaders had threatened them with removal from office and arrest.\nAfter two weeks, enough Democrats returned to allow a quorum on Monday. Democratic leaders said they were coming back because California had taken up the fight and they had run the clock out on one special session — only to see Abbott immediately start another.\n\"We're returning to Texas more dangerous to Republicans' plans than when we left,\" House Democratic Caucus Leader Gene Wu said Monday. \"Our return allows us to build the legal record necessary to defeat this racist map in court, take our message to communities across the state and country, and inspire legislators across the country how to fight these undemocratic redistricting schemes in their own statehouses.\"\nOpponents of the new map say it weakens the votes of Black and Latino elected Democrats by putting them in new districts or moving more conservative white voters into theirs. It could lead to some Democratic members of Congress running against each other.\nRepublicans note the map increases the Latino voting presence in a couple districts and say more of them are voting Republican. Supporters of the redistricting acknowledge it was based on \"political performance\" in previous elections.\nSome states ban partisan gerrymandering, the process of drawing districts to favor a political party. Texas does not. But gerrymandering for partisan benefit can sometimes overlap with illegal racial gerrymandering, which could soon be an issue in court for Texas.\nWith reporting by NPR's Acacia Squires and Larry Kaplow."
    },
    {
      "news_title": "Texas Senate passes new Republican-drawn congressional map",
      "news_link": "https://www.nbcchicago.com/news/politics/president-trump/texas-senate-passes-new-republican-drawn-congressional-map/3813932/",
      "bias": "Center",
      "text": "The Republican-controlled Texas state Senate passed the party’s new congressional maps overnight, completing a legislative odyssey that included significant Democratic delays and sparked a nationwide scramble over redistricting in the process.\nThe vote means the maps, which were designed to pad the Republican majority in the U.S. Congress, will go into effect when signed by Gov. Greg Abbott, a proponent of the plan who has been cheered on by President Donald Trump.\nStream NBC 5 for free, 24/7, wherever you are.\nDemocrats have promised to challenge the measure in court.\nTrump initially led the calls for Texas to redraw its congressional map, saying his party is “entitled to” five more congressional seats from the state. That’s what the maps intend to do: By redrawing congressional district boundaries in key cities as well as along the state’s border, Texas will have 30 congressional districts that Trump carried last fall by a double-digit margin.\nThe GOP currently controls 25 of the state’s 38 congressional districts.\n2024 presidential election results in Dallas-Fort Worth area legislative districts\nAccording to analyses performed by the Texas Legislative Council. Zoom out to see other areas in Texas\nOld legislative districts\nNew legislative districts\nRepublicans have been adamant, and blunt, from the start of the process that their exercise has been a political one aimed solely at increasing their party’s power in Washington, where the House is almost evenly balanced. Democrats need a net gain of just three seats in the 2026 elections to take the majority.\nThe Trump Administration\nThe latest news on Donald Trump's presidency\nDemocrats have accused Republicans of setting a dangerous precedent by not waiting until 2031 to redraw the lines, as is customary, and they said the new maps would hurt minority representation in the state, a charge their Republican colleagues denied.\nUnlike the state House, where business ground to a halt earlier this month when dozens of Democrats fled the state to deny the body a quorum to move forward with legislation, forcing Abbott to call another special session, the Senate has not been stymied by those efforts.\nWith Abbott poised to sign the new maps into law, the spotlight shifts to California, where Democratic lawmakers have their own proposal to redraw their state's congressional boundaries as political retribution for Texas' move. Unlike in Texas, where regular legislation is enough to change the maps, California Democrats' proposal must also be approved by the voters in a special election this fall in order to take effect."
    },
    {
      "news_title": "Texas lawmakers give final approval to redrawn congressional map favoring GOP, send to governor",
      "news_link": "https://apnews.com/article/california-texas-redistricting-f93a49178fd3b9cba00880b9c9231799",
      "bias": "Lean Left",
      "text": "Texas lawmakers give final approval to redrawn congressional map favoring GOP, send to governor\nWatch live as the Texas Senate is expected to vote on a new congressional map aimed at electing more Republicans to the U.S. House.\nAUSTIN, Texas (AP) — The Texas Senate gave final approval to a new, Republican-leaning congressional voting map early Saturday, sending it to Gov. Greg Abbott for his signature.\nPresident Donald Trump has pushed for the map to help the GOP maintain its slim majority in Congress in the 2026 midterm elections. It has five new districts that would favor Republicans.\nAbbott, a Republican, is expected to quickly sign it into law, though Democrats have vowed to challenge it in court.\nThe effort by Trump and Texas’ Republican-majority Legislature prompted state Democrats to hold a two-week walkout and kicked off a wave of redistricting efforts across the country.\nDemocrats had prepared for a final show of resistance, with plans to push the Senate vote into the early morning hours in a last-ditch attempt to delay passage.\nState Sen. Carol Alvarado, leader of the Senate Democratic caucus, announced on social media that she planned to filibuster the bill with a long speech and intended to speak for several hours. But just when she expected to start, the Senate broke for a long dinner break.\nWhen members returned, Alvarado never had a chance to filibuster because Republicans accused her of breaking Senate rules by attempting to fundraise off the coming filibuster.\nSen. Charles Perry said it “appears to be potentially unlawful, at least unethical, using state resources for a campaign purpose.”\nA spokesperson for Alvarado did not immediately respond to an email and phone call from The Associated Press.\n“Shutting down a filibuster over a fundraising email is unprecedented,” Democratic Sen. Sarah Eckhardt said in a post on social media platform X. “It exposes the hypocrisy of Republicans, who will turn around and raise millions off stealing Texans’ votes while silencing their voices.”\nThe weekslong showdown has roiled the Texas Legislature, marked by a Democratic walkout and threats of arrest from Republicans. Much of the drama unfolded in the House, where the map ultimately passed Wednesday.\nAP correspondent Ben Thomas reports California Governor Gavin Newsom has signed legislation calling a special election on a redrawn congressional map.\nDemocrats had already delayed the bill’s passage during hours of debate, pressing Republican Sen. Phil King, the measure’s sponsor, on the proposal’s legality, with many alleging that the redrawn districts violate the Voting Rights Act by diluting voters’ influence based on race.\nKing vehemently denied that accusation, saying, “I had two goals in mind: That all maps would be legal and would be better for Republican congressional candidates in Texas.”\n“There is extreme risk the Republican majority will be lost” in the House if the map does not pass, King said.\nThe showdown has also inflamed a broader, state-by-state redistricting battle, with governors from both parties pledging to redraw congressional maps.\nCalifornia Democrats approved legislation Thursday calling for a special election in November for residents to vote on a redrawn congressional map designed to help Democrats win five more House seats next year. Gov. Gavin Newsom quickly signed it.\n“This is not something six weeks ago that I ever imagined that I’d be doing,” Newsom said. “This is a reaction to an assault on our democracy in Texas.”\nCalifornia’s map needs voter approval because, unlike in Texas, a nonpartisan commission normally draws the map to avoid the sort of political battle that is playing out.\nOn Friday, Abbott called California’s redistricting “a joke” and asserted that Texas’ new map is constitutional but California’s would be overturned.\nBattle for the House waged via redistricting\nOn a national level, the partisan makeup of existing districts puts Democrats within three seats of a majority. The incumbent president’s party usually loses seats in the midterms.\nThe Texas redraw is already reshaping the 2026 race, with Democratic Rep. Lloyd Doggett, the dean of the state’s congressional delegation, announcing Thursday that he will not seek reelection to his Austin-based seat if the new map takes effect. Under the proposed map, Doggett’s district would overlap with that of another Democratic incumbent, Rep. Greg Casar.\nThe president has pushed other Republican-controlled states including Indiana and Missouri, to also revise their maps to add more winnable GOP seats. Ohio Republicans were also already scheduled to revise their maps to make them more partisan.\n“Republicans are not finished in the United States,” Abbott said.\nRedistricting typically occurs once a decade, immediately after a census. While some states have their own limitations, there is no national impediment to a state trying to redraw districts in the middle of the decade.\nThe U.S. Supreme Court has said the Constitution does not outlaw partisan gerrymandering, only using race to redraw district lines.\n‘Fight fire with fire’\nMore Democratic-run states have commission systems like California’s or other redistricting limits than Republican ones do, leaving the GOP with a freer hand to swiftly redraw maps. New York, for example, cannot draw new maps until 2028, and even then only with voter approval.\nRepublicans and some Democrats championed a 2008 ballot measure that established California’s nonpartisan redistricting commission, along with a 2010 one that extended its role to drawing congressional maps.\nBoth sides have shown concern over what the redistricting war could lead to.\nCalifornia Assemblyman James Gallagher, the Republican minority leader, said Trump was “wrong” to push for new Republican seats elsewhere. But he warned that Newsom’s approach, which the governor has dubbed “fight fire with fire,” is dangerous.\n“You move forward fighting fire with fire, and what happens?” Gallagher asked. “You burn it all down.”\n___\nCappelletti reported from Washington and Golden from Seattle."
    },
    {
      "news_title": "Texas Senate approves GOP congressional map, sending plan to Abbott’s…",
      "news_link": "https://www.texastribune.org/2025/08/22/texas-congressional-redistricting-map-senate-governor-desk/",
      "bias": "Lean Left",
      "text": "Texas Senate approves GOP congressional map, sending plan to Abbott’s desk\nSign up for The Brief, The Texas Tribune’s daily newsletter that keeps readers up to speed on the most essential Texas news.\nThe Texas Senate early Saturday morning approved a new congressional map gerrymandered to maximize Republican representation, sending the plan to the governor’s desk after weeks of intense partisan clashing.\nRepublican lawmakers pushed the plan through over fierce Democratic opposition, launching a national redistricting war from Albany to Sacramento while positioning the GOP to net up to five additional seats in Texas.\nThe Senate adopted the new lines on a party-line vote, 18 to 11, just after 12:30 a.m. Saturday following more than eight hours of at times tense debate.\nSen. Carol Alvarado, D-Houston, had planned to filibuster the map well into Saturday as a last stand against the effort, but a rare procedural motion by Senate Republicans just after midnight ended the debate and killed the filibuster, moving the chamber straight on to the final vote. Some observers in the gallery were removed for shouting “shame,” and “fascist,” shortly after the vote.\nThe map, demanded by President Donald Trump to fortify the GOP’s U.S. House majority in next year’s midterm election, hands up to five additional U.S. House seats to Republicans by dismantling Democratic bastions around Austin, Dallas and Houston, and by making two Democrat-held seats in South Texas redder. The new lines also keep all 25 seats already held by Republicans safely red.\nThe plan “meets the critically important goals of legality, of political performance for Republicans and of improved compactness,” said Sen. Phil King, R-Weatherford and House Bill 4’s sponsor, while repeatedly insisting under questioning from Democrats that he did not consider racial population data in his role shepherding the map through the upper chamber. Still, the map drew a legal challenge Saturday, hours after the vote.\nThe pickups are meant to help the GOP hold onto its razor-thin congressional majority in a midterm election year that is expected to favor Democrats — potentially making the difference between a continued Republican trifecta in Washington, or a divided government with one chamber intent on investigating Trump and bottlenecking his agenda.\nThat has put Texas lawmakers at the front lines of an issue with national stakes. Republicans earned kudos from Trump for pushing the new boundaries through the state House, while Democrats won support from national party figures, including former President Barack Obama, Democratic National Committee Chair Ken Martin and U.S. House Minority Leader Hakeem Jeffries of New York.\nThis site is protected by reCAPTCHA and the Google Privacy Policy and Terms of Service apply.\nIn his closing statement, King made clear that the case for the map rested purely on maintaining Republican control of the federal government — and that if Texas did not push the gerrymander through, the GOP would likely lose control of the U.S. House in next year’s midterm election.\nThe “amazing progress that’s been made in just eight months — all of this will end if the Republicans lose the Congress,” King said after citing a list of policy achievements he attributed to a Republican trifecta. “I’m convinced that if Texas does not take this action, there is an extreme risk that that Republican majority will be lost. If it does, the next two years after the midterm, there will be nothing but inquisitions and impeachments and humiliation for our country.”\nThough congressional lines are typically redrawn once every 10 years following the decennial census, Republicans justified the aggressive and unusual move to do so in the middle of the decade by saying it was legal to craft new boundaries at any point and for purely partisan gain. They also pointed to the party’s margins of victory in 2024 and the need to counter blue-state gerrymandering to further support their push.\nSupport independent Texas news\nThe Tribune needs your help to keep trusted journalists in the Capitol. Donate now.\nChoose an amount or learn more about membership.\nThe U.S. Supreme Court ruled in 2019 that states can draw electoral maps on partisan grounds. But under Section 2 of the Voting Rights Act, the lines cannot diminish people’s voting power based on race.\nDemocrats argued that the new map increased Republicans’ advantage by unconstitutionally suppressing the vote of Black and Latino Texans. They framed the push as a power grab by Trump meant to stack the deck in next year’s election.\n“Today, the majority will prevail, but the rights of minorities were ignored, outnumbered, outvoted and outgunned,” said Sen. Judith Zaffirini, D-Laredo and dean of the Senate. “Democrats will go down fighting, having used every available legislative tool. My prayer is that the pendulum will swing sooner rather than later, and that when it does, Democrats will respect all minorities, including political.”\nTexas’ approval of the map has set off a tit-for-tat redistricting push in California, where Gov. Gavin Newsom has proposed a map voters would have to approve that could yield five new Democratic-leaning seats, effectively offsetting GOP gains in Texas. Other blue-state governors and national Democratic leaders are backing retaliatory gerrymandering as the Trump administration also pushes GOP-controlled Florida, Indiana, Missouri and Ohio to draw more red seats.\nAlvarado, with assistance from other Senate Democrats, had planned to filibuster the map Friday, donning sneakers and receiving a catheter in preparation. Sen. Sarah Eckhardt, D-Austin, had compiled over 12 hours of testimony from constituents on the map to read from during the marathon speech.\nBut after a three-hour dinner break called by Lt. Gov. Dan Patrick and objected to by Democrats, Republicans returned late Friday night with a procedural motion up their sleeves. Sen. Charles Perry, R-Lubbock, moved to cut off debate early. He cited a campaign email Alvarado sent out promoting the filibuster Friday afternoon, calling it “potentially unlawful,” and “at least unethical,” for ostensibly using state resources, such as staff and Capitol facilities, for fundraising purposes.\n“It’s disrespectful. It violates the decorum of the Senate, and personally, I’m offended by it,” Perry said. All Republicans signed onto the motion.\nDemocrats condemned the explanation as an excuse to kill the filibuster and move the vote along, noting that senators routinely drew from their legislative work in their fundraising campaigns and that lawmakers were not under a fundraising moratorium as they are during the regular session.\n“When they do it, it seems to be fair game, and when other people do it, then it’s a gotcha,” Alvarado said after the vote. “It was a mechanism to shut down the discussion, the debate on this issue.”\nThe filibuster would have delayed the map’s passage, but almost certainly would not have blocked it. Alvarado would have to had to sustain the filibuster for three weeks straight to run out the clock on the Legislature’s special session.\nThe new Texas map cleared its biggest hurdle Wednesday when, after more than eight hours of tense debate, the state House adopted the plan along party lines.\nLacking the votes to stop the map in the GOP-dominated Texas Legislature, more than 50 House Democrats staged a two-week walkout earlier this month, grinding the lower chamber to a halt by denying the quorum needed to conduct business.\nRepublicans unleashed an unprecedented response to drag them back to Texas, issuing civil arrest warrants, asking a court to extradite them from Illinois, seeking to declare over a dozen Democrats’ seats vacant and clamoring for legislative punishments upon their return.\nAfter most Democratic lawmakers returned to Austin Monday, Republican Speaker Dustin Burrows, seeking to maintain a quorum, required each of them to agree to a police escort to leave the Capitol building. Rep. Nicole Collier, D-Fort Worth, refused and was confined to the Capitol for the next 54 hours, prompting a national media frenzy.\nDemocrats portrayed the walkout as a victory for sparking a national movement in support of retaliatory redistricting, and as just the first part of a longer fight against the map. In the House on Wednesday, Democratic lawmakers pressed their Republican colleagues on the plan’s impact on voters of color, working to establish a record they could use in a legal challenge seeking to kill the lines before next year’s election.\n“This fight is far from over,” Rep. Gene Wu of Houston, chair of the House Democratic Caucus, said after the map’s passage in the lower chamber. “Our best shot is in the courts. This part of the fight is over, but it is merely the first chapter.”\nMore all-star speakers confirmed for The Texas Tribune Festival, Nov. 13–15! This year’s lineup just got even more exciting with the addition of State Rep. Caroline Fairly, R-Amarillo; former United States Attorney General Eric Holder; Abby Phillip, anchor of “CNN NewsNight”; Aaron Reitz, 2026 Republican candidate for Texas Attorney General; and State Rep. James Talarico, D-Austin. Get your tickets today!\nTribFest 2025 is presented by JPMorganChase.\nAyden Runnels contributed to this report.\nInformation about the authors\nContributors\nLearn about The Texas Tribune’s policies, including our partnership with The Trust Project to increase transparency in news."
    },
    {
      "news_title": "Texas Senate Passes GOP Congressional Maps",
      "news_link": "https://www.polialert.com/political-news/texas-senate-passes-gop-congressional-maps/",
      "bias": "unknown",
      "text": "The Republican-controlled Texas Senate approved new congressional maps early Saturday, a plan designed to expand the party’s majority in Washington and reshape political power in the nation’s second-largest state.\nThe maps, pushed by Gov. Greg Abbott and cheered on by President Donald Trump, will take effect once Abbott signs the measure into law — a step he has already pledged to take immediately.\n“The One Big Beautiful Map has passed the Senate and is on its way to my desk, where it will be swiftly signed into law,” Abbott said in a statement.\nDemocrats blasted the maneuver as an unprecedented power grab, promising to challenge the maps in court.\nExpanding GOP power in Washington\nThe plan is expected to give Republicans a commanding advantage in Texas’ 38-member congressional delegation. By redrawing boundaries in urban areas and along the border, the maps would create 30 districts that Trump carried in 2024 by double-digit margins.\nCurrently, Republicans control 25 of the state’s congressional seats. Trump has been outspoken in demanding the changes, telling allies that Texas Republicans are “entitled to” at least five more safe seats.\nThe GOP has openly admitted the move is political. With the U.S. House nearly evenly divided, adding five solidly Republican seats in Texas could prove pivotal in maintaining the party’s majority. Democrats, meanwhile, need just a net gain of three seats nationally in the 2026 midterms to flip control.\nDemocrats decry early redistricting\nDemocrats say the decision to redraw congressional lines now — five years before the next Census-based reapportionment in 2031 — sets a dangerous precedent.\n“This is not democracy, this is disgraceful,” state Sen. Sarah Eckhardt (D-Austin) wrote on X.\nState Sen. Carol Alvarado, chair of the Senate Democratic caucus, had planned a lengthy filibuster but never got the chance. After a long dinner break, Republicans accused her of breaking Senate rules by fundraising off the planned filibuster and blocked her from speaking.\nRepublicans dismissed Democratic objections, arguing that the maps are legal and necessary to reflect the state’s growth and political alignment.\nA new front in the redistricting wars\nThe Texas move has already sparked retaliatory plans in California, where Democrats are proposing to redraw their own congressional boundaries to offset Republican gains. But unlike Texas, California law requires voter approval in a statewide referendum before new maps can take effect. That special election is expected later this year.\nLegal challenges in Texas are also likely, particularly on claims that the new maps dilute minority representation. Civil rights groups have signaled they are preparing lawsuits.\nWhat comes next\nOnce Abbott signs the legislation, the new maps will apply to the 2026 elections, reshaping the balance of Texas’ congressional delegation. Court challenges could still delay implementation, but for now, Republicans have delivered on Trump’s demand for “One Big Beautiful Map.”"
    },
    {
      "news_title": "Title of the Page",
      "news_link": "https://ktbb.com/post/?p=1436777",
      "bias": "unknown",
      "text": null
    },
    {
      "news_title": "Texas GOP passes the House gerrymander Trump asked for - Finnoexpert",
      "news_link": "https://finnoexpert.com/texas-gop-passes-the-house-gerrymander-trump-asked-for/",
      "bias": "unknown",
      "text": "Texas Republicans approved a new, aggressively gerrymandered congressional map early Saturday morning, moving forward with a power grab pushed by President Donald Trump.\nThe GOP-controlled state Senate approved the map on a party-line vote after hours of debate that began Friday morning. Republicans used a procedural move to block a Democratic senator’s plans to filibuster the bill, forcing it to a vote — one final show of force from GOP leadership after weeks of partisan fighting.\nThe map could ultimately help flip as many as five seats for the GOP starting with next year’s midterms. Republican Gov. Greg Abbott is set to quickly sign the legislation, capping off a turbulent few weeks in Texas over Republicans’ now-successful effort to further skew the maps in the GOP’s favor ahead of the 2030 census.\nUnder the new map, Republicans in Texas are aiming to earn 30 House seats — up from their current 25 — as they attempt to hold onto control of the chamber in what could be an unfavorable environment for them next year. Republicans currently have just a three-seat majority in the House, so the new Texas map alone will significantly affect their chances.\nThe unusual offcycle redistricting effort in Texas has set off a contentious national tit-for-tat. California formally launched its preemptive retaliation on Thursday, with lawmakers approving a ballot measure redrawing the state’s map to create five new Democratic seats to offset Texas. That measure —which would temporarily circumvent the state’s independent redistricting commission — now goes to voters on the November ballot, a gerrymander Democratic Gov. Gavin Newsom has cast as necessary to preserve democracy."
    },
    {
      "news_title": "Republicans closer to new Texas seats with senate vote",
      "news_link": "https://news.rthk.hk/rthk/en/component/k2/1819490-20250823.htm",
      "bias": "unknown",
      "text": "Texas legislators early on Saturday approved a new electoral map aimed at carving out five new Republican-leaning seats in the state to help the party retain control of Congress in next year's midterm elections.\nThe senators voted along party lines to pass the map by an 18-11 margin shortly after midnight on Saturday, following more than eight hours of debate.\nDemocratic senator Carol Alvarado's plans to filibuster the map as a final protest were thwarted when Republicans used a rare procedural motion to halt debate, end the filibuster, and proceed directly to the final vote.\nIt now heads to the governor's office for final approval.\nPresident Donald Trump had pressured Republican-run Texas to create the new map to help prevent Democratic opponents from taking over the House of Representatives in 2026, halfway through his term.\nThe cutthroat political gambit spurred California's Democratic governor, Gavin Newsom, to launch a process for redrawing his state's map – this time creating five potentially new seats for Democrats.\nAlthough Newsom hopes to cancel out the Republicans' advantages gained in Texas, his plan still requires voter approval in an election this November.\nBoth parties are now looking to other states where the rules might allow hasty redrawing of maps in ways that would create more seats.\nThe redistricting battle adds a volatile and high-stakes new element to next year's elections.\nRepublicans currently control both houses of Congress and the party's legislators largely operate to carry out Trump's wishes.\nBeleaguered Democrats are hoping that the unpopularity of many of Trump's policies will help spark a takeover of the lower house. If Democrats did win, they would immediately gain power to investigate Trump and his controversial government members. (AFP)"
    }
  ]
}