{
  "story_id": "GN_20250826_005038_bacd27f9",
  "metadata": {
    "title": "US says it killed top ISIS official in Syria",
    "timestamp": "2025-08-26T00:50:38.144932",
    "url": "https://ground.news/article/us-raid-in-northern-syria-kills-senior-isis-financier"
  },
  "bias_distribution": {
    "total_sources": "12",
    "leaning_left": "1",
    "center": "3",
    "leaning_right": "6"
  },
  "perspective_summaries": {
    "left": [
      "American forces killed a senior ISIS official during a raid in northern Syria on August 19, as announced by the United States Central Command .",
      "This official was a key financier for ISIS and involved in planning attacks in Syria and Iraq.",
      "He was considered a threat to American forces and the new Syrian government led by President Ahmed al-Sharaa.",
      "CENTCOM Commander Admiral Brad Cooper stated that the U.S. will continue to pursue ISIS terrorists with unwavering determination."
    ],
    "center": [
      "American forces killed a senior ISIS official during a raid in northern Syria on August 19, as announced by the United States Central Command .",
      "This official was a key financier for ISIS and involved in planning attacks in Syria and Iraq.",
      "He was considered a threat to American forces and the new Syrian government led by President Ahmed al-Sharaa.",
      "CENTCOM Commander Admiral Brad Cooper stated that the U.S. will continue to pursue ISIS terrorists with unwavering determination."
    ],
    "right": [
      "American forces killed a senior ISIS official during a raid in northern Syria on August 19, as announced by the United States Central Command .",
      "This official was a key financier for ISIS and involved in planning attacks in Syria and Iraq.",
      "He was considered a threat to American forces and the new Syrian government led by President Ahmed al-Sharaa.",
      "CENTCOM Commander Admiral Brad Cooper stated that the U.S. will continue to pursue ISIS terrorists with unwavering determination."
    ]
  },
  "sources": [
    {
      "news_title": "Senior ISIS official killed in Syria, CENTCOM says",
      "news_link": "https://www.clevelandjewishnews.com/jns/senior-isis-official-killed-in-syria-centcom-says/article_19fe0df3-f207-5c77-9846-fc9fed3bff71.html",
      "bias": "Lean Right",
      "text": null
    },
    {
      "news_title": "U.S. forces kill senior ISIS member in Syria raid",
      "news_link": "https://wng.org/sift/u-s-forces-kill-senior-isis-member-in-syria-raid-1755865723",
      "bias": "Right",
      "text": "U.S. forces kill senior ISIS member in Syria raid\nU.S. Central Command troops killed a senior member of the Islamic State terrorist group during an Aug. 19 raid, the military said Thursday evening. The terrorist financed and planned attacks in Syria and Iraq, according to the statement from Central Command. The military operation brought him down in Atimah, in northern Syria. U.S. soldiers killed him because his relationships throughout the terrorist group’s network threatened the United States and the Syrian government, according to the statement.\nBrad Cooper, the commander of U.S. Central Command, said the operation was part of the military’s mission to ensure the lasting defeat of the terrorist group. U.S. forces would continue to pursue terrorists in the region, he said.\nIs the terrorist’s death a major setback for the Islamic State group? The head of the United Nations’ counter-terrorism office, Vladimir Voronkov, on Wednesday said that the terrorist organization so far maintained its operational capacity despite the deaths of leaders. It wasn’t clear from his remarks if Voronkov knew about or was referencing the U.S. operation of the day before. However, he did expect the group to recover from the March death of its deputy leader in charge of operational planning within six months.\nDig deeper: Read my previous report for more details on the threat the Islamic State group poses in several areas, particularly Africa.\nAn actual newsletter worth subscribing to instead of just a collection of links. —Adam\nSign up to receive The Sift email newsletter each weekday morning for the latest headlines from WORLD’s breaking news team.\nPlease wait while we load the latest comments...\nComments\nPlease register, subscribe, or log in to comment on this article."
    },
    {
      "news_title": "Senior ISIS member killed in northern Syria, US CENTCOM says",
      "news_link": "https://www.aa.com.tr/en/middle-east/senior-isis-member-killed-in-northern-syria-us-centcom-says/3666169",
      "bias": "Right",
      "text": "Senior ISIS member killed in northern Syria, US CENTCOM says\n‘We will continue to pursue ISIS terrorists with unwavering determination, throughout the region,’ says CENTCOM commander\nISTANBUL\nUS Central Command said Friday that its forces killed a senior ISIS member and key financier in a raid in Atimah, northern Syria.\nThe raid conducted on August 19 eliminated the ISIS figure which “had relationships throughout the ISIS network in the region, posing a direct threat to US and Coalition forces and the new Syrian Government.”\n“We will continue to pursue ISIS terrorists with unwavering determination, throughout the region” said ADM Brad Cooper, Commander, CENTCOM. “Together with our partners and allies, CENTCOM remains steadfast in our commitment of ensuring the lasting defeat of ISIS and the protection of the U.S. homeland.”"
    },
    {
      "news_title": "CENTCOM forces kill senior ISIS official in Syria",
      "news_link": "https://www.jpost.com/middle-east/article-864992",
      "bias": "Center",
      "text": "The senior ISIS member was a key financier who planned attacks in Syria and Iraq, CENTCOM reported.\nA shirt bearing ISIS insignia, found on a terrorist who attempted to carry out a terror attack in Qalandiya, the West Bank, December 7, 2024.(photo credit: Police Spokesperson )ByJERUSALEM POST STAFF"
    },
    {
      "news_title": "U.S. raid in northern Syria kills senior ISIS financier",
      "news_link": "https://bnonews.com/index.php/2025/08/u-s-raid-in-northern-syria-kills-senior-isis-financier/",
      "bias": "Center",
      "text": "World\nU.S. raid in northern Syria kills senior ISIS financier\nU.S. forces have killed a senior ISIS official during a raid in northern Syria, U.S. Central Command (CENTCOM) announced.\nThe operation took place on Tuesday in Atimah, near the Turkish border, where CENTCOM said its forces targeted an ISIS member described as a key financier who planned attacks in Syria and Iraq.\nThe individual maintained connections across ISIS’s network in the region and posed what officials called a direct threat to U.S. and Coalition forces as well as Syria’s new government.\nISIS remnants continue to operate in Syria’s north and east. The group, which once controlled large swaths of territory in Syria and Iraq, has been reduced to insurgent cells that launch sporadic ambushes, assassinations, and bombings.\nThe strike comes amid shifting U.S. policy toward Syria. In June, President Donald Trump revoked longstanding U.S. sanctions on Damascus following the ouster of Bashar al-Assad and the formation of a new government under President Ahmed al-Sharaa.\nWhile Washington has lifted broad economic restrictions, sanctions remain in place against individuals tied to terrorism, narcotics trafficking, and Assad-era abuses.\n“We will continue to pursue ISIS terrorists with unwavering determination, throughout the region,” said Admiral Brad Cooper, commander of CENTCOM. “Together with our partners and allies, CENTCOM remains steadfast in our commitment of ensuring the lasting defeat of ISIS and the protection of the U.S. homeland.”\n-\nWorld1 week ago\n5.6-magnitude earthquake hits Queensland, felt in Brisbane\n-\nUS News7 days ago\nExplosion reported as cargo ship catches fire in Baltimore Harbor\n-\nLegal4 days ago\nCalifornia Amber Alert: 2 boys abducted from foster care in Los Angeles\n-\nPolitics6 days ago\nJustice Department eases enforcement of D.C. rifle and shotgun ban\n-\nBusiness23 hours ago\nBitcoin goes below $113,000 in sudden market drop\n-\nPolitics1 week ago\nTrump says Zelenskyy can end war by giving up NATO bid and Crimea\n-\nWorld4 days ago\nColombian police helicopter shot down during anti-narcotics mission; 10 killed\n-\nUS News3 days ago\nTour bus from Niagara Falls overturns in New York; 5 dead, dozens injured"
    },
    {
      "news_title": "US says it killed top ISIS official in Syria",
      "news_link": "https://thehill.com/policy/defense/5464790-us-says-it-killed-top-isis-official-in-syria/",
      "bias": "Center",
      "text": null
    },
    {
      "news_title": "CENTCOM announces US forces killed a senior ISIS official during raid in Syria",
      "news_link": "https://justthenews.com/government/security/centcom-announces-us-forces-killed-senior-isis-official-during-raid-syria",
      "bias": "Lean Right",
      "text": "CENTCOM announces US forces killed a senior ISIS official during raid in Syria\nThe Defense Department did not reveal the name of the ISIS official, but said the raid took place on Tuesday, Aug. 19. The official has been identified as a key financier who helped orchestrate attacks in Syria and Iraq.\nThe United States Central Command (CENTCOM) on Thursday announced that American forces successfully killed a senior ISIS official during a raid in northern Syria earlier this week.\nThe Defense Department did not reveal the name of the ISIS official, but said the raid took place on Tuesday, Aug. 19. The official has been identified as a key financier who helped orchestrate attacks in Syria and Iraq.\nThe service said he posed a threat to American forces and the new Syrian government because he had ISIS contacts in the region.\n“We will continue to pursue ISIS terrorists with unwavering determination, throughout the region” CENTCOM Commander Admiral Brad Cooper said in a statement. “Together with our partners and allies, CENTCOM remains steadfast in our commitment of ensuring the lasting defeat of ISIS and the protection of the U.S. homeland.”\nThe raid comes as the United States relaxes its sanctions against Syria after former dictator Bashar Assad was ousted in December. Syrian President Ahmed al-Sharaa has been leading the Middle Eastern country since January.\nMisty Severi is a news reporter for Just The News. You can follow her on X for more coverage."
    },
    {
      "news_title": "Senior ISIS Leader Killed in US-Syrian Raid",
      "news_link": "https://english.aawsat.com/arab-world/5177487-senior-isis-leader-killed-us-syrian-raid",
      "bias": "Lean Right",
      "text": "Mariam Dagga, a visual journalist who freelanced for The Associated Press and other news organizations, and produced harrowing images of the war in Gaza, was killed Monday by an Israeli strike on a hospital. She was 33.\nThrough photographs and video, Dagga captured the lives of ordinary Palestinians facing extraordinary challenges: families displaced from homes, people crowding around aid trucks, mourners attending funerals and doctors treating wounded or malnourished children.\nDuring the war, Dagga regularly based herself at Nasser Hospital in Khan Younis. She was among 20 people, including five journalists, killed there Monday by Israeli strikes, according to health officials and news organizations.\n“She worked under incredibly difficult circumstances to bring stories from Gaza to the world, particularly coverage of the war’s impact on children,\" said Julie Pace, AP’s Executive Editor and Senior Vice President. \"We are devastated by her death and urgently seeking more clarity on the strike.”\nThe Israel-Hamas war has been one of the bloodiest conflicts for media workers, with at least 197 journalists killed in Gaza in the 22-month conflict, according to the Committee to Protect Journalists. Comparatively, 18 journalists have been killed so far in Russia’s war in Ukraine, according to the CPJ.\nIn an April interview with Eye on Palestine — a social media platform — Dagga appealed to the international community to protect journalists in Gaza and to help end the war. In a video message Sunday, one of her last social media posts, she warned that nowhere in Gaza was safe.\n“Every place is dangerous, is hit by airstrikes ... In every home there is a story. In every home there is a detainee. In every home there is suffering.”\nBorn in Khan Younis, Dagga studied journalism and graduated from the Al-Aqsa University in Gaza. She began working as a journalist in 2015.\nShe is survived by a 13-year-old son who moved at the start of the war to the United Arab Emirates to live with his father.\nWhen she wasn't working, she was often on the phone with her son, who wanted to return to Khan Younis to be with her, she told colleagues.\nAt her funeral Monday, relatives and colleagues caressed her cheeks through tears. Her body lay shrouded in white, a single red flower placed gently beside her face.\nBefore the war, she had given a kidney to her father, her sister Nada said.\nDisplaced from home, she was forced to move multiple times during the war, but she never stopped working.\n“She was always ready,” said AP reporter Sarah El Deeb, who is based in Beirut. “Dagga stayed close to Nasser hospital and was able to see through the cruelty of the war with the skills and patience to report on its cost to the people of Gaza, its doctors, children and mothers,” she said.\nFor her recent coverage of malnourished children in Gaza, Dagga won an internal AP award recognizing the strongest work produced each week.\nDagga's editor at the Independent Arabia media outlet, Adhwan Alahmari, said she was among the most ethical, dedicated reporters and photographers. He called the strike a “flagrant violation of international laws.”\nWafaa Shurafa, AP’s senior producer in Gaza who worked with Dagga daily, said she never hesitated to help anyone. Dagga never complained despite the severe hardships she faced, was always quick with a laugh, and was deeply respected and loved by her colleagues, friends and family, Shurafa said.\nShurafa said that she missed a call from Dagga after the first strike hit the hospital on Monday. When she called back, Dagga didn't answer.\n“I was nervous at first because she didn’t answer, I was super worried, I thought she was filming, but I never imagined she was killed,” she said.\n“She didn’t answer, and she never will again.”"
    },
    {
      "news_title": "US troops kill senior Isis member in Syria",
      "news_link": "https://www.telegraph.co.uk/world-news/2025/08/21/us-troops-kill-senior-isis-member-syria/",
      "bias": "Lean Right",
      "text": "A senior member of the Islamic State group was killed by US forces in Syria on Wednesday, a US official said.\nThe dawn raid in the north of the country was the second by US troops since former president Bashar al-Assad was toppled in December.\nAhmed al-Sharaa, Syria’s new president, has pledged to prevent a resurgence of Islamic State with the country part of an anti-Isis alliance that includes the US-led coalition fighting the terror group.\nThe raid took place at 2am and involved a joint airdrop operation in which troops were dispatched by parachute to the town of Atmeh, in Idlib province.\nSuch risky ground operations, rather than drone strikes, often signal that the target is particularly prominent and likely to be embedded with civilians in a deliberate effort to ward off an air attack.\nThe US official, speaking on the condition of anonymity, said the operation killed a senior Isis member who was seen as a strong candidate to become the leader of the group in Syria.\nIsis has strengthened since fall of Assad\nA Syrian security source and the country’s state-owned Al-Ikhbariyah said the target was trying to escape when he was killed.\nAnother Syrian source said the target was Iraqi and was married to a French national. It was not immediately clear what happened to his wife.\nAbdelqader al-Sheikh, a neighbour, said he was up late with his son when he heard a noise in the yard next door.\n“I called out, ‘Who are you?’ and they started speaking to me in English, telling me to put my hands up,” Mr Al-Sheikh told Reuters.\nHe said the armed forces stayed on the roofs of surrounding houses for the next two hours and that he could hear someone nearby speaking Arabic in an Iraqi accent.\nIn July, the Pentagon said its forces had conducted a raid in Aleppo province that resulted in the death of a senior Islamic State leader and his two adult Islamic State-affiliated sons.\nLate last year, the US announced that its military had roughly doubled the number of its troops in Syria, to 2,000, but Donald Trump, the US president, has since expressed scepticism about keeping US boots on the ground.\nWhile severely weakened since its peak around 10 years ago, Isis has witnessed a resurgence in Syria since the fall of Assad.\nIn late May, the group claimed its first attack on the new government’s forces since it took power when it planted a bomb on a “vehicle of the apostate regime” in the desert of the southern province of Sweida.\nIsis opposes the new rule in Damascus spearheaded by Mr al-Sharaa, who once ran al-Qaeda’s branch in Syria and fought against Islamic State."
    },
    {
      "news_title": "US Raid Kills Future ISIS Leader in Northwest Syria",
      "news_link": "https://www.sofx.com/us-raid-kills-future-isis-leader-in-northwest-syria/",
      "bias": "unknown",
      "text": "The United States Central Command (CENTCOM) killed a senior ISIS commander, viewed as the group’s likely future leader, in a pre-dawn raid in Atmeh, near Syria’s border with Turkey, on Wednesday.\nThe coalition targeted Abu Hafs al-Hashimi al-Qurashi, an Iraqi national. The Syrian Observatory for Human Rights said another Iraqi citizen was killed during the operation. No U.S. troops were killed or injured in the raid.\nA Syrian security source and state-owned Al-Ikhbariya reported the target was killed while attempting to flee.\nCENTCOM confirmed the strike and described al-Qurashi as a key financier behind planned attacks in Syria and Iraq. “He had relationships throughout the ISIS network in the region, posing a direct threat to U.S. and Coalition forces and the new Syrian Government,” CENTCOM said.\nCENTCOM Forces Kill Senior ISIS Official in Atimah, Syria\nU.S. Central Command forces conducted a successful raid in northern Syria on August 19, killing a senior ISIS member and key financier who planned attacks in Syria and Iraq. He had relationships throughout the ISIS… pic.twitter.com/eORiOthb6G\n— U.S. Central Command (@CENTCOM) August 21, 2025\nA U.S. official told Fox News al-Qurashi was viewed as a strong candidate to become the ISIS Syria Emir, a role that would have posed a direct threat to U.S. and Coalition forces as well as the new Syrian government.\nThis is the second U.S. operation in northern Syria since President Ahmed al-Sharaa replaced Bashar al-Assad. In July, U.S. forces killed ISIS leader Dhiya’ Zawba Muslih al-Hardani and his two sons in Aleppo’s al-Bab region.\n“We will continue to pursue ISIS terrorists with unwavering determination, throughout the region.” CENTCOM Commander Adm. Brad Cooper said. Together with our partners and allies, CENTCOM remains steadfast in our commitment to ensuring the lasting defeat of ISIS and the protection of the U.S. homeland.”"
    }
  ]
}