{
  "story_id": "GN_20250823_210333_8c8f6e1c",
  "metadata": {
    "title": "Texas Legislature Gives Final Approval to Redrawn Congressional Map Favoring GOP, Sends to Governor",
    "timestamp": "2025-08-23T21:03:33.561776",
    "url": "https://ground.news/article/texas-republicans-aim-for-final-passage-of-redistricting-after-california-democrats-counterpunch"
  },
  "bias_distribution": {
    "total_sources": "36",
    "leaning_left": "14",
    "center": "12",
    "leaning_right": "3"
  },
  "perspective_summaries": {
    "left": [
      "Texas Democrats, led by State Sen. Carol Alvarado, plan a filibuster to resist a Republican effort to redraw congressional maps amid accusations of violating the Voting Rights Act.",
      "California's Democrats responded by approving a special election for a new congressional map, signed by Governor Gavin Newsom, to help win five additional U.S. House seats.",
      "The redrawn maps passed in the Texas House but face legal challenges regarding the Voting Rights Act, which Republicans deny.",
      "Nationally, both parties are engaged in redistricting efforts as President Donald Trump urges states to revise maps for more Republican representation ahead of the 2026 elections."
    ],
    "center": [
      "On Friday, Texas Republicans aimed to finalize a mid-decade redraw to add five seats to their U.S. House edge, urged by President Donald Trump, while California Democrats responded Thursday with their own plan and referendum.",
      "Republicans in the Texas Legislature pursue mid‑decade redistricting to gain as many as five seats, leveraging the U.S. Supreme Court's ruling that only race-based gerrymandering is unconstitutional.",
      "Earlier this month, outnumbered Texas Democrats staged a 15‑day walkout and planned filibusters, pressing sponsor Phil King on legal concerns, while Rep. Lloyd Doggett said he will not seek reelection if the new map takes effect.",
      "If Republicans finalize their map Friday, Gov. Greg Abbott will approve it, asserting `Republicans are not finished in the United States`, while the president urges other GOP‑controlled states including Indiana and Missouri to revise maps.",
      "On a national level, the partisan makeup of existing districts puts Democrats within three seats of a House majority, while more Democratic-run states use independent redistricting commissions, shaping midcycle map changes."
    ],
    "right": [
      "On Friday, Texas Republicans aimed to finalize a mid-decade redraw to add five seats to their U.S. House edge, urged by President Donald Trump, while California Democrats responded Thursday with their own plan and referendum.",
      "Republicans in the Texas Legislature pursue mid‑decade redistricting to gain as many as five seats, leveraging the U.S. Supreme Court's ruling that only race-based gerrymandering is unconstitutional.",
      "Earlier this month, outnumbered Texas Democrats staged a 15‑day walkout and planned filibusters, pressing sponsor Phil King on legal concerns, while Rep. Lloyd Doggett said he will not seek reelection if the new map takes effect.",
      "If Republicans finalize their map Friday, Gov. Greg Abbott will approve it, asserting `Republicans are not finished in the United States`, while the president urges other GOP‑controlled states including Indiana and Missouri to revise maps.",
      "On a national level, the partisan makeup of existing districts puts Democrats within three seats of a House majority, while more Democratic-run states use independent redistricting commissions, shaping midcycle map changes."
    ]
  },
  "sources": [
    {
      "news_title": "Texas Legislature gives final approval to redrawn congressional map favoring GOP, sends to governor",
      "news_link": "https://www.ottumwacourier.com/news/national_news/texas-legislature-gives-final-approval-to-redrawn-congressional-map-favoring-gop-sends-to-governor/article_4afb7465-8af6-50d9-a6ce-a0bdecba789a.html",
      "bias": "Center",
      "text": "AUSTIN, Texas (AP) — Texas Legislature gives final approval to redrawn congressional map favoring GOP, sends to governor.\nAP\nTexas Legislature gives final approval to redrawn congressional map favoring GOP, sends to governor\n- AP\nGetting your Trinity Audio player ready...\nTrending Video\nRecommended for you\nFeatured Local Savings\nA searchable database of public salaries including the City of Ottumwa, Wapello County, Ottumwa Community School District, Indian Hills Community College, Ottumwa Water Works, City of Eldon, City of Blakesburg, City of Eddyville, South Iowa Area Detention Service Agency, South Iowa Area Crime Commission, Eddyville Water Department.\nMost Popular\nArticles\n- Traditional marriage proclamation approved by council\n- Teen injured after falling from moving vehicle in Ottumwa\n- Kilauea's eruption is back as the Hawaii volcano shoots lava for the 31st time since December\n- Traditional marriage proclamation returns to agenda\n- Boys golf: Bulldogs open eighth at Blue Top Ridge\n- Google's Pixel 10 phones raises the ante on artificial intelligence\n- Fairfield police: Man accused of luring teen across state lines now faces kidnapping charge\n- Cierran las mesas de votación y comienza el cómputo en las elecciones en Bolivia\n- Christian McCaffrey shines in 49ers camp after injury-filled season\n- Phillies' Nola allows six runs in 2 1/3 innings in his return, Bohm homers in his first game back"
    },
    {
      "news_title": "Texas GOP now fears gerrymandered map will backfire",
      "news_link": "https://www.rawstory.com/texas-2673911898/",
      "bias": "Left",
      "text": "Less than a day after Texas Republicans muscled through their new redistricting plan, cracks are already showing as some party members admit the map could come back to haunt them. Conservative journalist David Drucker told Morning Joe that while the GOP expected to net up to five new House seats in 2026, the lines they drew may have created far more competitive districts than intended. With much of the map shaded only “light red,” Republicans now worry that instead of padding their majority, they could be fighting to defend as many as ten vulnerable seats. The move, critics note, underscores how gerrymandering often empowers extremists in safe districts while destabilizing the broader party — a gamble Texas Republicans may soon regret.\nRead the full store here or watch the video below.\nTexas GOP fears new map may backfire, creating swing seats instead of gains roar-assets-auto.rbl.ms"
    },
    {
      "news_title": "Texas Democrats Prepare Final Show Of Resistance Against Republican-Backed Redrawn Maps",
      "news_link": "https://www.huffpost.com/entry/texas-election-2026-redistricting_n_68a92571e4b0768c801eed73",
      "bias": "Left",
      "text": "AUSTIN, Texas (AP) — The Texas Senate gave final approval to a new, Republican-leaning congressional voting map early Saturday, sending it to Gov. Greg Abbott for his signature.\nPresident Donald Trump has pushed for the map to help the GOP maintain its slim majority in Congress in the 2026 midterm elections. It has five new districts that would favor Republicans.\nAbbott, a Republican, is expected to quickly sign it into law, though Democrats have vowed to challenge it in court.\nThe effort by Trump and Texas’ Republican-majority Legislature prompted state Democrats to hold a two-week walkout and kicked off a wave of redistricting efforts across the country.\nDemocrats had prepared for a final show of resistance, with plans to push the Senate vote into the early morning hours in a last-ditch attempt to delay passage.\nState Sen. Carol Alvarado, leader of the Senate Democratic caucus, announced on social media that she planned to filibuster the bill with a long speech and intended to speak for several hours. But just when she expected to start, the Senate broke for a long dinner break.\nWhen members returned, Alvarado never had a chance to filibuster because Republicans accused her of breaking Senate rules by attempting to fundraise off the coming filibuster.\nSen. Charles Perry said it “appears to be potentially unlawful, at least unethical, using state resources for a campaign purpose.”\nA spokesperson for Alvarado did not immediately respond to an email and phone call from The Associated Press.\n“Shutting down a filibuster over a fundraising email is unprecedented,” Democratic Sen. Sarah Eckhardt said in a post on social media platform X. “It exposes the hypocrisy of Republicans, who will turn around and raise millions off stealing Texans’ votes while silencing their voices.”\nThe weekslong showdown has roiled the Texas Legislature, marked by a Democratic walkout and threats of arrest from Republicans. Much of the drama unfolded in the House, where the map ultimately passed Wednesday.\nDemocrats had already delayed the bill’s passage during hours of debate, pressing Republican Sen. Phil King, the measure’s sponsor, on the proposal’s legality, with many alleging that the redrawn districts violate the Voting Rights Act by diluting voters’ influence based on race.\nKing vehemently denied that accusation, saying, “I had two goals in mind: That all maps would be legal and would be better for Republican congressional candidates in Texas.”\n“There is extreme risk the Republican majority will be lost” in the House if the map does not pass, King said.\nThe showdown has also inflamed a broader, state-by-state redistricting battle, with governors from both parties pledging to redraw congressional maps.\nCalifornia Democrats approved legislation Thursday calling for a special election in November for residents to vote on a redrawn congressional map designed to help Democrats win five more House seats next year. Gov. Gavin Newsom quickly signed it.\n“This is not something six weeks ago that I ever imagined that I’d be doing,” Newsom said. “This is a reaction to an assault on our democracy in Texas.”\nCalifornia’s map needs voter approval because, unlike in Texas, a nonpartisan commission normally draws the map to avoid the sort of political battle that is playing out.\nOn Friday, Abbott called California’s redistricting “a joke” and asserted that Texas’ new map is constitutional but California’s would be overturned.\nBattle for the House waged via redistricting\nOn a national level, the partisan makeup of existing districts puts Democrats within three seats of a majority. The incumbent president’s party usually loses seats in the midterms.\nThe Texas redraw is already reshaping the 2026 race, with Democratic Rep. Lloyd Doggett, the dean of the state’s congressional delegation, announcing Thursday that he will not seek reelection to his Austin-based seat if the new map takes effect. Under the proposed map, Doggett’s district would overlap with that of another Democratic incumbent, Rep. Greg Casar.\nThe president has pushed other Republican-controlled states including Indiana and Missouri, to also revise their maps to add more winnable GOP seats. Ohio Republicans were also already scheduled to revise their maps to make them more partisan.\n“Republicans are not finished in the United States,” Abbott said.\nRedistricting typically occurs once a decade, immediately after a census. While some states have their own limitations, there is no national impediment to a state trying to redraw districts in the middle of the decade.\nThe U.S. Supreme Court has said the Constitution does not outlaw partisan gerrymandering, only using race to redraw district lines.\n‘Fight fire with fire’\nMore Democratic-run states have commission systems like California’s or other redistricting limits than Republican ones do, leaving the GOP with a freer hand to swiftly redraw maps. New York, for example, cannot draw new maps until 2028, and even then only with voter approval.\nRepublicans and some Democrats championed a 2008 ballot measure that established California’s nonpartisan redistricting commission, along with a 2010 one that extended its role to drawing congressional maps.\nBoth sides have shown concern over what the redistricting war could lead to.\nCalifornia Assemblyman James Gallagher, the Republican minority leader, said Trump was “wrong” to push for new Republican seats elsewhere. But he warned that Newsom’s approach, which the governor has dubbed “fight fire with fire,” is dangerous.\n“You move forward fighting fire with fire, and what happens?” Gallagher asked. “You burn it all down.”\n___\nCappelletti reported from Washington and Golden from Seattle."
    },
    {
      "news_title": "Texas Republicans aim for final passage of redistricting after California Democrats' counterpunch",
      "news_link": "https://abc7.com/post/texas-republicans-aim-final-passage-redistricting-california-democrats-counterpunch/17616458/",
      "bias": "Center",
      "text": "AUSTIN, Texas -- Texas Democrats prepared for a final show of resistance against a Republican effort to redraw the state's congressional maps mid-decade, signaling plans to speak late into Friday night on the Senate floor in an attempt to delay final passage.\nIt's the latest chapter in a weekslong showdown that has roiled the Texas Legislature, marked by a Democratic walkout and threats of arrest from Republicans. While much of the drama has unfolded in the House - where the map ultimately passed on Wednesday - Democrats are mounting one last breath of resistance as the maps move toward likely approval.\n\"Republicans think they can walk all over us. Today I'm going to kick back,\" Democratic state Sen. Carol Alvarado wrote on social media Friday. \"I've submitted my intention to filibuster the new congressional maps. Going to be a long night.\"\nDemocrats had already delayed the bill's passage during hours of debate, pressing state Sen. Phil King, the measure's sponsor, on the proposal's legality, with many alleging that the redrawn districts violated the Voting Rights Act by diluting voters' influence based on race - an accusation King vehemently denied.\n\"I had two goals in mind: That all maps would be legal and would be better for Republican congressional candidates in Texas,\" said King, a Republican.\nAlvarado, chair of the Texas Senate Democratic Caucus, will not be able to take breaks to eat, drink or even go to the bathroom once she starts. She will be required to remain standing and cannot sit down or lean on her chair, desk or other lawmakers for support.\nHer filibuster is unlikely to do more than delay the inevitable. In 2021, Alvarado spoke for 15 hours to protest GOP voting restrictions that ultimately became law.\nThe showdown in Texas has inflamed a broader, state-by-state redistricting battle, with governors from both parties pledging to redraw their congressional maps. It was kicked off by President Donald Trump pushing Texas Republicans to redraw the state's U.S. House map to help the party gain more seats in 2026.\nRELATED: Texas House approves new congressional map that favors Republicans in 2026 midterms\nCalifornia Democrats have punched back. They approved legislation Thursday calling for a special election in November for residents to vote on a redrawn congressional map designed to help Democrats win five more U.S. House seats next year. California Gov. Gavin Newsom quickly signed the special election bill.\n\"This is not something six weeks ago that I ever imagined that I'd be doing,\" Newsom said. \"This is a reaction to an assault on our democracy in Texas.\"\nCalifornia's map needs voter approval because, unlike in Texas, a nonpartisan commission normally draws the map to avoid the sort of political battle that is playing out.\nAbbott on Friday called California's redistricting \"a joke\" and said that while Texas' new map is constitutional, he claimed California's would be overturned.\nThe back-and-forth between the two states marks the starkest escalation yet in an emerging redistricting war, with both parties openly redrawing congressional lines to lock in power ahead of the 2026 midterm elections.\nOn a national level, the partisan makeup of existing districts puts Democrats within three seats of a majority. The incumbent president's party usually loses congressional seats in the midterms.\nThe Texas redraw is already reshaping the 2026 race, with Democratic Rep. Lloyd Doggett, the dean of Texas' congressional delegation, announcing Thursday that he will not seek reelection to his Austin-based seat if the new Republican-drawn map takes effect. Under the proposed map, Doggett's district would overlap with another Democratic incumbent, Rep. Greg Casar.\nThe president has pushed other Republican-controlled states including Indiana and Missouri to also revise their maps to add more winnable GOP seats. Ohio Republicans were also already scheduled to revise their maps to make them more partisan.\n\"Republicans are not finished in the United States,\" Abbott said Friday.\nRedistricting typically occurs once a decade, immediately after a census. While some states have their own limitations, there is no national impediment to a state trying to redraw districts in the middle of the decade.\nThe U.S. Supreme Court has said the Constitution does not outlaw partisan gerrymandering, only using race to redraw district lines.\nMore Democratic-run states have commission systems like California's or other redistricting limits than Republican ones do, leaving the GOP with a freer hand to swiftly redraw maps. New York, for example, can't draw new maps until 2028, and even then, only with voter approval.\nRepublicans and some Democrats championed the 2008 ballot measure that established California's nonpartisan redistricting commission, along with the 2010 one that extended its role to drawing congressional maps.\nBoth sides have shown concern of what the redistricting war could lead to.\nCalifornia Assemblyman James Gallagher, the Republican minority leader, said Trump was \"wrong\" to push for new Republican seats elsewhere. But he warned that Newsom's approach, which the governor has dubbed \"fight fire with fire,\" was dangerous.\n\"You move forward fighting fire with fire and what happens?\" Gallagher asked. \"You burn it all down.\"\nSEE ALSO: California moving forward with partisan redistricting effort to counter Texas' move"
    },
    {
      "news_title": "Texas Republicans aim for final passage of redistricting after California Democrats’ counterpunch - The Boston Globe",
      "news_link": "https://www.bostonglobe.com/2025/08/22/nation/redistricting-bounces-back-to-texas/",
      "bias": "Lean Left",
      "text": "AUSTIN, Texas (AP) — Texas Republicans were aiming Friday to give final passage to an unprecedented mid-decade redraw of the state’s congressional map and send it to Gov. Greg Abbott’s desk for final approval ahead of the 2026 elections.\nDebate in the GOP-controlled Senate stretched into Friday afternoon, as Democrats attempted to delay the bill’s passage. Still, the proceedings remained far more subdued than the fiery showdown in the House that sparked a broader, state-by-state redistricting battle, with governors from both parties pledging to redraw their congressional maps.\nDemocrats spent hours pressing state Senator Phil King, the measure’s sponsor, on the legality of the proposal, with many alleging that the redrawn districts violated the Voting Rights Act by diluting voters’ influence based on race — an accusation King vehemently denied.\n“I had two goals in mind: That all maps would be legal and would be better for Republican congressional candidates in Texas,” said King.\nCalifornia Democrats landed their counterpunch to Texas on Thursday, just a day after Texas Republicans advanced their redrawn map that had come at the urging of President Trump with the aim of padding their House majority by five seats.\nAdvertisement\nLawmakers in California voted mostly along party lines to approve legislation calling for a special election in November to approve a redrawn congressional map designed to help Democrats win five more U.S. House seats next year. California’s map needs voter approval because, unlike in Texas, a nonpartisan commission normally draws the map to avoid the sort of political battle that is playing out.\nCalifornia Governor Gavin Newsom, who rallied Democrats in his state to counter Texas’ initial moves, quickly signed the special election bill. If Republicans in Texas finalize their map Friday, Abbott is expected to follow suit.\nAdvertisement\nThe back-and-forth between the two states marks the starkest escalation yet in an emerging redistricting war, with both parties openly redrawing congressional lines to lock in power ahead of the 2026 midterm elections.\nAbbott on Friday called California’s redistricting “a joke” and said that while Texas’ new map is constitutional, he claimed California’s would be overturned.\nNewsom said Thursday that the measure “is a reaction to an assault on our democracy in Texas,” and pledged a campaign that would reach out to Democrats, Republicans and independent voters.\n“This is not something six weeks ago that I ever imagined that I’d be doing,” he said.\nCalifornia Republicans have sued and called for a federal investigation. They promise to fight the measure at the ballot box as well.\nCalifornia Assemblyman James Gallagher, the Republican minority leader, said Trump was “wrong” to push for new Republican seats elsewhere, contending the president was responding to Democratic gerrymandering in other states. But he warned that Newsom’s approach, which the governor has dubbed “fight fire with fire,” was dangerous.\n“You move forward fighting fire with fire and what happens?” Gallagher asked. “You burn it all down.”\nA battle for US House control waged via redistricting\nOn a national level, the partisan makeup of existing districts puts Democrats within three seats of a majority. The incumbent president’s party usually loses congressional seats in the midterms.\nThe Texas redraw is already reshaping the 2026 race, with Democratic Representative Lloyd Doggett, the dean of Texas’ congressional delegation, announcing Thursday that he will not seek reelection to his Austin-based seat if the new Republican-drawn map takes effect. Under the proposed map, Doggett’s district would overlap with another Democratic incumbent, Representative Greg Casar.\nAdvertisement\nThe president has pushed other Republican-controlled states including Indiana and Missouri to also revise their maps to add more winnable GOP seats. Ohio Republicans were also already scheduled to revise their maps to make them more partisan.\n“Republicans are not finished in the United States,” Abbott said Friday.\nRedistricting typically occurs once a decade, immediately after a census. While some states have their own limitations, there is no national impediment to a state trying to redraw districts in the middle of the decade.\nThe US Supreme Court has said the Constitution does not outlaw partisan gerrymandering, only using race to redraw district lines.\n“What is allowed by the Supreme Court is drawing (districts) for political reasons,” Abbott said. “These were drawn by Republicans for political reasons to assure that Republicans would have better representation in Congress.”\nDemocrats have sought a national commission for redistricting\nRepublicans and some Democrats championed the 2008 ballot measure that established California’s nonpartisan redistricting commission, along with the 2010 one that extended its role to drawing congressional maps.\nNewsom, who backed the initial redistricting commission ballot measures, contended his state was still setting a model.\n“We’ll be the first state in US history, in the most democratic way, to submit to the people of our state the ability to determine their own maps,” Newsom said before signing the legislation.\nFormer President Barack Obama, who has also backed a nationwide nonpartisan approach, has also backed Newsom’s bid to redraw the California map, saying it was necessary to stave off the GOP’s Texas move.\nMore Democratic-run states have commission systems like California’s or other redistricting limits than Republican ones do, leaving the GOP with a freer hand to swiftly redraw maps. New York, for example, can’t draw new maps until 2028, and even then, only with voter approval.\nAdvertisement\nEarlier this month, outnumbered Texas Democrats left the state for 15 days to block a vote. Once they returned, they were assigned round-the-clock police monitoring.\n——\nRiccardi reported from Denver. Austin and Nguyen reported from Sacramento, California. Associated Press reporter Joey Cappelletti in Washington, D.C., also contributed."
    },
    {
      "news_title": "To beat Texas Republicans, California Dems want to load the dice",
      "news_link": "https://wng.org/roundups/to-beat-texas-republicans-california-dems-want-to-load-the-dice-1755893997",
      "bias": "Right",
      "text": "To beat Texas Republicans, California Dems want to load the dice\nGOP lawmakers in California angered by retaliatory redistricting\nRepublicans in the Texas Legislature want to help their party capture as many as five additional seats in Congress by remapping the state’s districts, but Democrats in California are making countermoves to try to keep the status quo. California Gov. Gavin Newsom signed the Election Rigging Response Act on Thursday, teeing up a statewide referendum on the matter in November.\nAt least one Republican assemblyman hoped it wouldn’t come to this.\n“I would love to see all the states stop their efforts to redistrict midcycle,” Republican Assemblyman Josh Hoover told me, referring to the campaign to change congressional boundaries in between U.S. censuses. The process, known as gerrymandering, maps out districts based on voting patterns that favor one political party over the other. “I don’t think Texas should be doing it. I don’t think California should be doing it. I think it’s very inappropriate for any state to do that.”\nThe U.S. Constitution mandates that each state have representation in the House of Representatives proportional to its population as determined by a census taken every 10 years. Historically, states have adjusted their districts every 10 years, using data from Census Bureau.\nCalifornia has a constitutional provision against redistricting between censuses, which is why Democrats must pass a statewide referendum before redrawing their congressional districts in a way that makes them more likely to win elections. Republican legislators from California who spoke to WORLD condemned the redistricting effort as a blatant partisan power grab. Democrats say Republicans opened the door; they are just walking through it.\nPresident Donald Trump has cheered partisan gerrymandering efforts like the one in Texas. Last week, Newsom responded with a statement excoriating Trump and “his Republican lapdogs.”\n“This moment calls for urgency and action—that is what we are putting before voters this November: a chance to fight back against his anti-American ways,” Newsom said.\nCalifornia’s Election Rigging Response Act would allow the state to adopt new congressional maps if—and only if—Republican states actually go through with their plans. The maps are designed to help California Democrats win five more seats in Congress.\nCurrently, California puts the redistricting process in the hands of a commission composed of 14 members who can serve once every 10 years. Five member are from the largest political party based on state registration, five are from the second largest, and four are unregistered with any party. Commission members must have voted in two of the last three statewide general elections.\nCalifornia put that commission in place through a constitutional amendment approved in 2008.\nRepublicans are betting that voters will chafe at the idea of having to reimplement a practice they already did away with.\n“Among Republicans in the Capitol, the concern is the same: this is a dangerous precedent,” Republican Assemblywoman Heather Hadwick said. “If the independent commission can be bypassed here, it can be bypassed anywhere. That undermines the trust Californians placed in the system when they voted to remove politicians from the process in the first place.”\nShe declined to comment on the redistricting efforts in Texas.\nAssemblywoman Diane Dixon also declined to comment on whether Texas lawmakers should continue their plan, but she noted that California’s effort actively looks to suspend part of existing law. That’s different from Texas—where there is no law against gerrymandering.\n“Even ‘temporarily’ killing off a piece of democracy could be used by future politicians to undermine constitutional safeguards,” said Dixon, who is Republican. “We have a California’s Citizens Redistricting Commission, which was created by voters to take the power of drawing political districts out of the hands of politicians and put it where it belongs—with the people.”\nEarly polling in California suggests that voters have mixed feelings about the redistricting effort.\nFindings from TrueDot in partnership with Politico on Thursday found that as many as 70% of Democratic respondents believed gerrymandering is always unacceptable. The same findings showed that 63% of Democrats said they supported California’s effort in light of Texas’ plans.\n“That is a very low start,” Assemblyman Hoover said in reference to the poll results. “Once there’s a campaign that is explaining what this really does, I think this fails by quite a bit.”\nThis keeps me from having to slog through digital miles of other news sites. —Nick\nSign up to receive The Stew, WORLD’s free weekly email newsletter on politics and government.\nPlease wait while we load the latest comments...\nComments\nPlease register, subscribe, or log in to comment on this article."
    },
    {
      "news_title": "“Commander-in-Cheat”: After Texas, Trump’s Redistricting Push Goes National",
      "news_link": "https://www.democracynow.org/2025/8/22/texas_democrats",
      "bias": "Left",
      "text": "Topics\nGuests\n- Trey Martinez FischerDemocratic Texas state representative for House District 116 in San Antonio.\n- David Daleyauthor and senior fellow at FairVote.\nDemocrats and Republicans are locked in a historic battle over congressional representation as Texas Republicans gerrymander the state’s district maps to flip five Democratic seats, at the request of President Trump. California Governor Gavin Newsom says he is fighting “fire with fire,” signing legislation to hold special elections for the public to approve a new gerrymandered map of their own. David Daley, a voting rights expert and the author of Antidemocratic: Inside the Far Right’s 50-Year Plot to Control American Elections, calls this a “gerrymandering Armageddon” that threatens to spread nationwide. “Donald Trump does not want to have an election fair and square,” says Texas state legislator Trey Martinez Fischer, a Democrat representing San Antonio. “He wants to be the 'commander-in-cheat.' He wants to cheat on America, cheat on democracy, steal these congressional seats.”\nTranscript\nAMY GOODMAN: California Governor Gavin Newsom signed legislation Thursday approving a special election in November that will ask voters to approve a new, partisan congressional map favoring Democrats. Lawmakers in Sacramento approved the measures a day after Texas’s Republican-controlled House passed a new congressional district map designed to flip five Democratic-held U.S. House seats in the 2026 midterm elections. This rare instance of mid-decade redistricting came at the behest of President Trump. California Governor Gavin Newsom spoke Thursday.\nGOV. GAVIN NEWSOM: We got here because the president of the United States is struggling. We got here because the president of the United States is one of the most unpopular presidents in U.S. history. We got here because he recognizes that he will lose the election. Congress will go back into the hands of the Democratic Party next November. We got here because of his failed policies. Those are being exposed hour by hour, reinforced today by Walmart announcing they’ll be raising prices because of the tax increases, because of the tariffs, reminded every day by a slowing economy, growing mistrust, distrust all across this nation. Across the board, he is failing. He recognized that, and that’s why he made a phone call to Greg Abbott asking for five seats — can’t win by playing by traditional sets of rules. He plays by no rules. I remind you all the time: It’s not the rule of law, it’s the rule of Don. And we’re standing up to that.\nAMY GOODMAN: We’re joined now by two guests. Trey Martinez Fischer is a Democratic Texas state representative from San Antonio. His piece for the San Antonio Express-News is headlined “To preserve democracy, Texas Democrats must fight fire with fire.” Earlier this month, he and other Texas Democratic lawmakers fled the state in an attempt to block passage of the new, gerrymandered congressional maps. He’s joining us from Austin.\nAnd in Haydenville, Massachusetts, David Daley is with us, a senior fellow at FairVote, author of several books on voting, including Antidemocratic: Inside the Far Right’s 50-Year Plot to Control American Elections and Unrigged: How Americans Are Battling Back to Save Democracy.\nLet’s go first to Austin to speak with Trey Martinez Fischer. Explain what has taken place, what is taking place as we speak, in the Texas Legislature, why you fled the state to break quorum, but the fact that now the vote, one of the votes, has taken place to pass the GOP-favored gerrymandered map.\nREP. TREY MARTINEZ FISCHER: No, well, thank you for the question. Well, first, it was one of the — just historic bait and switch. As you know, in Texas, we had a horrific flood where many people lost their lives. Many lives were just upended. And the idea was, we were going to come to a special session to aid the flood relief victims, to try to make things whole. And in just really with a snap of a finger, the governor announces his intention to have a mid-decade redistricting to bring five new Republican seats in Congress, which really threw everybody off.\nWe knew from the start that we did not have the votes to stop that. And moreover, we didn’t think the country was paying attention to what was happening in Texas. So, my fellow Democrats and I, we decided to elevate this conversation, fight in the national arena, leave the state of Texas for over two weeks, you know, find refuge in Illinois under the leadership and watch Governor Pritzker. And we used our two weeks to rally the country, to wake people up and to let people know that Donald Trump does not want to have an election fair and square, that he wants to be the “commander-in-cheat.” He wants to cheat on America, cheat on democracy, steal these congressional seats.\nAnd I’m just thankful that other leaders woke up, saw what was going on, and said, “OK, if Trump is going to throw out the rule book, then we will fight fire with fire.” And I think that’s what you see in California.\nAMY GOODMAN: Did California have to do with you coming back to Texas, even though you knew that meant that they would pass the gerrymandered map?\nREP. TREY MARTINEZ FISCHER: I think what it meant is, again, you know, had we stayed in Austin and we fought this in the middle of the night, it might have made the local news. We know this is now international news. We know that people are starting to ask questions about mid-decade redistricting and gerrymandering and all of the stuff that is happening.\nAnd quite frankly, if you ask California leaders, they needed time to educate their voters, to educate their lawmakers. They needed a discussion to be on the national stage. And I think, as you saw very recently, that a poll in the state of California showed 57% of Californians agree with Governor Newsom’s plan to draw five new congressional seats in California. That doesn’t happen by osmosis. That happens by engagement and people coming together and this country rallying, because, look, I never underestimate the power of the American people when it comes to preserving and protecting our democracy.\nAMY GOODMAN: Representative Martinez Fischer, you’re serving your 12th term in the Texas House of Representatives. You’re the former chair of the House Democratic Caucus and the Mexican American Legislative Caucus. Talk about how partisan gerrymandering relates to racial gerrymandering.\nREP. TREY MARTINEZ FISCHER: Thank you very much for the question, because that is the heart of the matter here. You know, Republicans and Donald Trump and Governor Abbott will tell you, “Well, this is nothing new here. This is just — we’re looking for partisan performance, and that is entirely legal.” Well, yes, you can draw maps for partisan performance, but you can’t do it on the backs of the minority community.\nHere’s what the maps in Texas do and how minority rights are taken away. Number one, you take districts in Texas, congressional districts like, you know, the one represented by Representative Al Green. That district is a performing district right now. It elects African Americans, even though it doesn’t have a majority of African Americans in that district. Under this plan, what has happened now, you see a concentration of voters, more than what is necessary for that map to perform, being placed in this Congressional District 18, and now, all of a sudden, you’ve just packed that district, and you’ve diluted the voice of the African American community.\nLet’s take another example. In San Antonio, where I’m from, you took a district that had a 60% Hispanic citizen voting age population, and you reduce that now to barely 50%, knowing full well, by looking at election data, that Hispanics will never, ever, ever have the opportunity to elect a candidate of their choice. And I find that very confusing, because the narrative, at least in Texas, is that Hispanics are trending Republican. If they’re trending Republican, why do you shrink the numbers so low that you know Hispanics’ voice will never be heard? And to do this, the way it’s done in Texas is they cut precincts. And that’s a little bit into the weeds, but you look at this map, and over 400 precincts were cut. You can’t cut a precinct by accident. You are laser-focused, looking for people you want to keep, getting rid of those you don’t. And that’s how you rig an election, and that’s how you decide an outcome before the first vote is cast.\nAMY GOODMAN: Let me ask you something. Could this backfire on the Republicans? Because you take very safe Republican districts, and you have to absorb more Democrats to take away the power of the Democratic districts. But could this possibly backfire?\nREP. TREY MARTINEZ FISCHER: I think it could backfire. And I think that’s why you saw the Republican legislative leader in California say that he’s not a fan of mid-decade redistricting. I think he even said, “When you fight fire with fire, you end up burning the whole place down.” I do believe that Republicans are at risk, but I think that that is a risk worth taking for President Trump, because the other side of the coin is maybe a Democratic House of Representatives that gets to ask questions of the executive branch, that has subpoena power, that has investigative power, probably a lot of risk for the president, and he’d rather give up his own Republicans in Congress just to protect his backside. And that will show you, you know, what the stakes are and what he will do to win this election.\nAMY GOODMAN: I want to bring David Daley into this conversation, David Daley, who wrote the book Undemocratic — Antidemocratic: Inside the Far Right’s 50-Year Plot to Control American Elections, senior fellow at FairVote. Talk about this redistricting war. We’re seeing what’s happening in Texas, what’s happened in now California, but this doesn’t stop with these two states.\nDAVID DALEY: That’s exactly right, Amy. We are in the midst of a gerrymandering Armageddon. And it’s going to start in Texas, spread to California, but it’s not going to stop there. And that’s really the challenge that Democrats face right now, because it’s entirely possible that the Texas and California gerrymanders will cancel each other out. Now, both of these two redistrictings in the middle of the decade would be the most extreme manipulation of electoral maps in modern American history. But it’s not going to stop there. This is about to spread to Republican-controlled maps in Ohio, in Indiana, in Missouri, in Florida, where Ron DeSantis has said he’s looking at as many as five additional districts. I don’t think he can get that many, but certainly two or three more in Florida. If Republicans want to keep going, they could go to Tennessee, Georgia, North Carolina, Kansas, Kentucky, New Hampshire.\nThe problem for Democrats is that they have essentially maxed out the places where they can gain additional seats. In New York, Governor Hochul talking tough, talking about declaring war, but this is a war that she can’t enter until 2028 because of the state’s constitutional prohibitions on mid-decade redistricting. In Illinois, Governor Pritzker already signed a pretty gerrymandered 14-Democrat, three-Republican map back in 2021. It’d be very difficult to squeeze out another Democratic seat there. In Maryland, in Oregon, I don’t think there’s a lot left on this map for Democrats to claim.\nRepublicans have got a lot more targets out there. This isn’t going to stop. And it could get even worse next year, if the U.S. Supreme Court, as we imagine, eliminates protections on majority-minority seats, shreds the remaining pieces of Section 2 of the Voting Rights Act and allows Southern states, like South Carolina, Louisiana, Georgia, Alabama, Mississippi, to go after majority-Black seats. This is the Callais case from Louisiana that the court will hear on October 15th. There’s lots and lots of danger ahead here. If Democrats think it’s going to be easy to take back the House in 2026, Republicans are doing everything they can to boost their chances before a vote is cast.\nAMY GOODMAN: I want to go back to this issue, David Daley, of political gerrymandering, which is allowed, partisan gerrymandering, and racial gerrymandering, which is not allowed. And if you can explain more fully the role of the Supreme Court, and particularly the chief justice, John Roberts?\nDAVID DALEY: Yes. And I think that that really is the particular bitterness of this situation, is that we don’t have to be here. We are here, in many ways, because John Roberts and the U.S. Supreme Court closed the federal courts to partisan gerrymandering claims back in 2019. This is a case from North Carolina called Rucho v. Common Cause.\nAnd what John Roberts said is that gerrymandering is just politics as usual, right? Now what we’re seeing in Texas, the most extreme manipulation of maps in modern American history, that’s just politics as usual, says the chief justice. And he said this at a time when federal courts, judges appointed by presidents of both parties, were looking at maps drawn by both parties, by Democrats in Maryland, by Republicans in Wisconsin, Ohio, Michigan and North Carolina. And they said, “We have all the tools we need to go ahead and fix this.” Roberts not only said no, but he closed the federal courts forever to these claims.\nSo, what he did was he unleashed, he incentivized the kinds of gerrymanders we saw back in 2021. He allowed for what is happening right now. He left voters completely naked in the face of these partisan power grabs. The Supreme Court really failed the country here.\nAnd I think it’s worth pointing out that if Republicans had not stolen that seat, given — that the Democrats were able to appoint back in 2016, that this entire thing turns out much differently right now. That case comes out differently. What has happened at the U.S. Supreme Court has accelerated and incentivized this entire anti-voter summer that we are seeing right now.\nAMY GOODMAN: I want to go to another issue, David. President Trump said Monday he’ll soon sign an executive order to ban voting by mail, calling the long-standing practice a “fraud.” Writing on social media, Trump also said he planned to target, quote, “Highly 'Inaccurate,' Very Expensive, and Seriously Controversial VOTING MACHINES,” unquote. Trump’s pledge came just days after he made these comments to Fox News, following his Alaska summit with Russian President Vladimir Putin.\nPRESIDENT DONALD TRUMP: You know, Vladimir Putin said something, one of the most interesting things. He said, “Your election was rigged because you have mail-in voting.”\nAMY GOODMAN: So, you have President Trump saying that Putin told him that his election is rigged because they have mail-in voting. Can you talk about the significance of banning mail-in ballots in this country?\nDAVID DALEY: Donald Trump cannot ban mail-in ballots. Our elections are regulated by the states. Donald Trump does not have this power. He cannot get that done. And I think the silence that you are seeing from Republican officials in states make that clear. Mail-in balloting is the way elections in many, many states, especially out West, are conducted. Donald Trump has voted by mail most of his life. Republicans have been very good over the years at generating mail-in ballots.\nThis is a distraction. This is an effort by the president to do what he does here, right? He likes to suggest that elections are not corrupt when he wins, and the ones he loses have all sorts of problems. This is an attempt ahead of the election to try to sow doubt among his followers that it will be free and fair. We do not have a problem with voter fraud in this country, with mail-in ballot fraud. Whenever they make these arguments, they are unable to find actually any examples at all that they can point to here.\nThe bigger challenge, I think, is that what we are seeing in Washington, D.C., right now could play out around the country in Democratic cities on Election Day in 2026, right? If what we are seeing in Washington is a dry run for what we could see in Philadelphia or Atlanta, Milwaukee, Detroit — National Guard and ICE troops, masked, on the streets, trying to intimidate voters — that, to me, is something very concerning and that we ought to be thinking about right now.\nAMY GOODMAN: Daley, about things we should be talking about, now the issue is gerrymandering. The issue is mail-in ballots. But issues that you focused on, like ranked-choice voting, that led to the Democratic candidate in the mayoral election this year, Zohran Mamdani, the popular electoral vote, where do these stand today?\nDAVID DALEY: There is, I think, a greater awareness than ever that what we need on redistricting, especially, is a national solution to a national problem, right? If we’re going to keep going state by state, what happens is, you know, Texas does something lousy like this, and it reverberates. It has consequences across the entire country, because Texas’s map does not stay in Texas. Republicans have a three-seat advantage in Congress, and so if you grab an additional five seats there, it has a ripple effect. What we need is a national solution.\nAnd I think the very best one would be a much more proportional House, along the lines of the Fair Representation Act that Jamie Raskin and Don Beyer have proposed. You can learn much more about this at FairVote.org. But really, the solution here would be to go to larger multimember districts that can’t be gerrymandered because the district lines no longer choose winners and losers, and to use ranked-choice voting within those districts. You would then see that every district in America becomes a swing district. Right now in this country, only 37 of 435 congressional seats were competitive in the 2024 election. That’s no way to run a democracy. When you look around the world, we would call nations where more than 90% of elections are noncompetitive something much different than a healthy, functioning democracy. So —\nAMY GOODMAN: And we’re going to do more on national popular vote, as well as ranked-choice voting —\nDAVID DALEY: Absolutely.\nAMY GOODMAN: — in the coming months. But I want to end with Texas Democratic state Representative Trey Martinez Fischer. House Democrats will sue to block the gerrymandered map once it’s signed. But won’t this process take too long to matter right now?\nREP. TREY MARTINEZ FISCHER: You know, I’m not so sure. Like, you know, again, filing for office in Texas begins in November. There’s lots of work to be done by the secretary of state, local election officials. And so, I think when this — when this map finds itself in court, I don’t think time is on the side of President Trump and Governor Abbott. And I think a federal panel, you know, might step in and tap the brakes on this. Now, understand, we are still fighting over maps that were passed in 2021, maps, I would argue, that Republicans said were perfectly fine and weren’t racially gerrymandered. So we have an ongoing fight under the current districts. Now we’re going to bring a new map and add an additional fight on top of that. I think that might be too much to bear for election officials. And so, if the brakes are tapped, maybe we’ll end up running in the current districts, which I think will be very competitive. And so, then, all of this work will be for naught. But I don’t think we sit on the sidelines. We do not have that luxury. We have to fight with every tool that we have, from quorum breaks to legislative floor fights to fighting at the courthouse, because I do believe, while we may lose the votes in the Capitol, we are all equal in federal court.\nAMY GOODMAN: And this latest news: The longtime Democratic Congressmember Lloyd Doggett says if the gerrymandered maps are approved, he will not run again. He would be running against the head of the Congressional Progressive Caucus, Greg Casar.\nTrey Martinez Fischer, Democratic Texas state representative for San Antonio, thank you so much for joining us from Texas’ capital of Austin, and David Daley, author of Antidemocratic: Inside the Right’s 50-Year Plot to Control American Elections, senior fellow at FairVote.\nComing up, a Democracy Now! broadcast exclusive. We’ll talk to the State Department press officer who was just fired. He had been pushing for sharing condolences with the families of the dead Gaza journalists killed in an Israeli airstrike. Stay with us.\n[break]\nAMY GOODMAN: “Knockando” by the folk musician Michael Hurley, performing at our Democracy Now! studio.\nMedia Options"
    }
  ]
}