{
  "story_id": "GN_20250825_224527_49948ab1",
  "metadata": {
    "title": "South Korea's Lee faces pivotal test at first summit with Trump",
    "timestamp": "2025-08-25T22:45:27.621640",
    "url": "https://ground.news/article/will-trump-put-money-over-principle-when-meeting-s-koreas-lee"
  },
  "bias_distribution": {
    "total_sources": "27",
    "leaning_left": "7",
    "center": "8",
    "leaning_right": "5"
  },
  "perspective_summaries": {
    "left": [
      "President Donald Trump is hosting South Korean President Lee Jae Myung at the White House for talks on trade and defense, particularly concerning a July trade deal that involves significant South Korean investment in the U.S. and tariffs on South Korean goods set at 15%.",
      "President Lee has discussed cooperation on manufacturing sectors such as semiconductors, batteries, and shipbuilding, while trade surplus issues between the U.S. and South Korea are also on the agenda, as noted by the two leaders' offices."
    ],
    "center": [
      "On August 25, President Donald Trump will meet South Korean President Lee Jae Myung in Washington for their first in-person summit, a crucial test of the US-South Korea alliance's future.",
      "Facing an increasingly assertive China, Washington is pressing Seoul to reshape bilateral security and economic ties and to spend 5 percent of GDP on defense amid alliance modernization talks.",
      "Expectations are that Lee will unveil U.S. investment pledges under a trade deal lowering reciprocal tariffs to 15 percent from 25 percent, with $350 billion in South Korean investment prospects and South Korea's defence budget at around 61.2 trillion won, about 2.32 percent of GDP.",
      "Trump is expected to press Lee to pledge higher defence spending, potentially billions for 28,500 US troops, while Lee aims to impress and avoid surprises in Seoul's cooperation efforts.",
      "The risk of test-firings and deeper Russia links means denuclearisation talks will be challenging, with Victor Cha noting North Korea's disinterest due to support from Russia."
    ],
    "right": [
      "The summit between Presidents Lee Jae Myung and Donald Trump is set for August 25, 2025, and aims to address the future of the South Korea-U.S. alliance amid increasing Chinese assertiveness.",
      "Lee and Trump will discuss several critical alliance issues, including U.S. demands for greater South Korean defense spending and the situation with North Korea's nuclear program.",
      "Both leaders have expressed willingness to engage North Korea, but Kim Jong Un's regime has rejected any denuclearization dialogue.",
      "Experts note this summit is an opportunity for Lee to build rapport with Trump while navigating complex topics like military spending and alliance modernization."
    ]
  },
  "sources": [
    {
      "news_title": "Trade and defense on the agenda as President Donald Trump hosts South Korea's Lee Jae Myung",
      "news_link": "https://www.wboc.com/news/international/trade-and-defense-on-the-agenda-as-president-donald-trump-hosts-south-koreas-lee-jae/article_e256b1bf-a56d-5690-9eb1-7a80e7f7e7ca.html",
      "bias": "Center",
      "text": null
    },
    {
      "news_title": "South Korea's new president to meet with Trump and Kilmar Abrego Garcia's ICE check-in: Morning Rundown",
      "news_link": "https://www.nbcnews.com/news/us-news/south-korea-president-trump-abrego-garcia-dc-troops-morning-rundown-rcna226921",
      "bias": "Lean Left",
      "text": "In today’s newsletter: South Korea’s president will meet with Donald Trump to discuss tariffs, a shipbuilding investment and nuclear-armed North Korea. National Guard troops deployed to D.C. are now armed with guns. And what could happen at Kilmar Abrego Garcia’s ICE check-in after the government announced plans to deport him to Uganda.\nHere’s what to know today.\nNo ‘bromance’ expected: Trump to meet South Korea’s president\nSouth Korea, one of the strongest U.S. allies in Asia, has had a rough start with President Donald Trump, struggling in tariff talks as it spent months without a permanent leader. But its new president, Lee Jae-myung, has arrived for a meeting with Trump on Monday with a $150 billion offering whose name is sure to appeal to the U.S. leader: “Make America Shipbuilding Great Again.”\nThis is Morning Rundown, a weekday newsletter to start your day. Sign up here to get it in your inbox.\nThe package, which South Korean officials also refer to as MASGA, includes the construction of new U.S. shipyards, the training of shipbuilding personnel and U.S. Navy ship maintenance. It’s a key part of the last-minute trade deal South Korea struck last month with Trump, who says he wants to revitalize U.S. shipbuilding for both economic and national security reasons.\nThe White House summit is an important opportunity for Lee to advocate South Korea’s interests with Trump after months of political instability created by former President Yoon Suk Yeol’s botched declaration of martial law.\nThough Lee comes from a liberal party, he and Trump share much in common — both have been the subjects of assassination attempts, and both are more open to diplomacy with nuclear-armed North Korea than their predecessors. But they have very different outlooks on political, economic and foreign policy, which could make the summit challenging, analysts told NBC News.\nRead more about the White House summit here.\nNational Guard troops in D.C. begin carrying firearms\nNational Guard troops deployed to Washington to support Trump’s effort to mitigate crime began carrying firearms Sunday evening, according to a Defense Department official with knowledge of the planning.\nDefense Secretary Pete Hegseth had authorized the change last week. The majority of the guard members will carry M17 pistols, their service-issued weapons, the official said, while a small number of the troops will be armed with their service M4 rifles.\nThe troops are authorized to use their weapons for self-protection and “as a last resort” in response to an “imminent threat,” according to the federal task force managing the operation.\nSeveral armed troops were seen Sunday evening patrolling the Chinatown neighborhood, wearing patches labeled “MP” to signify their role as military police. There will be an increased presence in “pre-specified metro locations” to coincide with the start of the school year, the task force said.\nA White House official told NBC News that despite carrying weapons, the National Guard is not making arrests. More than 2,000 troops are currently in the nation’s capital, and have been assisting law enforcement with community safety patrols, traffic control points and crowd flow support.\nMore on the D.C. takeover:\nAs D.C. students return to school today, Mayor Muriel Bowser is being flooded with questions from parents concerned about ICE agents on campuses and National Guard troops pouring in from other states. The acting ICE director said immigration officers won’t be visiting D.C. schools on the first day of class. But he said they could be on campuses in the future. Chicago’s mayor is scoping out legal avenues to prevent soldiers from overtaking the Windy City after federal threats. Trump said on Truth Social that he would send the military into Baltimore to “quickly clean up” crime, another threat to replicate the Guard deployment in Washington in other cities.\nWhat might happen at Kilmar Abrego Garcia's ICE check-in today\nKilmar Abrego Garcia, the man who the government says was mistakenly deported to a notorious prison in El Salvador, will meet with immigration officials today under the looming threat of a second deportation.Minutes after Abrego was released from federal custody last week, immigration authorities notified him that they intend to deport him to Uganda. Separately, the Trump administration offered him a plea deal that would eventually deport him to Costa Rica, giving him until “first thing” today to accept.\nHere’s how Abrego’s ICE check-in could go:\n→ These appointments are typically a brief meeting with an ICE officer to review case status, provide updates and confirm where a person is living. Usually, a person is released until the next scheduled check-in.\n→ Abrego’s attorneys told NBC News they expect he will be taken into ICE custody during the check-in, given the government’s deportation plan.\n→ From there, Abrego could take the plea deal and eventually be deported to Costa Rica. He could refuse and be deported to Uganda as soon as Wednesday. Or, his lawyers could fight to prevent his deportation to Uganda altogether.\nVance remains optimistic about ending Ukraine war while Kremlin dampens hopes\nVice President JD Vance remains confident the U.S. can broker an end to the war between Russia and Ukraine despite potential hang-ups that have emerged since Trump’s meeting with Russian President Vladimir Putin. “We believe we’ve already seen some significant concessions from both sides, just in the last few weeks,” Vance said in an exclusive interview on NBC News’ “Meet the Press.”\n“If we hit a brick wall, then we’re going to continue this process of negotiation, of applying leverage,” the vice president added.\nMeanwhile, Russia’s top diplomat, Foreign Minister Sergey Lavrov, cast doubt on hopes that Trump will propel a swift end to the war. Lavrov cited several issues that remain unresolved, including security guarantees for Ukraine and territorial disputes.\nHe told “Meet the Press” moderator Kristen Welker that Ukraine has hindered the process, saying President Volodymyr Zelenskyy and European leaders “don’t want peace.”\n“Zelenskyy said no to everything,” Lavrov said. “How can we meet with a person who is pretending to be a leader?” Lavrov said Putin is ready to meet with Zelenskyy “when the agenda is ready.” But he suggested the Russian president would not sign a peace agreement with Zelenskyy, whose legitimacy Moscow has questioned since Ukrainian elections were postponed last year amid martial law.\nRead more on Vance here, and Lavrov here.\n'Sopranos' actor Jerry Adler dies at 96\nJerry Adler, best known for playing a mobster’s confidant on “The Sopranos,” died at the age of 96, according to an obituary from the Riverside Memorial Chapel in New York. Adler spent the majority of his career behind the scenes of Broadway shows, not stepping forward to act until he was in his 60s.\nHe was the stage manager for the original 1956 production of “My Fair Lady” featuring Julie Andrews and Rex Harrison, and received his first acting credit in 1991 for an episode of “Brooklyn Bridge.”\nBut, the world will remember Adler for his six seasons on “The Sopranos” as Hesh Rabkin, a loan shark who often doled out advice to lead character Tony Soprano.\nRead what friends and colleagues said about his legacy.\nRead All About It\n- Across politics, culture and sports, it’s the golden age of men named Josh. We’re not kidding — and it’s also a sign of broader generational change.\n- The first human case of the flesh-eating parasite new world screwworm has been detected in the U.S., the Department of Health and Human Services said early Monday.\nAn Israel strike on a hospital in southern Gaza killed four journalists on Monday, including a freelancer who worked for The Associated Press, according to health officials.\n- The son of “Walking Dead” star Norman Reedus was arrested and charged following an alleged assault in a New York City apartment.\n- You’re probably brushing your teeth wrong. These dental experts want to help.\n- Female entrepreneurs are finding community, investors and tips for navigating a male-dominated world at this Long Island summer camp.\nStaff Pick: Your college dorm didn't come with a chandelier and custom wall art? Let's fix that.\nYou may have seen the crazy dorm makeovers on your TikTok feeds. Picture the classic, drab freshman dorm room with a paper-thin plastic mattress and cinder block walls transformed into a true palace. Parents are now shelling out thousands of dollars — sometimes upward of $20,000 — and hiring interior designers to deck out their kids’ college abodes. Many on social media are obsessed with the trend, and it has everyone in my office comparing today’s decor to their freshman year rooms (enter the fairy lights, fake vines, and tapestry from 2016). I chatted with some top interior designers and recent college grads about the trend and how they feel it’s impacting college campuses across the country.\n— Natalie Bennett, producer for Top Story with Tom Llamas\nNBC Select: Online Shopping, Simplified\nThere’s a right way to rid your home of dust: Start from top, work your way down and use a proper duster. Plus, the NBC Select team has everything you need to know about Labubu and why the little dolls have become a viral sensation.\nSign up to The Selection newsletter for hands-on product reviews, expert shopping tips and a look at the best deals and sales each week.\nThanks for reading today’s Morning Rundown. Today’s newsletter was curated for you by Kayla Hayempour. If you’re a fan, please send a link to your family and friends. They can sign up here."
    },
    {
      "news_title": "'Avoid disaster: Any new leader meeting Trump has foremost in their minds a risk of being ambushed'",
      "news_link": "https://www.france24.com/en/video/20250825-avoid-disaster-any-new-leader-meeting-trump-has-foremost-in-their-minds-a-risk-of-being-ambushed",
      "bias": "Center",
      "text": "One of your browser extensions seems to be blocking the video player from loading. To watch this content, you may need to disable it on this site.\n'Avoid disaster: Any new leader meeting Trump has foremost in their minds a risk of being ambushed'\nUS President Donald Trump hosts South Korean President Lee Jae Myung in Washington for their first summit meeting after the countries struck a trade deal last month lowering US tariffs on the Asian ally to 15% from a threatened 25%. Alongside trade, US pressure to redefine the decades-long military alliance is set to be a focus, while Trump has said more South Korean investment plans will be announced in addition to a $350 billion package agreed last month. For in-depth analysis and a deeper perspective, FRANCE 24's Eve Irvine welcomes Dr. James D.J. Brown, Author, Professor of Political Science, Temple University Japan.\nRead less Read more"
    },
    {
      "news_title": "South Korea's Lee faces pivotal test at first summit with Trump",
      "news_link": "https://www.reuters.com/world/china/south-koreas-lee-faces-pivotal-test-first-summit-with-trump-2025-08-25/",
      "bias": "Center",
      "text": null
    },
    {
      "news_title": "What’s at stake as Lee and Trump meet to discuss North Korea at first summit",
      "news_link": "https://www.nknews.org/pro/?p=2221710",
      "bias": "Center",
      "text": "|\nAnalysis What’s at stake as Lee and Trump meet to discuss North Korea at first summitModernizing alliance and expanding role of US forces likely to be focus, but Trump could send a signal to Kim Jong Un South Korean President Lee Jae-myung is set to visit the Oval Office for his first summit with U.S. President Donald Trump on Monday, a meeting that could set the template for how the allies plan to counter North Korea in the coming years and even open the door to reviving nuclear talks. In recent months, Pyongyang has repeatedly denounced the new ROK leader’s efforts to improve inter-Korean ties, even as it has broached the possibility of engaging the U.S. if it recognizes the DPRK as a nuclear state. This week’s summit © Korea Risk Group. All rights reserved. |"
    },
    {
      "news_title": "Five Things to Watch in South Korea's Lee First Trump Meeting",
      "news_link": "https://financialpost.com/pmn/business-pmn/five-things-to-watch-in-south-koreas-lee-first-trump-meeting",
      "bias": "Lean Right",
      "text": null
    },
    {
      "news_title": "Five Things to Watch in South Korea’s Lee First Trump Meeting",
      "news_link": "https://www.bloomberg.com/news/articles/2025-08-25/five-things-to-watch-in-south-korea-s-lee-first-trump-meeting",
      "bias": "Lean Left",
      "text": null
    },
    {
      "news_title": "South Korea’s Lee faces pivotal test at first summit with Trump",
      "news_link": "https://www.straitstimes.com/asia/south-koreas-lee-faces-pivotal-test-at-first-summit-with-trump",
      "bias": "Lean Right",
      "text": "South Korea’s Lee faces pivotal test at first summit with Trump\nSign up now: Get ST's newsletters delivered to your inbox\nFollow topic:\nWASHINGTON/SEOUL – South Korea’s President Lee Jae Myung faces a pivotal moment on Aug 25 when he meets US President Donald Trump in Washington for their first summit, as the countries’ decades-old alliance strains to tackle rapid geopolitical changes.\nMuch is riding on the meeting for Mr Lee, who took office in June following a snap election called after his conservative predecessor – feted in Washington for his hard line on North Korea – was removed for attempting to impose martial law.\nSouth Korea’s economy relies heavily on the US. Washington underwrites the country’s security with troops and nuclear deterrence, and Mr Lee hopes to chart a balanced path of cooperating with the US while not antagonising top trade partner China.\nAs he headed to the US, Mr Lee sent a special delegation to Beijing, which delivered a message calling for normalised relations with China that have been strained in recent years.\nSouth Korea has long come under targeted criticism from Mr Trump, who has called it a “money machine” that takes advantage of American military protection.\nMr Lee will seek to make a good impression, connect personally with Mr Trump and, above all, avoid any unpleasant surprises, analysts said.\n“For Lee, a no-news summit I think would be good,” said Mr Victor Cha of the Centre for Strategic and International Studies.\nHowever, Mr Cha said what Mr Trump’s aides produce for him to talk about at the meeting may be completely different from what the US leader wants to talk about.\nAs part of his preparations for the summit, Mr Lee told reporters during his flight to Washington that he had read Trump: The Art Of The Deal.\nUnder heavy pressure from Mr Trump’s administration, South Korean negotiators secured a last-minute deal in July to avoid the harshest of tariffs but must still hammer out details of billions of dollars in promised investments.\nSouth Korean officials say they hope such working-level trade negotiations will largely be left for other meetings.\n“There are many major topics in the security field,” Mr Lee’s top policy aide Kim Yong-beom has said.\n“Our position is that trade was already finalised last time. We hope that specific implementation plans for trade won’t be included in the summit at all, or at least should be kept simple if discussed.”\nSeveral top officials, including the foreign minister, rushed to Washington over the weekend to try to iron out final details.\nMr Lee, who arrived in Washington on Aug 24, will highlight some of South Korea’s expected investments when he visits a shipyard in Philadelphia owned by the country’s Hanwha Group after the summit.\nCooperation to help the ailing US shipbuilding sector is part of the broad tariff agreement reached between the countries.\nEngaging North Korea\nMr Trump is expected to pressure Mr Lee to commit to more spending on defence, including potentially billions of dollars more towards the upkeep of 28,500 American troops stationed in South Korea.\nMr Wi Sung-lac, Mr Lee’s top security adviser, said South Korea was in talks with Washington on Seoul’s higher defence spending, taking as a reference Nato’s agreement on a big new defence spending target.\nMr Wi added that the government was also looking into a plan for the purchase of American weapons.\nDr Duyeon Kim, from the Centre for a New American Security, said to avoid any public splits, the leaders should focus on reaffirming longstanding alliance principles and broadly agreeing to expand cooperation in all areas.\nWhile focusing on increasing military spending, Mr Lee will likely seek to avoid conversations about a potential reduction of US troops or using them for a wider range of operations, or details on modernising the alliance, she said.\n“They should leave those topics for working-level officials to hash out,” Dr Kim said. “Ambition could backfire.”\nMr Lee said it is difficult for Seoul to accept the demand by the United States to adopt “flexibility” of operating the US military now stationed in South Korea, Yonhap news agency reported on Aug 25.\nMr Trump and Mr Lee may also discuss efforts to persuade North Korea to freeze and eventually abandon its nuclear weapons programme. Both leaders support engaging Pyongyang, and Mr Lee has called for a phased approach to denuclearisation.\nNorth Korean leader Kim Jong Un says South Korea and the US remain hostile to his country, adding that he will never give up his nuclear arsenal.\nOver the weekend , Mr Kim supervised the test firing of new air defence systems.\nBefore Mr Lee’s US trip, the South Korean leader travelled to Tokyo to meet Japanese Prime Minister Shigeru Ishiba on Aug 23 to underscore the importance of cooperation between South Korea, Japan and the US.\nA commentary carried by North Korea’s state media on Aug 25 criticised Mr Lee’s “despicable” trip to Tokyo as a “begging message towards the master of the White House” by highlighting trilateral military cooperation.\nMr Lee and Mr Ishiba discussed relations with Washington and US tariff issues and the Japanese leader shared his experience with Mr Trump, which for Seoul was useful information before Mr Lee’s first meeting with Mr Trump, said Mr Wi, the South Korean security adviser. REUTERS"
    },
    {
      "news_title": "Trump, Lee Jae Myung to discuss alliance, tariffs, and investments",
      "news_link": "http://northkoreatimes.com/news/278527167/trump-lee-jae-myung-to-discub-alliance-tariffs-and-investments",
      "bias": "Center",
      "text": null
    },
    {
      "news_title": "South Korea promises Trump to ‘Make American Shipbuilding Great Again’",
      "news_link": "https://www.washingtonpost.com/world/2025/08/24/south-korea-united-states-shipbuilding/",
      "bias": "Lean Left",
      "text": null
    },
    {
      "news_title": "Lee-Trump summit likely a major test for future alliance trajectory",
      "news_link": "https://www.koreatimes.co.kr/foreignaffairs/20250824/lee-trump-summit-likely-a-major-test-for-future-alliance-trajectory",
      "bias": "Lean Left",
      "text": "South Korean President Lee Jae Myung, left, and U.S. President Donald Trump. Yonhap WASHINGTON — The planned summit between Presidents Lee Jae Myung and Donald Trump is expected to be a crucial test for the South Korea-U.S. alliance to set its future trajectory, as Washington is pushing to reshape the bilateral security and economic partnerships in the face of an increasingly assertive China. Lee and Trump are set to hold their first in-person summit at the White House on Monday, as South Korea and the United States seek to forge a shared understanding of where their partnership should be headed under a joint effort to \"modernize\" the alliance. The high-stakes summit will come against the backdrop of the Trump administration's growing demand that South Korea and other Asian allies boost their defense spending and undertake greater security burdens, while the U.S. focuses on deterring the \"pacing threat\" from its biggest strategic rival, China. Keen attention is fixated on how Seoul will navigate tricky \"alliance modernization\" issues, including Washington's potential move to readjust the size, role, composition and operational scope of the 28,500-strong U.S. Forces Korea (USFK) in an effort to better deter China. \"(The summit) really stands to be a litmus test for the new administration in Seoul as well as an opportunity to sort of set the trend for the bilateral relationship over the coming years,\" Arius Derr, director of communications at the Korea Economic Institute of America (KEI), said during a press meeting on Thursday. Hard issues aside, the summit will be a crucial opportunity for the two leaders to build personal rapport, experts said, at a time when Seoul hopes to further strengthen cooperation with Washington on North Korean nuclear threats, economic security, trade and other fronts. During their first phone call in June, signs of their budding friendship were detected as Lee and Trump talked about a set of mutually relatable topics — their experiences with assassination threats on the campaign trail and their shared interest in golf. But an array of challenging alliance issues are expected to figure prominently in the summit. Chief among them is Washington's apparent push for greater USFK \"strategic flexibility\" to expand its operational scope beyond the Korean Peninsula to cover China-related contingencies, including a Taiwan conflict. Seoul and Washington already issued a joint statement on strategic flexibility in 2006, which stated that South Korea respects the \"necessity\" for strategic flexibility, while the U.S. respects Seoul's position that it will not be involved in a regional conflict against the will of the Korean people. Observers said that Washington might want a more explicit South Korean understanding of the strategic flexibility concept — a move that would test Lee's \"pragmatic\" approach that values the alliance with the U.S. as the \"foundation\" of Seoul's security and foreign policy, but leaves open room for better ties with China. To what extent Trump will push the China-related issue remains to be seen as Trump has touted his \"great\" relationship with Chinese President Xi Jinping at a time when his administration seeks to strike a trade agreement with the Asian superpower. The USFK issue is expected to be part of the broad alliance modernization agenda. Alliance modernization is not a novel concept for the allies as their treaty partnership, forged in the crucible of the 1950-53 Korean War, has undergone adjustments in line with America's policy changes, shifting regional and global security landscapes, South Korea's growing military capabilities and its pursuit of an enhanced role in what has been an asymmetric partnership. \"(Alliance modernization) refers to potential changes in the U.S. force posture on the Korean Peninsula that could include the reduction in ground troops, enhancement of air and naval capabilities, greater South Korean defense spending, changes in the cost-sharing arrangement (and the) return of wartime operational control (OPCON),\" Victor Cha, president of the Geopolitics and Foreign Policy Department at the Center for Strategic and International Studies, told reporters on Wednesday. Speculation has persisted that Washington might weigh the idea of a ground troop reduction in the Army-centric USFK as it apparently sees naval and air force components as more suited for potential operations to address China-related contingencies. The alliance modernization discussions have proceeded as the Lee administration is expected to pursue the retaking of wartime OPCON within its five-year term -- a goal that some observers say might fall in line with Washington's push for allies to take greater responsibility for their own defense. Seoul and Washington have been working on the \"conditions-based\" OPCON transfer. Conditions include South Korea's capabilities to lead combined Korea-U.S. forces, its strike and air defense capabilities, and a regional security environment conducive to such a handover. South Korea handed over operational control of its troops to the U.S.-led U.N. Command during the 1950-53 Korean War. Control was then transferred to the two allies' Combined Forces Command when the command was launched in 1978. Wartime operational control still remains in U.S. hands, while South Korea retook peacetime OPCON in 1994. A defense spending issue could also be a point of contention at the summit. The Trump administration has been expected to demand that South Korea move toward what it has called the \"global standard\" of spending 5 percent of gross domestic product (GDP) on defense -- a goal that North Atlantic Treaty Organization member states agreed to achieve by 2035. South Korea's defense budget this year stands at around 61.2 trillion won (US$44.2 billion), or about 2.32 percent of its GDP, according to Seoul's defense ministry. How to lure North Korea back to a denuclearization track will be another key alliance issue at the summit. Both Lee and Trump have expressed their willingness to resume dialogue with Pyongyang, but the reclusive state has reiterated its rejection of any denuclearization dialogue at a time when it has relied on Russia for food, fuel, security, technology and other necessities. The leaders' anticipated show of unity against North Korea's nuclear threats could strike a sour note with the recalcitrant regime, which has already responded angrily to the allies' ongoing Ulchi Freedom Shield exercise despite the scaling-down of the exercise's field training portion. For Trump, his summit with Lee will be an opportunity to underscore South Korea's pledges for investments and industrial cooperation as his America First policy success, observers said. Expectations are that Lee will announce new plans for investments in the U.S., while more clarity will be given to last month's broad-brush trade deal, under which Washington agreed to lower \"reciprocal\" tariffs on Korea to 15 percent from the proposed 25 percent in return for Korea's investment pledges and other commitments. The summit will also be a chance to \"reset\" South Korea's role and status in Trump's \"hierarchy,\" Scott Snyder, president and CEO at the KEI, said, noting South Korea's apparently \"diminished\" influence under the Trump administration considering indicators, including the fact that no close Trump associate or prominent figure has been appointed as U.S. ambassador to Korea."
    },
    {
      "news_title": "(News Focus) Lee-Trump summit likely a major test for future alliance trajectory",
      "news_link": "https://en.yna.co.kr/view/AEN20250823000200315",
      "bias": "Lean Right",
      "text": "(News Focus) Lee-Trump summit likely a major test for future alliance trajectory\nBy Song Sang-ho\nWASHINGTON, Aug. 23 (Yonhap) -- The planned summit between Presidents Lee Jae Myung and Donald Trump is expected to be a crucial test for the South Korea-U.S. alliance to set its future trajectory, as Washington is pushing to reshape the bilateral security and economic partnerships in the face of an increasingly assertive China.\nLee and Trump are set to hold their first in-person summit at the White House on Monday, as South Korea and the United States seek to forge a shared understanding of where their partnership should be headed under a joint effort to \"modernize\" the alliance.\nThe high-stakes summit will come against the backdrop of the Trump administration's growing demand that South Korea and other Asian allies boost their defense spending and undertake greater security burdens, while the U.S. focuses on deterring the \"pacing threat\" from its biggest strategic rival, China.\nKeen attention is fixated on how Seoul will navigate tricky \"alliance modernization\" issues, including Washington's potential move to readjust the size, role, composition and operational scope of the 28,500-strong U.S. Forces Korea (USFK) in an effort to better deter China.\n\"(The summit) really stands to be a litmus test for the new administration in Seoul as well as an opportunity to sort of set the trend for the bilateral relationship over the coming years,\" Arius Derr, director of communications at the Korea Economic Institute of America (KEI), said during a press meeting on Thursday.\nHard issues aside, the summit will be a crucial opportunity for the two leaders to build personal rapport, experts said, at a time when Seoul hopes to further strengthen cooperation with Washington on North Korean nuclear threats, economic security, trade and other fronts.\nDuring their first phone call in June, signs of their budding friendship were detected as Lee and Trump talked about a set of mutually relatable topics -- their experiences with assassination threats on the campaign trail and their shared interest in golf.\nBut an array of challenging alliance issues are expected to figure prominently in the summit. Chief among them is Washington's apparent push for greater USFK \"strategic flexibility\" to expand its operational scope beyond the Korean Peninsula to cover China-related contingencies, including a Taiwan conflict.\nSeoul and Washington already issued a joint statement on strategic flexibility in 2006, which stated that South Korea respects the \"necessity\" for strategic flexibility, while the U.S. respects Seoul's position that it will not be involved in a regional conflict against the will of the Korean people.\nObservers said that Washington might want a more explicit South Korean understanding of the strategic flexibility concept -- a move that would test Lee's \"pragmatic\" approach that values the alliance with the U.S. as the \"foundation\" of Seoul's security and foreign policy, but leaves open room for better ties with China.\nTo what extent Trump will push the China-related issue remains to be seen as Trump has touted his \"great\" relationship with Chinese President Xi Jinping at a time when his administration seeks to strike a trade agreement with the Asian superpower.\nThe USFK issue is expected to be part of the broad alliance modernization agenda.\nAlliance modernization is not a novel concept for the allies as their treaty partnership, forged in the crucible of the 1950-53 Korean War, has undergone adjustments in line with America's policy changes, shifting regional and global security landscapes, South Korea's growing military capabilities and its pursuit of an enhanced role in what has been an asymmetric partnership.\n\"(Alliance modernization) refers to potential changes in the U.S. force posture on the Korean Peninsula that could include the reduction in ground troops, enhancement of air and naval capabilities, greater South Korean defense spending, changes in the cost-sharing arrangement (and the) return of wartime operational control (OPCON),\" Victor Cha, president of the Geopolitics and Foreign Policy Department at the Center for Strategic and International Studies, told reporters on Wednesday.\nSpeculation has persisted that Washington might weigh the idea of a ground troop reduction in the Army-centric USFK as it apparently sees naval and air force components as more suited for potential operations to address China-related contingencies.\nThe alliance modernization discussions have proceeded as the Lee administration is expected to pursue the retaking of wartime OPCON within its five-year term -- a goal that some observers say might fall in line with Washington's push for allies to take greater responsibility for their own defense.\nSeoul and Washington have been working on the \"conditions-based\" OPCON transfer. Conditions include South Korea's capabilities to lead combined Korea-U.S. forces, its strike and air defense capabilities, and a regional security environment conducive to such a handover.\nSouth Korea handed over operational control of its troops to the U.S.-led U.N. Command during the 1950-53 Korean War. Control was then transferred to the two allies' Combined Forces Command when the command was launched in 1978. Wartime operational control still remains in U.S. hands, while South Korea retook peacetime OPCON in 1994.\nA defense spending issue could also be a point of contention at the summit.\nThe Trump administration has been expected to demand that South Korea move toward what it has called the \"global standard\" of spending 5 percent of gross domestic product (GDP) on defense -- a goal that North Atlantic Treaty Organization member states agreed to achieve by 2035.\nSouth Korea's defense budget this year stands at around 61.2 trillion won (US$44.2 billion), or about 2.32 percent of its GDP, according to Seoul's defense ministry.\nHow to lure North Korea back to a denuclearization track will be another key alliance issue at the summit.\nBoth Lee and Trump have expressed their willingness to resume dialogue with Pyongyang, but the reclusive state has reiterated its rejection of any denuclearization dialogue at a time when it has relied on Russia for food, fuel, security, technology and other necessities.\nThe leaders' anticipated show of unity against North Korea's nuclear threats could strike a sour note with the recalcitrant regime, which has already responded angrily to the allies' ongoing Ulchi Freedom Shield exercise despite the scaling-down of the exercise's field training portion.\nFor Trump, his summit with Lee will be an opportunity to underscore South Korea's pledges for investments and industrial cooperation as his America First policy success, observers said.\nExpectations are that Lee will announce new plans for investments in the U.S., while more clarity will be given to last month's broad-brush trade deal, under which Washington agreed to lower \"reciprocal\" tariffs on Korea to 15 percent from the proposed 25 percent in return for Korea's investment pledges and other commitments.\nThe summit will also be a chance to \"reset\" South Korea's role and status in Trump's \"hierarchy,\" Scott Snyder, president and CEO at the KEI, said, noting South Korea's apparently \"diminished\" influence under the Trump administration considering indicators, including the fact that no close Trump associate or prominent figure has been appointed as U.S. ambassador to Korea.\nsshluck@yna.co.kr\n(END)\n-\nPark Chan-wook finds dark humor in man's predicament in 'No Other Choice'\n-\n'KPop Demon Hunters' director on how 'shame' powers Netflix's record-breaking hit\n-\nJungkook's 'Seven' becomes 1st K-pop song to garner 2.5 bln streams on Spotify\n-\n(LEAD) Gov't unveils steps to support 'voluntary' restructuring of petrochemical industry\n-\nLee vows to pursue 3-stage denuclearization plan for N. Korea\n-\nPark Chan-wook finds dark humor in man's predicament in 'No Other Choice'\n-\n'KPop Demon Hunters' director on how 'shame' powers Netflix's record-breaking hit\n-\nJungkook's 'Seven' becomes 1st K-pop song to garner 2.5 bln streams on Spotify\n-\nN. Korea continues to attract Russian tourists to Wonsan beach resort\n-\nTrump may want success in summit with Lee after no-deal meeting with Putin: expert\n-\nTrump says there seems to be 'purge or revolution' in S. Korea\n-\nWhite House officially announces plan for summit, luncheon between Lee, Trump\n-\nUNC says around 30 N. Korean troops crossed inter-Korean border recently, triggering S. Korean warning shots\n-\nLee arrives in Washington on eve of high-stakes summit with Trump\n-\nLee says Washington's demand on strategic flexibility of USFK difficult to agree"
    },
    {
      "news_title": "Will Trump put money over principle when meeting S Korea’s Lee?",
      "news_link": "https://asiatimes.com/2025/08/will-trump-put-money-over-principle-when-meeting-s-koreas-lee/",
      "bias": "Lean Left",
      "text": "US President Donald Trump will meet South Korean President Lee Jae Myung in Washington on August 25.\nLet’s hope Trump doesn’t allow the prospects of US$350 billion in South Korean investment into the United States, and some more money for US forces in South Korea, to blind him to the fact that Lee doesn’t like him or the United States very much.\nPresident Lee is a lifelong leftist with an affinity for the People’s Republic of China and North Korea, and has no great love for the United States.\nHe has referred to American troops in South Korea as “occupiers” and said China should do what it wants to Taiwan.\nLee apparently likes North Korea enough to put money down. He was indicted on charges of sending $8 million to North Korea while he was governor of Gyeonggi Province. His deputy has already been convicted.\nHe also opposed US THAAD missile defense deployment, which allowed American forces to better defend themselves and South Korea.\nAnd Lee recently praised Vietnam for fighting against foreign powers and reunifying. Foreign powers? The Americans. And, South Korean forces were in Vietnam too.\nHowever, since being elected Lee has talked up the US-ROK alliance and three-way US-ROK-Japan security cooperation. Thus, many American observers claim Lee is a pragmatist and a centrist, and will govern as such.\nTrump no doubt understands that nice words don’t overturn a lifetime of behavior. Instead, maybe Lee and others like him mean what they say behind the soothing language intended for Western governments.\nBetter to look at Lee’s new Prime Minister Kim Min Seok.\nKim was a Seoul University radical student leader in the 1980s and joined the illegal occupation of the Seoul American Cultural Center in 1985. He was jailed for three years due to his anti-state and pro-North Korea activities. The Americans once refused to give him a visa, and he is said to have claimed that the Americans were behind Covid.\nAnd consider Jung Chung Rae, the head of Lee Jae Myung’s Democratic Party of Korea. He led the 1989 occupation of the US Ambassador’s residence in Seoul and spent two years in prison. He is still a hard-core radical.\nAnd there are a few things that ought to really resonate with Trump.\nLee’s regime is persecuting former President Yoon and his wife. Both are imprisoned and under harsh conditions. The intention, it seems, is to break – if not kill – one or both. And also intimidate the political opposition.\nLee is doing to the Yoons what a cabal of US Democrats tried to do to Trump and his family for standing up for Americans against the domination of the bi-coastal elites.\nLee’s and his party’s broader objective is one-party rule forever. Part of the strategy is to manipulate the electoral process.\nSouth Korean citizens facing intimidation and lawsuits uncovered substantial evidence of widespread electoral irregularities in the recent June 2025 presidential election (as they did for elections in 2020, 2022, and 2024.)\nThe evidence has never been examined. Instead, the party, which dominates both the National Assembly and the media, declares it all “baseless conspiracy theories.”\nDid anyone at the US Embassy, State Department or the White House even examine the evidence? Or meet with the citizen groups? Apparently not.\nAnd, recently, South Korean police raided the offices of the new political party, Freedom and Innovation Party, headed by respected former Prime Minister and acting President Hwang Kyo Ahn. His offense: promoting the idea of honest elections.\nPolice also are reportedly investigating South Korean citizens who went to Incheon International Airport in July to welcome former US Ambassador for Global Criminal Justice Morse Tan – a strong proponent of South Korean election integrity.\nThe Trump administration fumbled things after the June 3 South Korean election. Perhaps hoping to make the best of things, the White House said the US-ROK alliance is “ironclad” – and declared the election “free and fair.”\nIt did express general concern over “Chinese interference” in democracies. The State Department similarly offered congratulations to President Lee.\nThis was a gut punch to pro-freedom South Koreans. Trump has a chance to recover if he calls out Lee when they meet next week.\nHowever, if Trump takes the “easy” route – overlooking American principles in exchange for a trade deal and investment – don’t be surprised if the “ironclad” alliance starts to unravel.\nGrant Newsham is a retired US Marine officer and former US diplomat. He is the author of the book “When China Attacks: A Warning To America. Follow him on X at @NewshamGrant\nanticomunist paranoia in 2025, someone give this poor author a nice room in a retire house. Also believing that Trump does something in the name of ideology may be symptoms of senile behavior.\nHe is Fake president. CCP OUT. LEE OUT!!!\nFake President China Lee Out"
    },
    {
      "news_title": "South Korean President Lee To Meet With Trump In Washington On Monday",
      "news_link": "https://realnewshub.com/south-korean-president-lee-to-meet-with-trump-in-washington-on-monday/",
      "bias": "unknown",
      "text": "Historic Summit: South Korean President Lee Jae-myung Meets U.S. President Donald Trump in Washington\nWashington, D.C. – August 25, 2025 – In a pivotal moment for U.S.-South Korea relations, South Korean President Lee Jae-myung arrived in Washington on Sunday for his first summit with U.S. President Donald Trump, scheduled for Monday at the White House. This high-stakes meeting comes amid evolving global tensions, including North Korean provocations, U.S.-China rivalry, and economic uncertainties following Trump’s return to office. As the current date marks the summit day, the world watches closely to see how these two leaders navigate alliance modernization, trade commitments, and regional security threats.\nLee Jae-myung, who assumed the presidency in June 2025 after the impeachment of his predecessor and a snap election, faces his first major foreign policy test. His administration has been grappling with domestic political turmoil, including the declaration of martial law in December 2024, which delayed South Korea’s engagement with the new Trump administration. Despite attempts to meet earlier—at the G7 summit in Canada and the NATO leaders’ meeting in The Hague—scheduling conflicts, including Trump’s abrupt departure for an Iran-related operation, postponed their encounter. Now, with a framework trade agreement secured in July, the summit provides an opportunity to address a broader agenda.\nCentral to the discussions is the July trade deal, which reduced U.S. tariffs on South Korean exports from 25% to 15%. In return, South Korea pledged a staggering $350 billion investment in the U.S. economy over the coming years, including $100 billion in U.S. energy purchases. This commitment extends to key sectors like semiconductors, batteries, shipbuilding, and critical minerals. A highlight of Lee’s visit is his planned tour of the Philadelphia Shipyard, recently acquired by South Korea’s Hanwha Group, symbolizing enhanced industrial cooperation. Trump, known for his “America First” policies, is expected to push for detailed implementation plans to ensure these investments bolster U.S. manufacturing and job creation.\nDefense and security will dominate the talks, given the 71-year-old U.S.-South Korea alliance and the presence of 28,500 U.S. troops on the Korean Peninsula. Trump has historically demanded that allies shoulder more of the financial burden, and sources indicate he may seek $5-10 billion annually from Seoul for troop maintenance—far exceeding current contributions. South Korea’s defense spending stands at about 3% of GDP, but Trump is pushing for an increase to 3.8% or even 5%, aligning with his calls for NATO allies to meet similar thresholds. Lee, however, has expressed reservations about granting “strategic flexibility” to U.S. forces, which could allow their redeployment for conflicts beyond the peninsula, such as a potential Taiwan crisis. This stance reflects South Korea’s delicate balancing act between its U.S. alliance and economic ties with China, its largest trading partner.\nThe summit also follows Lee’s recent visit to Japan on August 23-24, where he met Prime Minister Shigeru Ishiba to bolster trilateral cooperation with the U.S. This move aims to counter regional threats, including from China and North Korea. On North Korea, both leaders share an interest in diplomatic engagement, but prospects are dim. Pyongyang has rejected talks, deepened ties with Russia through joint military exercises and arms deals, and continued missile tests. Lee advocates a phased approach to denuclearization, while Trump may explore reengagement conditions. Domestically, some in South Korea have floated pursuing an independent nuclear option, a topic that could strain alliance talks.\nCritics have raised concerns about Lee’s foreign policy leanings. U.S. commentator Gordon G. Chang described Lee as an “anti-American president” attempting to pivot South Korea toward China and North Korea, potentially undermining the alliance. In a column covered by South Korean media like Chosun Ilbo, Chang warned the Trump administration not to be swayed by Lee’s pro-U.S. rhetoric. Similarly, Grant Newsham, a retired U.S. Marines colonel, urged Trump to address Chinese Communist Party influence on Lee’s administration, which he claims seeks to erode the partnership.\nThe summit’s format includes an Oval Office meeting, a possible Cabinet session, a working lunch, and joint statements. Lee will also deliver his first foreign policy address abroad at the Center for Strategic and International Studies (CSIS), focusing on U.S.-Korea relations. Prior to the summit, Lee met with Korean American leaders, including Senator Andy Kim, to rally support for the alliance. He also convened with South Korean conglomerates like Samsung and Hyundai, who are accompanying him to emphasize economic ties.\nThis meeting is crucial for Lee, who must secure Trump’s backing while advancing South Korea’s interests in a volatile geopolitical landscape. For Trump, it’s an opportunity to reinforce alliances amid his administration’s focus on countering China and revitalizing U.S. industry. Outcomes could include refined trade implementation, defense cost-sharing agreements, and a joint strategy on North Korea. However, divergences on troop flexibility and defense spending may highlight tensions.\nAs the summit unfolds, it underscores the enduring yet evolving U.S.-South Korea partnership, forged in the Korean War and now adapting to 21st-century challenges. With global eyes on Washington, the decisions made today could reshape Indo-Pacific security for years to come. Analysts predict announcements on enhanced cooperation in technology and energy, but warn that unresolved issues like tariff adjustments and nuclear policy could linger. In a world of shifting alliances, this dialogue between Lee and Trump represents a critical juncture for bilateral ties."
    },
    {
      "news_title": "South Korea Lee faces pivotal test at first summit with US President Trump",
      "news_link": "https://www.asiaone.com/asia/south-koreas-lee-faces-pivotal-test-first-summit-us-president-trump",
      "bias": "unknown",
      "text": "WASHINGTON/SEOUL — South Korea's new president, Lee Jae-myung, will face a pivotal moment on Monday (Aug 25) when he meets US President Donald Trump in Washington for their first summit, as the countries' decades-old alliance strains to confront rapid geopolitical changes.\nMuch is riding on the meeting for Lee, who took office in June after a snap election called after his conservative predecessor — feted in Washington for his hard line on North Korea — was removed for attempting to impose martial law.\nSouth Korea's economy relies heavily on the US, with Washington underwriting its security with troops and nuclear deterrence. Lee hopes to chart a balanced path of co-operation with the US, while not antagonising top trade partner China.\nAs he headed to the US, Lee sent a special delegation to Beijing, which delivered a message calling for normalised relations with China that have been strained in recent years.\nSouth Korea has long come under targeted criticism from Trump, who has called it a \"money machine\" that takes advantage of American military protection.\nLee will seek to make a good impression, connect personally with Trump, and above all, avoid any unpleasant surprises, analysts said.\n\"For Lee, a no-news summit I think would be good,\" said Victor Cha of the Centre for Strategic and International Studies.\nAs part of his preparations for the summit, Lee told reporters during his flight to Washington that he had read Trump: The Art of the Deal.\nUnder heavy pressure from Trump's administration, South Korean negotiators secured a last-minute deal last month to avoid the harshest of new US tariffs, but they must still hammer out details of billions of dollars in promised investments in the United States.\nSouth Korean officials say they hope such working-level trade negotiations will largely be left for other meetings.\n\"There are many major topics in the security field,\" Lee's top policy aide, Kim Yong-beom, said last week. \"Our position is that trade was already finalised last time. We hope that specific implementation plans for trade won't be included in the summit at all, or at least should be kept simple if discussed.\"\nSeveral top officials, including the foreign minister, rushed to Washington over the weekend to try to iron out final details.\nLee, who arrived in Washington on Sunday, will highlight some of South Korea's expected investments when he visits a shipyard in Philadelphia owned by the country's Hanwha Group after the summit. Cooperation to help the ailing US shipbuilding sector is part of the broad tariff agreement reached between the countries.\nEngaging North Korea\nTrump is expected to pressure Lee to commit to more spending on defence, including potentially billions of dollars more toward the upkeep of 28,500 American troops stationed in South Korea.\nWi Sung-lac, Lee's top security adviser, said South Korea was in talks with Washington over defence spending, taking as a reference Nato's agreement on a big new defence spending target. Wi added that the government was also looking into a plan for the purchase of American weapons.\nWhile focusing on increasing military spending, Lee will likely seek to avoid conversations about a potential reduction of US troops or using them for a wider range of operations, or details on modernising the alliance, said Duyeon Kim, from the Centre for a New American Security.\nLee told reporters it would be difficult for Seoul to accept the demand by the US to adopt \"flexibility\" in operating the US military stationed in South Korea.\n\"They should leave those topics for working-level officials to hash out,\" Kim said. \"Ambition could backfire.\"\nTrump and Lee may also discuss efforts to persuade North Korea to freeze and eventually abandon its nuclear weapons programme. Both leaders support engaging Pyongyang, and Lee has called for a phased approach to denuclearisation.\nNorth Korean leader Kim Jong-un says South Korea and the US remain hostile to his country and he will never give up his nuclear arsenal. Over the weekend Kim supervised test firing of new air defence systems.\nBefore Lee meets Trump, the South Korean leader travelled to Tokyo to meet Japanese Prime Minister Shigeru Ishiba on Saturday to underscore the importance of co-operation between South Korea, Japan and the US.\nA commentary carried by North Korea's state media on Monday criticised Lee's \"despicable\" trip to Tokyo as a \"begging message towards the master of the White House\" by highlighting trilateral military co-operation.\nLee and Ishiba discussed relations with Washington and US tariff issues and the Japanese leader shared his experience with Trump, which for Seoul was useful information before Lee's first meeting with Trump, said Wi, the South Korean security adviser.\n[[nid:721679]]"
    },
    {
      "news_title": "Trump eyes new chance with North as South Korea's president heads to Washington",
      "news_link": "https://www.tag24.com/politics/politicians/donald-trump/trump-eyes-new-chance-with-north-as-south-koreas-president-heads-to-washington-3414488",
      "bias": "unknown",
      "text": "Trump eyes new chance with North as South Korea's president heads to Washington\nWashington DC - Since returning to the White House, President Donald Trump has boasted of ending either six or seven wars – a matter of much dispute – and has been pushing with mixed success to bring peace to Ukraine.\nOne hotspot not yet on his second-term radar has been North Korea, despite Trump's unusually personal diplomacy during his first term when he met leader Kim Jong Un.\nTrump could find a chance to pivot on Monday as he welcomes to the White House South Korea's new President Lee Jae Myung, an advocate of outreach with the North.\nTrump, who did not secure a deal on Ukraine during an August 15 summit in Alaska with Russian President Vladimir Putin, has an \"appetite for big news,\" said Victor Cha, a top advisor on Asia to former President George W. Bush.\n\"Having the Alaska summit not go as well as he wanted may make the president much more interested in seeing this meeting with South Korea come off very well,\" said Cha, Korea chair at the Center for Strategic and International Studies.\nTrump had expressed striking fondness for Kim after their three meetings, once offering that he and the young totalitarian \"fell in love.\"\nBut Trump could find a new Kim this time, one emboldened since their diplomatic love affair.\nNorth Korea, one of the most sanctioned and isolated countries, has cashed in with Russia by supplying more than 10,000 troops plus weapons to Moscow's offensive in Ukraine, according to Western and South Korean intelligence.\n\"If there is one reason why North Korea's not interested in any of these dialogues with the South Koreans and the Americans, it's because of all they're getting from Russia,\" Cha said.\nFormer President Joe Biden also offered dialogue with North Korea, albeit among lower-ranking officials, but Pyongyang rebuffed him.\nLee Jae Myung's US visit comes amid rising tensions between the North and South\nLee won the election in June after a leadership gap due to the impeachment of his conservative predecessor, Yoon Suk Yeol, for briefly imposing martial law.\nThe transition was awkwardly timed as Trump was taking office, although the new South Korean administration managed to secure a deal similar to other US allies on tariffs.\nLee, a former labor lawyer, hails from the left but paradoxically may share more common ground with Trump than South Korea's conservatives on some issues.\nLee and Trump have both, in the past, questioned the US military commitment to South Korea, where some 28,500 US troops are stationed.\nBut since taking office, Lee has stressed consistency, including by going ahead with joint exercises with the US that angered North Korea.\nIn a highly symbolic step, Lee traveled to Japan before Washington, reaffirming his commitment to a three-way alliance despite the South Korean left's historic criticism of Japan over colonial history.\nHis trip comes as tensions spike on the Korean peninsula, with Pyongyang on Saturday test-firing two new air defense missiles, according to the country's state news agency.\nEarlier in the week, South Korean troops fired warning shots at several North Korean soldiers who briefly crossed the heavily militarized border separating the two countries.\nWill Trump attempt diplomacy with North Korea?\nNorth Korea has always refused to get rid of its nuclear program, a stance likely only to have hardened following the US and Israeli bombing of Iran's sensitive sites.\nSince January, Trump and Defense Secretary Pete Hegseth have both broken precedent by calling North Korea a \"nuclear power,\" although it did not appear they meant to recognize its right to nuclear weapons.\nLee has spoken of a three-step approach of freezing, reducing, and then dismantling Pyongyang's nuclear program.\nRachel Minyoung Lee, a senior fellow at the Stimson Center's Korea program, said that Lee's stance \"likely will resonate with President Trump, who is keen to engage North Korea.\"\n\"From the South Korean government's point of view, getting the Trump administration's buy-in on its North Korea policy would be a big diplomatic win, as it would not only put the two countries on the same page but also decrease the possibility of Seoul being sidelined from US efforts to engage North Korea,\" she said.\nBut she doubted North Korea would back diplomacy with an ultimate goal of denuclearization, phased or not.\n\"It has no reason to be receptive to such a proposition given that the geopolitical situation is working in its favor and it sees longer-term opportunities in its relationship with Russia,\" she said.\nCover photo: JUNG Yeon-je and ANDREW CABALLERO-REYNOLDS / AFP"
    },
    {
      "news_title": "South Korea’s president heads into Trump talks on troops, trade and Pyongyang",
      "news_link": "https://biztoc.com/x/d4d0238faaa43d23",
      "bias": "unknown",
      "text": "Why did the US buy a stake in Intel?\nHow will Trump’s furniture tariffs impact retailers?\nWhat caused Keurig Dr Pepper’s $18B coffee deal?\nWhy are National Guard troops in DC now armed?\nHow did Powell’s comments affect the dollar?\nWhy are European postal services suspending US shipments?\nWhat risks come with Intel’s US government investment?\nSouth Korea’s president heads into Trump talks on troops, trade and Pyongyang\nft.com/content/28820830-fce0-4a42-b734-05a5b0323bebLeftwing leader Lee Jae Myung will seek to dispel reputation as anti-American and pro-China at White House summit\nThis story appeared on ft.com, 2025-08-24 04:00:09."
    }
  ]
}