{
  "story_id": "GN_20250825_224155_746dc1f7",
  "metadata": {
    "title": "Cambodia passes law to revoke citizenship of people convicted of treason",
    "timestamp": "2025-08-25T22:41:55.989396",
    "url": "https://ground.news/article/cambodia-mps-pass-law-allowing-stripping-of-citizenship_ef045c"
  },
  "bias_distribution": {
    "total_sources": "52",
    "leaning_left": "8",
    "center": "12",
    "leaning_right": "10"
  },
  "perspective_summaries": {
    "left": [
      "Cambodian lawmakers passed a law allowing the government to revoke citizenship from individuals convicted of colluding with foreign countries, according to the National Assembly.",
      "The law was approved by 120 out of 125 lawmakers in the National Assembly, which is mostly controlled by the Cambodian People's Party.",
      "The law's implementation raises concerns about targeting based on ethnicity, political opinions, and activism, according to a coalition of 50 rights groups.",
      "Interior Minister Sar Sokha will request a committee to decide on citizenship revocation cases, as stated in the legislation."
    ],
    "center": [
      "Cambodia passes a law allowing the government to revoke citizenship of people convicted of treason.",
      "Rights groups warn the law will have a chilling effect on freedom of speech and could target people based on their ethnicity, political opinions, and activism.",
      "The amendment was unanimously approved by all 120 lawmakers, including Prime Minister Hun Manet."
    ],
    "right": [
      "Cambodia's parliament passed a law allowing the state to revoke citizenship for those convicted of treason, with 120 out of 125 members voting in favor.",
      "The law targets individuals accused of conspiring with foreign entities or plotting against Cambodian interests, amid a crackdown on opposition.",
      "Notable political figures, including Sam Rainsy and Mu Sochua, have fled Cambodia to escape arrest after mass trials of opposition members.",
      "Hun Sen stated that action was necessary against nationals who align with foreign nations, while the government denies targeting opponents."
    ]
  },
  "sources": [
    {
      "news_title": "Cambodian lawmakers pass bill to revoke citizenship that critics call repressive",
      "news_link": "https://apnews.com/article/cambodia-revoke-citizenship-bill-nationality-law-cb2bb44d3c7ed21a197ee1fd4fa9214f",
      "bias": "Lean Left",
      "text": "Cambodian lawmakers pass bill to revoke citizenship that critics call repressive\nCambodian lawmakers pass bill to revoke citizenship that critics call repressive\nPHNOM PENH, Cambodia (AP) — Cambodian lawmakers on Monday approved a bill giving the government power to revoke the citizenship of anyone found guilty of conspiring with foreign nations to harm the national interest.\nThe amendment to the Nationality Law, which was approved by all 120 members of the National Assembly who were present, is viewed by critics as a way to suppress internal dissent and control political opponents of Prime Minister Hun Manet and the ruling Cambodian People’s Party.\nAhead of the vote on Sunday, 50 Cambodian non-governmental organizations issued a statement saying they were deeply worried by the bill’s “vaguely written” contents allowing the the government to strip Cambodians of their citizenship. They claim it “will have a disastrously chilling effect on the freedom of speech of all Cambodian citizens.”\n“With this new amendment to the Nationality Law, all Cambodians risk losing our identities over our activism. If we are stripped of citizenship, we will lose the foundation for every right we have in our home country,” the statement said.\nBefore becoming law, the bill must be approved by Cambodia’s Senate and head of state, King Norodom Sihamoni, which are normally pro forma actions. Although Cambodia is formally an electoral democracy, Hun Manet’s Cambodian People’s Party holds 120 of the 125 seats in the National Assembly and controls all the levers of government.\nThe passage of the legislation comes during a period of heightened nationalism among Cambodians following a border dispute with neighboring Thailand that broke into a five-day armed conflict in late July ending only when a shaky ceasefire was reached.\nCambodian Interior Minister Sar Sokha told the lawmakers that the update to the law is vital to boost the patriotic feelings of Cambodians while their country is facing what he characterized as an invasion by neighboring Thailand.\nHe suggested a small group of Cambodians were commenting and acting in a manner harmful to the country’s interests and national security. Appealing to nationalist sentiment, he said people who directly or indirectly harm the interests of the nation and its people “should no longer be qualified as Cambodian citizens.”\nThe law would apply to lifelong Cambodian citizens, people with dual citizenship in Cambodia and another nation and people from other countries who have been granted Cambodian citizenship.\nSome prominent government critics and opposition politicians are known to have dual citizenship. Hun Manet and his father Hun Sen, who stepped down as prime minister in 2023 after 38 years in power, have been proactive in throttling opposition, often through lawsuits in the courts, which are widely seen as being under the ruling party’s influence.\nThe country’s main opposition party, the Cambodia National Rescue Party, was dissolved by a court order in 2017 after Hun Sen’s government accused it of seeking to topple it with the aid of foreign powers. The party’s then-leader, Kem Sokha, was arrested and later convicted of treason after specifically being accused of conspiring with the United States.\nMany countries have laws allowing citizenship to be revoked, but often on narrowly defined grounds.\nSpeaking to villagers and government officials in July in northern Kampong Thom province, Hun Manet claimed that among nearly 200 United Nations member states, 150 countries have laws allowing citizenship revocation, including the United States.\n“Please don’t be concerned if you are a patriot and do not oppose the interest of country. But if you have conspired with foreign powers to destroy Cambodia then, yes, it is true you should be worried, and in such case you are not a Cambodian.” Hun Manet said. “No true patriot would ever plot with foreign powers to destroy their nation.”\n___\nGrant Peck contributed from Bangkok, Thailand."
    },
    {
      "news_title": "Cambodia passes law to revoke citizenship of people convicted of treason",
      "news_link": "https://www.reuters.com/world/asia-pacific/cambodia-passes-law-revoke-citizenship-people-convicted-treason-2025-08-25/",
      "bias": "Center",
      "text": null
    },
    {
      "news_title": "Cambodia passes law to strip citizenship of people convicted of treason",
      "news_link": "https://www.aljazeera.com/news/2025/8/25/cambodia-passes-law-to-strip-citizenship-of-people-convicted-of-treason",
      "bias": "Lean Left",
      "text": "Cambodia passes law to strip citizenship of people convicted of treason\nMeasure comes amid sustained crackdown on opponents of the ruling Cambodian People’s Party.\nCambodian lawmakers have passed a law giving the government the power to strip citizenship from people who “collude” with foreign countries.\nThe law passed on Monday empowers authorities to revoke the citizenship of anyone convicted of conspiring with foreign countries, scheming against Cambodian interests, or committing acts leading to “destruction of sovereignty, territorial integrity and national security”.\nRecommended Stories\nlist of 4 items‘I just struggled’: Novak Djokovic battles to reach US Open second round\nIrish activists knit blanket representing children killed in Gaza\nVietnam prepares to evacuate half a million people ahead of Typhoon Kajiki\nThe legislation was approved by all but five lawmakers in the 125-member National Assembly, which is dominated by the long-governing Cambodian People’s Party.\nUnder the law, revocation of citizenship is to be decided by a committee established at the request of Interior Minister Sar Sokha.\nWhile the legislation must still be approved by Cambodia’s upper house and the king, these steps are widely considered formalities.\nThe measure comes amid a sustained crackdown on opponents of the governing party, the political vehicle of former strongman leader Hun Sen and his son, current Prime Minister Hun Manet.\nIn June, Hun Sen, who ruled Cambodia for more than three decades before his son took the reins in 2023, said Cambodia needed to take action against nationals who “side with foreign nations”.\nNumerous prominent political figures have fled Cambodia to avoid arrest amid the crackdown, including Sam Rainsy and Mu Sochua, the cofounders of the banned Cambodia National Rescue Party.\nBefore the parliamentary vote on the law, a coalition of 50 rights groups on Sunday warned that the legislation would have “a disastrously chilling effect on the freedom of speech of all Cambodian citizens”.\n“The potential for abuse in the implementation of this vaguely worded law to target people on the basis of their ethnicity, political opinions, speech, and activism is simply too high to accept,” the group said.\n“The government has many powers, but they should not have the power to arbitrarily decide who is and is not a Cambodian.”"
    },
    {
      "news_title": "Cambodia passes law to strip citizens of nationality for foreign collusion",
      "news_link": "https://www.scmp.com/news/asia/southeast-asia/article/3323025/cambodia-passes-controversial-citizenship-law-sparking-global-rights-concerns",
      "bias": "Center",
      "text": "Cambodia passes law to strip citizens of nationality for foreign collusion\nRights groups warn the vaguely worded legislation could be abused to banish political opponents, activists and journalists\nAll 120 lawmakers in attendance at the National Assembly session, including Prime Minister Hun Manet, voted unanimously to approve the bill on Monday.\nHuman rights monitors have long accused Cambodia’s government of using draconian laws to stifle opposition and legitimate political debate.\nA coalition of 50 rights groups issued a statement on Sunday warning that the law “will have a disastrously chilling effect on the freedom of speech of all Cambodian citizens”.\n“The potential for abuse in the implementation of this vaguely worded law to target people on the basis of their ethnicity, political opinions, speech and activism is simply too high to accept,” it added.\n“The government has many powers, but [it] should not have the power to arbitrarily decide who is and is not a Cambodian.”"
    },
    {
      "news_title": "Cambodia MPs pass law allowing stripping of citizenship",
      "news_link": "https://www.channelnewsasia.com/asia/cambodia-pass-law-allow-strip-citizenship-5312151",
      "bias": "Center",
      "text": "Cambodia MPs pass law allowing stripping of citizenship\nPHNOM PENH: Cambodian parliamentarians passed legislation on Monday (Aug 25) allowing people who \"collude\" with foreign countries to be stripped of citizenship, a law rights groups fear will be used to banish dissent.\nRights monitors have long accused Cambodia's government of using draconian laws to stifle opposition and legitimate political debate.\nA sitting of 120 lawmakers in the National Assembly including Prime Minister Hun Manet unanimously passed the bill, empowering authorities to strip nationality from citizens for \"an act of collusion\" with a foreign power.\nThe law \"will have a disastrously chilling effect on the freedom of speech of all Cambodian citizens\", a coalition of 50 rights groups warned in a statement on Sunday.\n\"The potential for abuse in the implementation of this vaguely worded law to target people on the basis of their ethnicity, political opinions, speech, and activism is simply too high to accept,\" it added.\n\"The government has many powers, but they should not have the power to arbitrarily decide who is and is not a Cambodian.\"\nUnder the bill, citizenship can also be stripped for acts leading to \"destruction of sovereignty, territorial integrity and national security\".\nRevocation will be directed by a committee established at the request of Interior Minister Sar Sokha.\nAhead of the vote, he urged lawmakers to pass the legislation because Cambodia was facing threats from \"a small handful\" of turncoat citizens working at the behest of neighbouring Thailand.\nFive days of border clashes erupted between the countries in a territorial dispute last month that killed at least 43 people.\n\"HEINOUS VIOLATION\"\nCambodia's plan to curtail citizenship rights, however, predates that spate of fighting.\nThe unconditional right to citizenship had been enshrined in Cambodia's constitution, but was excised by an amendment passed earlier last month saying nationality could be \"determined by law\".\nThe legislation must still be passed by Cambodia's upper house before being enacted by the head of state, but both are considered rubber-stamp steps.\nCitizenship can be revoked on grounds of treason or disloyalty in 15 European Union countries, and only for naturalised citizens in eight of those, according to a European Parliament briefing in February.\n\"If you betray the nation, the nation will not keep you,\" Justice Minister Koeut Rith told reporters after the amendment was passed.\nLast month, Amnesty International called the legislation a \"heinous violation of international law\".\n\"It comes against a backdrop where the Cambodian authorities have completely failed to safeguard the independence and integrity of the country's courts,\" said regional research director Montse Ferrer.\n\"This has enabled the government's authoritarian practices to continue unchecked, such as its persecution of opposition leaders, activists and independent journalists.\"\nScores of opposition activists have been jailed or face legal cases filed by Cambodian authorities.\nOpposition leader Kem Sokha was sentenced in 2023 to 27 years in prison for treason – a charge he has repeatedly denied – and was immediately placed under house arrest."
    },
    {
      "news_title": "Cambodia passes law to strip citizenship from political dissidents",
      "news_link": "https://alkhaleejtoday.co/international/5855504/Cambodia-passes-law-to-strip-citizenship-from-political-dissidents.html",
      "bias": "unknown",
      "text": "Hello and welcome to the details of Cambodia passes law to strip citizenship from political dissidents and now with the details\nNevin Al Sukari - Sana'a - Cambodia’s Prime Minister Hun Manet greets people as he arrives for a meeting at the National Assembly building in Phnom Penh on August 25, 2025. — AFP pic\nPHNOM PENH, Aug 25 — Cambodian parliamentarians passed on Monday legislation allowing people who collude with foreign countries to be stripped of citizenship, a law rights groups fear will be used to banish dissent.\nAll 120 lawmakers in attendance at the National Assembly session, including Prime Minister Hun Manet, voted unanimously to approve the bill.\nRights monitors have long accused Cambodia’s government of using draconian laws to stifle opposition and legitimate political debate.\nA coalition of 50 rights groups issued a statement on Sunday warning the law “will have a disastrously chilling effect on the freedom of speech of all Cambodian citizens”.\n“The potential for abuse in the implementation of this vaguely worded law to target people on the basis of their ethnicity, political opinions, speech, and activism is simply too high to accept,” it added.\n“The government has many powers, but they should not have the power to arbitrarily decide who is and is not a Cambodian.”\nThe legislation must still be passed by Cambodia’s upper house before being enacted by the head of state, but both are considered rubber-stamp steps.\n‘Determined by law’\nCitizenship can be revoked on grounds of treason or disloyalty in 15 European Union countries, and only for naturalised citizens in eight of those, according to a European Parliament briefing in February.\nThe unconditional right to citizenship was enshrined in Cambodia’s constitution, but lawmakers last month amended it to say “receiving, losing and revoking Khmer nationality shall be determined by law”.\n“If you betray the nation, the nation will not keep you,” Justice Minister Koeut Rith told reporters after the amendment was passed.\nLast month, Amnesty International called the legislation a “heinous violation of international law”.\n“It comes against a backdrop where the Cambodian authorities have completely failed to safeguard the independence and integrity of the country’s courts,” said regional research director Montse Ferrer.\n“This has enabled the government’s authoritarian practices to continue unchecked, such as its persecution of opposition leaders, activists and independent journalists.”\nScores of opposition activists have been jailed or face legal cases filed by Cambodian authorities.\nOpposition leader Kem Sokha was sentenced in 2023 to 27 years in prison for treason – a charge he has repeatedly denied – and was immediately placed under house arrest. — AFP\nThese were the details of the news Cambodia passes law to strip citizenship from political dissidents for this day. We hope that we have succeeded by giving you the full details and information. To follow all our news, you can subscribe to the alerts system or to one of our different systems to provide you with all that is new.\nIt is also worth noting that the original news has been published and is available at Malay Mail and the editorial team at AlKhaleej Today has confirmed it and it has been modified, and it may have been completely transferred or quoted from it and you can read and follow this news from its main source."
    },
    {
      "news_title": "Cambodian MPs pass law allowing stripping of citizenship",
      "news_link": "https://www.freemalaysiatoday.com/category/world/2025/08/25/cambodian-mps-pass-law-allowing-stripping-of-citizenship",
      "bias": "unknown",
      "text": "PHNOM PENH: Cambodian parliamentarians passed on Monday legislation allowing people who collude with foreign countries to be stripped of citizenship, a law rights groups fear will be used to banish dissent.\nAll 120 lawmakers in attendance at the National Assembly session, including prime minister Hun Manet, voted unanimously to approve the bill.\nRights monitors have long accused Cambodia’s government of using draconian laws to stifle opposition and legitimate political debate.\nA coalition of 50 rights groups issued a statement on Sunday warning the law is “vaguely written” and “will have a disastrously chilling effect on the freedom of speech of all Cambodian citizens”.\nThe legislation must still be passed by Cambodia’s upper house before being enacted by the head of state, but both are considered rubber-stamp steps."
    }
  ]
}