{
  "story_id": "GN_20250826_001344_0f29d328",
  "metadata": {
    "title": "HHS derecognizing unions representing staffers at CDC, FDA, NIH and more",
    "timestamp": "2025-08-26T00:13:44.486592",
    "url": "https://ground.news/article/hhs-moves-to-strip-thousands-of-federal-health-workers-of-union-rights"
  },
  "bias_distribution": {
    "total_sources": "74",
    "leaning_left": "9",
    "center": "51",
    "leaning_right": "4"
  },
  "perspective_summaries": {
    "left": [
      "The U.S. Department of Health and Human Services has moved to strip thousands of federal health agency employees of their collective bargaining rights, according to a union that called the effort illegal.",
      "HHS officials confirmed that they are ending recognition of unions and reclaiming office space and equipment used for union activities.",
      "HHS spokesman Andrew Nixon stated that the action ensures resources are focused on safeguarding the health and security of the American people.",
      "Officials with the American Federation of Government Employees said tearing up contracts is a disservice to Americans who benefit from their programs and services."
    ],
    "center": [
      "The U.S. Department of Health and Human Services has moved to strip thousands of federal health agency employees of their collective bargaining rights and ending recognition of unions.",
      "The American Federation of Government Employees condemned HHS's action, saying strong union contracts do not hinder responses to public health emergencies and help agencies like the CDC maintain an experienced workforce.",
      "Despite HHS's actions, the union says it remains intact and vowed to keep fighting for its members, some of whom faced layoffs recently including experts in violence prevention."
    ],
    "right": [
      "The U.S. Department of Health and Human Services plans to end union recognition for thousands of federal health agency employees, according to a union statement.",
      "An appeals court allowed the Trump administration to proceed with an order to end collective bargaining rights for federal employees during ongoing lawsuits.",
      "HHS spokesman Andrew Nixon stated, 'This action ensures that HHS resources and personnel are fully focused on safeguarding the health and security of the American people.'",
      "Union officials argue that strong contracts do not hinder effective responses to public health emergencies."
    ]
  },
  "sources": [
    {
      "news_title": "Agency will end union rights of health workers",
      "news_link": "https://www.nwitimes.com/article_b29495dc-d909-5c68-be5e-2b6d24040328.html",
      "bias": "Center",
      "text": "Country\nUnited States of America US Virgin Islands United States Minor Outlying Islands Canada Mexico, United Mexican States Bahamas, Commonwealth of the Cuba, Republic of Dominican Republic Haiti, Republic of Jamaica Afghanistan Albania, People's Socialist Republic of Algeria, People's Democratic Republic of American Samoa Andorra, Principality of Angola, Republic of Anguilla Antarctica (the territory South of 60 deg S) Antigua and Barbuda Argentina, Argentine Republic Armenia Aruba Australia, Commonwealth of Austria, Republic of Azerbaijan, Republic of Bahrain, Kingdom of Bangladesh, People's Republic of Barbados Belarus Belgium, Kingdom of Belize Benin, People's Republic of Bermuda Bhutan, Kingdom of Bolivia, Republic of Bosnia and Herzegovina Botswana, Republic of Bouvet Island (Bouvetoya) Brazil, Federative Republic of British Indian Ocean Territory (Chagos Archipelago) British Virgin Islands Brunei Darussalam Bulgaria, People's Republic of Burkina Faso Burundi, Republic of Cambodia, Kingdom of Cameroon, United Republic of Cape Verde, Republic of Cayman Islands Central African Republic Chad, Republic of Chile, Republic of China, People's Republic of Christmas Island Cocos (Keeling) Islands Colombia, Republic of Comoros, Union of the Congo, Democratic Republic of Congo, People's Republic of Cook Islands Costa Rica, Republic of Cote D'Ivoire, Ivory Coast, Republic of the Cyprus, Republic of Czech Republic Denmark, Kingdom of Djibouti, Republic of Dominica, Commonwealth of Ecuador, Republic of Egypt, Arab Republic of El Salvador, Republic of Equatorial Guinea, Republic of Eritrea Estonia Ethiopia Faeroe Islands Falkland Islands (Malvinas) Fiji, Republic of the Fiji Islands Finland, Republic of France, French Republic French Guiana French Polynesia French Southern Territories Gabon, Gabonese Republic Gambia, Republic of the Georgia Germany Ghana, Republic of Gibraltar Greece, Hellenic Republic Greenland Grenada Guadaloupe Guam Guatemala, Republic of Guinea, Revolutionary\nPeople's Rep'c of Guinea-Bissau, Republic of Guyana, Republic of Heard and McDonald Islands Holy See (Vatican City State) Honduras, Republic of Hong Kong, Special Administrative Region of China Hrvatska (Croatia) Hungary, Hungarian People's Republic Iceland, Republic of India, Republic of Indonesia, Republic of Iran, Islamic Republic of Iraq, Republic of Ireland Israel, State of Italy, Italian Republic Japan Jordan, Hashemite Kingdom of Kazakhstan, Republic of Kenya, Republic of Kiribati, Republic of Korea, Democratic People's Republic of Korea, Republic of Kuwait, State of Kyrgyz Republic Lao People's Democratic Republic Latvia Lebanon, Lebanese Republic Lesotho, Kingdom of Liberia, Republic of Libyan Arab Jamahiriya Liechtenstein, Principality of Lithuania Luxembourg, Grand Duchy of Macao, Special Administrative Region of China Macedonia, the former Yugoslav Republic of Madagascar, Republic of Malawi, Republic of Malaysia Maldives, Republic of Mali, Republic of Malta, Republic of Marshall Islands Martinique Mauritania, Islamic Republic of Mauritius Mayotte Micronesia, Federated States of Moldova, Republic of Monaco, Principality of Mongolia, Mongolian People's Republic Montserrat Morocco, Kingdom of Mozambique, People's Republic of Myanmar Namibia Nauru, Republic of Nepal, Kingdom of Netherlands Antilles Netherlands, Kingdom of the New Caledonia New Zealand Nicaragua, Republic of Niger, Republic of the Nigeria, Federal Republic of Niue, Republic of Norfolk Island Northern Mariana Islands Norway, Kingdom of Oman, Sultanate of Pakistan, Islamic Republic of Palau Palestinian Territory, Occupied Panama, Republic of Papua New Guinea Paraguay, Republic of Peru, Republic of Philippines, Republic of the Pitcairn Island Poland, Polish People's Republic Portugal, Portuguese Republic Puerto Rico Qatar, State of Reunion Romania, Socialist Republic of Russian Federation Rwanda, Rwandese Republic Samoa, Independent State of San Marino, Republic of Sao Tome and Principe, Democratic Republic of Saudi Arabia, Kingdom of Senegal, Republic of Serbia and Montenegro Seychelles, Republic of Sierra Leone, Republic of Singapore, Republic of Slovakia (Slovak Republic) Slovenia Solomon Islands Somalia, Somali Republic South Africa, Republic of South Georgia and the South Sandwich Islands Spain, Spanish State Sri Lanka, Democratic Socialist Republic of St. Helena St. Kitts and Nevis St. Lucia St. Pierre and Miquelon St. Vincent and the Grenadines Sudan, Democratic Republic of the Suriname, Republic of Svalbard & Jan Mayen Islands Swaziland, Kingdom of Sweden, Kingdom of Switzerland, Swiss Confederation Syrian Arab Republic Taiwan, Province of China Tajikistan Tanzania, United Republic of Thailand, Kingdom of Timor-Leste, Democratic Republic of Togo, Togolese Republic Tokelau (Tokelau Islands) Tonga, Kingdom of Trinidad and Tobago, Republic of Tunisia, Republic of Turkey, Republic of Turkmenistan Turks and Caicos Islands Tuvalu Uganda, Republic of Ukraine United Arab Emirates United Kingdom of Great Britain & N. Ireland Uruguay, Eastern Republic of Uzbekistan Vanuatu Venezuela, Bolivarian Republic of Viet Nam, Socialist Republic of Wallis and Futuna Islands Western Sahara Yemen Zambia, Republic of Zimbabwe"
    },
    {
      "news_title": "Union representing CDC, NIOSH employees says Trump admin is moving to 'de-recognize' it",
      "news_link": "https://www.wboy.com/news/union-representing-cdc-niosh-employees-says-trump-admin-is-moving-to-de-recognize-it/",
      "bias": "Center",
      "text": null
    },
    {
      "news_title": "HHS moves to ‘de-recognize’ federal union contracts",
      "news_link": "https://federalnewsnetwork.com/unions/2025/08/hhs-moves-to-de-recognize-federal-union-contracts/",
      "bias": "Center",
      "text": "The removal of collective bargaining at multiple HHS components came shortly after several other agencies terminated union contracts in the last few weeks.\nThousands of public health employees at the Department of Health and Human Services have lost union representation through their collective bargaining agreements.\nHHS on Friday terminated its contracts with federal unions and ended recognition of thousands of employees’ eligibility for union representation, effective immediately. The move comes in response to an executive order from President Donald Trump earlier this year.\nHHS’s “de-recognition” of federal unions affects employees working in the HHS Office of the Secretary, HHS Office of the General Counsel, the Food and Drug Administration, the Centers for Disease Control and Prevention, the Administration for Strategic Preparedness and Response, and the Administration for Children and Families’ Office of Refugee Resettlement. The contract cancellations also affect some employees at the National Institute of Allergy and Infectious Diseases and the National Institutes of Health.\n“This action ensures that HHS resources and personnel are fully focused on safeguarding the health and security of the American people,” HHS spokesperson Andrew Nixon said in a statement. “HHS is removing unnecessary obstacles to mission-critical work and space previously used for union activities. This change strengthens our ability to respond rapidly to public health threats, advance national security and deliver results for the American taxpayer.”\nThe collective bargaining terminations impact several local chapters of the American Federation of Government Employees, including those representing employees at the CDC, FDA and the National Institute for Occupational Safety and Health, AFGE said Friday. The contract cancellations also impact HHS employees represented by the National Treasury Employees Union, National Alliance of Postal and Federal Employees and United Auto Workers.\nAFGE, which represents thousands of HHS employees, blasted the the agency for its decision, calling the actions an “illegal and immoral assault.”\n“Tearing up our contracts is a disservice to every American who benefits from the programs and services our members deliver,” AFGE National President Everett Kelley said. “But let me be clear: our union isn’t going anywhere.”\nThe federal union argued that stripping collective bargaining agreements, on top of the already-occurring reductions in force at HHS, would lead to a “decimated and demoralized workforce already traumatized by recent campus violence.”\n“Don’t believe HHS — we are still a union,” said Micah Niemeier-Walsh, vice president of AFGE Local 3840, which represents NIOSH employees. “They’re attacking us because they know we are one of the last lines of defense against their effort to dismantle America’s public health system. Whether or not HHS recognizes us on paper, we will continue standing together, side-by-side as coworkers, to defend our rights and protect the nation’s health.”\nThe HHS Office of Human Resources (OHR) appears to be updating federal employees’ personnel files to mark them as non-union employees, despite them previously being eligible for union representation, according to an internal CDC message viewed by Federal News Network.\n“Many employees who were previously in bargaining units or marked as ‘eligible but not represented’ have now been changed to ‘ineligible,’” the message reads. “We do not expect OHR to sent out a communication about this, but we believe employees will start receiving notices soon in their eOPF [personnel files].”\nThe collective bargaining cancellations come as CDC sent permanent termination notices to at least 600 agency employees earlier this week, as reported by the Associated Press.\nThe removal of collective bargaining for many HHS employees also comes shortly after several other agencies, including the Department of Veterans Affairs and the Environmental Protection Agency, similarly terminated their union contracts.\nThe actions follow a recent appeals court decision that allowed agencies to move forward with implementing an anti-union executive order that President Donald Trump signed March 27.\nFederal News Network’s Jory Heckman contributed to this report.\nIf you would like to contact this reporter about recent changes in the federal government, please email drew.friedman@federalnewsnetwork.com or reach out on Signal at drewfriedman.11\nCopyright © 2025 Federal News Network. All rights reserved. This website is not intended for users located within the European Economic Area.\nDrew Friedman is a workforce, pay and benefits reporter for Federal News Network.\nFollow @dfriedmanWFED"
    },
    {
      "news_title": "Unions cry foul as HHS moves to strip thousands of federal health workers of bargaining rights",
      "news_link": "https://nypost.com/2025/08/22/us-news/unions-cry-foul-as-hhs-moves-to-strip-thousands-of-federal-health-workers-of-bargaining-rights/",
      "bias": "Lean Right",
      "text": "Unions cry foul as HHS moves to strip thousands of federal health workers of bargaining rights\nThe U.S. Department of Health and Human Services has moved to strip thousands of federal health agency employees of their collective bargaining rights, according to a union that called the effort illegal.\nHHS officials confirmed Friday that the department is ending its recognition of unions for a number of employees, and are reclaiming office space and equipment that had been used for union activities.\nIt’s the latest move by the Trump administration to put an end to collective bargaining with unions that represent federal employees.\nPreviously affected agencies include the Department of Veterans Affairs and the Environmental Protection Agency.\nIn May, an appeals court said the administration could move forward with President Donald Trump’s executive order aimed at ending collective bargaining rights for hundreds of thousands of federal employees while a lawsuit plays out.\n“This action ensures that HHS resources and personnel are fully focused on safeguarding the health and security of the American people,” HHS spokesman Andrew Nixon said in a statement.\nOfficials with the American Federation of Government Employees said strong union contracts do not hinder strong responses to public health emergencies.\nRather, they help make agencies like the Centers for Disease Control and Prevention have a stable, experienced and supported workforce, the union said.\nSome CDC employees said the union has been a source of information and advocacy for the agency’s employees during layoffs this year and in the wake of the Aug. 8 attack at the CDC’s main campus in Atlanta.\nSince then, the union has been trying to advocate for a better emergency alert system and better security.\nOther affected agencies include the Food and Drug Administration, the National Institutes of Health, the Administration for Strategic Preparedness and Response, and at the Office of Refugee Resettlement within the Administration for Children and Families."
    },
    {
      "news_title": "HHS Strips Union Voices for Workers at Multiple Agencies",
      "news_link": "https://www.wlsam.com/2025/08/22/hhs-strips-union-voices-for-workers-at-multiple-agencies/",
      "bias": "Right",
      "text": "The Department of Health and Human Services moved to revoke recognition of labor unions representing staff at several agencies, arguing the step would “remove unnecessary obstacles to mission-critical work.”\nThe move affects several offices represented by the National Treasury Employees Union; the American Federation of Government Employees; the National Alliance of Postal and Federal Employees; and the United Automobile, Aerospace, and Agricultural Implement Workers of America, The Hill reported Friday.\n“This action ensures that HHS resources and personnel are fully focused on safeguarding the health and security of the American people,” HHS spokesperson Andrew Nixon told The Hill. “By implementing President [Donald] Trump’s Executive Order 14251, HHS is removing unnecessary obstacles to mission-critical work and space previously used for union activities.\n“This change strengthens our ability to respond rapidly to public health threats, advance national security, and deliver results for the American taxpayer.”\nThe Hill reported Friday’s move will impact, among other areas within HHS, the Office of the Secretary, Office of the General Counsel, the Food and Drug Administration, the Centers for Disease Control and Prevention, the Administration for Strategic Preparedness and Response, the National Institute of Allergy and Infectious Diseases, the National Institutes of Health, the Office of Refugee Resettlement, and the Administration for Children and Families.\nThe move came after HHS this week gave permanent termination notices to 600 CDC employees in the wake of a recent court decision that protected some CDC employees from layoffs but not others.\n“This administration’s illegal and immoral assault on federal workers and their labor unions is punishing hundreds of thousands of dedicated public servants who serve our veterans, ensure the safety of the food we eat and the air we breathe, and now those who protect our public health,” American Federation of Government Employees National President Everett Kelley said in a statement.\n“Tearing up our contracts is a disservice to every American who benefits from the programs and services our members deliver. But let me be clear: Our union isn’t going anywhere.”\nTrump in March signed an executive order that ended collective bargaining for wide swaths of federal employees, as part of his campaign to reshape the federal government’s workforce. The White House in a fact sheet said the Civil Service Reform Act of 1978 gave Trump the authority to halt collective bargaining at agencies with national security missions. It excluded law enforcement.\nEarlier this month, a three-judge panel of the 9th U.S. Circuit Court of Appeals rescinded a district court injunction blocking the Trump administration’s effort to strip hundreds of thousands of workers from engaging in union bargaining with federal agencies. The 9th Circuit ruled that Trump’s executive order on its face “does not express any retaliatory animus,” and it agreed with the Trump administration that the president “would have taken the same action even in the absence of the protected conduct.”\n© 2025 Newsmax. All rights reserved."
    },
    {
      "news_title": "HHS Moves to Strip Thousands of Federal Health Workers of Union Rights",
      "news_link": "https://www.usnews.com/news/health-news/articles/2025-08-22/hhs-moves-to-strip-thousands-of-federal-health-workers-of-union-rights",
      "bias": "Lean Left",
      "text": null
    },
    {
      "news_title": "HHS moves to strip thousands of federal health workers of union rights",
      "news_link": "https://apnews.com/article/hhs-cdc-unions-96ac80031b9c4da4d5f68e3c7fc8d156",
      "bias": "Lean Left",
      "text": "HHS moves to strip thousands of federal health workers of union rights\nNEW YORK (AP) — The U.S. Department of Health and Human Services has moved to strip thousands of federal health agency employees of their collective bargaining rights, according to a union that called the effort illegal.\nHHS officials confirmed Friday that the department is ending its recognition of unions for a number of employees, and are reclaiming office space and equipment that had been used for union activities.\nIt’s the latest move by the Trump administration to put an end to collective bargaining with unions that represent federal employees. Previously affected agencies include the Department of Veterans Affairs and the Environmental Protection Agency.\nIn May, an appeals court said the administration could move forward with President Donald Trump’s executive order aimed at ending collective bargaining rights for hundreds of thousands of federal employees while a lawsuit plays out.\n“This action ensures that HHS resources and personnel are fully focused on safeguarding the health and security of the American people,” HHS spokesman Andrew Nixon said in a statement.\nOfficials with the American Federation of Government Employees said strong union contracts do not hinder strong responses to public health emergencies. Rather, they help make agencies like the Centers for Disease Control and Prevention have a stable, experienced and supported workforce, the union said.\nSome CDC employees said the union has been a source of information and advocacy for the agency’s employees during layoffs this year and in the wake of the Aug. 8 attack at the CDC’s main campus in Atlanta.\nSince then, the union has been trying to advocate for a better emergency alert system and better security.\nOther affected agencies include the Food and Drug Administration, the National Institutes of Health, the Administration for Strategic Preparedness and Response, and at the Office of Refugee Resettlement within the Administration for Children and Families.\n___\nThe Associated Press Health and Science Department receives support from the Howard Hughes Medical Institute’s Science and Educational Media Group and the Robert Wood Johnson Foundation. The AP is solely responsible for all content."
    },
    {
      "news_title": "HHS derecognizing unions representing staffers at CDC, FDA, NIH and more",
      "news_link": "https://thehill.com/homenews/5466412-hhs-de-recognizes-labor-unions/",
      "bias": "Center",
      "text": null
    },
    {
      "news_title": "Union blasts HHS for stripping CDC, NIOSH staff of bargaining rights",
      "news_link": "https://www.krem.com/article/news/nation-world/union-responds-hhs-stripping-cdc-niosh-staff-bargaining-rights/507-260527e8-3553-447c-bd45-c6011f6e8054",
      "bias": "Center",
      "text": "WASHINGTON — The American Federation of Government Employees is condemning the Department of Health and Human Services after the agency moved to strip thousands of workers at the Centers for Disease Control and Prevention and the National Institute for Occupational Safety and Health of their union rights while carrying out sweeping layoffs.\nAFGE National President Everett Kelley called the action “illegal and immoral,” saying in a statement it punishes hundreds of thousands of employees who safeguard public health. “Tearing up our contracts is a disservice to every American who benefits from the programs and services our members deliver. But let me be clear: our union isn’t going anywhere.”\nThe union says HHS notified the press, not unions, that it would decertify bargaining units representing CDC, NIOSH and Food and Drug Administration staff.\nThe move comes as at least 600 CDC employees are receiving final termination notices following an April restructuring. The cuts include experts in violence prevention, some of whom lost jobs less than two weeks after a gunman opened fire at the CDC campus, killing a police officer.\nHHS has said the downsizing is aimed at making agencies more responsive, but union leaders argue gutting contracts and jobs undercuts readiness.\n“Canceling our CBAs and gutting our workforce at the same time weakens CDC’s readiness and makes America less safe and less healthy,” Brendan Demich, vice president of AFGE Local 1916 said in the statement. “You cannot cut capacity, silence workers, and then claim you are strengthening public health. Those two positions contradict each other.”\nDespite HHS’s actions, AFGE leaders say their unions remain intact and vowed to keep fighting for members.\n“Whether or not HHS recognizes us on paper, we will continue standing together, side-by-side as coworkers, to defend our rights and protect the nation’s health,” AFGE Local 3840 Vice President Micah Niemeier-Walsh said."
    },
    {
      "news_title": "‘We want to protect what we have’: Blizzard cinematics workers discuss the reasons for joining a union",
      "news_link": "https://massivelyop.com/2025/08/23/we-want-to-protect-what-we-have-blizzard-cinematics-workers-discuss-the-reasons-for-joining-a-union/",
      "bias": "unknown",
      "text": "The growing formation of unions across Microsoft’s game studios, particularly at Blizzard, has been something we’ve been keeping a track of for some time, and that of course includes the one just recently created among employees at the developer’s story and franchise (SFD) team. The reasons for this widespread effort shouldn’t be too surprising to gamers who follow the news, but if you’re looking for even more context, a Eurogamer interview with some recently unionized workers should provide some direct insight.\nAccording to video editor Alison Venato and SFD associate producer Sammi Kay, it boils down to achieving a sense of job stability (and a push against contract work), insight into business decisions that will affect workers, assurance that pay scales will adjust with inflation and local cost of living in Irvine, California, and putting up guardrails for AI tool use. In other words, developers are organizing to protect themselves against the tumult that continues to jar the games industry at the rank-and-file level.\n“We understand companies need to make money, but we were bought in the largest tech acquisition of all time, so obviously we have value,” Venato says. “Our union can work with the leadership to create a situation that’s beneficial to everyone. […] There’s a disconnect between what the companies and leadership are expecting from the industry and the workers who are developing that content.”\nKay also points out that many who work at Blizzard are deeply committed to the studio and its legacy – and the defense of that legacy. “Things have changed due to many factors, including the pandemic, and the age of Blizzard as a company and it evolving, including with the acquisition by Microsoft,” she says. “We’re unionizing because we’re attached to how special Blizzard is […] We want to protect what we have and make it better.”"
    }
  ]
}