{
  "story_id": "GN_20250825_231710_ef4b80cb",
  "metadata": {
    "title": "Trump administration halts offshore wind project in Rhode Island",
    "timestamp": "2025-08-25T23:17:10.867288",
    "url": "https://ground.news/article/trump-administration-halts-offshore-wind-project-in-rhode-island"
  },
  "bias_distribution": {
    "total_sources": "179",
    "leaning_left": "29",
    "center": "47",
    "leaning_right": "31"
  },
  "perspective_summaries": {
    "left": [
      "The Trump administration halted construction of the Revolution Wind project off Rhode Island, stating the need to review national security interests related to the project, according to the Bureau of Ocean Energy Management.",
      "Orsted reports that the Revolution Wind project is about 80% complete with 45 of 65 turbines installed, and it is evaluating options, including legal action, due to the stop-work order.",
      "Rhode Island Governor Dan McKee and Connecticut Governor Ned Lamont plan to pursue every avenue to reverse the halt on Revolution Wind, which is intended to power over 350,000 homes.",
      "Critics, including environmental groups, claim the decision is a significant setback for renewable energy, while fishermen celebrate the pause, signaling concerns for marine life and local livelihoods."
    ],
    "center": [
      "The Trump administration ordered a halt to all activities on the Revolution Wind offshore project off Rhode Island on Friday, 2025-08-23.",
      "This stoppage follows the Department of Interior's recent secretarial order demanding elevated review of all wind and solar projects and concerns about national security and environmental impacts.",
      "The Danish firm Orsted, which has installed 45 of 65 turbines and completed 80% of construction since last year, said it is evaluating all options, including legal avenues, to resume the 704-megawatt project expected to power 350,000 homes.",
      "President Trump stated in Washington, 'wind doesn't work' and pledged to favor fossil fuels, claiming unverified environmental harms while critics argue the administration misuses environmental laws to restrict renewables.",
      "The order and elevated reviews could effectively block renewable energy development on federal lands, signaling a significant challenge for US wind power amid increasing international green energy adoption."
    ],
    "right": [
      "The Department of the Interior has halted all activities on the Revolution Wind project off the coast of Rhode Island, citing unspecified issues that need review.",
      "Orsted, the company building the project, stated it is 80% complete but must now comply with the halt, which addresses unspecified concerns related to national security interests.",
      "Environmental and fishing industry concerns have been raised about offshore wind projects due to issues like habitat disruption and safety, as highlighted by various stakeholders.",
      "Governor Dan McKee of Rhode Island stated that the halt undermines efforts to lower energy costs and expand supply for families and businesses."
    ]
  },
  "sources": [
    {
      "news_title": "Trump's stop work order on wind project hits renewable energy stocks",
      "news_link": "https://qz.com/trumps-stop-work-order-on-wind-project-hits-renewable-stocks",
      "bias": "Center",
      "text": null
    },
    {
      "news_title": "DAILY CALLER EXCLUSIVE: Trump Admin Kills Massive Offshore Wind Project",
      "news_link": "https://www.themainewire.com/2025/08/daily-caller-exclusive-trump-admin-kills-massive-offshore-wind-project/",
      "bias": "Right",
      "text": "The Daily Caller News Foundation learned on Friday that the Department of the Interior (DOI) is immediately halting all activity on a massive offshore wind project.\nThe Bureau of Ocean Energy Management (BOEM) under the DOI is halting activity on the “Revolution Wind” project off the coast of Rhode Island and Connecticut in line with President Donald Trump’s energy goals to boost reliable energy resources and lower costs for Americans, the agency told the DCNF. The Trump administration has dealt a series of recent blows to the wind industry, with the DOI ending “preferential treatment” for what it considers to be foreign-controlled and unreliable energy sources and moving to terminate the massive Lava Ridge Wind Project in southern Idaho that the Biden administration approved just weeks before Trump’s return to office.\n“Americans deserve energy that is affordable, reliable, and built to last — not experimental and expensive wind projects that are proven failures,” DOI deputy press secretary Aubrie Spady told the DCNF. “In line with President Donald Trump’s Energy Dominance Agenda, Interior is putting an immediate stop to these costly failures to deliver a stronger energy future and lower costs for American families. Like President Trump said, ‘the days of stupidity are over in the USA!’”\nThe Biden administration approved the construction plan for Revolution Wind in 2023, which is located on the federally-owned Outer Continental Shelf. While former President Joe Biden pushed for wind and solar technology throughout his term by greenlighting billions in subsidies, loans and grants, the Trump administration has shifted its focus to conventional and reliable energy sources and taken action to crackdown on federal support for the green energy technology the Biden administration favored.\nTrump signed an executive order directing the DOI to “revise any identified regulations, guidance, policies, and practices as appropriate and consistent with applicable law to eliminate any such preferences for wind and solar facilities” on July 7. Trump campaigned against Biden’s push for green energy and has continued to rail against Biden’s climate agenda, writing on Truth Social Wednesday that “any State that has built and relied on WINDMILLS and SOLAR for power are seeing RECORD BREAKING INCREASES IN ELECTRICITY AND ENERGY COSTS. THE SCAM OF THE CENTURY! We will not approve wind or farmer destroying Solar. The days of stupidity are over in the USA!!! MAGA.”\nThe agency introduced an additional permitting roadblock for green energy projects on public lands on Aug. 1., and a few days later, Interior Secretary Doug Burgum wrote on X that wind projects “are known to kill eagles” and that his agency would enforce the Bald and Golden Eagle Protection Act to protect eagles. The Trump administration also pulled a permit for a massive pending New Jersey offshore wind project in March.\nThe wind industry has come under fire in recent years, as multiple beaches closed in 2024 after a broken wind turbine shed debris into the ocean off the coast of Nantucket and protests surged due to concerns about high-voltage cables running through neighborhoods in 2023. Environmentalists also raised concerns over the energy technology after dolphins washed up along the East Coast in 2023.\nSome fishermen have also voiced opposition to offshore wind projects, arguing that their industry cannot survive alongside offshore wind farms."
    },
    {
      "news_title": "Trump administration halts Orsted's Rhode Island wind project, shares sink 17%",
      "news_link": "https://gazette.com/news/us-world/trump-administration-halts-orsteds-rhode-island-wind-project-shares-sink-17/article_16609610-85c5-5a29-89bb-472eca30c185.html",
      "bias": "Center",
      "text": "By Stine Jacobsen\nCOPENHAGEN (Reuters) -Orsted said on Monday it would continue with a plan to raise capital after the Trump administration ordered the offshore wind farm developer to stop construction on a near-completed project off Rhode Island, sending its shares down 17%.\nThe company, 50.1% owned by the Danish state, said earlier this month it would seek to shore up its finances through a $9.4 billion emergency rights issue.\n\"The planned rights issue had been sized to provide the required strengthening of Orsted's capital structure to execute its business plan, even when taking into account the impact of this uncertainty on Orsted's U.S. offshore wind portfolio,\" it said in a statement.\nThe Trump administration's Bureau of Ocean Energy Management (BOEM) published its stop-work order late on Friday, forcing suspension of a project that was 80% complete with 45 out of 65 wind turbines installed.\nThe timing of the halt to Revolution Wind off Rhode Island was particularly damaging to Orsted, which announced earlier this month a plan to raise 60 billion Danish crowns ($9.42 billion) through a rights issue.\nOrsted's shares, already down 30% since announcing its plan on August 11, fell as much as 17% in early trading on Monday.\n\"This is a huge hurdle with regards to raising capital,\" Sydbank analyst Jacob Pedersen told Reuters, adding he was \"stunned.\"\nAlphaValue analyst Pierre-Alexandre Ramondenc said the U.S. move could jeopardise the success of the rights issue.\n\"The news came as a major shock and amounts to nothing less than political hostage-taking by the U.S. administration, given the project's advanced stage,\" Ramondenc said.\nOn his first day in office in January, President Donald Trump suspended new offshore wind leasing pending environmental and economic review of projects. He has repeatedly criticised wind energy as ugly, unreliable and expensive.\n($1 = 6.3685 Danish crowns)\n(Reporting by Stine Jacobsen; Editing by Terje Solsvik, Lincoln Feast, Bernadette Baum and Louise Heavens)"
    },
    {
      "news_title": "Ribbon cutting ceremonies held for new troll sculpture locations",
      "news_link": "https://www.wpri.com/news/local-news/providence/ribbon-cutting-ceremonies-held-for-new-troll-sculpture-locations/",
      "bias": "Center",
      "text": null
    },
    {
      "news_title": "Trump Works To Sabotage Offshore Wind Alliances - CleanTechnica",
      "news_link": "https://cleantechnica.com/2025/08/24/trump-works-to-sabotage-offshore-wind-alliances/",
      "bias": "Lean Left",
      "text": "Trump Works To Sabotage Offshore Wind Alliances\nSupport CleanTechnica's work through a Substack subscription or on Stripe.\nWouldn’t you think that a $4 billion wind farm off the coast of Rhode Island that is nearly complete would be safe from Trump administration wrath? With all necessary permits in place, wouldn’t its future seem secure? Nope. Citing “concerns that have arisen” during a review, the US Department of the Interior (DOI) has informed Revolution Wind, LLC that it cannot resume any activities until so notified. The announcement threatens already tenuous wind alliances across commercial fishers, the offshore wind industry, environmentalists, clean power advocates, and investors.\nRevolution Wind, a subsidiary of Ørsted, is complying with the order and is “taking appropriate steps to stop offshore activities, ensuring the safety of workers and the environment.”\nThe Ørsted vision is a world that runs entirely on green energy.\nIn the August 22 Ørsted press release, the company described how Revolution Wind has 20-year power purchase agreements to deliver 400 MW of electricity to Rhode Island and 304 MW to Connecticut, “enough to power over 350,000 homes across both states to meet their growing energy demand.” The adjacent South Fork Wind, which uses the same turbine technology, “delivered reliable energy to New York at a capacity factor of 53% for the first half of 2025, on par with the state’s baseload power sources.”\nThe project is located about 15 miles south of the Rhode Island coast and 32 miles southeast off the shores of Connecticut.\nOnly a handful of offshore wind projects in the United States are still under construction, including Empire Wind and Sunrise Wind, NY; Vineyard Wind near Martha’s Vineyard, MA; and the Coastal Virginia Offshore Wind project.\nConnecticut Attorney General William Tong, a Democrat, said the state was “evaluating all legal options to protect Connecticut’s interests.” Arguing that the Trump administration “wants to mothball billions of dollars in investment and cancel one of the best new sources of American-made, renewable energy,” Tong called out the President and his advisors for the harm they will cause to everyday consumers. “Trump and his enablers will own the resulting cost increases for ratepayers.”\nTong has joined a coalition of 19 attorneys general in filing a lawsuit against the Trump Administration over its unlawful attempt to freeze the development of wind energy.\n“With the significant investments made in this project already and its obvious benefit to our economy and climate,” RI Attorney General Peter F. Neronha added, “the Trump Administration’s attempt to halt it can only be characterized as bizarre.”\nGlobally the offshore wind industry is ramping up full speed ahead. On the other end of the energy spectrum, though, the Trump administration continues to do all it can to enhance the oil, gas, and coal industries. They are trying to halt policies in place that curb carbon emissions. They have reneged on federal grants, fired workers en masse, and attacked longstanding environmental regulations. They have frozen funds appropriated by Congress for clean energy projects and taken particular aim at wind energy, the country’s largest source of renewable power. They are promoting the dirtiest and most expensive fossil fuels in place of large offshore wind farms.\nYet the untold story is about higher consumer utility rates, which are largely a result of higher demand. That demand, in turn, are being driven by the rapid expansion of artificial intelligence, oil and gas drilling, space heating, and electrified forms of transportation, explains Rob Gramlich, president of Grid Strategies, a DC-based energy consultancy firm. All of these technologies require extraordinary amounts of power. Offshore wind can reduce the need for peaker plants. In wholesale electricity markets, peak power costs set the price for the whole market.\nDOI deputy press secretary Aubrie Spady told the Daily Caller (co-founded by Tucker Carlson) that people in the US don’t want or need renewable energy.\n“Americans deserve energy that is affordable, reliable, and built to last — not experimental and expensive wind projects that are proven failures. In line with President Donald Trump’s Energy Dominance Agenda, Interior is putting an immediate stop to these costly failures to deliver a stronger energy future and lower costs for American families. Like President Trump said, ‘the days of stupidity are over in the USA!’”\nAhem. As is their norm, lies are more important for the Trump administration than data or peer-reviewed research.\nHow the Anti-Wind Narrative Evolved\nIn 2025, many businesses face an insidious threat: the danger that the Trump administration will tell their company’s story faster, louder, or more convincingly than they do. And what’s become clear is the truth doesn’t matter. Executive orders now introduce policy uncertainty. Funding freezes lead to project delays. Investors retreat — as Marianne O’Connor outlines in PR News, “not due to technological failings but because of politically driven narrative shifts.”\nThis abrupt reversal rocked markets and cast doubt on the viability of wind power overall, illustrating how quickly external narratives can destabilize entire sectors. Offshore wind developers never fully grounded their story in rural revitalization, energy independence. or patriotism, O’Connor argues, and these are themes that might have defused political hostility. Another gap seems a deficit of relatable spokespeople, such as utility customers, turbine technicians, coastal business owners, or veterans retrained for green jobs — “who could retake the narrative and humanize the industry.”\nInstead of hyperbole, the nuances of offshore wind need to be explored. Despite the recent increase in offshore wind deployments, decision-making bodies have been making slow progress in measuring cumulative impacts. Experts describe how:\n- large offshore wind farms are planned for extreme climate conditions and designed to reduce installation time;\n- large-scale projects have the need to improve the supply chain towards the establishment of coastal logistic centers;\n- a Marine Net Gain approach is based on the value of the marine environment to people via ecosystem services and natural capital.\nSeveral offshore wind advocacy groups have spoken out about the Trump halt to the Revolution Wind project.\nOne is Climate Action RI, which posted a message on social media criticizing the Trump administration’s action. “Revolution Wind is essential not only for our work to mitigate the climate crisis, but Rhode Island’s energy and economic future,” wrote Christian Roselund, clean energy policy analyst and “Yes to Wind” team leader.\nLiz Burdock, CEO of Oceantic Network, stated, “This dramatic action further erodes investor confidence in the US market across all industries and undermines progress on shared national priorities—shipyard revitalization, steel and port investments, and energy dominance.”\nSign up for CleanTechnica's Weekly Substack for Zach and Scott's in-depth analyses and high level summaries, sign up for our daily newsletter, and follow us on Google News!\nHave a tip for CleanTechnica? Want to advertise? Want to suggest a guest for our CleanTech Talk podcast? Contact us here.\nSign up for our daily newsletter for 15 new cleantech stories a day. Or sign up for our weekly one on top stories of the week if daily is too frequent.\nCleanTechnica uses affiliate links. See our policy here.\nCleanTechnica's Comment Policy"
    },
    {
      "news_title": "Americans Rejoice after Trump Admin Pulls Plug on Behemoth Rhode Island Offshore Wind Project",
      "news_link": "https://legalinsurrection.com/2025/08/americans-rejoice-after-trump-admin-pulls-plug-on-behemoth-rhode-island-offshore-wind-project/",
      "bias": "Right",
      "text": "Americans Rejoice after Trump Admin Pulls Plug on Behemoth Rhode Island Offshore Wind Project\nMeanwhile, Rhode Island leaders slammed the Trump administration’s decision to halt Revolution Wind.\nLegal Insurrection has been following the complaints and valid concerns raised by local residents, area fishermen, and environmentalists about the giant offshore wind projects that have emerged in recent years, all of which were supported by massive tax breaks and grants from Biden’s ‘Green New Deal.’\nResidents objected to the visual impact of turbines, cited concerns over property values, and complained about noise and changes to the local seascape (especially in the wake of the Vineyard Wind incident).\nFishermen warned about the potential loss of fishing grounds, the disruption of fish habitats, and difficulties navigating safely within and around turbine arrays. They feared impacts to fish populations due to noise, surveys, and construction. They also argued that substantial portions of valuable fishing areas may become inaccessible, threatening their livelihoods.\nEnvironmentalists regularly complain about threats to marine biodiversity, such as risks to birds, marine mammals, and ocean ecosystems during both construction and operation.\nAdd to this mix the increasing doubt about the promises made by wind energy developers regarding environmental benefits and job creation. And given the likely escalation in electricity prices in Blue States pushing the “Net-Zero” inanity, this skepticism will likely increase exponentially.\nHowever, the Biden administration, Blue State politicians, and climate activists ignored the complaints, the protests, and the findings that challenged the idea that the windfarms were “environmentally friendly.” They persisted in building and funding.\nThis steamrolling completely ended with President Donald Trump, who recently posted that he was essentially going to put a stake in the heart of the wind and solar energy industries.\nThe Deal That Wasn't Green\nOld Joe rolled out a mighty plan,\nTo “save the earth,” he'd say he can.\nWith windmills high and taxes new,\nA Green New Deal for me and you.But Trump came back with booming cheer,\n“Those turbines? Folks, they’re killing deer!\nAnd solar’s fine, but… pic.twitter.com/fwDxD2uiSz— Leslie Eastman ☥ (@Mutnodjmet) August 23, 2025\nFollowing this Truth Social chestnut, the Trump administration has ordered a halt to the construction of the Revolution Wind project, a major offshore wind farm located off the coast of Rhode Island. This stop-work order came despite the project being about 80% complete, with 45 out of 65 turbines already installed and significant investment already made.\nMatthew Giacona, the acting director of the Bureau of Ocean Energy Management, issued a letter on Friday to Orsted, the Danish company building the wind farm, ordering it to “halt all ongoing activities” because of unspecified issues.\n“In particular, BOEM is seeking to address concerns related to the protection of national security interests in the United States,” Mr. Giacona wrote, adding that Orsted “may not resume activities” until the agency has completed a review of the project.\n…In a statement, Orsted said that it was “evaluating all options to resolve the matter expeditiously,” including “potential legal proceedings.” The company said it still aimed to complete the project by next year.\nLast week, Orsted said that it needed to raise an additional $9.4 billion to shore up its finances as it attempted to complete both Revolution Wind and Sunrise Wind, another large offshore wind project near Long Island, while contending with an industry downturn that has been exacerbated by President Trump’s opposition to wind farms.\nBREAKING: Trump administration halts all work on Revolution Wind project off the coast of RI and MA, southwest of Martha’s Vineyard citing the OCS Lands Act. #mapoli #offshorewind #GreenEnergy pic.twitter.com/PFeckLXsce\n— JohnFGately (@johnfgately) August 22, 2025\nRhode Island’s Democratic politicians are unhappy:\nIn a statement, Gov. Dan McKee (D-RI) calls the decision to halt the project a big blow to hundreds of thousands of Rhode Islanders who could have gotten power from the project, saying:\nThe Trump administration’s stop-work order on Revolution Wind undermines efforts to expand our energy supply, lower costs for families and businesses, and strengthen regional reliability. This action puts hundreds of union jobs at risk by halting a project that is 80% complete—just steps away from powering more than 350,000 homes in Rhode Island and Connecticut. At a time when we should be moving forward with solutions for energy, jobs, and affordability, the Trump administration is choosing delay and disruption. We are working with our partners in Connecticut to pursue every avenue to reverse this decision. Revolution Wind is key to Rhode Island’s economic development, energy security, and long-term affordability for our residents.\nHowever, many Americans (especially in Rhode Island and Connecticut) are happy. And many want all the rest of these monstrosities halted as well.\nNow order it to be disassembled!! @realDonaldTrump\n— Annie F. (@PamelaSpeaksNow) August 23, 2025\nBig offshore wind news: the Trump administration has halted construction on Revolution Wind: pic.twitter.com/JXXflPd03J\n— Nantucket Current (@ACKCurrent) August 22, 2025\nGreat news!\nTrump halts Revolution Wind project that’s nearly complete off the Rhode Island shore | AP News https://t.co/RJFybmMGtD— Donald Morgan (@dmorgan1773) August 23, 2025\nDonations tax deductible\nto the full extent allowed by law.\nComments\nI’m not rejoicing. Wind and solar are now capable of competing with fossil fuels on cost and emissions. We need more of these energy sources not less.\nElectricity prices are going to increase because of AI’s (and crypto’s) tremendous demand. 2% of our income goes to our electricity bills. Trump is going to make it 3%.\nThis is dumb.\nNo matter how low the establishment cost goes, wind and solar can NEVER be capable of competing with fossil fuels, because so-called “renewables” are intrinsically intermittent and must be backstopped by excess fossil-fuel generation to provide reliable power. As graphically illustrated in Spain not long ago.\nThe fact that you even use the word “emissions” in these discussion identifies your POV unscientific.\nNo, they aren’t and they never were.\nWind and solar DO NOT WORK AT SCALE. They can only safely provide a SMALL percentage of total power generation of a grid, and they REQUIRE full backup from fossil fuels because big shocker, they generate wildly different amounts of power based on the environment.\nAnd oh by the way, they COST more ’emissions’ to manufacture them than they can possibly save in their entire lifetimes, so that crap is just a lie.\nThe only game in town to actually replace fossil fuels is nuclear.\n“Wind and solar are now capable of competing with fossil fuels on cost and emissions.”\nAssuming this is true (and I don’t think it is), wind and solar cannot compete with the reliability of fossil fuels. What if the sun doesn’t shine, and the wind doesn’t blow? The grid issues in Texas should have served as a warning to those touting solar and wind as reliable replacements for fossil fuels. I guess you didn’t get the memo.\nOlinser in his comment makes the right call: the power source of the future should be nuclear. It’s clean, reliable, and scalable. In fact, Google and Kairos Power are looking to build an advanced nuclear plant in Oak Ridge TN to power Google data centers.\nThe only thing here that’s dumb is the substance of your post.\nI hate to pile on, but you are very, very mistaken. There are many very detailed analyses on why wind is not cost effective and a poor solution, but a good starting place is here: https://unpopular-truth.com/2025/02/21/where-the-wind-blows/\nMoreover, as an engineer I find it amazing that people are advocating for an energy system that is located in the ocean. You would be hard pressed to find a worse environment for mechanical systems. We have deep sea drilling platforms, but those are manned and constantly maintained. Ocean vessels are under constant maintenance. It is no different, and perhaps worse, for a wind turbine. Just because the turbine blades don’t rust doesn’t mitigate the corrosive effects of salt and wind (Yes, wind) on the turbine and mechanical subsystems. In other words, their real world capacity factors will be even worse than land-based.\nThe only good source of energy is one that produces power essentially 24/7/365 regardless of the weather or if it’s daytime or night.\nDo you honestly think wind/solar will provide the power required for AI, crypto, server farms, and so on? Do you honest think that power will be 24/7 reliable?\nYou DO understand what happened in Texas a couple of winters ago, right?\nFirst cost. What metric do you use to compare wind turbine energy to (say) combined cycle gas turbine (CCGT)? Many energy economists use LCOE (levelized cost of electricity). Look up the formulas and assumptions behind LCOE. Lazard dot com has done LCOE for wind turbines vs CCGT, and wind turbine does come in cheaper, but there many parameters (like interest rates and the cost of capital) that change from year to year. In my opinion, most energy economists lack the knowledge of physics needed to tell the whole story. Most alternative energy sources do not produce dispatchable energy. What happens when the wind dies down for a long time? Exactly this happened in Europe well before the recent problem in Spain. Wind fields exhibit spatial correlation (look up Kriging to go into the theory). So you can’t rely on active wind all the time and everywhere (temporal and spatial correlation). Moreover the wind can blow too hard and the turbine shuts down. So you need something like CCGT as a backup and I don’t see that cost factored into LCOE.\nThere are other non-quantifiable costs to wind turbines: aesthetics, acoustics, land use, bird harm … not reflected in LCOE.\nAll that being said I have my own critique of alternative energy which I hope to bring out in a book. Put simply: pipes vs wires. Once you generate energy you have to get it to the end user. Do you transfer as chemical energy as a fluid (like oil) in a pipe, or as electrical energy by wire. Small digression. Where is the energy in wire transmission? Not in the wires! In the electromagnetic field between the wires. I don’t think many economists know Poynting’s theorem which shows you where the energy is flowing. Big deal. Electrical transmission can’t compete with fluid transmission. The Alaska pipeline, (four foot diameter) when operating at full capacity delivers 17 times the all the electrical energy consumed in New York City. Pipes vs wires. The US is riddled with pipelines carrying energy in chemical form as a fluid flow. We really can’t replace all those pipes with wires because of cost and land use. Transmission is the Achilles heel of alternative energy.\nWow! You drank the whole gallon of Kool-Aid!!!\nStupid take. AI companies are looking to nuclear. Solar and Wind have to either be backed by large expensive explosive battery farms or fossil fuel sources because they are unreliable, They are also environmentally unsound to produce, increase reliance on china, unsightly, require lots of acreages, have short lifespans, and a problem recycling. Wind farms off NE have shown themselves to be a hazard as well.\nI guess genius didn’t read about the Google plan for a mini reactor.\nMy Massachusetts electric bill MANDATES that 61% of my electricity needs come from so called renewable (HYPER expensive) sources like your crappy wind. My kWhr rate rose 28% this year due to this mandate.\nGo pound sand.\nWind and solar do not now nor will they ever “compete” with fossil fuel generation on cost and energy production. If they could they would not need massive tax payer subsidies to survive.\nDon’t stop the work already completed. BUT, remove the federal taxpayer support… subsidies, tax breaks, etc. State support may continue in our federal system. If the project is worthy, it will stand on it’s own economics. “No Green Scams”\nAgree. Might as well use what’s already built instead of tearing it down (Shoreham, anyone?), but not replace anything that gets damaged or worn out.\nThose wind turbines are killing a lot of sealife and birds in unsustainable numbers. When a beach is full of bodies of sealife washing up there is something very wrong.\nForce the power companies to remove their green subsidies. My power costs have increased with a portion put toward green energy.\nYes. The windmills that are built are there so let the state use them but remove any and all federal support. Let’s see if they can provide any reliable electricity at current market rates. I have my doubts.\nI’d like to see whose (which politicians) pocketbook benefitted\nAsk Shelly Whitehouse. This was his baby.\nHis wife is definitely involved.\nI’d like to see investigations into kickbacks to dramacrat politicians from green companies receiving government contracts or subsidies.\nI HIER U LIEK KEYSTONE PIPLINE\nSO WE PUT SUM KEYSTONE PIPLINE IN YUR WIND FARM\nSO U KNOW WHAT IT’S LIEK\nwhile youre in that neighborhood\nstop the obama era ..”zipcodes cant stop you from living where you want” agenda as multifamily “affordable housing” is taking over neighborhoods that are meant to be single family as the agenda of giving to those that havent earned their keep…giving them YOUR KEEP\n“stop the obama era ..”zipcodes cant stop you from living where you want”\nRight — only from going to school where you want.\nGREAT NEWS!!\nEven better news will be when theyre ordered to remove those wind generators and the fish habitat destroying stantions supporting them.\nI don’t know what can be done with the huge, unrecyclable, composite blades but the important thing is to get them out of the water so we can get at the bases.\n.\nMaybe we can make a big pile of blades in Delaware somewhere until the geniuses figure this problem out.\nReplace the classified ballast beside Joe’s Corvette.\nBring back impalement and apply it to all who promoted these wind farms using the blades of course.\nPile them up along the southern border.\n“We will not approve wind or farmer destroying Solar.”\nI dearly await the small child predestined to cry out:\n“The Emperor has no punctuation!”\nGeez, I wish Trump would learn to write.\nAnd if you think Trump does it for any reason other than to further irritate the Left into mindless grammar-and-punctuation rage… think further.\nHow about the government getting out of subsidizing established technologies such as solar and wind turbines or mandating their use? If these technologies are all that the proponents say they are, then we should see the market react accordingly. I am more that a bit skeptical that, without subsidies or use mandates, solar and wind will be economically competitive with hydro, gas, or nuclear.\nRI is tiny state. Their entire coastline could be potentially decimated by one wind turbine project. The environmental impact of these projects is not “neutral”.\nPA has enough natural gas to supply nearby markets if they stop blocking pipeline construction.\nLeave a Comment"
    },
    {
      "news_title": "NEW: Trump Axes Massive Biden-Era Offshore Wind Farm Project",
      "news_link": "https://trendingpoliticsnews.com/new-trump-axes-massive-biden-era-offshore-wind-farm-project-cmc/",
      "bias": "Right",
      "text": "Politics\nNEW: Trump Axes Massive Biden-Era Offshore Wind Farm Project\nThe Department of the Interior (DOI) is immediately halting all activity on a massive offshore wind farm project that was established by the Biden Administration, according to a report from the Daily Caller.\nThe Bureau of Ocean Energy Management (BOEM, which falls under the DOI, is halting activity on the “Revolution Wind” project off the coast of Rhode Island and Connecticut effective immediately. President Donald Trump has long criticized wind farm projects, pointing to their notoriously unreliable output, foreign control of key components for wind projects and environmental concerns.\nIn recent weeks and months, the DOI has dealt a number of significant blows to the wind energy industry, including an end to Biden-era “preferential treatment” and moving to terminate the massive Lava Ridge Wind Project in southern Idaho. The latter project was green-lit just weeks before President Trump returned to office.\n“Americans deserve energy that is affordable, reliable, and built to last — not experimental and expensive wind projects that are proven failures,” DOI deputy press secretary Aubrie Spady told the Daily Caller. “In line with President Donald Trump’s Energy Dominance Agenda, Interior is putting an immediate stop to these costly failures to deliver a stronger energy future and lower costs for American families. Like President Trump said, ‘the days of stupidity are over in the USA!’”\nThe Biden Administration had approved the Revolution Wind project in 2023, which is located on the federally-owned Outer Continental Shelf. Cancelling the project follows in line with the Trump Administration’s radical shift on energy policy, namely in shifting focus away from solar and wing projects in favor of traditional energy sources.\nTrump signed an executive order directing the DOI to “revise any identified regulations, guidance, policies, and practices as appropriate and consistent with applicable law to eliminate any such preferences for wind and solar facilities” on July 7. The order fulfilled a popular campaign promise from the president to end his predecessor’s “green new deal” policies in favor of a “drill baby drill” agenda.\n“Any State that has built and relied on WINDMILLS and SOLAR for power are seeing RECORD BREAKING INCREASES IN ELECTRICITY AND ENERGY COSTS,” the president posted on Truth Social earlier this week. “THE SCAM OF THE CENTURY! We will not approve wind or farmer destroying Solar. The days of stupidity are over in the USA!!!”\nInterior Secretary Doug Burgum reiterated the administration’s opposition to wind farms in a social media post of his own, which noted that wind farms have depleted populations of eagles and other rare bird species. Offshore wind farms like Revolution Wind have also faced criticism for killing whales and dolphins, oftentimes from environmental groups that often support left-wing political causes and candidates.\n“Wind projects are known to kill eagles, and climate extremists in the Biden admin still greenlit scores of these projects,” Burgum posted on X. “[The DOI] is enforcing the Bald and Golden Eagle Protection Act to ensure that our national bird is not sacrificed for unreliable wind facilities!”\nThe Trump administration also pulled a permit for a massive pending New Jersey offshore wind project in March."
    },
    {
      "news_title": "Trump Admin Kills Massive Offshore Wind Project",
      "news_link": "https://georgiastarnews.com/news/trump-admin-kills-massive-offshore-wind-project/dcnf/2025/08/24/",
      "bias": "Right",
      "text": "by Audrey Streb\nThe Daily Caller News Foundation learned on Friday that the Department of the Interior (DOI) is immediately halting all activity on a massive offshore wind project.\nThe Bureau of Ocean Energy Management (BOEM) under the DOI is halting activity on the “Revolution Wind” project off the coast of Rhode Island and Connecticut in line with President Donald Trump’s energy goals to boost reliable energy resources and lower costs for Americans, the agency told the DCNF. The Trump administration has dealt a series of recent blows to the wind industry, with the DOI ending “preferential treatment” for what it considers to be foreign-controlled and unreliable energy sources and moving to terminate the massive Lava Ridge Wind Project in southern Idaho that the Biden administration approved just weeks before Trump’s return to office.\n“Americans deserve energy that is affordable, reliable, and built to last — not experimental and expensive wind projects that are proven failures,” DOI deputy press secretary Aubrie Spady told the DCNF. “In line with President Donald Trump’s Energy Dominance Agenda, Interior is putting an immediate stop to these costly failures to deliver a stronger energy future and lower costs for American families. Like President Trump said, ‘the days of stupidity are over in the USA!’”\nThe Biden administration approved the construction plan for Revolution Wind in 2023, which is located on the federally-owned Outer Continental Shelf. While former President Joe Biden pushed for wind and solar technology throughout his term by greenlighting billions in subsidies, loans and grants, the Trump administration has shifted its focus to conventional and reliable energy sources and taken action to crackdown on federal support for the green energy technology the Biden administration favored.\nTrump signed an executive order directing the DOI to “revise any identified regulations, guidance, policies, and practices as appropriate and consistent with applicable law to eliminate any such preferences for wind and solar facilities” on July 7. Trump campaigned against Biden’s push for green energy and has continued to rail against Biden’s climate agenda, writing on Truth Social Wednesday that “any State that has built and relied on WINDMILLS and SOLAR for power are seeing RECORD BREAKING INCREASES IN ELECTRICITY AND ENERGY COSTS. THE SCAM OF THE CENTURY! We will not approve wind or farmer destroying Solar. The days of stupidity are over in the USA!!! MAGA.”\nThe agency introduced an additional permitting roadblock for green energy projects on public lands on Aug. 1., and a few days later, Interior Secretary Doug Burgum wrote on X that wind projects “are known to kill eagles” and that his agency would enforce the Bald and Golden Eagle Protection Act to protect eagles. The Trump administration also pulled a permit for a massive pending New Jersey offshore wind project in March.\nThe wind industry has come under fire in recent years, as multiple beaches closed in 2024 after a broken wind turbine shed debris into the ocean off the coast of Nantucket and protests surged due to concerns about high-voltage cables running through neighborhoods in 2023. Environmentalists also raised concerns over the energy technology after dolphins washed up along the East Coast in 2023.\nSome fishermen have also voiced opposition to offshore wind projects, arguing that their industry cannot survive alongside offshore wind farms.\n– – –\nAudrey Streb is a reporter at Daily Caller News Foundation.\nPhoto “Offshore Wind Farm” by Nicholas Doherty."
    },
    {
      "news_title": "Trump Halts Work On New England Offshore Wind Project That's Nearly Complete",
      "news_link": "https://www.huffpost.com/entry/climate-trump-offshore-wind_n_68aa6141e4b0434e01af7f9b",
      "bias": "Left",
      "text": "The Trump administration halted construction on a nearly complete offshore wind project near Rhode Island as the White House continues to attack the battered U.S. offshore wind industry that scientists say is crucial to the urgent fight against climate change.\nDanish wind farm developer Orsted says the Revolution Wind project is about 80% complete, with 45 out of its 65 turbines already installed.\nDespite that progress — and the fact that the project had cleared years of federal and state reviews — the Bureau of Ocean Energy Management issued the order Friday, saying the federal government needs to review the project and “address concerns related to the protection of national security interests of the United States.”\nIt did not specify what the national security concerns are.\nPresident Donald Trump has made sweeping strides to prioritize fossil fuels and hinder renewable energy projects. Trump recently called wind and solar power “THE SCAM OF THE CENTURY!” in a social media post and vowed not to approve wind or “farmer destroying Solar” projects. “The days of stupidity are over in the USA!!!” he wrote on his Truth Social site this week.\nScientists across the globe agree that nations need to rapidly embrace renewable energy to stave off the worst effects of climate change, including extreme heat and drought; larger, more intense wildfires and supercharged hurricanes, typhoons and rainstorms that lead to catastrophic flooding.\nRhode Island Gov. Dan McKee criticized the stop-work order and said he and Connecticut Gov. Ned Lamont “will pursue every avenue to reverse the decision to halt work on Revolution Wind” in a post on X. Both governors are Democrats.\nConstruction on Revolution Wind began in 2023, and the project was expected to be fully operational next year. Orsted says it is evaluating the financial impact of stopping construction and is considering legal proceedings.\nRevolution Wind is located more than 15 miles (24 kilometers) south of the Rhode Island coast, 32 miles (51 kilometers) southeast of the Connecticut coast and 12 miles (19 kilometers) southwest of Martha’s Vineyard. Rhode Island is already home to one offshore wind farm, the five-turbine Block Island Wind Farm.\nRevolution Wind was expected to be Rhode Island and Connecticut’s first commercial-scale offshore wind farm, capable of powering more than 350,000 homes. The densely populated states have minimal space available for land-based energy projects, which is why the offshore wind project is considered crucial for the states to meet their climate goals.\n“This arbitrary decision defies all logic and reason — Revolution Wind’s project was already well underway and employed hundreds of skilled tradesmen and women. This is a major setback for a critical project in Connecticut, and I will fight it,” Connecticut Sen. Richard Blumenthal, a Democrat, said in a statement.\nWind power is the largest source of renewable energy in the U.S. and provides about 10% of the electricity generated in the nation.\n“Today, the U.S. has only one fully operational large-scale offshore wind project producing power. That is not enough to meet America’s rising energy needs. We need more energy of all types, including oil and gas, wind, and new and emerging technologies,” said Erik Milito, president of the National Ocean Industries Association, a group that supports offshore oil, gas and wind.\nGreen Oceans, a nonprofit that opposes the offshore wind industry, applauded the BOEM’s decision. “We are grateful that the Trump Administration and the federal government are taking meaningful action to preserve the fragile ocean environment off the coasts of Rhode Island and Massachusetts,” the nonprofit said in a statement.\nThis is the second major offshore wind project the White House has halted. Work was stopped on Empire Wind, a New York offshore wind project, but construction was allowed to resume after New York Sen. Chuck Schumer and Gov. Kathy Hochul, both Democrats, intervened.\n“This administration has it exactly backwards. It’s trying to prop up clunky, polluting coal plants while doing all it can to halt the fastest growing energy sources of the future – solar and wind power,” said Kit Kennedy, managing director for the power division at Natural Resources Defense Council, in a statement. “Unfortunately, every American is paying the price for these misguided decisions.”\n___\nReporter Jennifer McDermott contributed from Providence, Rhode Island, and Matthew Daly contributed from Washington.\n___\nThe Associated Press’ climate and environmental coverage receives financial support from multiple private foundations. AP is solely responsible for all content. Find AP’s standards for working with philanthropies, a list of supporters and funded coverage areas at AP.org."
    },
    {
      "news_title": "Trump Administration Puts Brakes on Rhode Island's Offshore Wind Farm - Real News Now",
      "news_link": "https://www.realnewsnow.com/trump-administration-puts-brakes-on-rhode-islands-offshore-wind-farm/",
      "bias": "Far Right",
      "text": "Trump Administration Puts Brakes on Rhode Island’s Offshore Wind Farm\nLast Friday marked a setback for green energy development as the Trump administration halted the progression of Revolution Wind, an offshore wind farm along Rhode Island’s coastline. The $4 billion energy project, mostly completed, has been a source of contention due to the weighty influence of the fossil fuel industry in political circles.\nThe new directive has put a sudden brake on the 65-turbine wind farm, which had previously received full endorsements and necessary permits under the Biden administration. These turbines, nearly 70 percent of which are already erected, were greenlit to push forward with the aim of reducing reliance on fossil fuels and promoting clean energy.\nThe Revolution Wind initiative had shown great promise, with estimates suggesting that upon completion the system would have had the capacity to power over 350,000 households in both Rhode Island and Connecticut. The timeline for this ambitious target was set for next spring, a goal that now seems uncertain due to the abrupt construction cessation directed by the Trump administration.\nThe order to halt operations came directly from the acting director of the Bureau of Ocean Energy Management (BOEM), addressed to the Danish company tasked with the wind farm’s erection. Despite the advanced state of the project’s construction, the company has been left with no choice but to comply and cease all ongoing activities effectively.\nThe letter of cessation issued by the BOEM, however, left many wanting for specifics. It referred to ‘unspecified issues,’ without providing much detail as to the nature of the concerns or what elements of the project these issues pertain to. This lack of transparency leaves the future of the Revolution Wind project veiled in uncertainty.\nOne of the significant factors hinted at by the BOEM in relation to their decision is a need to address certain national security interests within the United States. The exact nature of these concerns is not laid out explicitly, but it is clear that they stem from a perceived risk associated with the project.\nThe Danish company overseeing the development of the wind farm has been left in a state of limbo. While the order forces them to pause their activities, it also makes it clear that resumption of activities can only occur once the BOEM has completed its review of the project."
    },
    {
      "news_title": "Trump halts work on an offshore wind project that's 80% complete, citing unspecified 'national security interests'",
      "news_link": "https://fortune.com/2025/08/23/trump-new-england-offshore-revolution-wind-project-national-security/",
      "bias": "Center",
      "text": "The Trump administration halted construction on a nearly complete offshore wind project near Rhode Island as the White House continues to attack the battered U.S. offshore wind industry that scientists say is crucial to the urgent fight against climate change.\nDanish wind farm developer Orsted says the Revolution Wind project is about 80% complete, with 45 out of its 65 turbines already installed.\nDespite that progress — and the fact that the project had cleared years of federal and state reviews — the Bureau of Ocean Energy Management issued the order Friday, saying the federal government needs to review the project and “address concerns related to the protection of national security interests of the United States.”\nIt did not specify what the national security concerns are.\nPresident Donald Trump has made sweeping strides to prioritize fossil fuels and hinder renewable energy projects. Trump recently called wind and solar power “THE SCAM OF THE CENTURY!” in a social media post and vowed not to approve wind or “farmer destroying Solar” projects. “The days of stupidity are over in the USA!!!” he wrote on his Truth Social site this week.\nScientists across the globe agree that nations need to rapidly embrace renewable energy to stave off the worst effects of climate change, including extreme heat and drought; larger, more intense wildfires and supercharged hurricanes, typhoons and rainstorms that lead to catastrophic flooding.\nRhode Island Gov. Dan McKee criticized the stop-work order and said he and Connecticut Gov. Ned Lamont “will pursue every avenue to reverse the decision to halt work on Revolution Wind” in a post on X. Both governors are Democrats.\nConstruction on Revolution Wind began in 2023, and the project was expected to be fully operational next year. Orsted says it is evaluating the financial impact of stopping construction and is considering legal proceedings.\nRevolution Wind is located more than 15 miles (24 kilometers) south of the Rhode Island coast, 32 miles (51 kilometers) southeast of the Connecticut coast and 12 miles (19 kilometers) southwest of Martha’s Vineyard. Rhode Island is already home to one offshore wind farm, the five-turbine Block Island Wind Farm.\nRevolution Wind was expected to be Rhode Island and Connecticut’s first commercial-scale offshore wind farm, capable of powering more than 350,000 homes. The densely populated states have minimal space available for land-based energy projects, which is why the offshore wind project is considered crucial for the states to meet their climate goals.\n“This arbitrary decision defies all logic and reason — Revolution Wind’s project was already well underway and employed hundreds of skilled tradesmen and women. This is a major setback for a critical project in Connecticut, and I will fight it,” Connecticut Sen. Richard Blumenthal, a Democrat, said in a statement.\nWind power is the largest source of renewable energy in the U.S. and provides about 10% of the electricity generated in the nation.\n“Today, the U.S. has only one fully operational large-scale offshore wind project producing power. That is not enough to meet America’s rising energy needs. We need more energy of all types, including oil and gas, wind, and new and emerging technologies,” said Erik Milito, president of the National Ocean Industries Association, a group that supports offshore oil, gas and wind.\nGreen Oceans, a nonprofit that opposes the offshore wind industry, applauded the BOEM’s decision. “We are grateful that the Trump Administration and the federal government are taking meaningful action to preserve the fragile ocean environment off the coasts of Rhode Island and Massachusetts,” the nonprofit said in a statement.\nThis is the second major offshore wind project the White House has halted. Work was stopped on Empire Wind, a New York offshore wind project, but construction was allowed to resume after New York Sen. Chuck Schumer and Gov. Kathy Hochul, both Democrats, intervened.\n“This administration has it exactly backwards. It’s trying to prop up clunky, polluting coal plants while doing all it can to halt the fastest growing energy sources of the future – solar and wind power,” said Kit Kennedy, managing director for the power division at Natural Resources Defense Council, in a statement. “Unfortunately, every American is paying the price for these misguided decisions.”"
    },
    {
      "news_title": "Trump Administration Orders “Stop Work” on 80% Installed Offshore Wind Farm",
      "news_link": "https://maritime-executive.com/article/trump-administration-orders-stop-work-on-80-complete-offshore-wind-farm",
      "bias": "Center",
      "text": "Trump Administration Orders “Stop Work” on 80% Installed Offshore Wind Farm\nIn a surprising move on Friday, August 22, the Trump administration took action against an 80 percent installed offshore wind farm being built by Denmark’s Ørsted and a subsidiary of BlackRock. The Department of the Interior’s Bureau of Ocean Energy Management ordered a “halt to ongoing activities related to the Revolution Wind project on the outer continental shelf (OCS) to allow time for it to address concerns that have arisen.”\nUnlike previous orders, which stopped projects before construction commenced, Revolution Wind has been under construction since 2024. Ørsted reports that the project is 80 percent complete, with all its offshore foundations installed and 45 out of 65 wind turbines installed. Steel in the water started in May 2024, and the first turbine installation was completed in September.\nThe company says Revolution Wind is employing hundreds of local union workers both on and offshore and that approximately two million labor union hours have been spent on the project. The shore operations are at ProvPort and Quonset in Rhode Island, and State Pier in New London, Connecticut.\nBOEM was vague in its reasoning, writing in the letter to Ørsted North America that it is “seeking to address concerns related to the protection of national security interest of the United States and prevention of interference with reasonable uses of the exclusive economic zone, the high seas and the territorial seas.” The letter signed by Acting Director of BOEM Matthew Giacona also refers to “concerns that have arisen” during its review under the President’s Memorandum of January 20 which directed agencies to review the industry.\n“Ørsted is evaluating all options to resolve the matter expeditiously,” the company said in a statement confirming it was complying and taking steps to stop offshore activities. “This includes engagement with relevant permitting agencies for any necessary clarification or resolution, as well as through potential legal proceedings, with the aim being to proceed with continued project construction towards COD in the second half of 2026.”\nIn its statement, the company notes the project spent more than nine years in review and is fully permitted. It received approval of its Construction and Operations Plan in November 2023.\nRevolution Wind is located more than 15 miles south of Rhode Island and 32 miles southeast of Connecticut, with power contracts with both states. The nearest point of land is Martha’s Vineyard with the project approximately 12 miles southwest. Power was expected to start by the spring of 2026, and when the project is completed, it would generate a total of 704 MW, with 400 MW going to Rhode Island and 304 MW to Connecticut. Ørsted points out that the project is using the same turbine technology as South Fork Wind, which was completed as the first large, commercial offshore wind farm in the United States in 2024.\nThe stop work order pertains to all offshore activities on the OCS. The company can continue any emergency or safety work, as well as onshore activities. BOEM says the project may appeal this determination.\nØrsted said in its statement that it is considering “a range of scenarios, including legal proceedings.” The company is 50 percent owned by the Danish state, and just announced it was facing financial challenges due to the actions of the new U.S. government. It launched a rights offering to raise $9 billion from existing shareholders, which it is said is necessary to fund the construction work for another U.S. wind farm, Sunrise Wind, as well as completing Revolution Wind, after investors determined the risks are too great in the U.S. market based on the uncertainties raised by the Trump administration’s assault on wind energy.\nLast year, Eversource sold its 50 percent interest in its partnership with Ørsted to Global Infrastructure Partners and its Skyborn Renewables fund. GIS was acquired last year by BlackRock to expand the group's investment in renewable energy and infrastructure, with BlackRock’s CEO, Larry Fink, reported to be a friend and supporter of Donald Trump.\nThis is the second time the administration has issued a stop work order on an offshore wind farm. In April, the Department of the Interior suspended licenses to Equinor just as offshore work was due to begin on the Empire Wind project off New York. The suspension lasted for a month and drew broad criticism, while there were reports of pressure, including from the Norwegian government, which owns Equinor. There were reports of a deal where New York State will permit an oil pipeline it was blocking in exchange for the lifting of the stop work order on Empire Wind. Equinor reported it would take a $1 billion impairment charge related to the impact of the U.S. actions on the project and the offshore wind industry.\nLast week, the Trump administration also announced a further review of the manufacture of wind turbines and their components. Trump has repeatedly said they are made in China, although none of the U.S. projects are using Chinese turbines. The Commerce Department was ordered to start a trade investigation citing national security concerns over the importing of components for wind energy projects.\nExperts point out that 40 percent of the components for wind energy projects come from Europe, while Mexico is supplying more than 30 percent of the material used in the construction. The Trump administration has said it will include aluminum and steel components for wind turbines in the 50 percent tariff on imports, and the new trade investigation could impose further tariffs on components. The administration has already suspended future licensing and revoked previous approvals. Trump has promised to “stop the windmills.”"
    },
    {
      "news_title": "Despite $4 Billion Already Invested In A Nearly Complete Project, Trump Shuts Down Revolution Wind",
      "news_link": "https://ctnewsjunkie.com/2025/08/23/despite-4-billion-already-invested-in-nearly-complete-project-trump-shuts-down-revolution-wind/",
      "bias": "Lean Left",
      "text": "Revolution Wind, a $4 billion, 704-megawatt offshore wind farm under construction about 15 miles south of Rhode Island that is designed to power more than 350,000 homes, has been abruptly halted by the Trump administration.\nA letter issued late Friday by the Bureau of Ocean Energy Management ordered work stopped, despite the project being more than 80% complete and promising both clean energy and economic benefits for southern New England.\nØrsted, the project’s lead developer, confirmed the directive Friday, saying it is “complying with the order and taking appropriate steps to stop offshore activities, ensuring the safety of workers and the environment,” while also evaluating regulatory and legal options to resolve the matter. The company earlier this month saw its shares plunge after announcing a $9.4 billion rights offering, citing investor concerns over President Trump’s opposition to wind power.\nDan Dolan, president of the New England Power Generators Association, called the move “deeply troubling,” warning that billions of dollars in nearly completed facilities are now at risk due to abrupt policy reversals.\nThe project, which has already seen a $4 billion investment, had foundations in place and 45 of 65 turbines installed in federal waters south of Rhode Island. It was projected to cut over one million metric tons of carbon pollution annually — the equivalent of taking 150,000 cars off the road.\nRevolution Wind secured 20-year power-purchase agreements with local utilities in 2019 and was endorsed by both Rhode Island and Connecticut regulators as a cornerstone of their climate goals, supporting Rhode Island’s ambitious 100% renewable target by 2033 and Connecticut’s zero-carbon electricity grid by 2040. The project was seen as a major opportunity to expand offshore wind, diversify the region’s energy mix, reduce dependence on natural gas, and help stabilize New England’s historically volatile winter electricity prices.\nHalting the completion of the project not only jeopardizes billions of dollars in nearly finished infrastructure but also puts hundreds of local jobs and critical progress toward regional clean energy goals at risk.\n“New England needs forward momentum, not sudden stops that hurt both consumers and suppliers,” said Dolan, emphasizing that energy investments require policy certainty, market stability, and clear, consistent siting rules. “When projects like Revolution Wind have met every legal requirement, secured financing, and obtained a Capacity Supply Obligation, they should not face the rules being changed midstream,” he added, noting that such actions erode investor confidence and threaten long-term electric reliability.\nHe stressed that the region must continue building new energy infrastructure — whether conventional power plants, offshore wind, advanced nuclear, or other technologies — to meet growing demand.\nThe directive, issued in the letter from acting BOEM Director Matt Giacona, cited a January 20 memorandum signed by President Trump stating unspecified concerns related to “national security interests” and “prevention of the interference with reasonable uses of the exclusive economic zone, the high seas, and the territorial seas.”\nRejecting the Trump administration’s rationale, US Rep. Joe Courtney, D-2nd District, said he had been in contact Saturday with Ørsted’s leadership, his Connecticut and Rhode Island congressional colleagues, and representatives of the building trades.\n“The claim by the administration that national security concerns have arisen is particularly galling, given that BOEM and the US Coast Guard meticulously analyzed the protection of US interests as part of the record of decision years ago,” Courtney said, noting that the review ensured that transit by Coast Guard vessels and US Navy warships would not be hindered by the placement of Revolution Wind turbines.\nCourtney added that if the order is carried out, it would terminate the jobs of about 200 workers in the trades, among the industry’s suppliers, and from tugboat crews, while also canceling a critical expansion of energy capacity negotiated below the cost of current wind projects.\nConnecticut Gov. Ned Lamont and Rhode Island Gov. Daniel McKee condemned the Trump administration’s announcement.\n“This political move … wastes years of state investment in renewable energy designed to diversify our energy supply and lower costs for families and businesses,” Lamont said.\nMcKee added, “This action puts hundreds of union jobs at risk … just steps away from powering more than 350,000 homes.”\nBoth governors said they are working together to reverse the decision and save the project.\nAs a member of the New England electricity grid, power plants in Connecticut produce more electricity than Connecticut residents use each year.\nBroken down by energy type, 58% of the electricity produced in Connecticut comes from Natural Gas, while 37% is from nuclear power. However, 85.5% of the state’s greenhouse gas emissions from electricity are from Natural Gas.\nConnecticut uses about 24.5% of the energy produced for the New England grid, while the power generators located in the Nutmeg state provide 41% of all the electricity consumed in New England.The average residential price of electricity per KWh in Connecticut is 30.11 cents, according to FindEnergy.com, ranking the state 50th in the nation. The average monthly residential electricity bill is $211.14, ranking the state 52nd.\nUS Sen. Chris Murphy said Trump’s order was an example of corruption by the Trump administration.\n“When the oil industry showed up at Mar a Lago with a set of demands in exchange for a $1 billion of campaign support for Trump, this is what they were asking for: the destruction of clean energy in America. The decision to stop the Revolution Wind project, which is 80 percent compete and has already been approved through exhaustive reviews by multiple federal agencies, has nothing to do with energy policy or energy prices. This is a story of corruption, plain and simple. President Trump has sold our country out to big corporations with the oil and gas industry at the top of the list,” Murphy said. “I will work with my colleagues and Governor Lamont to pursue all legal paths to get this project back on track.”\nUS Sen. Richard Blumenthal also released a statement decrying the Trump administration’s decision.\n“As Connecticut families’ electric bills skyrocket, the Trump Administration is canceling critical clean energy projects that would lower utility bills and have created good paying union jobs for our state’s workforce,” he said. “This arbitrary decision defies all logic and reason — Revolution Wind’s project was already well underway and employed hundreds of skilled tradesmen and women. This is a major setback for a critical project in Connecticut, and I will fight it.”\nPowered By FindEnergy"
    },
    {
      "news_title": "Trump admin halts work on nearly complete offshore wind project",
      "news_link": "https://spectrumlocalnews.com/nyc/all-boroughs/politics/2025/08/23/offshore-wind-project-rhode-island",
      "bias": "Center",
      "text": "The Trump administration halted construction on a nearly complete offshore wind project near Rhode Island as the White House continues to attack the battered U.S. offshore wind industry that scientists say is crucial to the urgent fight against climate change.\nDanish wind farm developer Orsted says the Revolution Wind project is about 80% complete, with 45 out of its 65 turbines already installed.\nDespite that progress — and the fact that the project had cleared years of federal and state reviews — the Bureau of Ocean Energy Management issued the order Friday, saying the federal government needs to review the project and \"address concerns related to the protection of national security interests of the United States.\"\nIt did not specify what the national security concerns are.\nPresident Donald Trump has made sweeping strides to prioritize fossil fuels and hinder renewable energy projects. Trump recently called wind and solar power \"THE SCAM OF THE CENTURY!\" in a social media post and vowed not to approve wind or \"farmer destroying Solar\" projects. \"The days of stupidity are over in the USA!!!\" he wrote on his Truth Social site this week.\nScientists across the globe agree that nations need to rapidly embrace renewable energy to stave off the worst effects of climate change, including extreme heat and drought; larger, more intense wildfires and supercharged hurricanes, typhoons and rainstorms that lead to catastrophic flooding.\nRhode Island Gov. Dan McKee criticized the stop-work order and said he and Connecticut Gov. Ned Lamont \"will pursue every avenue to reverse the decision to halt work on Revolution Wind\" in a post on X. Both governors are Democrats.\nConstruction on Revolution Wind began in 2023, and the project was expected to be fully operational next year. Orsted says it is evaluating the financial impact of stopping construction and is considering legal proceedings.\nRevolution Wind is located more than 15 miles south of the Rhode Island coast, 32 miles southeast of the Connecticut coast and 12 miles southwest of Martha's Vineyard. Rhode Island is already home to one offshore wind farm, the five-turbine Block Island Wind Farm.\nRevolution Wind was expected to be Rhode Island and Connecticut's first commercial-scale offshore wind farm, capable of powering more than 350,000 homes. The densely populated states have minimal space available for land-based energy projects, which is why the offshore wind project is considered crucial for the states to meet their climate goals.\n\"This arbitrary decision defies all logic and reason — Revolution Wind's project was already well underway and employed hundreds of skilled tradesmen and women. This is a major setback for a critical project in Connecticut, and I will fight it,\" Connecticut Sen. Richard Blumenthal, a Democrat, said in a statement.\nWind power is the largest source of renewable energy in the U.S. and provides about 10% of the electricity generated in the nation.\n\"Today, the U.S. has only one fully operational large-scale offshore wind project producing power. That is not enough to meet America's rising energy needs. We need more energy of all types, including oil and gas, wind, and new and emerging technologies,\" said Erik Milito, president of the National Ocean Industries Association, a group that supports offshore oil, gas and wind.\nGreen Oceans, a nonprofit that opposes the offshore wind industry, applauded the BOEM's decision. \"We are grateful that the Trump Administration and the federal government are taking meaningful action to preserve the fragile ocean environment off the coasts of Rhode Island and Massachusetts,\" the nonprofit said in a statement.\nThis is the second major offshore wind project the White House has halted. Work was stopped on Empire Wind, a New York offshore wind project, but construction was allowed to resume after New York Sen. Chuck Schumer and Gov. Kathy Hochul, both Democrats, intervened.\n\"This administration has it exactly backwards. It's trying to prop up clunky, polluting coal plants while doing all it can to halt the fastest growing energy sources of the future – solar and wind power,\" said Kit Kennedy, managing director for the power division at Natural Resources Defense Council, in a statement. \"Unfortunately, every American is paying the price for these misguided decisions.\""
    },
    {
      "news_title": "Department of Interior Shut Down Massive Revolution Wind Project",
      "news_link": "https://www.independentsentinel.com/department-of-interior-shut-down-massive-revolution-wind-project/",
      "bias": "Right",
      "text": "On Friday, the Department of the Interior halted all activity on the massive offshore wind project in the northeast.\nThe Bureau of Ocean Energy Management under the Department of Interior, stopped the Revolution Wind project of the coast of Rhode Island and Connecticut in line with President Trump‘s energy goals to boost reliable energy resources, and lower cost for Americans.\nThe project is under construction by Denmark’s Orsted A/S.\nDuring a review of the project concerns were raised about the approval process.\nThe project was halted and had received federal approval last year via demented Joe Biden. The project is 80% complete with 45 of 65 wind turbines stalled.\nOrsted is looking to resolve the matter expeditiously. Potential legal proceedings could ensue.\nThe entire wind industry is in trouble. It has been for years. Rising prices and logistical problems have led to potential buyers of wind power to scrap contracts, put off projects, and postpone investment decisions.\nin April, Secretary of the Interior, Doug Burgerim halted work on the Equinor project off the coast of New York. The decision was reversed when New York governor Kathy Hochul opened the way for new gas pipelines to be built in the state. We’ve yet to see if that will actually happen.\nMany years ago when I lived in California I was one day driving through a vast area full of wind turbines, hundreds of them and not a single one of them was turning.\nFor what this is worth, Just to give you an idea of how disconnected from reality the leftists in charge of the Province of Quebec in Canada are, please read this, Electricity in Quebec all comes from Hydro Quebec, a government owned company. They announced a few days ago that they will invest MORE in Wind Mills !!! They want… Read more »\nThe US is as crazy. We just haven’t caught up yet. Canada is a little ahead of us. Trudeau was our Obama-Biden. The new guy – Carney – is a jerk too."
    },
    {
      "news_title": "Revolution Wind project, set to power homes in Connecticut, Rhode Island halted due to federal order",
      "news_link": "https://www.wtnh.com/news/connecticut/revolution-wind-project-set-to-power-homes-in-connecticut-rhode-island-halted-due-to-federal-order/",
      "bias": "Center",
      "text": null
    },
    {
      "news_title": "Trump halts work on nearly complete New England offshore wind project",
      "news_link": "https://abcnews.go.com/Business/wireStory/trump-halts-work-new-england-offshore-wind-project-124918883",
      "bias": "Lean Left",
      "text": "Trump halts work on nearly complete New England offshore wind project\nWhite House attacks industry scientists say is crucial to fight climate change.\nThe Trump administration halted construction on a nearly complete offshore wind project near Rhode Island as the White House continues to attack the battered U.S. offshore wind industry that scientists say is crucial to the urgent fight against climate change.\nDanish wind farm developer Orsted says the Revolution Wind project is about 80% complete, with 45 out of its 65 turbines already installed.\nDespite that progress — and the fact that the project had cleared years of federal and state reviews — the Bureau of Ocean Energy Management issued the order Friday, saying the federal government needs to review the project and “address concerns related to the protection of national security interests of the United States.”\nIt did not specify what the national security concerns are.\nPresident Donald Trump has made sweeping strides to prioritize fossil fuels and hinder renewable energy projects. Trump recently called wind and solar power “THE SCAM OF THE CENTURY!” in a social media post and vowed not to approve wind or “farmer destroying Solar” projects. “The days of stupidity are over in the USA!!!” he wrote on his Truth Social site this week.\nScientists across the globe agree that nations need to rapidly embrace renewable energy to stave off the worst effects of climate change, including extreme heat and drought; larger, more intense wildfires and supercharged hurricanes, typhoons and rainstorms that lead to catastrophic flooding.\nRhode Island Gov. Dan McKee criticized the stop-work order and said he and Connecticut Gov. Ned Lamont “will pursue every avenue to reverse the decision to halt work on Revolution Wind” in a post on X.\nConstruction on Revolution Wind began in 2023, and the project was expected to be fully operational next year. Orsted says it is evaluating the financial impact of stopping construction and is considering legal proceedings.\nRevolution Wind is located more than 15 miles (24 kilometers) south of the Rhode Island coast, 32 miles (51 kilometers) southeast of the Connecticut coast and 12 miles (19 kilometers) southwest of Martha’s Vineyard. Rhode Island is already home to one offshore wind farm, the five-turbine Block Island Wind Farm.\nRevolution Wind was expected to be Rhode Island and Connecticut’s first commercial-scale offshore wind farm, capable of powering more than 350,000 homes. The densely populated states have minimal space available for land-based energy projects, which is why the offshore wind project is considered crucial for the states to meet their climate goals.\n“This arbitrary decision defies all logic and reason — Revolution Wind’s project was already well underway and employed hundreds of skilled tradesmen and women. This is a major setback for a critical project in Connecticut, and I will fight it,” Connecticut Sen. Richard Blumenthal said in a statement.\nWind power is the largest source of renewable energy in the U.S. and provides about 10% of the electricity generated in the nation.\nGreen Oceans, a nonprofit that opposes the offshore wind industry, applauded the BOEM’s decision. “We are grateful that the Trump Administration and the federal government are taking meaningful action to preserve the fragile ocean environment off the coasts of Rhode Island and Massachusetts,” the nonprofit said in a statement.\nThis is the second major offshore wind project the White House has halted. Work was stopped on Empire Wind, a New York offshore wind project, but construction was allowed to resume after New York Sen. Chuck Schumer and Gov. Kathy Hochul intervened.\n“This administration has it exactly backwards. It’s trying to prop up clunky, polluting coal plants while doing all it can to halt the fastest growing energy sources of the future – solar and wind power,\" said Kit Kennedy, managing director for the power division at Natural Resources Defense Council, in a statement. “Unfortunately, every American is paying the price for these misguided decisions.”\n___\nReporter Jennifer McDermott contributed from Providence, Rhode Island, and Matthew Daly contributed from Washington.\n___\nThe Associated Press’ climate and environmental coverage receives financial support from multiple private foundations. AP is solely responsible for all content. Find AP’s standards for working with philanthropies, a list of supporters and funded coverage areas at AP.org."
    },
    {
      "news_title": "Trump halts work on New England offshore wind project that's nearly complete",
      "news_link": "https://apnews.com/article/offshore-revolution-wind-project-stopped-trump-33214b9efb8f3f7a98c58299581bff9f",
      "bias": "Lean Left",
      "text": "Trump halts work on New England offshore wind project that’s nearly complete\nTrump halts work on New England offshore wind project that’s nearly complete\nThe Trump administration halted construction on a nearly complete offshore wind project near Rhode Island as the White House continues to attack the battered U.S. offshore wind industry that scientists say is crucial to the urgent fight against climate change.\nDanish wind farm developer Orsted says the Revolution Wind project is about 80% complete, with 45 out of its 65 turbines already installed.\nDespite that progress — and the fact that the project had cleared years of federal and state reviews — the Bureau of Ocean Energy Management issued the order Friday, saying the federal government needs to review the project and “address concerns related to the protection of national security interests of the United States.”\nIt did not specify what the national security concerns are.\nPresident Donald Trump has made sweeping strides to prioritize fossil fuels and hinder renewable energy projects. Trump recently called wind and solar power “THE SCAM OF THE CENTURY!” in a social media post and vowed not to approve wind or “farmer destroying Solar” projects. “The days of stupidity are over in the USA!!!” he wrote on his Truth Social site this week.\nScientists across the globe agree that nations need to rapidly embrace renewable energy to stave off the worst effects of climate change, including extreme heat and drought; larger, more intense wildfires and supercharged hurricanes, typhoons and rainstorms that lead to catastrophic flooding.\nRhode Island Gov. Dan McKee criticized the stop-work order and said he and Connecticut Gov. Ned Lamont “will pursue every avenue to reverse the decision to halt work on Revolution Wind” in a post on X. Both governors are Democrats.\nConstruction on Revolution Wind began in 2023, and the project was expected to be fully operational next year. Orsted says it is evaluating the financial impact of stopping construction and is considering legal proceedings.\nRevolution Wind is located more than 15 miles (24 kilometers) south of the Rhode Island coast, 32 miles (51 kilometers) southeast of the Connecticut coast and 12 miles (19 kilometers) southwest of Martha’s Vineyard. Rhode Island is already home to one offshore wind farm, the five-turbine Block Island Wind Farm.\nRevolution Wind was expected to be Rhode Island and Connecticut’s first commercial-scale offshore wind farm, capable of powering more than 350,000 homes. The densely populated states have minimal space available for land-based energy projects, which is why the offshore wind project is considered crucial for the states to meet their climate goals.\n“This arbitrary decision defies all logic and reason — Revolution Wind’s project was already well underway and employed hundreds of skilled tradesmen and women. This is a major setback for a critical project in Connecticut, and I will fight it,” Connecticut Sen. Richard Blumenthal, a Democrat, said in a statement.\nWind power is the largest source of renewable energy in the U.S. and provides about 10% of the electricity generated in the nation.\n“Today, the U.S. has only one fully operational large-scale offshore wind project producing power. That is not enough to meet America’s rising energy needs. We need more energy of all types, including oil and gas, wind, and new and emerging technologies,” said Erik Milito, president of the National Ocean Industries Association, a group that supports offshore oil, gas and wind.\nGreen Oceans, a nonprofit that opposes the offshore wind industry, applauded the BOEM’s decision. “We are grateful that the Trump Administration and the federal government are taking meaningful action to preserve the fragile ocean environment off the coasts of Rhode Island and Massachusetts,” the nonprofit said in a statement.\nThis is the second major offshore wind project the White House has halted. Work was stopped on Empire Wind, a New York offshore wind project, but construction was allowed to resume after New York Sen. Chuck Schumer and Gov. Kathy Hochul, both Democrats, intervened.\n“This administration has it exactly backwards. It’s trying to prop up clunky, polluting coal plants while doing all it can to halt the fastest growing energy sources of the future – solar and wind power,” said Kit Kennedy, managing director for the power division at Natural Resources Defense Council, in a statement. “Unfortunately, every American is paying the price for these misguided decisions.”\n___\nReporter Jennifer McDermott contributed from Providence, Rhode Island, and Matthew Daly contributed from Washington.\n___\nThe Associated Press’ climate and environmental coverage receives financial support from multiple private foundations. AP is solely responsible for all content. Find AP’s standards for working with philanthropies, a list of supporters and funded coverage areas at AP.org."
    },
    {
      "news_title": "Trump administration halts work on an almost-finished wind farm",
      "news_link": "https://www.opb.org/article/2025/08/23/trump-administration-halts-work-on-an-offshore-wind-farm/",
      "bias": "Center",
      "text": "The Trump administration has ordered companies to stop construction of a wind farm that’s being built off the coast of Rhode Island.\nThe acting director of the Bureau of Ocean Energy Management, Matthew Giacona, wrote in a letter to one of the developers, a Danish firm called Ørsted, that the government was halting work on the almost-finished project in order to “address concerns related to the protection of national security interests of the United States.” The project is also being developed by Global Infrastructure Partners.\nThe order to stop work on the Revolution Wind project is the latest move by the Trump administration targeting the country’s renewable energy industry. President Trump, a longtime critic of the wind industry, in January issued a moratorium on new development of offshore wind projects. The Internal Revenue Service recently put out new guidance that makes it harder for companies building wind and solar projects to qualify for federal tax incentives. And the Commerce Department is investigating whether imports of wind turbines and their components threaten national security.\nØrsted said in a statement that it is “evaluating all options to resolve the matter expeditiously,” including legal action.\nRevolution Wind is located in federal waters 15 miles south of Rhode Island. Construction started in 2023, and the project has been slated to begin sending power to homes and businesses in Rhode Island and Connecticut starting next year.\n“Any pause or uncertainty at this stage could ripple across jobs, contracts, and communities already benefiting from the project,” Erik Milito, president of the National Ocean Industries Association, a trade group whose members include wind project developers as well as oil and gas companies, said in a statement.\n“Today, the U.S. has only one fully operational large-scale offshore wind project producing power,” Milito said. “That is not enough to meet America’s rising energy needs. We need more energy of all types, including oil and gas, wind, and new and emerging technologies.”\nThe Bureau of Ocean Energy Management didn’t respond to messages seeking comment.\nIndustry analysts have said that limiting renewable energy development amid rising electricity demand threatens to drive up power prices across the country.\n“This is not the first time extreme partisan politics has derailed sound energy policy,” Jason Grumet, chief executive of American Clean Power, an industry group, said in a statement responding to the Trump administration’s stop-work order to Revolution Wind. “The unfortunate message to investors is clear: the U.S. is no longer a reliable place for long-term energy investments.”\nIn April, the Interior Department halted work on an offshore wind project near the coast of Long Island. Interior Secretary Doug Burgum wrote in a letter to the Bureau of Ocean Energy Management at the time that approval of the project, called Empire Wind, “was rushed through by the prior administration without sufficient analysis.”\nConstruction on Empire Wind resumed in May when the Trump administration lifted the stop-work order. But the disruption was costly for the project’s developer, a Norwegian company called Equinor. The firm recently cut the value of its investment by almost $1 billion, mainly because of “the changes in regulations for future offshore wind projects in the U.S.,” Torgrim Reitan, Equinor’s chief financial officer, said on an earnings call in July.\n“For the second time, the Trump Administration has taken unlawful action against a fully permitted offshore wind project under active construction — this time one that is nearly 80% complete,” Liz Burdock, chief executive of the Oceantic Network, an advocacy group for offshore wind, said in a statement about the Revolution Wind project.\n“This dramatic action further erodes investor confidence in the U.S. market across all industries and undermines progress on shared national priorities — shipyard revitalization, steel and port investments, and energy dominance,” Burdock said. “In fact, halting work on Revolution Wind will drive up energy costs for consumers, idle Gulf Coast vessel operators that have invested hundreds of millions of dollars in new or retrofitted vessels, and jeopardize the livelihoods of union workers.”"
    },
    {
      "news_title": "Trump orders Revolution Wind developers to stop offshore project already 80% complete",
      "news_link": "https://rhodeislandcurrent.com/2025/08/23/trump-orders-revolution-wind-developers-to-stop-offshore-project-already-80-complete/",
      "bias": "Left",
      "text": null
    },
    {
      "news_title": "Trump Kills 'Revolution Wind'",
      "news_link": "https://hotair.com/headlines/2025/08/23/trump-kills-revolution-wind-n3806074",
      "bias": "Lean Right",
      "text": "The Daily Caller News Foundation learned on Friday that the Department of the Interior (DOI) is immediately halting all activity on a massive offshore wind project.\nThe Bureau of Ocean Energy Management (BOEM) under the DOI is halting activity on the “Revolution Wind” project off the coast of Rhode Island and Connecticut in line with President Donald Trump’s energy goals to boost reliable energy resources and lower costs for Americans, the agency told the DCNF. The Trump administration has dealt a series of recent blows to the wind industry, with the DOI ending “preferential treatment” for what it considers to be foreign-controlled and unreliable energy sources and moving to terminate the massive Lava Ridge Wind Project in southern Idaho that the Biden administration approved just weeks before Trump’s return to office.\n“Americans deserve energy that is affordable, reliable, and built to last — not experimental and expensive wind projects that are proven failures,” DOI deputy press secretary Aubrie Spady told the DCNF. “In line with President Donald Trump’s Energy Dominance Agenda, Interior is putting an immediate stop to these costly failures to deliver a stronger energy future and lower costs for American families. Like President Trump said, ‘the days of stupidity are over in the USA!'”\nJoin the conversation as a VIP Member"
    },
    {
      "news_title": "Trump administration halts CT offshore wind project",
      "news_link": "https://ctmirror.org/2025/08/23/revolution-wind-trump-administration-ct-offshore-wind/",
      "bias": "Lean Left",
      "text": "The developers of Connecticut’s only offshore wind project, Revolution Wind, were ordered by the Trump administration late Friday to stop construction immediately.\nThe project is already 80% complete according to Ørsted, one of its developers.\nIt is designed to generate more than 700 megawatts of power — 305 megawatts to Connecticut and 400 to Rhode Island — and would provide power to the equivalent of about 350,000 homes.\nThis is the second time Trump officials have shut down an offshore wind project that was already under construction. President Donald J. Trump’s dislike of wind power is longstanding.\nFriday afternoon, Ørsted received a letter from the U.S. Department of the Interior’s Bureau of Ocean Energy Management, BOEM, ordering it to “halt all ongoing activities related to the Revolution Wind Project on the outer continental shelf.” It went on to say that this was to allow time for BOEM to address concerns that have arisen since President Trump’s inauguration day order to stop any new wind projects on federal properties and review all those underway.\nAnother part of the letter stated that: “In particular, BOEM is seeking to address concerns related to the protection of national security interests of the United States.”\nEarlier in the week, the U.S. Commerce Department revealed it had opened an investigation the week before “to determine the effects on the national security of imports of wind turbines and their parts and components.” That announcement indicated the results could trigger steep tariffs or quotas “to protect national security.”\nBOEM did not respond to emails or phone calls Friday night seeking further information about what the specific security issues were for Revolution Wind or whether the two investigations were related.\nThe BOEM letter to Ørsted also threatened further “corrective action” if the company did not comply.\nRevolution has created about 1200 direct jobs in Connecticut and Rhode Island. Eighty to 120 of them, depending on the activity level at any given time, are at State Pier in New London where much of the onshore work is being done.\nThe onshore transmission work for Revolution Wind began in the summer of 2023. All federal and state permits were secured in November 2023 and full construction began in early 2024. Presently all of the offshore foundations are in place and 45 of the 65 wind turbines are installed according to Ørsted. Work is slated to be completed by the end of 2026.\nConnecticut Congressman Joe Courtney, whose district includes the State Pier, said the federal action puts approximately 200 jobs at risk. He called the administration’s claim of security concerns “particularly galling,” noting that in 2023, a record of decision by BOEM analyzed and addressed national security considerations for the project in coordination with the Department of Defense.\n“That exhaustive review ensured that transit by Coast Guard vessels and U.S. Navy warships would not be hindered by the final placement of Revolution Wind towers,” Courtney said.\nIn a lengthy statement on its website Ørsted said it “is complying with the order and is taking appropriate steps to stop offshore activities, ensuring the safety of workers and the environment.”\nThe statement also said; “Ørsted is evaluating the potential financial implications of this development, considering a range of scenarios, including legal proceedings.”\nSo is Connecticut Attorney General William Tong, who said in a statement Friday night that “We are evaluating all legal options to protect Connecticut’s interests.”\n“Trump wants to mothball billions of dollars in investment and cancel one of the best new sources of American-made, renewable energy. Trump and his enablers will own the resulting cost increases for ratepayers,” Tong said.\nReaction from the Lamont administration echoed this criticism.\n“This political move by the Trump administration will drive up the cost of electricity bills and contradicts everything the administration has told us. It wastes years of state investment in renewable energy designed to diversify our energy supply and lower costs for families and businesses,” said Gov. Ned Lamont in a statement Saturday. “We are working closely with Rhode Island to save this project, because it represents exactly the kind of investment that reduces energy costs, strengthens regional production, and builds a more secure energy future, the very goals President Trump claims to support but undermines with this decision.”\nConnecticut Sen. Richard Blumenthal pointed to the potential impact on electric bills as well.\n“The Trump Administration is canceling critical clean energy projects that would lower utility bills and have created good paying union jobs for our state’s workforce,” the Democratic senator said in a statement. “This arbitrary decision defies all logic and reason. Revolution Wind’s project was already well underway and employed hundreds of skilled tradesmen and women. This is a major setback for a critical project in Connecticut, and I will fight it.”\nAt the Conservation Law Foundation, which operates throughout New England, Kate Sinding Daly, the group’s senior vice president for law and policy said in a statement: “There is no evident legal basis for this, and it contravenes all common sense. Offshore wind represents the single most significant investment in clean, affordable energy for New England and this specious directive will not only deprive New Englanders of homegrown jobs but exposes us to higher energy bills and increasingly deadly extreme weather.”\nOutrage was swift from a number of national groups, including the Natural Resources Defense Council. Kit Kennedy, the group’s managing director for power called halting Revolution Wind “a devastating attack on workers, on electricity customers, and on the investment climate in the U.S.”\n“This administration has it exactly backwards. It’s trying to prop up clunky, polluting coal plants while doing all it can to halt the fastest growing energy sources of the future – solar and wind power.”\nBoth have been targeted directly by the Trump administration in the recent reconciliation budget legislation. Their valuable federal tax credits are being eliminated along with other actions that will make them less financially worthwhile.\nOnly a handful of offshore wind projects remain in development, a sharp departure from the many the Biden administration had approved. It had been assumed those under construction would be safe, but in July the Interior Department announced that it would consider cancelling projects that were challenged in court. The next day, the conservative Texas Public Policy Foundation filed suit on behalf of fishermen against a Massachusetts project – Vineyard Wind 1.\nThe first project stopped by the Trump administration was Empire Wind off New York, which was halted in April. That move was widely seen as a pressure tactic to get New York Governor Kathy Hochul to agree to allow a natural gas pipeline through the state. Hochul has said no deal was made.\nThat project was restarted after a month, but its developer, Equinor, came close to shutting it down and in the end the company indicated it cost them $1 billion.\nØrsted has had its own financial issues lately. Its stock nosedived earlier this month when the company said it would need more than $9 billion to help finance its only other offshore wind development, Sunrise Wind off Long Island.\nAmerican Clean Power CEO Jason Grumet posted online: “This is not the first time extreme partisan politics has derailed sound energy policy. The unfortunate message to investors is clear: the U.S. is no longer a reliable place for long-term energy investments,” he said.\nConnecticut has had its own difficulties with offshore wind projects. A large, second project called Park City Wind was cancelled after inflation spurred by COVID and Russia’s invasion of Ukraine caused its developer, Avangrid, to pull out when its initial costs were no longer sustainable. In the last offshore wind solicitation at the end of the Biden administration, the Connecticut Department of Energy and Environmental Protection opted to forgo any new projects.\nIn a statement Friday night, Commissioner Katie Dykes called the stop-work order on Revolution “deeply disappointing.”\n“Losing this much capacity means higher costs and less reliability for families and businesses in Connecticut and across New England, at a time when we urgently need more affordable, domestically produced energy to strengthen our regional grid,” Dykes said. “Connecticut remains committed to an all-of-the-above approach to energy, of which offshore wind is a promising and important part.”"
    },
    {
      "news_title": "Trump Administration Halts Offshore Wind Farm off Rhode Island - Big Win for Whales and the Environment - Newport Buzz",
      "news_link": "https://www.thenewportbuzz.com/trump-halts-rhode-island-offshore-wind-farm/57052",
      "bias": "Lean Left",
      "text": "The Trump administration dropped the hammer Friday on Ørsted’s controversial Revolution Wind project, ordering an immediate stop to all construction just 15 miles south of Rhode Island.\nThe massive 704-megawatt wind farm — already 80% built with 45 of 65 turbines standing in the Atlantic — was supposed to power 350,000 homes by 2026. Now it’s dead in the water.\nIn a letter to the Danish energy giant, the Bureau of Ocean Energy Management (BOEM) said work must stop while the Department of the Interior reviews “national security” and “environmental” concerns. Acting BOEM Director Matthew Giacona made clear the feds aren’t budging until those issues are resolved.\nThe decision marks a stunning reversal for the Biden-approved project, long slammed by fishermen, coastal communities, and environmentalists who warned the turbines would devastate marine life. The site sits near Cox Ledge — prime cod habitat — and critics have blamed offshore wind construction for a surge in dead whales along the East Coast. NOAA has even declared an “Unusual Mortality Event” for humpbacks.\nLocal fishermen celebrated the pause, saying the project threatened their livelihoods. Coastal advocates hailed the move as a huge victory in protecting waters, wildlife, and Rhode Island’s iconic shoreline.\nØrsted, reeling from financial losses and a $9.4 billion bailout plan, said it is “evaluating all options,” including possible legal action.\nFor now, the turbines are frozen in place — and so are the dreams of Big Wind.\nLike Newport Buzz? We depend on the generosity of readers like you who support us, to help with our mission to keep you informed and entertained with local, independent news and content. We truly appreciate your trust and support!"
    },
    {
      "news_title": "US tells Orsted to halt work on offshore wind project off Rhode Island",
      "news_link": "https://www.reuters.com/legal/litigation/us-tells-orsted-halt-work-offshore-wind-project-off-rhode-island-2025-08-22/",
      "bias": "Center",
      "text": null
    },
    {
      "news_title": "Interior Department Halts $1.5 Billion Offshore Wind Project Off Rhode Island",
      "news_link": "https://www.theepochtimes.com/us/danish-company-orsted-ordered-to-halt-work-on-rhode-island-offshore-wind-project-5905097",
      "bias": "Lean Right",
      "text": "The U.S. Department of the Interior on Aug. 22 directed Danish company Orsted to halt all construction on Revolution Wind, the offshore wind farm off Rhode Island that is nearing completion.\nIn a letter, acting Bureau of Ocean Energy Management (BOEM) Director Matthew Giacona ordered Orsted to suspend all activities on the project while officials conduct a review to address “concerns related to the protection of national security interests.”"
    },
    {
      "news_title": "Trump administration orders work halted on wind farm that is nearly built - The Boston Globe",
      "news_link": "https://www.bostonglobe.com/2025/08/22/nation/trump-order-wind-farm/",
      "bias": "Lean Left",
      "text": "The Trump administration on Friday ordered that all construction stop on Revolution Wind, a $4 billion wind farm off the coast of Rhode Island that is mostly built.\nThe 65-turbine project had obtained all necessary permits from the Biden administration, and nearly 70% of the turbines have been installed. The developers behind the project had said it was on track to produce enough electricity for more than 350,000 homes in Rhode Island and Connecticut by next spring.\nMatthew Giacona, the acting director of the Bureau of Ocean Energy Management, issued a letter Friday to Orsted, the Danish company building the wind farm, ordering it to “halt all ongoing activities” because of unspecified issues.\n“In particular, BOEM is seeking to address concerns related to the protection of national security interests in the United States,” Giacona wrote, adding that Orsted “may not resume activities” until the agency has completed a review of the project.\nThe decision was first reported by The Daily Caller. The Interior Department declined to comment on the order to stop work on Revolution Wind.\nAdvertisement\nIn a statement, Orsted said that it was “evaluating all options to resolve the matter expeditiously,” including “potential legal proceedings.” The company said it still aimed to complete the project by next year.\nLast week, Orsted said that it needed to raise an additional $9.4 billion to shore up its finances as it attempted to complete both Revolution Wind and Sunrise Wind, another large offshore wind project near Long Island in New York while contending with an industry downturn that has been exacerbated by President Donald Trump’s opposition to wind farms.\nAdvertisement\n“Orsted and our industry are in an extraordinary situation with the adverse market development in the U.S.,” said Rasmus Errboe, the company’s CEO.\nConnecticut Attorney General William Tong, a Democrat, said the state was “evaluating all legal options to protect Connecticut’s interests.”\n“Trump wants to mothball billions of dollars in investment and cancel one of the best new sources of American-made, renewable energy,” Tong said. “Trump and his enablers will own the resulting cost increases for ratepayers.”\nThe Trump administration’s move against Revolution Wind is the latest in a series of its escalating attacks against the wind industry.\nOn Thursday, the Commerce Department opened a trade investigation into imported wind turbines and their components. The probe could result in further tariffs on the wind industry that could increase costs for offshore projects that are already underway.\nTwo weeks ago, the administration said it was reversing a Biden administration decision to approve the Lava Ridge Wind Project, a giant wind farm planned for southern Idaho. The administration said it had discovered “legal deficiencies” in the original approval but did not provide details.\nThe Interior Department had signaled last month that it would consider revoking federal permits for wind projects that opponents have sued over, even if those projects were under construction.\nIn April, the Trump administration ordered a halt to work at Empire Wind, a $5 billion wind farm off the coast of Long Island that was under construction, without publicly providing a justification. After a month of negotiations with New York Gov. Kathy Hochul, a Democrat, the administration let Empire Wind move forward, but administration officials suggested that they had done so only after Hochul agreed to approve new gas pipelines in the state. Hochul has denied that any such deal was made.\nAdvertisement\nEquinor, the developer behind Empire Wind, recently said that those delays and other regulatory changes affecting U.S. offshore wind projects had cost the company nearly $1 billion.\nThis article originally appeared in The New York Times."
    },
    {
      "news_title": "Trump administration halts offshore wind project in Rhode Island",
      "news_link": "https://thehill.com/policy/energy-environment/5467000-trump-halts-rhode-island-wind-energy-project/",
      "bias": "Center",
      "text": null
    },
    {
      "news_title": "Revolution Wind project issued stop-work order by Trump administration",
      "news_link": "https://www.wfsb.com/2025/08/23/senator-richard-blumenthal-says-that-revolution-wind-project-has-been-cancelled/",
      "bias": "Center",
      "text": "Revolution Wind project issued stop-work order by Trump administration\n(WFSB) - The Revolution Wind project has been issued a stop-work order by the Trump administration.\nRevolution Wind was a subsidiary of Orsted, who released a statement on the matter.\nThey said that the project was 80% complete with all offshore foundations installed and 45 out of 65 wind turbines installed.\nThe order was issued by the U.S. Department of the Interior’s Bureau of Ocean Energy Management.\nThe project was the United States’ first multi-state offshore wind project that covered Rhode Island and Connecticut.\n“Ørsted is evaluating all options to resolve the matter expeditiously. This includes engagement with relevant permitting agencies for any necessary clarification or resolution as well as through potential legal proceedings, with the aim being to proceed with continued project construction towards COD in the second half of 2026,” said Orsted in a statement.\nSenator Richard Blumenthal also released a statement on the order.\nOrsted said that the project was fully permitted and had 20-year power purchase agreements to provide 400 MW of electricity to Rhode Island and 304 MW to Connecticut.\nThe company will also be investing $20 billion into American energy, including in grid upgrades, manufacturing, shipbuilding, and domestic generation.\nEyewitness News has also received a statement from Governor Lamont that reads:\nNo further details were released.\nEyewitness News will provide more details as soon as they become available.\nCopyright 2025 WFSB. All rights reserved."
    },
    {
      "news_title": "US halts work on huge, nearly complete offshore wind farm",
      "news_link": "https://www.kake.com/us-halts-work-on-huge-nearly-complete-offshore-wind-farm/article_359c280f-4b4b-53b7-b8db-6efd6eccdf83.html",
      "bias": "Center",
      "text": "Headline: Dense Fog Advisory until MON 1:00 PM CDT\nBulletin: ...DENSE FOG ADVISORY REMAINS IN EFFECT UNTIL NOON MDT /1 PM CDT/\nTODAY...\n* WHAT...Visibility at or below one quarter mile in dense fog.\n* WHERE...Portions of eastern Colorado, northwest Kansas and\nsouthwest Nebraska.\n* WHEN...Until noon MDT /1 PM CDT/ today.\n* IMPACTS...Hazardous driving conditions.\n* ADDITIONAL DETAILS...This includes portions of the Interstate 70\ncorridor in eastern Colorado and northwest Kansas. As of 930 am\nMDT, observation sites reporting dense fog included Yuma, Wray,\nColby and Oakley. Gradual improvement is expected late this\nmorning and early this afternoon.\nPRECAUTIONARY/PREPAREDNESS ACTIONS...\nIf driving, slow down, use low beam headlights and leave plenty of\nfollowing distance.\n&&\nType: Dense Fog Advisory\nIssued for: 2025-08-25T10:36:00-05:00\nEnding at: 2025-08-25T13:00:00-05:00\nCounty Name:\nState: Kansas\nCategory: Met\nUrgency: Expected\nSeverity: Moderate\nCertainty: Likely\nWeather Alert\nHeadline: Dense Fog Advisory until MON 12:00 PM MDT\nBulletin: ...DENSE FOG ADVISORY REMAINS IN EFFECT UNTIL NOON MDT /1 PM CDT/\nTODAY...\n* WHAT...Visibility at or below one quarter mile in dense fog.\n* WHERE...Portions of eastern Colorado, northwest Kansas and\nsouthwest Nebraska.\n* WHEN...Until noon MDT /1 PM CDT/ today.\n* IMPACTS...Hazardous driving conditions.\n* ADDITIONAL DETAILS...This includes portions of the Interstate 70\ncorridor in eastern Colorado and northwest Kansas. As of 930 am\nMDT, observation sites reporting dense fog included Yuma, Wray,\nColby and Oakley. Gradual improvement is expected late this\nmorning and early this afternoon.\nPRECAUTIONARY/PREPAREDNESS ACTIONS...\nIf driving, slow down, use low beam headlights and leave plenty of\nfollowing distance.\n&&\nType: Dense Fog Advisory\nIssued for: 2025-08-25T09:36:00-06:00\nEnding at: 2025-08-25T12:00:00-06:00\nCounty Name:\nState: Kansas\nCategory: Met\nUrgency: Expected\nSeverity: Moderate\nCertainty: Likely\nWeather Alert\nHeadline: Flood Warning until MON 1:45 PM CDT\nBulletin: ...FLOOD WARNING NOW IN EFFECT UNTIL 145 PM CDT THIS AFTERNOON...\n* WHAT...Flooding caused by excessive rainfall continues.\n* WHERE...Portions of south central and southwest Kansas, including\nthe following counties, in south central Kansas, Comanche. In\nsouthwest Kansas, Clark.\n* WHEN...Until 145 PM CDT.\n* IMPACTS...Flooding of rivers, creeks, streams, and other low-lying\nand flood-prone locations is imminent or occurring. Low-water\ncrossings are inundated with water and may not be passable.\n* ADDITIONAL DETAILS...\n- At 1124 AM CDT, emergency management reported ongoing\nflooding was occurring on highway 183 west of Protection to\nnear the Clark county line from the heavy rainfall that fell\nlast night and early this Monday morning. Radar estimated\nbetween 3 and 4 inches of rain have fallen in this area.\n- Additional rainfall amounts up to 1 inch are possible in the\nwarned area.\n- Some locations that will experience flooding include...\nColdwater, Protection, Sitka and Buttermilk.\n- http://www.weather.gov/safety/flood\nPRECAUTIONARY/PREPAREDNESS ACTIONS...\nTurn around, don't drown when encountering flooded roads. Most flood\ndeaths occur in vehicles.\nPlease report observed flooding to local emergency services or law\nenforcement and request they pass this information to the National\nWeather Service when you can do so safely.\n&&\nType: Flood Warning\nIssued for: 2025-08-25T11:29:00-05:00\nEnding at: 2025-08-25T13:45:00-05:00\nCounty Name: Clark County\nState: Kansas\nCategory: Met\nUrgency: Unknown\nSeverity: Severe\nCertainty: Unknown\nWeather Alert\nHeadline: Flood Warning until MON 1:45 PM CDT\nBulletin: ...FLOOD WARNING NOW IN EFFECT UNTIL 145 PM CDT THIS AFTERNOON...\n* WHAT...Flooding caused by excessive rainfall continues.\n* WHERE...Portions of south central and southwest Kansas, including\nthe following counties, in south central Kansas, Comanche. In\nsouthwest Kansas, Clark.\n* WHEN...Until 145 PM CDT.\n* IMPACTS...Flooding of rivers, creeks, streams, and other low-lying\nand flood-prone locations is imminent or occurring. Low-water\ncrossings are inundated with water and may not be passable.\n* ADDITIONAL DETAILS...\n- At 1124 AM CDT, emergency management reported ongoing\nflooding was occurring on highway 183 west of Protection to\nnear the Clark county line from the heavy rainfall that fell\nlast night and early this Monday morning. Radar estimated\nbetween 3 and 4 inches of rain have fallen in this area.\n- Additional rainfall amounts up to 1 inch are possible in the\nwarned area.\n- Some locations that will experience flooding include...\nColdwater, Protection, Sitka and Buttermilk.\n- http://www.weather.gov/safety/flood\nPRECAUTIONARY/PREPAREDNESS ACTIONS...\nTurn around, don't drown when encountering flooded roads. Most flood\ndeaths occur in vehicles.\nPlease report observed flooding to local emergency services or law\nenforcement and request they pass this information to the National\nWeather Service when you can do so safely.\n&&\nThe US federal government on Friday ordered all construction be halted on a massive wind farm off the coast of Rhode Island that is 80 percent complete.\nIt was the latest in a series of orders blocking climate-friendly wind power from the administration of US President Donald Trump, who said on Thursday that \"wind doesn't work.\"\nThe Revolution Wind project, which started construction last year after receiving all the necessary permits, is intended to power more than 350,000 homes in the US state of Rhode Island, according to its builder, Danish renewables firm Orsted.\nMatthew Giacona, acting director of the Bureau of Ocean Energy Management (BOEM), issued a letter on Friday ordering the project to \"halt all ongoing activities\" to allow time for a review.\n\"In particular, BOEM is seeking to address concerns related to the protection of national security interests in the United States,\" the letter read, without elaborating.\n\"You may not resume activities until BOEM\" has completed the review, it added.\nOrsted said in a statement it is \"evaluating all options to resolve the matter expeditiously,\" including engaging in \"potential legal proceedings.\"\nThe wind farm is 80 percent complete, with 45 of its planned 65 wind turbines installed, the company said, adding it hopes to finish the project by late next year.\nThe entire wind power sector has faced a major challenge in the US since Trump replaced renewables-friendly Joe Biden in the White House in January.\nTrump has frozen federal permitting and loans for all offshore and onshore wind projects -- and repeatedly expressed his distaste for wind power.\n\"It destroys everything, it looks terrible, it's a very expensive form of energy -- and we're not doing the wind, we're going back to fossil fuel,\" Trump said in Washington on Thursday.\nAs the United States has been blocking and stalling wind power, China and Europe have been breaking records in their embrace of the green energy.\nOrsted, once considered a success story, said last week it is planning to raise $9.4 billion by selling shares after the US setbacks.\nEmpire Wind, another massive wind power project off New York being constructed by Norway's Equinor, was also temporarily halted by the Trump administration in April."
    },
    {
      "news_title": "Trump administration halts construction of Revolution Wind project off RI",
      "news_link": "https://www.providencejournal.com/story/news/2025/08/22/revolution-wind-project-off-ri-trump-administration-halts-project/85786444007/",
      "bias": "Center",
      "text": "Trump administration halts work on Revolution Wind project off RI. What happens now?\n- The Trump administration halted construction on Revolution Wind, a $4 billion offshore wind farm project near Rhode Island.\n- The Bureau of Ocean Energy Management cited national security concerns as the reason for the halt.\n- The project is about 80% complete and was expected to begin generating power next year.\nPROVIDENCE – The Trump administration has halted construction of Revolution Wind, the multibillion-dollar wind farm being built south of the Rhode Island coast that has already installed 45 of its 65 turbines.\nIn a letter sent late on Friday, Aug. 22, to Ørsted, the Danish company that is a partner on the joint venture developing the project, the Bureau of Ocean Energy Management ordered a stop to all ongoing activities related to the 704-megawatt wind farm that has contracts to deliver power to Rhode Island and Connecticut.\nThe bureau cited an executive order signed by President Donald Trump in January that aimed to rein in the expansion of offshore wind power in America. At the time, industry experts believed the order would stop proposed projects from moving through the permitting process, but that it wouldn’t affect wind farms like Revolution Wind that were already under construction.\nThe letter from acting director Matthew Giacona says the bureau ordered the halt so that it can address concerns that have arisen during a review of the project sparked by the president’s order, in particular in relation “to the protection of national security interests of the United States and prevention of interference with reasonable uses of the exclusive economic zone, the high seas, and the territorial seas.”\nOnshore construction for the wind farm began more than two years ago, and the work shifted offshore in the spring of 2024. The first turbine went up at the project site about 15 miles south of Little Compton in September 2024.\nSeventy percent of the turbines are now in place, and the total project is about 80% complete, according to Ørsted, which is in a 50/50 partnership on the wind farm with Global Infrastructure Partners’ Skyborn Renewables. It was on track to start delivering power to the electric grid next year.\nØrsted said it “is evaluating all options to resolve the matter expeditiously.”\n“This includes engagement with relevant permitting agencies for any necessary clarification or resolution as well as through potential legal proceedings, with the aim being to proceed with continued project construction towards [commercial operation date] in the second half of 2026,” the company said in a statement.\n“Ørsted is evaluating the potential financial implications of this development, considering a range of scenarios, including legal proceedings,” the statement continued.\nWhat's the impact on RI's Act on Climate targets?\nRevolution Wind was aimed at fulfilling a promise made when the nation's first offshore wind farm was built off Rhode Island a decade ago. Offshore wind supporters argued that by paying more for the five-turbine Block Island Wind Farm, Rhode Islanders would be rewarded with economic development and lower prices with future projects.\nThat appeared to be the case with the much larger Revolution Wind project, which has been partially staged in the Port of Providence and Quonset Business Park. Rhode Island Energy is set to pay a flat rate of 9.8 cents per kilowatt hour for power from the wind farm, which at the time of approval was projected to save ratepayers $90 million over the life of the contract, in large part by displacing the most expensive fossil fuel-burning generators in winter.\nConstruction of the wind farm is also a key part of Rhode Island’s climate policy. Rhode Island is set to get 400 megawatts of power capacity from the project while the remaining 304 megawatts will go to Connecticut. The developers say the wind farm will generate enough power for 350,000 households.\nRhode Island needs to ramp up supplies of renewable energy to slash greenhouse gases and comply with the mandates put in place by the Act on Climate, the 2021 state law that requires Rhode Island to reach net-zero emissions by 2050.\nGov. Dan McKee, who signed the act into law, said the order \"undermines efforts to expand our energy supply, lower costs for families and businesses, and strengthen regional reliability.\" It also \"puts hundreds of union jobs at risk,\" he said.\n\"At a time when we should be moving forward with solutions for energy, jobs, and affordability, the Trump administration is choosing delay and disruption. We are working with our partners in Connecticut to pursue every avenue to reverse this decision,\" he said in a statement on Saturday, Aug. 23.\nAttorney General Peter F. Neronha said without the wind farm, the act \"is dead in the water.\"\nThe American Clean Power Association laid the blame for the stop-work order on “extreme partisan politics.”\n“Here again, the Trump Administration is raising alarms about rising energy prices while blocking new supply from reaching the grid,” CEO Jason Grumet said.\nThis is the second time the administration has ordered a stop to an offshore wind farm already under construction. In April, the Bureau of Ocean Energy Management issued an order affecting Empire Wind, a project off New York, only to reverse course a month later.\nIt also comes amid increasing doubts about the future of SouthCoast Wind, a proposal that Rhode Island was also counting on to add to its offshore wind portfolio. That project secured approval from the federal government under President Joe Biden but has been delayed by years under the new administration.\nThe decision on Revolution Wind only adds to the economic uncertainty for offshore wind, said Liz Burdock, CEO of the Oceantic Network, an industry group.\n“This dramatic action further erodes investor confidence in the U.S. market across all industries and undermines progress on shared national priorities – shipyard revitalization, steel and port investments, and energy dominance,” she said.\nThis story has been updated with new information."
    },
    {
      "news_title": "Trump administration halts work on New England offshore wind project",
      "news_link": "https://www.axios.com/2025/08/22/trump-halts-offshore-wind-orsted",
      "bias": "Lean Left",
      "text": null
    },
    {
      "news_title": "LCV Statement on Trump Administration Stopping Work on Offshore Wind Project",
      "news_link": "https://www.lcv.org/media-center/lcv-statement-on-trump-administration-stopping-work-on-offshore-wind-project/",
      "bias": "Left",
      "text": "Washington, D.C. — In response to today’s announcement from the Bureau of Ocean Energy Management to issue a stop work order on the Revolution Wind offshore wind project, the League of Conservation Voters issued the following statement from Local Clean Energy Deployment Director Kathleen Meil:\n“Donald Trump and his administration are doing everything they can to raise energy prices for hardworking families and kill clean energy jobs. Energy prices are already going up as communities across the country continue to experience climate-fueled extreme weather and energy demand is rising — it makes absolutely no sense to be taking affordable clean energy offline. The administration just tried this with another offshore wind project, and when they were called on it, they redacted an entire 27 page study rather than admit the truth: Donald Trump wants to kill affordable clean energy because he cares more about Big Polluters than families’ pocketbooks, what’s best for communities, and our kids’ future.”\n###"
    },
    {
      "news_title": "Revolution Wind project halted by Trump administration",
      "news_link": "https://www.abc6.com/revolution-wind-project-halted-by-trump-administration/",
      "bias": "Center",
      "text": "Revolution Wind project halted by Trump administration\nPROVIDENCE, R.I. (WLNE) — The U.S. Department of the Interior ordered any ongoing activity related to the Revolution Wind Project to stop Friday.\nIn a letter to leadership at Orsted, the acting director of the Bureau of Ocean Energy Management said the Department of Interior wants concerns addressed before any work can resume.\nActing Director Matthew Giacona said these concerns have been identified as part of a review of offshore wind projects mandated by the president.\nSpecific concerns include protection of the environment and national security interests, Giacona said.\nOrsted completed installation of the project’s first offshore wind turbine in September 2024.\nAt the time, the company hailed it as a “historic moment for Rhode Island and Connecticut’s first large-scale offshore wind farm.”\nGov. Dan McKee celebrated it as a “monumental moment” for Rhode Island at the time.\nOrsted said the 704-megawatt offshore wind farm was set to generate enough energy to power 350,000 homes in Rhode Island and Connecticut.\nThe project site is 15 miles south of Rhode Island’s coast.\nThe project was expected to be operational in 2026, according to Orsted’s website.\nIn a statement sent to ABC6 Friday, Orsted said it is complying with the order.\nThe company noted that the project is already 80 percent complete, with 45 of 65 wind turbines installed.\nThe company is considering legal proceedings in the matter, the statement said.\nIn a statement released Saturday morning, McKee said, in part:\n“The Trump administration’s stop-work order on Revolution Wind undermines efforts to expand our energy supply, lower costs for families and businesses, and strengthen regional reliability. This action puts hundreds of union jobs at risk by halting a project that is 80% complete—just steps away from powering more than 350,000 homes in Rhode Island and Connecticut.”\nMcKee said he is working with Gov. Ned Lamont, a fellow Democrat from Connecticut, to pursue avenues to reverse the decision."
    },
    {
      "news_title": "Controversy Clouds Orsted's Revolution Wind Project",
      "news_link": "https://www.devdiscourse.com/article/science-environment/3591244-controversy-clouds-orsteds-revolution-wind-project",
      "bias": "Center",
      "text": "Controversy Clouds Orsted's Revolution Wind Project\nThe Trump administration has ordered Orsted to stop all activities related to the Revolution Wind project off Rhode Island, due to concerns arising from a review of offshore wind projects.\nThe Trump administration, in a move clouded with controversy, has directed Orsted, a leading Danish energy firm, to cease its activities on the Revolution Wind project.\nThis directive was issued through a letter from the Bureau of Ocean Energy Management (BOEM), highlighting unspecified concerns emanating from a broader review of offshore wind initiatives in federal waters.\nThe halt, ordered by acting Director Matthew Giacona, places the future of this significant renewable energy undertaking in uncertainty, drawing attention to the administration's evolving stance on wind energy projects.\n(With inputs from agencies.)\nAdvertisement\nALSO READ\nOrsted's Offshore Wind Venture Faces Turbulence Amid U.S. Setback\nOrsted's Offshore Wind Challenges Amplified by U.S. Project Halt\nOrsted's Offshore Wind Project Halted Amid U.S. Political Tensions\nOrsted's Offshore Wind Project Faces Political Turbulence\nTrump Administration Halts Orsted's Offshore Wind Project Near Completion"
    },
    {
      "news_title": "Trump Halts Orsted Wind Project in Another Blow to Industry",
      "news_link": "https://www.bloomberg.com/news/articles/2025-08-22/trump-halts-orsted-wind-project-in-another-blow-to-industry",
      "bias": "Lean Left",
      "text": null
    },
    {
      "news_title": "Trump administration orders Revolution Wind to halt work on offshore wind project",
      "news_link": "https://turnto10.com/news/local/trump-administration-orders-revolution-wind-to-halt-wok-on-offshore-wind-project-turbines-rhode-island-coast-connecticut-construction-boem-auugust-22-2025",
      "bias": "Lean Right",
      "text": "(WJAR) — The Bureau of Ocean Energy Management announced it is issuing a stop-work order to the Revolution Wind project.\nThe Revolution Wind project was putting wind turbines about 15 miles off the Rhode Island coast and was expected to be operational in 2026.\nIt aimed to create an offshore wind farm that is expected to generate power for Rhode Island and Connecticut.\nAccording to federal officials, the stoppage is to take time and address concerns that arose during the review of a presidential memorandum issued in January.\n“In particular, BOEM is seeking to address concerns related to the protection of national security interest of the United States and prevention of interference with reasonable uses of the exclusive economic zone, the high seas and the territorial seas,” the Acting Director of BOEM Matthew Giacona wrote in a letter to Revolution Wind.\nOrsted said the offshore construction of the project is 80% complete with all foundation installed and 45 of 65 wind turbines installed. Revolution Wind is a subsidiary of Orsted.\n“Revolution Wind is complying with the order and is taking appropriate steps to stop offshore activities, ensuring the safety of workers and the environment,” an Orsted spokesperson said in a statement. “Ørsted is evaluating all options to resolve the matter expeditiously. This includes engagement with relevant permitting agencies for any necessary clarification or resolution as well as through potential legal proceedings, with the aim being to proceed with continued project construction towards COD in the second half of 2026.”\nThe project received final federal approval from BOEM over a year ago.\nIn a statement released Saturday morning, Governor Dan McKee (D-RI) ripped the Trump administration's decision, saying:\nThe Trump administration’s stop-work order on Revolution Wind undermines efforts to expand our energy supply, lower costs for families and businesses, and strengthen regional reliability. This action puts hundreds of union jobs at risk by halting a project that is 80% complete—just steps away from powering more than 350,000 homes in Rhode Island and Connecticut. At a time when we should be moving forward with solutions for energy, jobs, and affordability, the Trump administration is choosing delay and disruption. We are working with our partners in Connecticut to pursue every avenue to reverse this decision. Revolution Wind is key to Rhode Island’s economic development, energy security, and long-term affordability for our residents."
    },
    {
      "news_title": "EXCLUSIVE: Trump Admin Kills Massive Offshore Wind Project",
      "news_link": "https://dailycaller.com/2025/08/22/exclusive-trump-admin-kills-massive-offshore-wind-project/",
      "bias": "Right",
      "text": "The Daily Caller News Foundation learned on Friday that the Department of the Interior (DOI) is immediately halting all activity on a massive offshore wind project.\nThe Bureau of Ocean Energy Management (BOEM) under the DOI is halting activity on the “Revolution Wind” project off the coast of Rhode Island and Connecticut in line with President Donald Trump’s energy goals to boost reliable energy resources and lower costs for Americans, the agency told the DCNF. The Trump administration has dealt a series of recent blows to the wind industry, with the DOI ending “preferential treatment” for what it considers to be foreign-controlled and unreliable energy sources and moving to terminate the massive Lava Ridge Wind Project in southern Idaho that the Biden administration approved just weeks before Trump’s return to office.\n“Americans deserve energy that is affordable, reliable, and built to last — not experimental and expensive wind projects that are proven failures,” DOI deputy press secretary Aubrie Spady told the DCNF. “In line with President Donald Trump’s Energy Dominance Agenda, Interior is putting an immediate stop to these costly failures to deliver a stronger energy future and lower costs for American families. Like President Trump said, ‘the days of stupidity are over in the USA!'” (RELATED: EXCLUSIVE: Trump Admin Unveils Massive Oil And Gas Lease Expansion Biden Tried To Squash)\nThe Biden administration approved the construction plan for Revolution Wind in 2023, which is located on the federally-owned Outer Continental Shelf. While former President Joe Biden pushed for wind and solar technology throughout his term by greenlighting billions in subsidies, loans and grants, the Trump administration has shifted its focus to conventional and reliable energy sources and taken action to crackdown on federal support for the green energy technology the Biden administration favored.\nTrump signed an executive order directing the DOI to “revise any identified regulations, guidance, policies, and practices as appropriate and consistent with applicable law to eliminate any such preferences for wind and solar facilities” on July 7. Trump campaigned against Biden’s push for green energy and has continued to rail against Biden’s climate agenda, writing on Truth Social Wednesday that “any State that has built and relied on WINDMILLS and SOLAR for power are seeing RECORD BREAKING INCREASES IN ELECTRICITY AND ENERGY COSTS. THE SCAM OF THE CENTURY! We will not approve wind or farmer destroying Solar. The days of stupidity are over in the USA!!! MAGA.”\nThe agency introduced an additional permitting roadblock for green energy projects on public lands on Aug. 1., and a few days later, Interior Secretary Doug Burgum wrote on X that wind projects “are known to kill eagles” and that his agency would enforce the Bald and Golden Eagle Protection Act to protect eagles. The Trump administration also pulled a permit for a massive pending New Jersey offshore wind project in March.\nThe wind industry has come under fire in recent years, as multiple beaches closed in 2024 after a broken wind turbine shed debris into the ocean off the coast of Nantucket and protests surged due to concerns about high-voltage cables running through neighborhoods in 2023. Environmentalists also raised concerns over the energy technology after dolphins washed up along the East Coast in 2023.\nSome fishermen have also voiced opposition to offshore wind projects, arguing that their industry cannot survive alongside offshore wind farms.\nAll content created by the Daily Caller News Foundation, an independent and nonpartisan newswire service, is available without charge to any legitimate news publisher that can provide a large audience. All republished articles must include our logo, our reporter’s byline and their DCNF affiliation. For any questions about our guidelines or partnering with us, please contact licensing@dailycallernewsfoundation.org."
    },
    {
      "news_title": "Trump Admin Is Using Environmental Protections to Throttle Renewable Energy",
      "news_link": "https://truthout.org/articles/trump-admin-is-using-environmental-protections-to-throttle-renewable-energy/",
      "bias": "Left",
      "text": "Did you know that Truthout is a nonprofit and independently funded by readers like you? If you value what we do, please support our work with a donation.\nThe Department of the Interior, or DOI, has such a wide-ranging set of duties that it’s sometimes referred to in Washington, D.C., as “the department of everything else” — public lands, natural resources, wildlife regulations, and the Bureau of Indian Affairs all fall under its auspices. It is now also the tip of the spear in the Trump administration’s war on renewables.\nOn July 17, the DOI announced that all wind and solar projects would have to undergo “elevated review” from department Secretary Doug Burgum’s office. On July 29, Burgum ordered an end to “preferential treatment” for “unreliable, foreign controlled energy sources,” specifically wind and solar. The next day, the Bureau of Ocean Energy Management, which sits within the DOI, rescinded all designated Wind Energy Areas along the continental shelf. Two days later, on August 1, the DOI released a secretarial order that mandates all energy projects based on federal land be evaluated on their “capacity density,” or how much energy they are able to produce per square acre. The following week, the agency ordered the cancellation of the already-approved Lava Ridge Wind Project, a proposed wind farm in Idaho, arguing that it would “harm rural communities, livelihoods and the land.” And on August 4, Bergum called for the use of the Bald and Golden Eagle Protection Act to request numbers of eagle deaths from wind developers.\nFollowing these moves, President Donald Trump took to Truth Social to vow that the administration “will not approve wind or farmer destroying Solar. The days of stupidity are over in the USA!!!”\nNever miss another story\nGet the news you want, delivered to your inbox every day.\nWhat Trump and the Interior Department are doing, experts say, is using environmentalists’ legal playbook against them to throttle renewable energy. Laws meant to protect and safeguard wildlife and public lands from mining, drilling, and habitat degradation — such as the Federal Land Policy and Management Act’s prohibition against “unnecessary or undue degradation” — are instead being wielded as a cudgel against wind and solar.\n“They are effectively trying to co-opt arguments that we have used for years to push back on fossil fuels,” said Erik Schlenker-Goodrich, the executive director at the Western Environmental Law Center, a public interest firm.“But I think it should go without saying that they are abusing those laws.”\nSchlenker-Goodrich pointed to the DOI’s recent capacity density order as a particularly troubling example. Secretarial orders are meant to function as internal guidance to agencies. “They are not intended to put in place substantive rules that dictate outcomes,” he said, in this case “a de facto prohibition against the siting and permitting of renewables on federal public lands.”\nSolar and wind farms will never technically be able to produce as much energy per acre as an oil and gas facility — but that is also not the best measure of impact. Wind turbines are only a handful of feet wide at the base — the land or water that surrounds them remains unaffected and can easily be used for farming or agriculture. Solar panels can be placed on brownfields or integrated on agricultural land. When a wind or solar farm is decommissioned, the equipment is removed, the ground is decompacted, and vegetation is replanted. Within a year or two, you can barely tell anything was there, and the land can immediately be reused — the possibilities are limited only by zoning laws.\nIn contrast, when a refinery or a fossil fuel plant shuts down, the ground is poisoned. Cancer-causing chemicals like benzene saturate the soil and remediation can take years, assuming it happens at all. And that doesn’t even account for the massive amount of energy spent producing and transporting fossil fuels to power plants.\n“The DOI is fixating on this one metric, capacity density, to the exclusion of a holistic understanding of costs and benefits of a particular energy technology,” said Schlenker-Goodrich.\nRefineries, gas plants, and nuclear plants also aren’t typically built on public land, nor are they likely to be. Private industry has little interest in dealing with even more federal regulations, according to Josh Axelrod, senior policy advocate at the National Resources Defense Council, an environmental nonprofit.\n“The [DOI is] trying to come up with the facade of a rational reason to stop doing anything related to renewables, but this one especially is really mind-boggling,” said Axelrod. “Everything it compares wind and solar to — none of those types of facilities are built on federal land … There’s no comparison.”\nThe Interior Department’s order that all wind and solar projects on federal land undergo “elevated review” is another misuse of environmental law, experts said. Routine procedures that would have previously been handled by a DOI bureaucrat will now need the secretary’s personal sign-off. And the restrictions will impact projects on private land just as much as on public land. A recent analysis from The American Clean Power Association found that 27 of the new procedures requiring Bergum’s sign-off — such as needing consultations around harm to wildlife and endangered species — will allow the DOI to effectively end development of renewable energy projects nationwide. The goal, it seems, is to create an impossible backlog that bleeds projects of funding before they can get off the ground.\nAll of this is in service of propping up dying industries, such as coal, said Alex Klass, an environmental law professor at the University of Michigan. “[The administration] can talk about energy dominance and talk about the need for new energy,” he said, “but before there was always an argument [that] you shouldn’t try to prop up an industry that can’t make it on its own. That’s basically what they’re doing.”\nAnd it is being done with little concern for the environmental consequences.\nBergum cited concerns about migratory bird populations when he moved to cancel offshore areas for wind energy development. But on Tuesday, the DOI announced that it plans to hold 30 oil and gas lease auctions over the next 15 years — also offshore. Although the administration has declared an “energy emergency,” it’s clear that actual energy development is being approached from a position of political theater, rather than practicality.\nTrump has claimed that offshore wind turbines “are causing whales to die in numbers never seen before,” but there is no evidence of that. Upon taking office, the administration almost immediately moved to fire scientists at the National Oceanic and Atmospheric Administration whose research centered around ensuring offshore wind was safe for whales. Offshore drilling, on the other hand, is proven to be enormously harmful to marine environments. Seismic blasting can result in hearing loss — affecting whales’ ability to breed and communicate — and animals are often killed by vessel strikes. When something goes wrong on a drill rig, it’s apocalyptic for the nearby environment. The Deepwater Horizon spill remains the worst environmental disaster in United States history.\nInterior officials have also worked to roll back environmental regulations around mining, eliminate Biden-era regulations that provided protection for public lands, and fast-track mining despite local concerns of water scarcity. Given the administration’s aggressive antipathy for environmental regulations, experts say it’s impossible to believe that the Interior Department’s sudden conservationist concerns around solar and wind impacts are being made in good faith.\n“It’s not like the Biden administration stopped permitting oil and gas development. There’s lots of oil and gas development,” said Klass. “They just also tried to prioritize wind and solar. Here they’re saying, ‘Not only are we not going to prioritize [wind and solar], we’re going to try to shut it down entirely.’”\nAn urgent appeal for your support\nTruthout relies on reader support to publish independent journalism, free from political and corporate influence.\nUnfortunately, donations are down. At a moment when our journalism is most necessary, we are struggling to meet our operational costs due to worsening political censorship.\nTruthout may end this month in the red without additional help, so we’ve launched a fundraiser. We have 72 hours to hit our $30,000 goal. Please make a tax-deductible gift to Truthout at this critical time!"
    },
    {
      "news_title": "Trump Administration Halts 80% Complete Rhode Island Offshore Wind Project",
      "news_link": "https://thedeepdive.ca/trump-administration-halts-80-complete-rhode-island-offshore-wind-project/",
      "bias": "unknown",
      "text": "The Trump administration on Friday ordered an immediate halt to construction of a nearly complete offshore wind project off Rhode Island’s coast, citing unspecified national security concerns and dealing a major blow to the renewable energy industry.\nThe Bureau of Ocean Energy Management told Danish energy company Ørsted to stop all work on Revolution Wind, an 80% complete project that was scheduled to begin powering 350,000 homes in Rhode Island and Connecticut next year. The order affects 1,200 jobs and puts the multibillion-dollar investment at risk.\nFederal officials said the halt was needed to “address concerns related to the protection of national security interests of the United States,” but did not specify what those concerns were. The project had cleared nine years of federal and state reviews and received final approval in November 2023.\nRevolution Wind has 45 of its planned 65 wind turbines already installed in federal waters, more than 15 miles south of Rhode Island. Construction began in 2023 and was proceeding on schedule until Friday’s order.\n“This arbitrary decision defies all logic and reason,” said Connecticut Sen. Richard Blumenthal, who vowed to fight the decision. Rhode Island Gov. Dan McKee and Connecticut Gov. Ned Lamont said they would “pursue every avenue to reverse the decision.”\nThe stoppage is the second time the Trump administration has halted construction on an active offshore wind project. Work on New York’s Empire Wind project was stopped in April but later resumed after political intervention.\nPresident Donald Trump issued a moratorium on new offshore wind projects on his first day in office and has called wind power “THE SCAM OF THE CENTURY” on social media. Since January, the administration has also made it harder for renewable energy companies to qualify for federal tax incentives and launched a national security investigation into wind turbine imports.\nØrsted said it was evaluating “all options to resolve the matter expeditiously,” including potential legal action. The company noted its US offshore wind projects have generated 4 million union labor hours, with 2 million from Revolution Wind alone.\nIndustry advocates warned the decision would undermine investor confidence and drive up energy costs. “The unfortunate message to investors is clear: the US is no longer a reliable place for long-term energy investments,” Jason Grumet, CEO of American Clean Power, said in a statement.\nThe project’s location near Cox Ledge, an important fishing habitat, has drawn opposition from commercial fishing groups. Green Oceans, a nonprofit opposing offshore wind, praised the administration’s decision as protecting “the fragile ocean environment.”\nRevolution Wind was considered crucial for Rhode Island and Connecticut to meet their climate goals, as both densely populated states have limited space for land-based renewable energy projects. Wind power currently provides about 10% of US electricity generation.\nThe halt leaves hundreds of workers facing uncertain employment and raises questions about the future of the US offshore wind industry, which has a pipeline of projects worth $80 billion in various stages of development.\nInformation for this story was found via OPB, NPR, and the sources and companies mentioned. The author has no securities or affiliations related to the organizations discussed. Not a recommendation to buy or sell. Always do additional research and consult a professional before purchasing a security. The author holds no licenses."
    },
    {
      "news_title": "Feds halt work on nearly completed offshore wind project",
      "news_link": "https://masslawyersweekly.com/2025/08/25/feds-halt-work-on-nearly-completed-offshore-wind-project/",
      "bias": "unknown",
      "text": "State House News Service//August 25, 2025//\nState House News Service//August 25, 2025//\nThe Trump administration struck another blow against the growth of offshore wind energy, ordering a project off the Rhode Island coast to halt work while federal officials look into unspecified “concerns that have arisen.”\nIn a letter on Aug. 22 to Ørsted North America Inc., Bureau of Ocean Energy Management Acting Director Matthew Giacona said his directive applies to the Revolution Wind project and stems from a Jan. 20 memorandum from President Donald Trump.\n“BOEM is seeking to address concerns related to the protection of national security interests of the United States and prevention of interference with reasonable uses of the exclusive economic zone, the high seas, and the territorial seas” as described in the 1953 Outer Continental Shelf Lands Act, the letter said.\nGiacona’s letter referenced Part 585 regulations which require, among other things, that lessees submit information on social and economic conditions, including recreational and commercial fishing that could be affected by offshore wind energy activities, and mitigation measures pertaining to environmental impacts.\n“Revolution Wind is complying with the order and is taking appropriate steps to stop offshore activities, ensuring the safety of workers and the environment,” Ørsted said in a statement responding to the directive.\nThe project received final federal approval from BOEM in 2024 and is 80 percent complete, with all foundations installed and 45 out of 65 wind turbines installed, the company said.\nØrsted said it was evaluating options including engagement with permitting agencies and potential litigation. The company said it hopes to resolve the matter “expeditiously,” noting the project had secured all required federal and state permits following reviews that began more than nine years ago.\nBOEM said an appeal of its directive must be filed with the agency within 60 days and that project activities may not resume until the agency “has completed its necessary review.”\nRevolution Wind has 20-year power purchase agreements to deliver 400 MW of electricity to Rhode Island and 304 MW to Connecticut, enough to power over 350,000 homes across both states."
    },
    {
      "news_title": "BOEM orders work stop at Revolution Wind",
      "news_link": "https://www.marinelog.com/offshore/boem-stops-work-at-revolution-wind/",
      "bias": "unknown",
      "text": "BOEM orders work stop at Revolution Wind\nWritten by Nick BlenkeyØrsted reports that on August 22, its subsidiary, Revolution Wind LLC, a 50/50 joint venture with Global Infrastructure Partner’s Skyborn Renewables, received an order instructing the project to stop activities on the outer continental shelf related to the Revolution Wind project from the Department of the Interior’s Bureau of Ocean Energy Management (BOEM). Revolution Wind is complying with the order and is taking appropriate steps to stop offshore activities, ensuring the safety of workers and the environment.\n‘’The project commenced offshore construction following the final federal approval from BOEM last year. The project is 80% complete with all offshore foundations installed and 45 out of 65 wind turbines installed.\nØrsted says that it is evaluating all options to resolve the matter expeditiously. This includes engagement with relevant permitting agencies for any necessary clarification or resolution as well as through potential legal proceedings, with the aim being to proceed with continued project construction towards COD in the second half of 2026.\nRevolution Wind is fully permitted, having secured all required federal and state permits including its Construction and Operations Plan approval letter on November 17, 2023, following reviews that began more than nine years ago. Revolution Wind has 20-year power purchase agreements to deliver 400 MW of electricity to Rhode Island and 304 MW to Connecticut, enough to power over 350,000 homes across both states to meet their growing energy demand. As a reference, South Fork Wind, which is adjacent to Revolution Wind and uses the same turbine technology, delivered reliable energy to New York at a capacity factor of 53% for the first half of 2025, on par with the state’s baseload power sources.\nØrsted said that it is evaluating the potential financial implications of this development, considering a range of scenarios, including legal proceedings.\nThe move marks the second attempt by the Administration to end a fully-permitted offshore wind operation, following its move to shut down New York’s Empire Wind. That decision was later reversed.\nUnlawful?\nThe Oceantic Network slammed the shutdown as “unlawful,” noting afternoon, The Department of the Interior ordered work to stop on Ørsted’s the project, which is 80% complete, was set to provide 704 MW of power generation to Conneticut and Rhode Island once completed early next year.\n–\n“For the second time,” said Oceantic Network CEO Liz Burdock, “the Trump Administration has taken unlawful action against a fully permitted offshore wind project under active construction—this time one that is nearly 80% complete. This dramatic action further erodes investor confidence in the U.S. market across all industries and undermines progress on shared national priorities—shipyard revitalization, steel and port investments, and energy dominance. In fact, halting work on Revolution Wind will drive up energy costs for consumers, idle Gulf Coast vessel operators that have invested hundreds of millions of dollars in new or retrofitted vessels, and jeopardize the livelihoods of union workers.”\nConnecticut and R.I. governors respond\nWhether the action is unlawful or not is something likely being thoroughly explored not only by Ørsted but by the attorneys general of both Connecticut and Rhode Island.\nGov.Ned Lamont of Connecticut and Governor Dan McKee of Rhode Island released the following statements :\nGov. Lamont said, “This political move by the Trump administration will drive up the cost of electricity bills and contradicts everything the administration has told us. It wastes years of state investment in renewable energy designed to diversify our energy supply and lower costs for families and businesses. The project, which was on track to be completed early next year, would have powered more than 350,000 homes across Connecticut and Rhode Island while creating good-paying, clean energy jobs. All of that is now at risk. We are working closely with Rhode Island to save this project because it represents exactly the kind of investment that reduces energy costs, strengthens regional production, and builds a more secure energy future – the very goals President Trump claims to support but undermines with this decision.”\nGov. McKee said, “The Trump administration’s stop-work order on Revolution Wind undermines efforts to expand our energy supply, lower costs for families and businesses, and strengthen regional reliability. This action puts hundreds of union jobs at risk by halting a project that is 80% complete – just steps away from powering more than 350,000 homes in Rhode Island and Connecticut. At a time when we should be moving forward with solutions for energy, jobs, and affordability, this administration is choosing delay and disruption. We are working with our partners in Connecticut to pursue every avenue to reverse this decision. Revolution Wind is key to Rhode Island’s economic development, energy security, and long-term affordability for our residents.”\nNOIA: Not only about energy\nNational Ocean Industries Association (NOIA) President Erik Milito issued the following statement:\n“Revolution Wind is already under construction and nearly complete, representing years of planning, billions in private investment, and significant progress for America’s offshore energy supply chain. Any pause or uncertainty at this stage could ripple across jobs, contracts, and communities already benefiting from the project.\n“These projects are not only about energy. They advance priorities of the Administration by restoring American manufacturing, strengthening shipbuilding, modernizing ports, and building the reliable power needed to support data centers and AI innovation.\n“Today, the U.S. has only one one fully operational large-scale offshore wind project producing power. That is not enough to meet America’s rising energy needs. We need more energy of all types, including oil and gas, wind, and new and emerging technologies. Offshore projects take years of investment before delivering results, and stable, consistent policy is essential to keep that progress moving.\n“The totality of America’s offshore energy industry, including oil and gas, wind, carbon capture and storage, and deep sea mining, is driving more stability for consumers, more jobs nationwide, and a stronger future for America.”"
    },
    {
      "news_title": "Orsted Shares Crash To Record Lows After Trump Halts Rhode Island Offshore Wind Project – altnews.org",
      "news_link": "https://altnews.org/2025/08/25/orsted-shares-crash-to-record-lows-after-trump-halts-rhode-island-offshore-wind-project/",
      "bias": "unknown",
      "text": "Orsted Shares Crash To Record Lows After Trump Halts Rhode Island Offshore Wind Project\nOrsted Shares Crash To Record Lows After Trump Halts Rhode Island Offshore Wind Project\nShares of Danish wind giant Orsted A/S crashed as much as 19% – to record lows – after the Trump administration ordered construction halted on the 80%-completed Revolution Wind offshore project off Rhode Island last Friday, citing unresolved national security concerns under federal review. The struggling wind company still plans to move forward with a $9.4 billion share sale to strengthen its capital structure.\nThe Interior Department’s Bureau of Ocean Energy Management (BOEM) issued a directive on Friday ordering Orsted to halt all offshore construction activities on the Revolution Wind project. The order stems from a Presidential Memorandum issued on Jan. 20, which triggered a broad review of renewable projects on the Outer Continental Shelf.\nTwo items the BOEM wants to address:\n- Environmental protections\n-\nNational security concerns (e.g., interference with U.S. defense/naval activity in the exclusive economic zone, high seas, territorial seas).\n“In particular, BOEM is seeking to address concerns related to the protection of national security interests of the United States and prevention of interference with reasonable uses of the exclusive economic zone, the high seas, and the territorial seas, as described in that subsection of OCSLA. Id,” stated BOEM’s letter addressed to Rob Keiser, head of Orsted North America.\nThe $5 billion wind project, already 80% complete with 45 of 65 turbines installed, was approved under the Biden-Harris regime in 2023, during the time the Democratic Party looted the nation under the guise of a ‘climate crisis’ to funnel hundreds of billions of dollars into green companies and NGOs. This, in effect, helped spark generational-high inflation, crippling working-poor and middle-class households. Several of these projects have already collapsed, and we anticipate more Solyndra-style busts ahead as the green bubble continues to implode.\nOrsted told Bloomberg that it’s exploring regulatory channels and possible legal action to resolve the matter: “Orsted is evaluating all options to resolve the matter expeditiously. This includes engagement with relevant permitting agencies for any necessary clarification or resolution as well as through potential legal proceedings.”\nBloomberg reports Ortsed is still moving ahead with a $9.4 billion share sale and appointed a syndicate of BNP Paribas, Danske Bank, and J.P. Morgan as joint global coordinators, alongside Morgan Stanley. BofA Securities Europe SA and Goldman Sachs will serve as joint bookrunners.\nHere are more details about the planned share sale that will help stabilize the balance sheet of the struggling wind company:\n-\nOrsted is pushing ahead with a planned 60 billion DKK ($9.4B) rights issue, the largest European energy-sector share sale in over a decade.\n-\nThe Danish government has pledged to buy about half the shares.\n-\nOrsted’s credit rating has already been slashed to the lowest investment grade.\n-\nOrsted has already canceled two U.S. projects, booked heavy writedowns, and changed out its top executives.\nThis month, Orsted shares in Denmark have been in turmoil:\n-\nWind Giant Orsted Suffers Worst Week On Record As Green Energy Demise Accelerates\n-\nOrsted Shares Crash Below IPO Price On “Unexpected” Rights Issue\nHowever, good news for the industry last week on new IRS guidance:\n- Vestas Wind Shares Surge On Revised Tax Credit Guidance, Wall Street Analysts Breathe Sigh Of Relief\nRelated:\nOrsted crashed as much as 19% in Copenhagen, falling to record lows below its IPO price.\nCommentary from a team of Goldman analysts led by Alberto Gandolfi provides clients with the economics of Orsted walking away from Revolution and another offshore wind project, Sunrise:\nWhat are the economics of walking away from both projects? To run this math, we look at three building blocks: (1) walking away from Revolution and Sunrise would save Orsted DKK 45 bn in residual capex, (2) the company would lose around DKK 3 bn EBITDA for a period of c.25 years, and (3) Orsted may face cancellation fees: based on Ocean Wind 1 (DKK 10 bn, based on 2023 accounts), cancellation fees on these two projects could be DKK 10-15 bn.\nCan Orsted downsize or delay the rights issue? Based on the math just presented, we estimate that walking away from both US projects would require a smaller rights issue: we estimate DKK 30 bn, half of what was recently announced. To reach our conclusion, we assume that Orsted would have to comply with its target FFO/Net debt “above 30%”. We also estimate that this move – i.e., walking away from projects, paying penalties and downsizing the equity issuance – would be EPS accretive (double digit) in 2025-27, EPS neutral in 2028, but it would then start to be increasingly EPS dilutive as of 2029-30; this scenario wouldn’t meaningfully change our current valuation for the stock. We also note that Orsted would still have to carry out the targeted DKK 35 bn disposals by the end of 2026, to avoid any B/S pressure.\nGandolfi is “Neutral” wated on Orsted with a 12-month price target of DKK 235.\n. . .\nTyler Durden\nMon, 08/25/2025 – 07:20\nRead further at ZeroHedge"
    },
    {
      "news_title": "US Halts Revolution Wind Project",
      "news_link": "https://www.marinelink.com/news/us-halts-revolution-wind-project-529245",
      "bias": "unknown",
      "text": "US Halts Revolution Wind Project\nThe Trump administration on Friday ordered Denmark's Orsted to stop far-advanced construction on an offshore wind project near Rhode Island, in a move that threatens to exacerbate the company's financial troubles.\nWith construction now frozen at 80% completion, Orsted has no immediate path to revenue generation, heightening pressure on the company as it seeks to shore up finances through a $9.4 billion emergency rights issue.\nThe stop-work order, issued by the Bureau of Ocean Energy Management (BOEM), is the administration's latest effort to hinder U.S. renewable energy development and is the second time this year the Interior Department, which oversees BOEM, has halted work on a major offshore wind project.\n\"Orsted is evaluating all options to resolve the matter expeditiously,\" the company said in a statement, adding that it was reviewing the financial implications of the order and was considering legal action.\nThe company said it would \"in due course\" advise the market on the potential impact on its plans to conduct the rights issue.\nOrsted is investing into American energy generation, grid upgrades, port infrastructure, and a supply chain, including US shipbuilding and manufacturing extending to more than 40 states.\nOrsted’s US offshore wind projects have totalled approximately 4 million labour union hours to date, 2 million of which are with Revolution Wind.\nA spokesperson for the company, owned 50.1% by the Danish state, declined to comment further.\nOn his first day in office in January, President Donald Trump suspended new offshore wind leasing pending an environmental and economic review of projects. He has repeatedly criticized wind energy as ugly, unreliable and expensive.\nThe $1.5 billion project that Orsted was constructing, Revolution Wind, was scheduled to be completed next year and expected to produce enough electricity to power 350,000 homes in Rhode Island and Connecticut.\nAll offshore foundations had been installed and 45 out of 65 wind turbines were already in place, Orsted said.\nThe National Ocean Energy Industries Association, an industry trade group, said halting work on a project that is almost finished would jeopardize jobs and investment.\n“These projects are not only about energy,\" NOIA President Erik Milito said. \"They advance priorities of the Administration by restoring American manufacturing, strengthening shipbuilding, modernizing ports, and building the reliable power needed to support data centers and AI innovation.\n“Today, the U.S. has only one fully operational large-scale offshore wind project producing power. That is not enough to meet America’s rising energy needs. We need more energy of all types, including oil and gas, wind, and new and emerging technologies. Offshore projects take years of investment before delivering results, and stable, consistent policy is essential to keep that progress moving.\"\nThe stop-work order is driven by unspecified national security concerns arising from the administration's review of offshore wind projects in federal waters, according to the letter, signed by BOEM acting Director Matthew Giacona.\nThe bureau is seeking to protect U.S. national security and prevent \"interference with reasonable uses of the exclusive economic zone, the high seas, and the territorial seas,\" Giacona said.\nOrsted is among the biggest global offshore wind companies, but its U.S. business has suffered setbacks in addition to the broader challenges facing the global offshore wind industry, which is struggling to meet ambitious government targets amid soaring costs and project delays.\nEarlier this month, Orsted sought the $9.4 billion of financing from shareholders to help fund its Sunrise Wind project off the New York coast after potential partners pulled out due to Trump's hostility to wind power.\nPotential co-investors for the Sunrise Wind project pulled out after Trump's administration in April ordered Equinor to halt the development of a fully-permitted wind farm. The order, which sent shockwaves through the industry, was reversed the following month, however.\n(staff and Reuters - Reporting by Nichola Groom and Stine Jacobsen; Editing by Leslie Adler, Sandra Maler, Cynthia Osterman, Aidan Lewis)"
    },
    {
      "news_title": "Trump halts Rhode Island offshore wind project – Rhode Island Lawyers Weekly",
      "news_link": "https://rilawyersweekly.com/blog/2025/08/24/trump-halts-revolution-wind-offshore-project-rhode-island/",
      "bias": "unknown",
      "text": "Associated Press//August 24, 2025//\nThe Trump administration halted construction on a nearly complete offshore wind project near Rhode Island as the White House continues to attack the battered U.S. offshore wind industry that scientists say is crucial to the urgent fight against climate change.\nDanish wind farm developer Orsted says the Revolution Wind project is about 80 percent complete, with 45 out of its 65 turbines already installed.\nDespite that progress — and the fact that the project had cleared years of federal and state reviews — the Bureau of Ocean Energy Management issued the order on Aug. 22, saying the federal government needs to review the project and “address concerns related to the protection of national security interests of the United States.”\nIt did not specify what the national security concerns are.\nPresident Donald Trump has made sweeping strides to prioritize fossil fuels and hinder renewable energy projects. Trump recently called wind and solar power “THE SCAM OF THE CENTURY!” in a social media post and vowed not to approve wind or “farmer destroying Solar” projects. “The days of stupidity are over in the USA!!!” he wrote on his Truth Social site.\nScientists across the globe agree that nations need to rapidly embrace renewable energy to stave off the worst effects of climate change, including extreme heat and drought, larger, more intense wildfires, and supercharged hurricanes, typhoons and rainstorms that lead to catastrophic flooding.\nGov. Daniel K. McKee criticized the stop-work order and said he and Connecticut Gov. Ned Lamont “will pursue every avenue to reverse the decision to halt work on Revolution Wind” in a post on X. Both governors are Democrats.\nConstruction on Revolution Wind began in 2023, and the project was expected to be fully operational next year. Orsted says it is evaluating the financial impact of stopping construction and is considering legal proceedings.\nRevolution Wind was expected to be Rhode Island and Connecticut’s first commercial-scale offshore wind farm, capable of powering more than 350,000 homes. The densely populated states have minimal space available for land-based energy projects, which is why the offshore wind project is considered crucial for the states to meet their climate goals.\nIn response to the stop-work order, Attorney General Peter F. Neronha called Revolution Wind “absolutely essential” to meeting Rhode Island’s clean energy goals.\n“Nearly half of the state’s clean energy portfolio … is slated to come from Revolution Wind upon the project’s completion next year. Without Revolution Wind, our Act on Climate is dead in the water,” he said.\nNoting the significant investments already made in the project and “its obvious benefit to our economy and climate,” the AG said the Trump administration’s attempt to stop the project could only be characterized as “bizarre.”\n“This arbitrary decision defies all logic and reason — Revolution Wind’s project was already well underway and employed hundreds of skilled tradesmen and women. This is a major setback for a critical project in Connecticut, and I will fight it,” Connecticut Sen. Richard Blumenthal, a Democrat, said in a statement.\nWind power is the largest source of renewable energy in the U.S. and provides about 10 percent of the electricity generated in the nation.\n“We are grateful that the Trump Administration and the federal government are taking meaningful action to preserve the fragile ocean environment off the coasts of Rhode Island and Massachusetts,” the nonprofit said in a statement.\nThis is the second major offshore wind project the White House has halted. Work was stopped on Empire Wind, a New York offshore wind project, but construction was allowed to resume after New York Sen. Chuck Schumer and Gov. Kathy Hochul, both Democrats, intervened."
    },
    {
      "news_title": "Trump halts work on New England offshore wind project that’s nearly complete – UK Times",
      "news_link": "https://uk-times.com/trump-halts-work-on-new-england-offshore-wind-project-thats-nearly-complete-uk-times/",
      "bias": "unknown",
      "text": "The Trump administration halted construction on a nearly complete offshore wind project near Rhode Island as the White House continues to attack the battered U.S. offshore wind industry that scientists say is crucial to the urgent fight against climate change.\nDanish wind farm developer Orsted says the Revolution Wind project is about 80% complete, with 45 out of its 65 turbines already installed.\nDespite that progress — and the fact that the project had cleared years of federal and state reviews — the Bureau of Ocean Energy Management issued the order Friday, saying the federal government needs to review the project and “address concerns related to the protection of national security interests of the United States.”\nIt did not specify what the national security concerns are.\nPresident Donald Trump has made sweeping strides to prioritize fossil fuels and hinder renewable energy projects. Trump recently called wind and solar power “THE SCAM OF THE CENTURY!” in a social media post and vowed not to approve wind or “farmer destroying Solar” projects. “The days of stupidity are over in the USA!!!” he wrote on his Truth Social site this week.\nScientists across the globe agree that nations need to rapidly embrace renewable energy to stave off the worst effects of climate change, including extreme heat and drought; larger, more intense wildfires and supercharged hurricanes, typhoons and rainstorms that lead to catastrophic flooding.\nRhode Island Gov. Dan McKee criticized the stop-work order and said he and Connecticut Gov. Ned Lamont “will pursue every avenue to reverse the decision to halt work on Revolution Wind” in a post on X.\nConstruction on Revolution Wind began in 2023, and the project was expected to be fully operational next year. Orsted says it is evaluating the financial impact of stopping construction and is considering legal proceedings.\nRevolution Wind is located more than 15 miles (24 kilometers) south of the Rhode Island coast, 32 miles (51 kilometers) southeast of the Connecticut coast and 12 miles (19 kilometers) southwest of Martha’s Vineyard. Rhode Island is already home to one offshore wind farm, the five-turbine Block Island Wind Farm.\nRevolution Wind was expected to be Rhode Island and Connecticut’s first commercial-scale offshore wind farm, capable of powering more than 350,000 homes. The densely populated states have minimal space available for land-based energy projects, which is why the offshore wind project is considered crucial for the states to meet their climate goals.\n“This arbitrary decision defies all logic and reason — Revolution Wind’s project was already well underway and employed hundreds of skilled tradesmen and women. This is a major setback for a critical project in Connecticut, and I will fight it,” Connecticut Sen. Richard Blumenthal said in a statement.\nWind power is the largest source of renewable energy in the U.S. and provides about 10% of the electricity generated in the nation.\nGreen Oceans, a nonprofit that opposes the offshore wind industry, applauded the BOEM’s decision. “We are grateful that the Trump Administration and the federal government are taking meaningful action to preserve the fragile ocean environment off the coasts of Rhode Island and Massachusetts,” the nonprofit said in a statement.\nThis is the second major offshore wind project the White House has halted. Work was stopped on Empire Wind, a New York offshore wind project, but construction was allowed to resume after New York Sen. Chuck Schumer and Gov. Kathy Hochul intervened.\n“This administration has it exactly backwards. It’s trying to prop up clunky, polluting coal plants while doing all it can to halt the fastest growing energy sources of the future – solar and wind power,” said Kit Kennedy, managing director for the power division at Natural Resources Defense Council, in a statement. “Unfortunately, every American is paying the price for these misguided decisions.”\n___\nReporter Jennifer McDermott contributed from Providence, Rhode Island, and Matthew Daly contributed from Washington.\n___\nThe Associated Press’ climate and environmental coverage receives financial support from multiple private foundations. AP is solely responsible for all content. Find AP’s standards for working with philanthropies, a list of supporters and funded coverage areas at AP.org."
    },
    {
      "news_title": "US Orders Ørsted to Halt Rhode Island Wind Farm Construction",
      "news_link": "https://energynewsbeat.co/us-orders-orsted-to-halt-rhode-island-wind-farm-construction/",
      "bias": "unknown",
      "text": "In a significant blow to the offshore wind industry, the U.S. Department of the Interior’s Bureau of Ocean Energy Management (BOEM) has issued a stop-work order for Ørsted’s Revolution Wind project off the coast of Rhode Island. The directive, announced on August 22, 2025, halts all offshore construction activities on the nearly completed wind farm, citing national security concerns amid the Trump administration’s broader pushback against renewable energy initiatives.\nThis move comes at a precarious time for the Danish energy giant Ørsted, which is already grappling with substantial financial losses and has recently sought a massive capital injection to stabilize its operations.\nProject Overview and Current Status\nRevolution Wind, a joint venture between Ørsted and Skyborn Renewables (formerly Eversource), is designed to generate 704 megawatts (MW) of clean energy—enough to power over 350,000 homes in Rhode Island and Connecticut.\nThe project, located approximately 15 miles south of Rhode Island, features 65 Siemens Gamesa 11-MW turbines and was fully permitted, with construction well underway since late 2023.\nAs of the halt order, the project was approximately 80% complete. All offshore foundations had been installed, and 45 out of the 65 wind turbines were already in place, leaving just 20 turbines remaining to be installed.\nThe wind farm was on track for commercial operations in the second half of 2026, with 400 MW allocated to Rhode Island and 304 MW to Connecticut under 20-year power purchase agreements (PPAs).\nThe total capital cost of the project is estimated at $4 billion, reflecting the scale of investment in infrastructure, turbines, and transmission systems.\nØrsted, holding a 50% stake in the venture, has emphasized that the project complies with all federal and state permits, and the company is now evaluating legal options to challenge the order and resume work.\nPotential Revenue Loss from Uninstalled Turbines\nIf the halt becomes prolonged or permanent, the inability to install the remaining 20 turbines could result in substantial revenue shortfalls. The missing turbines represent about 30.8% of the project’s total capacity (approximately 217 MW, based on the 704 MW overall rating). Assuming a conservative capacity factor of 45% for offshore wind (a standard industry benchmark), the full project would generate roughly 2.78 million megawatt-hours (MWh) of electricity annually. Under the PPAs, Rhode Island’s portion is priced at approximately $98.43 per MWh, while Connecticut’s pricing is comparable, averaging around $90-$98 per MWh across the agreements.\nTo calculate the potential annual revenue loss for the uninstalled turbines: Total annual output for full project: 704 MW × 8,760 hours/year × 45% capacity factor = 2,775,168 MWh.\nRevenue at an average $98/MWh: 2,775,168 MWh × $98 = approximately $272 million per year.\nProportion for 20 turbines (20/65 ≈ 0.308): $272 million × 0.308 ≈ $84 million in annual revenue loss.\nOver the 20-year PPA term, this could equate to a cumulative loss of about $1.68 billion (undiscounted), not accounting for escalation clauses or operational costs. This figure assumes the installed turbines can operate independently, which may not be the case if the halt affects the entire project’s commissioning.\nIndustry experts warn that delays could also inflate costs due to idled vessels, labor, and supply chain disruptions, potentially adding hundreds of millions more in expenses.\nBroader Impact on Ørsted’s Financial Woes and Potential Bailout\nThis development exacerbates Ørsted’s ongoing financial challenges, which have been mounting due to project delays, rising interest rates, and political headwinds in the U.S. market. Just two weeks prior, on August 11, 2025, Ørsted announced a $9.4 billion rights issue to bolster its balance sheet amid a 30% plunge in its stock price.\nThe Danish government, Ørsted’s majority shareholder with a 50.1% stake, committed to providing roughly half of the funds—about $4.7 billion—to maintain its ownership level.\nØrsted has already reported impairments on U.S. projects, including a $575 million hit last year partly tied to Revolution Wind delays.\nThe halt could lead to further impairments, eroding the effectiveness of the recent capital raise and prompting calls for additional support. In a statement, Ørsted noted it is assessing the financial implications, including effects on the rights issue, and may pursue litigation to mitigate losses.\nAnalysts suggest this could deepen Ørsted’s projected losses for 2025-2027, potentially necessitating more government intervention from Denmark, where the company is seen as a national champion in green energy.\nState officials in Rhode Island and Connecticut have vowed to fight the order, emphasizing the project’s role in meeting climate goals and creating over 1,200 jobs.\nAs the offshore wind sector faces increasing scrutiny under the current administration, the fate of Revolution Wind could signal broader challenges for renewable energy development in the U.S.The Energy News Beat Channel will continue to monitor this story as Ørsted and stakeholders respond to the halt.\nIn a significant blow to the offshore wind industry, the U.S. Department of the Interior’s Bureau of Ocean Energy Management (BOEM) has issued a stop-work order for Ørsted’s Revolution Wind project off the coast of Rhode Island. The directive, announced on August 22, 2025, halts all offshore construction activities on the nearly completed wind farm, citing national security concerns amid the Trump administration’s broader pushback against renewable energy initiatives.\nThis move comes at a precarious time for the Danish energy giant Ørsted, which is already grappling with substantial financial losses and has recently sought a massive capital injection to stabilize its operations.\nProject Overview and Current Status\nRevolution Wind, a joint venture between Ørsted and Skyborn Renewables (formerly Eversource), is designed to generate 704 megawatts (MW) of clean energy—enough to power over 350,000 homes in Rhode Island and Connecticut.\nThe project, located approximately 15 miles south of Rhode Island, features 65 Siemens Gamesa 11-MW turbines and was fully permitted, with construction well underway since late 2023.\nAs of the halt order, the project was approximately 80% complete. All offshore foundations had been installed, and 45 out of the 65 wind turbines were already in place, leaving just 20 turbines remaining to be installed.\nThe wind farm was on track for commercial operations in the second half of 2026, with 400 MW allocated to Rhode Island and 304 MW to Connecticut under 20-year power purchase agreements (PPAs).\nThe total capital cost of the project is estimated at $4 billion, reflecting the scale of investment in infrastructure, turbines, and transmission systems.\nØrsted, holding a 50% stake in the venture, has emphasized that the project complies with all federal and state permits, and the company is now evaluating legal options to challenge the order and resume work.\nPotential Revenue Loss from Uninstalled Turbines\nIf the halt becomes prolonged or permanent, the inability to install the remaining 20 turbines could result in substantial revenue shortfalls. The missing turbines represent about 30.8% of the project’s total capacity (approximately 217 MW, based on the 704 MW overall rating). Assuming a conservative capacity factor of 45% for offshore wind (a standard industry benchmark), the full project would generate roughly 2.78 million megawatt-hours (MWh) of electricity annually. Under the PPAs, Rhode Island’s portion is priced at approximately $98.43 per MWh, while Connecticut’s pricing is comparable, averaging around $90-$98 per MWh across the agreements.\nTo calculate the potential annual revenue loss for the uninstalled turbines: Total annual output for full project: 704 MW × 8,760 hours/year × 45% capacity factor = 2,775,168 MWh.\nRevenue at average $98/MWh: 2,775,168 MWh × $98 = approximately $272 million per year.\nProportion for 20 turbines (20/65 ≈ 0.308): $272 million × 0.308 ≈ $84 million in annual revenue loss.\nOver the 20-year PPA term, this could equate to a cumulative loss of about $1.68 billion (undiscounted), not accounting for escalation clauses or operational costs. This figure assumes the installed turbines can operate independently, which may not be the case if the halt affects the entire project’s commissioning.\nIndustry experts warn that delays could also inflate costs due to idled vessels, labor, and supply chain disruptions, potentially adding hundreds of millions more in expenses.\nBroader Impact on Ørsted’s Financial Woes and Potential Bailout\nThis development exacerbates Ørsted’s ongoing financial challenges, which have been mounting due to project delays, rising interest rates, and political headwinds in the U.S. market. Just two weeks prior, on August 11, 2025, Ørsted announced a $9.4 billion rights issue to bolster its balance sheet amid a 30% plunge in its stock price.\nThe Danish government, Ørsted’s majority shareholder with a 50.1% stake, committed to providing roughly half of the funds—about $4.7 billion—to maintain its ownership level.\nØrsted has already reported impairments on U.S. projects, including a $575 million hit last year partly tied to Revolution Wind delays.\nThe halt could lead to further impairments, eroding the effectiveness of the recent capital raise and prompting calls for additional support. In a statement, Ørsted noted it is assessing the financial implications, including effects on the rights issue, and may pursue litigation to mitigate losses.\nAnalysts suggest this could deepen Ørsted’s projected losses for 2025-2027, potentially necessitating more government intervention from Denmark, where the company is seen as a national champion in green energy.\nState officials in Rhode Island and Connecticut have vowed to fight the order, emphasizing the project’s role in meeting climate goals and creating over 1,200 jobs.\nThe real question not talked about in the news or mainstream media is how much money has been spent on wind and solar in projects that could have been redesigned and not implemented without financial subsidies? Think about how much cheaper energy would be. The second question is how much this will save ratepayers by not completing the installation and looking for alternative natural gas or nuclear for replacement energy?\nAs the offshore wind sector faces increasing scrutiny under the current administration, the fate of Revolution Wind could signal broader challenges for renewable energy development in the U.S.The Energy News Beat Channel will continue to monitor this story as Ørsted and stakeholders respond to the halt.\nAvoid Paying Taxes in 2025\nCrude Oil, LNG, Jet Fuel price quote\nENB Top News\nENB\nEnergy Dashboard\nENB Podcast\nENB Substack\nBe the first to comment"
    },
    {
      "news_title": "Trump Administration Blocks Near-Complete Wind Farm",
      "news_link": "https://capitalisminstitute.org/trump-administration-blocks-near-complete-wind-farm/",
      "bias": "unknown",
      "text": "The Trump administration just slammed the brakes on the Revolution Wind project, a nearly done offshore wind farm just 15 miles south of Rhode Island.\nAccording to NPR, in a move that’s got green energy enthusiasts clutching their solar panels, the administration has ordered a full stop to construction, citing national security concerns, while continuing a broader push against the renewable energy sector with moratoriums and regulatory hurdles.\nLet’s rewind to 2023, when construction kicked off on Revolution Wind, a joint venture between Danish developer Ørsted and Global Infrastructure Partners, with plans to power homes in Rhode Island and Connecticut as early as next year.\nFast forward to now, and the Bureau of Ocean Energy Management’s acting director, Matthew Giacona, has penned a letter to Ørsted, claiming the halt is to protect U.S. national security interests.\nThat’s a hefty claim, but details are scarcer than a conservative at a climate rally—neither the Bureau nor the administration has offered much to chew on beyond the statement.\nThis isn’t the first rodeo for the Trump team; back in January, President Trump slapped a moratorium on new offshore wind developments, signaling a clear pivot away from the renewable push of prior administrations.\nAdding fuel to the fire, the Internal Revenue Service recently tightened the screws with new guidance that makes it tougher for wind and solar projects to snag federal tax incentives.\nMeanwhile, the Commerce Department is poking around, investigating if imported wind turbines and parts pose a national security threat—because apparently, nothing screams danger like a spinning blade offshore.\nLet’s not forget April’s drama, when the Interior Department paused the Empire Wind project off Long Island, with Secretary Doug Burgum griping that the prior administration rushed its approval without proper scrutiny.\nEmpire Wind’s stop-work order was lifted in May, but not before its developer, Norwegian company Equinor, took a financial hit, slashing the value of its investment by nearly $1 billion due to shifting U.S. regulations.\n“The changes in regulations for future offshore wind projects in the U.S.,” Equinor’s CFO Torgrim Reitan noted, were the primary culprit for the massive write-down. Turns out, policy flip-flops can cost more than just political points.\nIndustry voices are sounding the alarm, with Erik Milito of the National Ocean Industries Association warning, “Any pause or uncertainty at this stage could ripple across jobs, contracts, and communities already benefiting from the project.” He’s got a point—stability matters when you’re building the future of energy.\nMilito also highlighted a stark reality: “Today, the U.S. has only one fully operational large-scale offshore wind project producing power.” If we’re serious about meeting rising energy demands, stalling projects like Revolution Wind might leave us all in the dark—literally and figuratively.\nLiz Burdock of the Oceantic Network didn’t mince words either, stating, “For the second time, the Trump Administration has taken unlawful action against a fully permitted offshore wind project under active construction.” While her legal jab stings, it’s hard not to wonder if national security truly trumps nearly 80% completion—or if this is just politics dressed in camouflage.\nJason Grumet of American Clean Power summed up the investor chill with, “The unfortunate message to investors is clear.” He’s not wrong; when the U.S. starts looking like a regulatory rollercoaster, even the boldest companies might think twice before betting on our energy future. But let’s be real—shouldn’t we prioritize American interests over foreign developers’ bottom lines?"
    },
    {
      "news_title": "Trump halts work on New England offshore wind project that’s nearly complete",
      "news_link": "https://biztoc.com/x/57392aad07a5a7f7",
      "bias": "unknown",
      "text": "Why did the US buy a stake in Intel?\nHow will Trump’s furniture tariffs impact retailers?\nWhat caused Keurig Dr Pepper’s $18B coffee deal?\nWhy are National Guard troops in DC now armed?\nHow did Powell’s comments affect the dollar?\nWhy are European postal services suspending US shipments?\nWhat risks come with Intel’s US government investment?\nTrump halts work on New England offshore wind project that’s nearly complete\napnews.com/article/offshore-revolution-wind-project-stopped-trump-33214b9efb8f3f7a98c58299581bff9f\nTrump halts work on New England offshore wind project that’s nearly complete\nThe Trump administration halted construction on a nearly complete offshore wind project near Rhode Island as the White House continues to attack the battered U.S. offshore wind industry that scientists say is…\nThis story appeared on apnews.com, 2025-08-23 20:52:04.454000."
    },
    {
      "news_title": "Trump halts work on New England offshore wind project that's nearly complete - What's Up Newp",
      "news_link": "https://whatsupnewp.com/2025/08/trump-halts-construction-on-nearly-complete-revolution-wind-project/",
      "bias": "unknown",
      "text": "By ISABELLA O’MALLEY Associated Press\nThe Trump administration halted construction on a nearly complete offshore wind project near Rhode Island as the White House continues to attack the battered U.S. offshore wind industry that scientists say is crucial to the urgent fight against climate change.\nDanish wind farm developer Orsted says the Revolution Wind project is about 80% complete, with 45 out of its 65 turbines already installed.\nDespite that progress — and the fact that the project had cleared years of federal and state reviews — the Bureau of Ocean Energy Management issued the order Friday, saying the federal government needs to review the project and “address concerns related to the protection of national security interests of the United States.”\nIt did not specify what the national security concerns are.\nPresident Donald Trump has made sweeping strides to prioritize fossil fuels and hinder renewable energy projects. Trump recently called wind and solar power “THE SCAM OF THE CENTURY!” in a social media post and vowed not to approve wind or “farmer destroying Solar” projects. “The days of stupidity are over in the USA!!!” he wrote on his Truth Social site this week.\nScientists across the globe agree that nations need to rapidly embrace renewable energy to stave off the worst effects of climate change, including extreme heat and drought; larger, more intense wildfires and supercharged hurricanes, typhoons and rainstorms that lead to catastrophic flooding.\nRhode Island Gov. Dan McKee criticized the stop-work order and said he and Connecticut Gov. Ned Lamont “will pursue every avenue to reverse the decision to halt work on Revolution Wind” in a post on X. Both governors are Democrats.\nConstruction on Revolution Wind began in 2023, and the project was expected to be fully operational next year. Orsted says it is evaluating the financial impact of stopping construction and is considering legal proceedings.\nRevolution Wind is located more than 15 miles (24 kilometers) south of the Rhode Island coast, 32 miles (51 kilometers) southeast of the Connecticut coast and 12 miles (19 kilometers) southwest of Martha’s Vineyard. Rhode Island is already home to one offshore wind farm, the five-turbine Block Island Wind Farm.\nRevolution Wind was expected to be Rhode Island and Connecticut’s first commercial-scale offshore wind farm, capable of powering more than 350,000 homes. The densely populated states have minimal space available for land-based energy projects, which is why the offshore wind project is considered crucial for the states to meet their climate goals.\n“This arbitrary decision defies all logic and reason — Revolution Wind’s project was already well underway and employed hundreds of skilled tradesmen and women. This is a major setback for a critical project in Connecticut, and I will fight it,” Connecticut Sen. Richard Blumenthal, a Democrat, said in a statement.\nWind power is the largest source of renewable energy in the U.S. and provides about 10% of the electricity generated in the nation.\n“Today, the U.S. has only one fully operational large-scale offshore wind project producing power. That is not enough to meet America’s rising energy needs. We need more energy of all types, including oil and gas, wind, and new and emerging technologies,” said Erik Milito, president of the National Ocean Industries Association, a group that supports offshore oil, gas and wind.\nGreen Oceans, a nonprofit that opposes the offshore wind industry, applauded the BOEM’s decision. “We are grateful that the Trump Administration and the federal government are taking meaningful action to preserve the fragile ocean environment off the coasts of Rhode Island and Massachusetts,” the nonprofit said in a statement.\nThis is the second major offshore wind project the White House has halted. Work was stopped on Empire Wind, a New York offshore wind project, but construction was allowed to resume after New York Sen. Chuck Schumer and Gov. Kathy Hochul, both Democrats, intervened.\n“This administration has it exactly backwards. It’s trying to prop up clunky, polluting coal plants while doing all it can to halt the fastest growing energy sources of the future – solar and wind power,” said Kit Kennedy, managing director for the power division at Natural Resources Defense Council, in a statement. “Unfortunately, every American is paying the price for these misguided decisions.”\n___\nReporter Jennifer McDermott contributed from Providence, Rhode Island, and Matthew Daly contributed from Washington.\n___\nThe Associated Press’ climate and environmental coverage receives financial support from multiple private foundations. AP is solely responsible for all content. Find AP’s standards for working with philanthropies, a list of supporters and funded coverage areas at AP.org."
    },
    {
      "news_title": "Trump administration halts work on nearly complete offshore wind farm",
      "news_link": "https://www.tag24.com/politics/us-politics/trump-administration-halts-work-on-nearly-complete-offshore-wind-farm-3414294",
      "bias": "unknown",
      "text": "Trump administration halts work on nearly complete offshore wind farm\nWashington DC - The federal government on Friday ordered all construction to be halted on a massive wind farm off the coast of Rhode Island that is 80% complete.\nIt was the latest in a series of orders blocking climate-friendly wind power from the administration of President Donald Trump, who said on Thursday that \"wind doesn't work.\"\nThe Revolution Wind project, which started construction last year after receiving all the necessary permits, is intended to power more than 350,000 homes in Rhode Island, according to its builder, Danish renewables firm Orsted.\nMatthew Giacona, acting director of the Bureau of Ocean Energy Management (BOEM), issued a letter on Friday ordering the project to \"halt all ongoing activities\" to allow time for a review.\n\"In particular, BOEM is seeking to address concerns related to the protection of national security interests in the United States,\" the letter read, without elaborating.\n\"You may not resume activities until BOEM\" has completed the review, it added.\nOrsted said in a statement it is \"evaluating all options to resolve the matter expeditiously,\" including engaging in \"potential legal proceedings.\"\nThe wind farm is 80% complete, with 45 of its planned 65 wind turbines installed, the company said, adding it hopes to finish the project by late next year.\nTrump administration wages war on wind farms\nThe entire wind power sector has faced a major challenge in the US since Trump replaced renewables-friendly Joe Biden in the White House in January.\nTrump has frozen federal permitting and loans for all offshore and onshore wind projects – and repeatedly expressed his distaste for wind power.\n\"It destroys everything, it looks terrible, it's a very expensive form of energy – and we're not doing the wind, we're going back to fossil fuel,\" Trump said in Washington on Thursday.\nAs the US has been blocking and stalling wind power, China and Europe have been breaking records in their embrace of the green energy.\nOrsted, once considered a success story, said last week it is planning to raise $9.4 billion by selling shares after the US setbacks.\nEmpire Wind, another massive wind power project off New York being constructed by Norway's Equinor, was also temporarily halted by the Trump administration in April.\nCover photo: JOHN MOORE / GETTY IMAGES NORTH AMERICA / Getty Images via AFP"
    },
    {
      "news_title": "Trump administration orders halt to construction on Revolution Wind off the coast of Rhode Island",
      "news_link": "https://www.wind-watch.org/news/2025/08/23/trump-administration-orders-halt-to-construction-on-revolution-wind-off-the-coast-of-rhode-island/",
      "bias": "unknown",
      "text": "| Wind Watch is a registered educational charity, founded in 2005. |\nTrump administration orders halt to construction on Revolution Wind off the coast of Rhode Island\nCredit: \"Trump Admin Kills Massive Offshore Wind Project\" · Audrey Streb · August 22, 2025 · dailycaller.com ~~\nThe Daily Caller News Foundation learned on Friday that the Department of the Interior (DOI) is immediately halting all activity on a massive offshore wind project.\n[N.Y. Times: «The Trump administration on Friday ordered that all construction stop on Revolution Wind, a $4 billion wind farm off the coast of Rhode Island that is already mostly built. The 65-turbine project had obtained all necessary permits from the Biden administration, and nearly 70 percent of the turbines have been installed. … Matthew Giacona, the acting director of the Bureau of Ocean Energy Management, issued a letter on Friday to Orsted, the Danish company building the wind farm, ordering it to “halt all ongoing activities” because of unspecified issues. In particular, BOEM is seeking to address concerns related to the protection of national security interests in the United States,” Mr. Giacona wrote, adding that Orsted “may not resume activities” until the agency has completed a review of the project. … Last week, Orsted said that it needed to raise an additional $9.4 billion to shore up its finances as it attempted to complete both Revolution Wind and Sunrise Wind, another large offshore wind project near Long Island, while contending with an industry downturn that has been exacerbated by President Trump’s opposition to wind farms.»]\nThe Bureau of Ocean Energy Management (BOEM) under the DOI is halting activity on the “Revolution Wind” project off the coast of Rhode Island and Connecticut in line with President Donald Trump’s energy goals to boost reliable energy resources and lower costs for Americans, the agency told the DCNF. The Trump administration has dealt a series of recent blows to the wind industry, with the DOI ending “preferential treatment” for what it considers to be foreign-controlled and unreliable energy sources and moving to terminate the massive Lava Ridge Wind Project in southern Idaho that the Biden administration approved just weeks before Trump’s return to office.\n“Americans deserve energy that is affordable, reliable, and built to last – not experimental and expensive wind projects that are proven failures,” DOI deputy press secretary Aubrie Spady told the DCNF. “In line with President Donald Trump’s Energy Dominance Agenda, Interior is putting an immediate stop to these costly failures to deliver a stronger energy future and lower costs for American families. Like President Trump said, ‘the days of stupidity are over in the USA!’”\nThe Biden administration approved the construction plan for Revolution Wind in 2023, which is located on the federally-owned Outer Continental Shelf. While former President Joe Biden pushed for wind and solar technology throughout his term by greenlighting billions in subsidies, loans and grants, the Trump administration has shifted its focus to conventional and reliable energy sources and taken action to crackdown on federal support for the green energy technology the Biden administration favored.\nTrump signed an executive order directing the DOI to “revise any identified regulations, guidance, policies, and practices as appropriate and consistent with applicable law to eliminate any such preferences for wind and solar facilities” on July 7. Trump campaigned against Biden’s push for green energy and has continued to rail against Biden’s climate agenda, writing on Truth Social Wednesday that “any State that has built and relied on WINDMILLS and SOLAR for power are seeing RECORD BREAKING INCREASES IN ELECTRICITY AND ENERGY COSTS. THE SCAM OF THE CENTURY! We will not approve wind or farmer destroying Solar. The days of stupidity are over in the USA!!! MAGA.”\nThe agency introduced an additional permitting roadblock for green energy projects on public lands on Aug. 1., and a few days later, Interior Secretary Doug Burgum wrote on X that wind projects “are known to kill eagles” and that his agency would enforce the Bald and Golden Eagle Protection Act to protect eagles. The Trump administration also pulled a permit for a massive pending New Jersey offshore wind project in March.\nThe wind industry has come under fire in recent years, as multiple beaches closed in 2024 after a broken wind turbine shed debris into the ocean off the coast of Nantucket and protests surged due to concerns about high-voltage cables running through neighborhoods in 2023. Environmentalists also raised concerns over the energy technology after dolphins washed up along the East Coast in 2023.\nSome fishermen have also voiced opposition to offshore wind projects, arguing that their industry cannot survive alongside offshore wind farms.\n[N.Y. Times: «Green Oceans, a nonprofit group that has sued over the approvals of federal permits for Revolution Wind, praised the Trump administration’s move. “This decisive action demonstrates that the federal government finally recognizes the seriously flawed permitting process that allowed this project and others to move forward,” the group said in a statement.\n[«The Trump administration’s move against Revolution Wind is the latest in a series of its escalating attacks against the wind industry. On Thursday, the Commerce Department opened a trade investigation into imported wind turbines and their components. The probe could result in further tariffs on the wind industry that could increase costs for offshore projects that are already underway. Two weeks ago, the administration said it was reversing a Biden administration decision to approve the Lava Ridge Wind Project, a giant wind farm planned for southern Idaho. The administration said it had discovered “legal deficiencies” in the original approval but did not provide details. And the Interior Department had signaled last month that it would consider revoking federal permits for wind projects that opponents have sued over, even if those projects were already under construction.\n[«In April, the Trump administration ordered a halt to work at Empire Wind, a $5 billion wind farm off the coast of Long Island that was already being built, without publicly providing a justification. After a month of negotiations with Gov. Kathy Hochul, Democrat of New York, the administration let Empire Wind move forward, but administration officials suggested that they had done so only after Ms. Hochul agreed to approve new gas pipelines in the state. Ms. Hochul has denied that any such deal was made. Equinor, the developer behind Empire Wind, recently said that those delays and other regulatory changes affecting U.S. offshore wind projects had cost the company nearly $1 billion. …\n[«The Biden administration had tried to accelerate the development of offshore wind, which is commonplace in Europe but barely exists in the United States, and approved nearly a dozen commercial-scale wind farms in the Atlantic Ocean. Yet some of those projects foundered as a result of soaring costs, high interest rates, supply chain delays and bursts of local opposition.\n[«Only a handful of offshore wind projects in the United States are still under construction, including Empire Wind and Sunrise Wind off New York; Vineyard Wind near Martha’s Vineyard, Mass.; and the Coastal Virginia Offshore Wind project. In the wake of Mr. Trump’s election, some companies have said they will halt plans to develop any more offshore wind projects in the country for the foreseeable future.»]\nThis article is the work of the source indicated. Any opinions expressed in it are not necessarily those of National Wind Watch.\nThe copyright of this article resides with the author or publisher indicated. As part of its noncommercial educational effort to present the environmental, social, scientific, and economic issues of large-scale wind power development to a global audience seeking such information, National Wind Watch endeavors to observe “fair use” as provided for in section 107 of U.S. Copyright Law and similar “fair dealing” provisions of the copyright laws of other nations. Send requests to excerpt, general inquiries, and comments via e-mail.\n| Wind Watch relies entirely on User Contributions |\n(via Stripe) |\n(via Paypal) |\nShare:"
    },
    {
      "news_title": "Trump halts work on New England offshore wind project that’s nearly complete - Regional Media News",
      "news_link": "https://www.regionalmedianews.com/news/national/trump-halts-work-on-new-england-offshore-wind-project-thats-nearly-complete/",
      "bias": "unknown",
      "text": "The Trump administration halted construction on a nearly complete offshore wind project near Rhode Island as the White House continues to attack the battered U.S. offshore wind industry that scientists say is crucial to the urgent fight against climate change.\nDanish wind farm developer Orsted says the Revolution Wind project is about 80% complete, with 45 out of its 65 turbines already installed.\nDespite that progress — and the fact that the project had cleared years of federal and state reviews — the Bureau of Ocean Energy Management issued the order Friday, saying the federal government needs to review the project and “address concerns related to the protection of national security interests of the United States.”\nIt did not specify what the national security concerns are.\nPresident Donald Trump has made sweeping strides to prioritize fossil fuels and hinder renewable energy projects. Trump recently called wind and solar power “THE SCAM OF THE CENTURY!” in a social media post and vowed not to approve wind or “farmer destroying Solar” projects. “The days of stupidity are over in the USA!!!” he wrote on his Truth Social site this week.\nScientists across the globe agree that nations need to rapidly embrace renewable energy to stave off the worst effects of climate change, including extreme heat and drought; larger, more intense wildfires and supercharged hurricanes, typhoons and rainstorms that lead to catastrophic flooding.\nRhode Island Gov. Dan McKee criticized the stop-work order and said he and Connecticut Gov. Ned Lamont “will pursue every avenue to reverse the decision to halt work on Revolution Wind” in a post on X.\nConstruction on Revolution Wind began in 2023, and the project was expected to be fully operational next year. Orsted says it is evaluating the financial impact of stopping construction and is considering legal proceedings.\nRevolution Wind is located more than 15 miles (24 kilometers) south of the Rhode Island coast, 32 miles (51 kilometers) southeast of the Connecticut coast and 12 miles (19 kilometers) southwest of Martha’s Vineyard. Rhode Island is already home to one offshore wind farm, the five-turbine Block Island Wind Farm.\nRevolution Wind was expected to be Rhode Island and Connecticut’s first commercial-scale offshore wind farm, capable of powering more than 350,000 homes. The densely populated states have minimal space available for land-based energy projects, which is why the offshore wind project is considered crucial for the states to meet their climate goals.\n“This arbitrary decision defies all logic and reason — Revolution Wind’s project was already well underway and employed hundreds of skilled tradesmen and women. This is a major setback for a critical project in Connecticut, and I will fight it,” Connecticut Sen. Richard Blumenthal said in a statement.\nWind power is the largest source of renewable energy in the U.S. and provides about 10% of the electricity generated in the nation.\nGreen Oceans, a nonprofit that opposes the offshore wind industry, applauded the BOEM’s decision. “We are grateful that the Trump Administration and the federal government are taking meaningful action to preserve the fragile ocean environment off the coasts of Rhode Island and Massachusetts,” the nonprofit said in a statement.\nThis is the second major offshore wind project the White House has halted. Work was stopped on Empire Wind, a New York offshore wind project, but construction was allowed to resume after New York Sen. Chuck Schumer and Gov. Kathy Hochul intervened.\n“This administration has it exactly backwards. It’s trying to prop up clunky, polluting coal plants while doing all it can to halt the fastest growing energy sources of the future – solar and wind power,” said Kit Kennedy, managing director for the power division at Natural Resources Defense Council, in a statement. “Unfortunately, every American is paying the price for these misguided decisions.”\n___\nReporter Jennifer McDermott contributed from Providence, Rhode Island, and Matthew Daly contributed from Washington.\n___\nThe Associated Press’ climate and environmental coverage receives financial support from multiple private foundations. AP is solely responsible for all content. Find AP’s standards for working with philanthropies, a list of supporters and funded coverage areas at AP.org.\nBrought to you by www.srnnews.com"
    },
    {
      "news_title": "Department of government efficiency - Lawyers, Guns & Money",
      "news_link": "https://www.lawyersgunsmoneyblog.com/2025/08/department-of-government-efficiency",
      "bias": "unknown",
      "text": "Department of government efficiency\nWasting money and raising energy prices because of a combination of being in political hock to fossil fuel interests and having seen a mediocre stand-up routine about wind power on Jay Leno or something:\nThe Trump administration on Friday ordered that all construction stop on Revolution Wind, a $4 billion wind farm off the coast of Rhode Island that is already mostly built.\nThe 65-turbine project had obtained all necessary permits from the Biden administration, and nearly 70 percent of the turbines have been installed. The developers behind the project had said it was on track to produce enough electricity for more than 350,000 homes in Rhode Island and Connecticut by next spring.\nMatthew Giacona, the acting director of the Bureau of Ocean Energy Management, issued a letter on Friday to Orsted, the Danish company building the wind farm, ordering it to “halt all ongoing activities” because of unspecified issues.\n“In particular, BOEM is seeking to address concerns related to the protection of national security interests in the United States,” Mr. Giacona wrote, adding that Orsted “may not resume activities” until the agency has completed a review of the project.\nWe’re living in a perpetual Anne Gorsuch revenge fantasy."
    },
    {
      "news_title": "Trump halts Orsted’s US Revolution Wind",
      "news_link": "https://www.rechargenews.com/policy/trump-halts-orsted-s-us-revolution-wind/2-1-1861582",
      "bias": "unknown",
      "text": "Trump halts Orsted’s US Revolution Wind\nAdministration issues stop-work order against array already 80% complete to address ‘national security concerns’\nAdministration issues stop-work order against array already 80% complete to address ‘national security concerns’"
    }
  ]
}