{
  "story_id": "GN_20250827_041417_c3d8c3ae",
  "metadata": {
    "title": "DNC Chair Withdraws Gaza Resolution, Calls for Task Force to ‘Move Forward United’",
    "timestamp": "2025-08-27T04:14:17.498656",
    "url": "https://ground.news/article/dnc-chair-withdraws-gaza-resolution-calls-for-task-force-to-move-forward-united_9ea8d9"
  },
  "bias_distribution": {
    "total_sources": "24",
    "leaning_left": "6",
    "center": "14",
    "leaning_right": "4"
  },
  "perspective_summaries": {
    "left": [
      "The Democratic National Committee voted down a resolution that urged a suspension of military aid to Israel and called for an immediate ceasefire in Gaza.",
      "DNC Chair Ken Martin announced the formation of a task force to discuss the issue further after the resolution's rejection, emphasizing the need for party unity.",
      "Supporter Sophia Danenberg remarked that Democratic voters want a stronger statement on the issue, criticizing the DNC for not taking a stronger stance.",
      "Delegate Asra Nizami pointed out that many party members expressed support for the resolution, yet the DNC voted it down, highlighting tensions within the party."
    ],
    "center": [
      "On August 26, 2025, the Democratic National Committee met in Minneapolis where Chair Ken Martin withdrew his resolution on the Israel-Hamas war to allow more inclusive discussion.",
      "The withdrawal came after a panel discussion featuring Martin’s resolution advocating for a ceasefire and humanitarian assistance, contrasted with a progressive proposal calling for halting weapons shipments and ending military support to Israel.",
      "Martin’s resolution passed initially but faced criticism for not addressing Israel's response to Hamas' October 7, 2023 attack, while the progressive resolution failed via voice vote amid party division.",
      "Ahead of the vote, party activists sent nearly 5,000 emails expressing their views, and Martin emphasized the need for the party to move ahead together and maintain unity.",
      "The withdrawal signals continued debate within Democrats, prompting Martin to form a task force to include diverse voices and potentially revisit an official position at a future meeting."
    ],
    "right": [
      "The Democratic National Committee's resolution supporting an embargo of military aid to Israel was voted down.",
      "Chairman Ken Martin withdrew a proposal that had passed, leaving the party without an official stance on the Middle East conflict.",
      "The North Carolina Democratic Party's State Executive Committee declared Israel guilty of apartheid against Palestinians on June 28.",
      "Responses from Democratic U.S. Representatives concerning the state party resolution have not been received."
    ]
  },
  "sources": [
    {
      "news_title": "US Democrats fail to pass competing resolutions on Israel's war on Gaza",
      "news_link": "https://www.aa.com.tr/en/americas/-us-democrats-fail-to-pass-competing-resolutions-on-israels-war-on-gaza/3669964",
      "bias": "Right",
      "text": "US Democrats fail to pass competing resolutions on Israel's war on Gaza\nDemocratic chair withdraws resolution reflecting establishment position on Israel, says he will form committee to 'work through' matter\nWASHINGTON\nStark internal divides within the Democratic Party were on full display Tuesday as it failed to advance competing motions related to the party's official positions on Israel and its war on the Gaza Strip.\nAn initial resolution demanding the unrestricted flow of humanitarian aid into the besieged enclave, an end to the war and a long elusive two-state solution easily sailed through the Democratic National Committee's (DNC) resolution panel without opposition.\nBut it was later pulled by DNC Chair Ken Martin in an abrupt and highly unusual action, which he said he took to allow for the party to reach a consensus after a competing resolution supportive of an arms embargo was rejected.\n\"I know there are some who are interested in making changes today. As we've seen, there's divide in our party on this issue,\" said Martin, who had introduced the resolution.\n\"This is a moment that calls for shared dialogue. It calls for shared advocacy, and that's why I've decided today, at this moment, listening to testimony, and listening to people in our party to withdraw my amendment and resolution to allow us conversation on this as a party,\" he added.\nMartin said he would be establishing a task force or committee \"comprised of stakeholders on all sides of\" the issue to \"work through\" the matter.\nThe resolution Martin put forward is largely in line with the position of the establishment wing of the party and reflects the official Democratic platform. But a younger, more liberal cohort has demanded further action in response to Israel's war, which has soured support within the party's base for continued US support for Israel.\nAllison Minnerly, a 26-year-old youth organizer from the state of Florida, introduced resolution 18, which demands that the party support an arms embargo on Israel, an immediate ceasefire, and recognition of Palestine in response to the mass death and starvation being inflicted on Gaza's civilian population.\nShe referenced Martin's motion, saying her competing resolution would \"achieve several things not outlined\" in it, including aligning the DNC with the will of Democratic voters.\n\"This is a moment that calls for leadership, listening and hard conversations. We urge that beyond calling for a ceasefire, that we acknowledge the devastation, and we also outline actionable items for our elected officials within the Democratic Party to align ourselves with the voters of our base,\" she said to raucous applause and cheers.\nA survey from the Economist/YouGov released last week found just 25% of Democratic voters support increasing or maintaining US military support for Israel. And 38% said military aid should be halted altogether, while another 20% said it should be reduced, a reflection of Democratic anger about the war.\nThe DNC panel rejected the progressive motion via voice vote, and while no one spoke in direct opposition, an amendment offered by Stephanie Beal to condition the arms embargo solely to offensive weapons and add language demanding the return of all hostages held in Gaza, was rejected.\nMartin's move to withdraw his resolution comes at a pivotal moment for the Democratic Party as it prepares to head into next year's high-stakes midterm elections. Gaza proved to be a critical issue for voters during last year's presidential election cycle when Democrats lost the White House and control of the Senate.\nA poll released in January by the Institute for Middle East Understanding's Policy Project and YouGov found that 29% of voters who cast ballots for former President Joe Biden in 2020, but voted for someone besides his successor, Kamala Harris, in 2024, said \"ending Israel’s violence in Gaza\" was their top issue.\nThat issue was cited the most by voters who backed Biden, but not Harris, followed closely by the economy at 24%.\nIt is exceedingly rare for a foreign policy issue to motivate American voters, but the gravity of the US-supported war and the human toll appear to have done just that.\nIsrael has killed nearly 63,000 Palestinians in Gaza since October 2023. The military campaign has devastated the enclave, which is facing famine.\nLast November, the International Criminal Court issued arrest warrants for Israeli Prime Minister Benjamin Netanyahu and his former Defense Minister Yoav Gallant for war crimes and crimes against humanity in Gaza. Israel also faces a genocide case at the International Court of Justice for its war on the enclave."
    },
    {
      "news_title": "DNC summer meeting derailed after tensions flare over dueling resolutions: 'Losing our future'",
      "news_link": "https://www.foxnews.com/politics/dnc-summer-meeting-derailed-after-tensions-flare-dueling-resolutions-losing-future",
      "bias": "Right",
      "text": "MINNEAPOLIS, MN - Growing discord between Democrats over the ongoing war in Gaza between Israel and Hamas flared during the second day of the Democratic National Committee's (DNC) summer meeting.\nThe tension came as a key DNC committee voted down a symbolic resolution calling for an arms embargo and suspension of U.S. military aid to Israel, which has long been the top American ally in the Middle East.\nThe DNC's Resolutions Committee, in a separate vote, unanimously passed a resolution reaffirming the party's support for diversity, equity, and inclusion values amid a massive conservative backlash in recent years.\nBut grabbing the spotlight on Tuesday as more than 400 elected party officials from all 50 states and seven territories huddled in Minnesota's largest city this week was the war in Gaza, which was sparked by the horrific Oct. 7, 2023, ambush by Hamas on Israel.\nDNC CHAIR DEMANDS DEMOCRATS ‘STOP BRINGING A PENCIL TO A KNIFE FIGHT'\nA resolution introduced and supported by DNC chair Ken Martin that called for a ceasefire between Israel and Hamas, as well as unrestricted access for humanitarian aid to civilians in Gaza, was unanimously passed by the panel.\nBut the defeat of the second, more forceful resolution, which was introduced by 26-year-old Allison Minnerly, a new DNC member from Florida, sparked opposition among some members on the panel.\n\"It’s not enough,\" DNC committee member from Washington D.C. Sophia Danenberg said, as she pointed to Martin's resolution. \"People want to hear a louder, stronger, statement.\"\nDNC CHAIR TELLS FOX NEWS PARTY HAS HIT ‘ROCK BOTTOM’\nDanenberg emphasized, \"I do fear that we're losing our future as the Democratic Party by not being courageous on this issue.\"\nMinutes later, following a private conversation between Martin and Minnerly, the DNC chair asked the committee to \"withdraw my resolution so we can move united today and have the conversation.\"\nMartin's stunning move was embraced by the committee.\nNearly 1,200 people in Israel were killed after Hamas ambushed them, with over 250 people taken hostage. In the nearly two years since the attack, over 60,000 Palestinians have allegedly been killed by Israel's ongoing military response, according to the Hamas-run health ministry in Gaza.\nCLICK HERE FOR THE LATEST FOX NEWS REPORTING ON THE ISRAEL-HAMAS WAR\nAnd the showdown over the resolutions comes as the Democratic Party's once nearly unshakable support for Israel has fractured amid the bloodshed. And concerns over the growing death toll among Palestinians by many in the party's progressive base have soared this spring and summer, amid what many describe as a famine in Gaza. Recent polling indicates support for Israel's continued military actions in Gaza is plummeting among Democrats.\nThe split in the party is partially between an older and more moderate wing that is cautious when it comes to blaming Israel, and a younger and more progressive wing that wants robust action in response to the human suffering in Gaza.\n\"One thing all of this room can agree on is that the crisis in Gaza is urgent,\" Martin said as he introduced his resolution. This resolution is focused on the humanitarian crisis and makes clear that it must be addressed as the emergency that it is.\"\nAnd Martin's resolution also called for \"long-term peace through a two-state solution\" between Israel and the Palestinians.\nMinnerly said her more forceful resolution would \"ensure that the Democratic Party will follow the will of our voters and call for an end to U.S. involvement in this particular tragedy. The resolution was drafted in consultation with Palestinians and many folks directly impacted by this ongoing humanitarian crisis.\"\nMartin, after calling for the withdrawal of his competing resolution, urged that Democrats to \"move forward in a conversation on this as a party. We need to keep working through this. We have to find a path forward as a party, and we have to stay unified.\"\nAnd the chair said he would \"appoint a committee or taskforce comprised of stakeholders on all sides of this to continue to have the conversation.\"\nBut Minnerly, after the committee adjourned, told reporters, \"I think it's disappointing that the conversation is ending here today and that at this DNC meeting there's going to be no further conversation on Gaza when it's so over due and so critical to people.\"\nAnd Joe Salas, a DNC committee member from California and a Muslim American, told Fox News after the defeat of Minnerly's resolution, that \"I think there is a disconnect between the people on the committee and the average lock-stock-and-barrel voters who identify with the Democratic Party.\"\nWhile the outcome left many disappointed, the debate was orderly and there were no protests or disruptions of the committee meeting.\nThe Republican National Committee, following the meeting, blasted Martin.\n\"Weak DNC Chair Ken Martin was bullied by radical Antisemitic members to withdraw a resolution that recognizes Israel's right to exist,\" the RNC charged in a social media post.\nThe competing Gaza resolutions were among 19 resolutions voted on by the panel.\nAmong them was the DEI resolution, which called for \"Affirming the American Values of Diversity, Equity, and Inclusion.\"\nThe author of the resolution, DNC member Bill Owen of Tennessee, a former state senator, said \"to my Republican friends and fellow citizens…who profess to be active Christians, I remind them that D.E.I. is the very foundation of the Christian church. I get a little emotional on this, but Jesus loves little children. All the children of the world. Red and yellow, black and white.\"\nPresident Donald Trump and Republicans, during last year's campaign, repeatedly took aim at Democrats over their support for DEI efforts and transgender rights, turning them into political liabilities.\nCLICK HERE TO GET THE FOX NEWS APP\nAnd following the Democrats' setbacks in last year's elections, when the party lost control of the White House, the Senate, and failed to win back the House majority, some in the party have second-guessed their long support for DEI and transgender rights.\nThe resolutions passed Tuesday by the panel will face votes on Wednesday by the entire DNC membership during the national party committee's closing general session."
    },
    {
      "news_title": "National Democrats vote down Israel resolution similar to North Carolina",
      "news_link": "https://www.thecentersquare.com/north_carolina/article_9ca76db2-4baf-4732-9a8f-d9d3e42a2d28.html",
      "bias": "Lean Right",
      "text": "(The Center Square) – A resolution by the Democratic National Committee, similar to one by North Carolina Democrats calling for an embargo of military aid to Israel, has been voted down.\nAnother without the military embargo was withdrawn after passing, leaving the national party without a full official position. For now, at least.\nOn Tuesday in Minneapolis, the expected thrust forward with a position on the Middle East war between Hamas and Israel derailed. Two resolutions were debated, one inclusive of the arms embargo, and the dust settled with Chairman Ken Martin withdrawing his proposal that had passed.\nThe State Executive Committee for the North Carolina Democratic Party on June 28 adopted a resolution declaring Israel guilty of apartheid against Palestinians; genocide in Gaza; and using American weapons in “self defense” against hospitals, schools, homes, refugee camps, mosques, churches, journalists and humanitarian aid workers.\nThe resolution calls for an immediate embargo on all military aid, weapons shipments and military logistical support from the United States to Israel.\nThe language says the embargo would be supported until “Amnesty International, Human Rights Watch, and B’tselem certify that Israel is no longer engaged in apartheid rule.”\nThe United States has long been an ally of Israel in the Middle East, including being the first to recognize it as an independent state in 1948 under President Harry Truman.\nThe Center Square has waited for more than a month on responses via email getting an answer of being in support or against the state party resolution from Democratic U.S. Reps. Alma Adams, Valerie Foushee, Deborah Ross or Don Davis. Also checked were Democrats on the Council of State – Gov. Josh Stein, Lt. Gov. Rachel Hunt, Attorney General Jeff Jackson, Secretary of State Elaine Marshall and Public Instruction Superintendent Mo Green.\nFormer Gov. Roy Cooper, Democratic candidate for the U.S. Senate race in 2026, is quiet as well. The Center Square was unsuccessful via email getting comment from the office of Morgan Jackson, a managing partner at Nexus Strategies that handles political consulting for Cooper."
    },
    {
      "news_title": "DNC rejects resolution to suspend U.S. military aid to Israel amid party divide",
      "news_link": "https://www.haaretz.com/israel-news/2025-08-26/ty-article/.premium/dnc-rejects-resolution-to-suspend-u-s-military-aid-to-israel-amid-party-divide/00000198-e717-d8de-a3bb-e79f59250000",
      "bias": "Lean Left",
      "text": "DNC Rejects Resolution to Suspend U.S. Military Aid to Israel Amid Party Divide\nWASHINGTON - The Democratic National Committee rejected a proposed resolution calling for suspended U.S. military aid to Israel at its annual summer meeting, in a vote considered to be a litmus test on how far discontent toward Israel's actions toward the Palestinians could impact longstanding official policy."
    },
    {
      "news_title": "Democratic leaders withdraw measure clarifying the party position on the Israel-Hamas war",
      "news_link": "https://apnews.com/article/democratic-national-committee-israel-gaza-resolution-bc8ec0b1f58d086393019a494fd35fbf",
      "bias": "Lean Left",
      "text": "Democratic leaders withdraw measure clarifying the party position on the Israel-Hamas war\nMINNEAPOLIS (AP) — The Democratic National Committee planned to clarify its position on the Israel-Hamas war this week. But after a surprise reversal, it may be several months before DNC officials adopt a formal position on an issue that has divided their party perhaps more than any other.\nThe debate played out on Tuesday as the DNC gathered in a downtown Minneapolis hotel behind a security checkpoint for its annual summer meeting.\nThere were two competing resolutions that addressed the war and the related humanitarian crisis in Gaza: The first, introduced by the committee’s progressive wing, called for an arms embargo and the suspension of military aid to Israel; the other, backed by DNC Chair Ken Martin, offered more context from Israel’s perspective while calling for an immediate ceasefire, the unconditional release of all hostages and the unrestricted delivery of humanitarian assistance — including food, water, medicine and shelter — to civilians in Gaza.” It also reaffirmed the Democrats’ support for a two-state solution.\nThe DNC’s Resolutions Committee voted to support Martin’s version and voted down the progressives’ preference. But after a brief debate, Martin surprised many in the crowded hotel ballroom by deciding to withdraw his measure.\nHe called instead for members to form a task force to study the issue further.\n“As we’ve seen there’s divide in our party on this issue,” Martin said. “I’ve decided today, at this moment, to listen … so we can move forward united today and have the conversation.”\nThe delay prolongs a sensitive political debate that has divided Democrats for much of the last year. Resolutions Committee members said they received nearly 5,000 emails about the resolution from activists on both sides ahead of Tuesday’s vote.\nEven when the party adopts a formal position — if at all — the issue threatens to continue dividing Democratic voters heading into next year’s midterm elections. Any DNC resolution would be a symbolic measure with no real power.\nDNC member Allison Minnerly of Florida, who sponsored the progressive version, said she was disappointed by Martin’s decision.\n“There needs to be urgency,” Minnerly said. “The majority of our party is looking for answers and leadership on this issue.”\nIt’s unclear when Martin’s yet-unformed task force would report back with an updated position. Martin did not offer a timeline. The DNC is expected to meet again in December.\nHarini Krishnan, a DNC member from California, was among several officials to express their frustration.\n“I also want to say that I truly hope as a party that we can move beyond this issue,” she said."
    },
    {
      "news_title": "DNC Votes Down Resolution Calling for Israeli Arms Embargo to Halt US Complicity in Gaza Genocide",
      "news_link": "https://www.commondreams.org/news/dnc-israel-embargo-resolution",
      "bias": "Left",
      "text": "The Democratic National Committee on Tuesday voted down a resolution calling for a suspension of military aid to Israel in the midst of a famine in Gaza that is a direct result of Israel's near-total blockade on humanitarian aid.\nThe resolution in question would have urged elected members to call for an immediate ceasefire in the Gaza conflict, as well as an arms embargo on Israel. It also would have urged the recognition of Palestine as a state, following the examples of countries such as France and Australia, which have announced intentions to formally recognize Palestine next month.\nThe resolution was rejected in a voice vote, with the \"nays\" strong enough to see it struck down. Five abstentions were recorded.\nNOTUS reports that, in the wake of the resolution's failure, DNC Chairman Ken Martin announced that he \"was forming a task force to continue discussion of the issue, indicating that the committee planned to consider a new resolution about the issue at a later date.\"\nBut following the declaration of famine in Gaza, and with US support for Israel clearly violating the country's own laws—including Section 620I of the Foreign Assistance Act, which bars the US from providing military aid to countries that are blocking humanitarian aid—the rejection of the resolution incensed its supporters.\nSophia Danenberg, a delegate from Washington state who spoke in favor of the Israeli arms embargo resolution, said she believes Democratic voters \"want to hear a louder, stronger statement, and this isn't the time for subtlety.\"\nShe acknowledged the atrocities committed by terrorist organization Hamas in its attack on Israel on October 7, 2023, but she said that this \"does not justify the actions of this right-wing [Israeli] regime—massacring and starving and slaughtering the Palestinian people.\"\nDanenberg added that the DNC could be \"losing the future of the Democratic Party by not being courageous\" on the issue of Israel's assault on Gaza, which has killed at least 62,819 Palestinians, orphaned tens of thousands of children, and created the world's largest population of child amputees.\nMargaret DeReus, the executive director of IMEU Policy Project, was even more scathing in her denunciation of the DNC for voting down the resolution and directly called out the influence of pro-Israel groups that have spent millions to defeat progressives like former Rep. Cori Bush (D-Mo.), one of the first Democratic lawmakers to demand a ceasefire after Israel began its assault on Gaza in 2023.\n\"It's another sign of just how out of touch Democratic Party leadership is today that dark money groups like [Democratic Majority for Israel]—that have spent millions in Democratic primaries to unseat progressives who stand for human rights for all people—were consulted ahead of DNC Chair Ken Martin's decision to introduce his bland resolution, while advocates for Palestinian rights who represent most Democrats were once again shut out and ignored,\" she said. \"Sadly, this has been standard practice for a historically unpopular Democratic leadership that will not win elections until it decides to become a political party that actually listens to its voters.\"\nOrganizer Asra Nizami noted that \"members acknowledged getting hundreds of calls and emails\" about supporting the resolution, but voted it down nonetheless.\n\"This party keeps digging its own grave. And it's owned by AIPAC,\" said Nizami, referring to the pro-Israel American Israel Public Affairs Committee, which donated more than $24 million to Democratic candidates in 2024.\nAs Common Dreams reported last month, public support for Israel's US-backed bombardment of Gaza has plummeted in recent months, with just 8% of Democratic voters supporting the action.\nJosh Ruebner, IMEU Policy Project's policy director, accused Democrats of being \"wildly out of touch with their base who overwhelmingly want to block bombs to Israel and end US complicity in its genocide of Palestinians as shown by poll after poll.\"\nJames Zogby, founder and president of the Arab American Institute (AAI) and former member of the DNC executive committee, told Common Dreams that even though he had lobbied in favor of the resolution calling for the arms embargo, he was still pleased with the outcome of Tuesday's meeting.\nThe DNC, Zogby said, had a discussion about the issue of Israel-Palestine that he said never heard before. He said that what Ken Martin did by withdrawing his resolution and instead creating a task force to discuss the issue further \"remarkable\" given the party's historic position.\nZogby credited the heroic efforts by Allison Minnerly, the 26-year-old new DNC member from Florida who introduced the arms embargo, for her \"incredible work\" in bringing people together on the issue, generating many thousands of direct emails and calls to members of the resolution committee. The outcome was not what she and others hoped for, said Zogby, but Martin's decision on the weaker of the two resolutions and the creation of the task force should be seen as a \"big deal\" and \"incredible\" progress in the fight for Palestinian rights inside the party."
    },
    {
      "news_title": "DNC chair pledges to facilitate 'conversation' in the party about Israel amid clashing resolutions",
      "news_link": "https://www.nbcnews.com/politics/politics-news/dnc-chair-pledges-facilitate-conversation-party-israel-clashing-resolu-rcna227231",
      "bias": "Lean Left",
      "text": "MINNEAPOLIS — Democratic National Committee members on Tuesday clashed over how to address Israel's actions in the war in Gaza, prompting the party chair to withdraw a resolution on the matter and move to instead address concerns brought by a younger faction agitating for a stronger stance.\nThe move came after a DNC panel passed a resolution from chair Ken Martin that called for a ceasefire and the free flow of aid to Gaza — and then blocked a second resolution that called for an arms embargo and suspension of military aid to Israel.\nAs party leaders announced the rival resolution had failed, one man stood up and, referring to the strong rank-and-file support for a harsher stand on Israel, called out loudly: “Ninety-three percent of Democrats — you gotta be f---ing kidding me.\"\nMartin, seeing that the party was divided on the issue, announced that he would pull his resolution and instead further study it to include the voices of younger voters who were pushing for a harder line on Israel.\nMartin said he decided to withdraw his resolution to \"allow us to move forward in a conversation on this as a party, we need to keep working through this,\" he said. While calling the situation in Gaza \"urgent,\" he said, \"We have to find a path forward as a party, and we have to stay unified.\"\nAllison Minnerly, a 26-year-old Democratic National Committee member from Florida who had pushed for Democrats to advocate for an arms embargo and suspension of military aid to Israel, said Martin had not reached out to her before Tuesday, when he jumped from his chair and pulled Minnerly aside in a private chat after her resolution failed.\nMinnerly said that since her stance on the war and her proposed amendment became public, she has been swamped with shows of support from around the nation.\n\"The majority of our party is looking for answers and leadership on this issue, and they're going to continue sending emails like the almost 200,000 that were sent just this week,\" Minnerly told reporters. \"I will not be surprised if the activism and organizing continues.\"\nMinnerly said she hoped Martin would include her in future conversations to help shape the DNC's ultimate position on the issue.\n\"There needs to be urgency. When we reach a point of 90-10 issue within the party, the voters are more than ready to have this decided and resolved,\" she said, referring to a July Gallup poll. \"It's just a matter of when is the party going to start listening.\""
    },
    {
      "news_title": "DNC chair withdraws Gaza resolution, calls for task force to ‘move forward united’",
      "news_link": "https://thehill.com/homenews/campaign/5470913-dnc-task-force-israel-gaza/",
      "bias": "Center",
      "text": null
    },
    {
      "news_title": "DNC panel fails to advance dueling resolutions on Israel’s war in Gaza",
      "news_link": "https://www.cnn.com/2025/08/26/politics/dnc-israel-gaza-resolution-vote",
      "bias": "Lean Left",
      "text": "A Democratic National Committee panel on Tuesday failed to advance dueling resolutions on the party’s stance on Israel’s war in Gaza, after one proposal was voted down and a second was withdrawn.\nThe DNC’s resolutions panel considered two measures Tuesday morning at the committee’s summer meeting in Minneapolis: a proposal introduced by chair Ken Martin that echoed language in the party’s platform on the issue and a resolution backed by progressives that called for a suspension of military aid to Israel.\nThe panel unanimously advanced Martin’s resolution and voted down the resolution calling for an arms embargo. Martin later made the stunning decision to withdraw his resolution to allow for further discussion, a motion that was also supported by the whole committee.\n“I know that there are some who are interested in making changes today, but as we’ve seen, there’s divide in our party on this issue,” Martin said. “This is a moment that calls for shared dialog. It calls for shared advocacy, and that’s why I’ve decided today, at this moment, listening to the testimony and listening to people in our party, to withdraw my amendment and resolution.”\nThe DNC chair said he would refer the issue to a task force “comprised of stakeholders on all sides of this to continue to have the conversation” and report back to the party.\nMartin’s resolution called for “secure and unrestricted delivery of humanitarian assistance” in Gaza, reaffirmed the DNC’s support for a ceasefire and the release of hostages, and stated the committee supports a two-state solution.\nThe progressive-backed resolution was voted down via voice vote. A proposed amendment to add language calling for the release of hostages in Gaza and to oppose only offensive weapons also failed.\nNathan Soltz, a DNC member from Oregon, said that while he appreciated the effort to amend the resolution, it didn’t got far enough for him.\n“This is an issue that I hear about all the time and that I know is very salient to young Democrats,” he said, adding that the party had in Martin’s resolution “something very strong.”\nIt was a dramatic ending to one of the most controversial resolutions before the committee. One audience member shouted “you’ve got to be f**king kidding me” after the progressive-backed resolution failed. Martin later huddled off to the side with the sponsors of that resolution before deciding to withdraw his own.\nThe two resolutions were the results of a failed weekslong attempt to combine the proposals into a unified resolution that might win broad support among members.\nAllison Minnerly, a 26-year-old Florida organizer and new DNC member, introduced a resolution on Gaza this month that called on the committee to ask party leaders, including elected officials, to back an immediate ceasefire, an arms embargo and suspension of military aid to Israel. If passed, the DNC would have urged “its elected members of Congress to recognize Palestine as country.”\nMinnerly said it was disappointing that the party was going to continue debating the issue instead of taking a stance. She pointed to polling that shows an overwhelming majority of Democrats disapprove of Israel’s military actions in Gaza.\n“I think that prolonging this conversation just avoids the necessary alignment that has to happen with the base,” she told CNN after the vote.\nThe dueling resolutions highlight the growing tensions within the party over how Democrats should respond to Israel’s war in Gaza and the ensuing humanitarian crisis. Similar debates have taken place at the state level, including in North Carolina, where Democrats passed a contentious resolution calling for an arms embargo. As public opinion has become more critical of Israel’s military tactics, progressive members of the party have called for a more forceful condemnation of the war and the United States’ role in it.\nCritics of Martin’s resolution said that, in an effort to treat both sides equally, the proposal failed to address the scale of Israel’s response to Hamas’ October 7, 2023, attack. Those opposed to the progressive-backed resolution say calling for an arms embargo goes too far, and the proposal doesn’t mention the October 7 attack.\nIsrael’s supporters within the DNC have, meanwhile, sought to strike a middle ground between condemning Prime Minister Benjamin Netanyahu’s right-wing government and still advocating for military and financial support for Israel.\nDemocratic Majority for Israel President Brian Romick called the progressive-backed resolution “a flawed, irresponsible resolution at a Democratic National Committee meeting that will further sow division within our Party and do nothing to help bring an end to the Israel-Hamas war” and called on the resolutions committee to reject it.\nMeanwhile, the committee advanced a resolution to take steps toward limiting the influence of dark money in the 2028 presidential primaries.\nThis story has been updated with additional information."
    },
    {
      "news_title": "DNC Rejects Resolution for Arms Embargo on Israel",
      "news_link": "https://politicalwire.com/2025/08/26/dnc-rejects-resolution-for-arms-embargo-on-israel/",
      "bias": "Center",
      "text": "“A polarizing resolution calling for an arms embargo on Israel was voted down Tuesday by members of the Democratic National Committee, who opted instead to approve a more modest measure that called for a ceasefire to the conflict in Gaza,” NOTUS reports.\nSave to FavoritesYou're reading the free version of Political Wire\nUpgrade to a paid membership to unlock full access. The process is quick and easy. You can even use Apple Pay.\n- ✔ Become a member to get many great benefits -- exclusive analysis, a trending news page, a private podcast, no advertising and more!\n- ✔ If you're already a member, log in for the full experience.\nRecent Posts\nTrump Again Escalates Power Grabs\n“President Trump’s bid to fire a member of the Federal Reserve board is a new escalation of his efforts to amass more power over American government and society: Congress generations…\nResearcher Who Distorted Data in Election Integrity Role\n“A conservative election researcher whose faulty findings on voter data were cited by President Donald Trump as he tried to overturn his 2020 election loss has been appointed to an…\nAnother Bonus Quote of the Day\n“I have the right to do anything I want to do. I’m the president of the United States.” — President Trump, speaking to reporters at a Cabinet meeting today. Save…\nEric Adams Won’t Drop Out of Mayoral Race\n“New York Mayor Eric Adams said he has no plans to drop out of November’s election after his struggling campaign was rocked last week by more corruption allegations,” Bloomberg reports….\nRepublicans Defunded Roads In Their Own Districts\nWhen Republicans repealed a Biden-era “access and equity” grant program for transportation, they canceled funding for projects in some of their own districts, the New York Times reports. Save to…\nTrump Claims He’ll Have a ‘Fed Majority’ Soon\n“President Donald Trump said Tuesday he will soon have a ‘majority’ of his own nominees on the Federal Reserve board of governors who will back his desire to slash interest…\nExxon Held Secret Talks About Going Back to Russia\n“After huddling with President Trump in Alaska, President Vladimir Putin told reporters Russia and the U.S. could do more business together—for example, between their Pacific coastlines,” the Wall Street Journal…\nFed Will Let Court Decide Fate of Lisa Cook\n“The Federal Reserve said it would abide by any court decision on whether President Donald Trump has the legal authority to fire Board of Governors member Lisa Cook,” CNBC reports….\nRFK Jr. Claims He Knows Cause of Higher Autism Rates\nHealth Secretary Robert F. Kennedy Jr. announced in a cabinet meeting that the Department of Health and Human Services has identified “interventions” that it says are behind rising autism rates…\nTrump Comments on Taylor Swift’s Engagement\nPresident Trump commented on the Taylor Swift and Travis Kelce engagement: “I wish them a lot of luck. I think he’s a great player. I think he’s a great guy…\nTrump Wants to Rebrand His ‘One Big, Beautiful Bill’\nPresident Donald Trump said Tuesday at a Cabinet meeting that he wants to rebrand his “one big beautiful bill” after he persuaded Republicans to call it that, NBC News reports….\nNew Vanity Fair Boss Sparks Fury Among Staff\n“The new editor of Vanity Fair has enraged his staff by considering putting Melania Trump on the magazine’s cover—which then sparked a MAGA backlash to the backlash,” the Daily Beast…\nTrump Wants No Less than $500 Million from Harvard\nPresident Donald Trump called for Harvard University to pay a sweeping $500 million settlement to restore its federal funding, CNN reports. Said Trump, to Education Secretary Linda McMahon: “We want…\nTrump Tells Cracker Barrel to Ditch New Logo\nPresident Trump weighed in on the controversial rebranding of Cracker Barrel Old Country Store, writing that: “Cracker Barrel should go back to the old logo, admit a mistake based on…\nTrump-Appointed Judge Rebukes White House\n“A federal judge has forcefully rejected a highly unusual lawsuit the Trump administration filed against 15 other judges whom the Justice Department accused of hindering the president’s mass deportation agenda,”…\nExtra Bonus Quote of the Day\n“In some places it is two dollars. It broke two dollars in a couple locations in the South.” — President Trump, talking to reporters about gas prices. Save to Favorites\nTrump’s Approval Stays Tepid\nA new Gallup poll finds 40% of Americans approving of President Donald Trump’s overall job performance. Save to Favorites\nBuzz Grows for Possible Padilla California Governor’s Run\n“The rumor mill is hitting overdrive that Sen. Alex Padilla is contemplating a bid for California governor — and it’s not just idle talk,” Politico reports. “A prominent political entity…\nU.S. Offers Air and Intelligence Support in Ukraine\n“The US has said it is prepared to provide intelligence assets and battlefield oversight to any western security plan for postwar Ukraine and take part in a European-led air defense…\nGOP Candidate Vows to ‘End Islam’\nValentina Gomez, a Republican running for Congress in Texas, shared a video of her burning the Koran with a flamethrower as part of her effort to “end Islam,” the Daily…"
    }
  ]
}