{
  "story_id": "GN_20250825_230151_298a9fb9",
  "metadata": {
    "title": "India says US trade negotiations are still going on as fresh tariffs loom",
    "timestamp": "2025-08-25T23:01:51.754108",
    "url": "https://ground.news/article/india-says-us-trade-negotiations-are-still-going-on-as-fresh-tariffs-loom_835031"
  },
  "bias_distribution": {
    "total_sources": "126",
    "leaning_left": "11",
    "center": "30",
    "leaning_right": "19"
  },
  "perspective_summaries": {
    "left": [
      "Indian Prime Minister Narendra Modi proposes to cut consumption taxes, which could save consumers billions and increase demand as the economy braces for potential US tariffs.",
      "US President Donald Trump threatens to double import duties on India due to its oil purchases from Russia, which could impact the country's economy.",
      "Experts estimate Modi's proposed tax reforms might lead to a decrease in tax collections by $13 billion to $17 billion, benefiting many consumers.",
      "Analysts suggest the GST changes may boost domestic consumption and improve Modi's standing among the middle class amid US-India trade tensions."
    ],
    "center": [
      "On August 23, 2025, Indian Foreign Minister Subrahmanyam Jaishankar confirmed that discussions regarding trade with the United States are continuing despite existing tensions and tariffs.",
      "These talks follow the Trump administration's decision to raise tariffs above 50% on Indian goods as a penalty for India's continued purchase of Russian oil, which India disputes.",
      "Jaishankar emphasized that defending farmers' and small producers' interests are red lines that India will not compromise, and he criticized the framing of the dispute mainly as an oil issue.",
      "He highlighted that the volume of trade between Russia and European countries significantly exceeds that between Russia and India, noting that claims about India financing the war overlook the larger scale of Russia-EU commerce.",
      "A scheduled trip by American trade officials to New Delhi from August 25 to 29 was called off, reducing expectations for a rollback or delay of tariffs amid ongoing discussions between the two nations."
    ],
    "right": [
      "India's trade negotiations with the United States continue, according to External Affairs Minister S. Jaishankar, who stated that defending farmers' interests is a priority and that there are non-negotiable red lines in the talks.",
      "A 25 percent tariff on Indian imports to the U.S. is currently imposed, with an additional 25 percent scheduled for August 27, significantly impacting trade.",
      "Jaishankar criticized the U.S. for its harsh tariffs, calling them \"unjustified and unreasonable,\" while emphasizing India’s right to make decisions in its national interest.",
      "Concerns have arisen as the planned visit by U.S. trade negotiators to Delhi from August 25 to 29 has been canceled, suggesting that tariffs may not be lowered."
    ]
  },
  "sources": [
    {
      "news_title": "Big PMO meet tomorrow as Trump's 50% tariffs set to come into force: Sources",
      "news_link": "https://www.indiatoday.in/business/story/pmo-to-chair-key-meeting-on-50-us-tariffs-tomorrow-details-here-2776375-2025-08-25",
      "bias": "Lean Right",
      "text": "Big PMO meet tomorrow as Trump's 50% tariffs set to come into force: Sources\nStarting Wednesday, Indian goods entering the US market will be subject to a 50% tariff after Washington doubled existing duties, heightening cost pressures on exporters.\nThe Prime Minister’s Office will convene a high-level meeting on August 26 to review measures for Indian exporters facing the impact of higher tariffs in the United States, according to people familiar with the matter. The session is expected to be chaired by the Principal Secretary to the Prime Minister.\nStarting Wednesday, Indian goods entering the US market will be subject to a 50% tariff after Washington doubled existing duties, heightening cost pressures on exporters.\nThe commerce and industry ministry has been consulting exporters and export promotion councils to understand the impact of the existing 25% levy, which firms say has already squeezed margins and reduced competitiveness.\nPolicy options under discussion include targeted support for specific industries rather than broad, economy-wide measures.\nExporters had requested an Emergency Credit Line Guarantee Scheme (ECLGS), offering collateral-free working capital with government-backed risk cover, but officials believe sector-specific interventions could be more effective.\nSMALL FIRMS, EXPORT-ORIENTED SECTORS IN FOCUS\nAn official said that micro-firms have indicated sector-specific credit lines with collateral support are helpful. Cluster-based working capital funds are also under active consideration to ease liquidity pressures.\nOfficials said protecting export-oriented units and small and medium enterprises (SMEs) remains central to the government’s strategy, given their vulnerability to external shocks.\nTuesday’s meeting is expected to finalise the contours of India’s response as exporters prepare for the tariff increase.\nThe government’s move comes amid growing concerns that the 50% US tariff could further strain margins for Indian exporters, disrupt supply chains, and affect competitiveness in key sectors ranging from textiles and leather to engineering goods and specialty chemicals."
    },
    {
      "news_title": "India and the United States",
      "news_link": "https://tribune.com.pk/story/2562976/india-and-the-united-states",
      "bias": "Center",
      "text": "The global order constructed with considerable care by the Western leadership that won for their nations the Second World War is now under great stress. We are now witnessing the growing conflict among four large powers: the United States, China, Russia and India. Complicating relations among them are now not only deeply held national interests but also idiosyncratic personalities that lead them.\nAccording to a news analysis done for The New York Times by its correspondent Mujib Mashal, \"the much-touted bond nurtured through platitudes and joint appearances at stadia during rallies held in Mr. Trump's first term, led one television anchor sympathetic to India's leader to suggest that Trump and Modi 'have extraordinary chemistry'. Another chipped in: 'when the two of them are onstage together, it is lightning.' But when Mr. Modi needed to lean into that relationship, he instead has had to weather a series of blows that is hurting his reputation at home. Indian officials are wondering how the historic highs in the relationship have soured so quickly.\"\nThe American president did not favour India as he announced a series of trade-related actions including levy of tariffs on imports from several countries. On July 29, 2025, Trump announced that he was imposing 25 per cent tariffs on imports from India and some additional penalties for India's close ties with Russia which included imports of oil from Moscow. India's exports to the United States have grown rapidly, making the United States its largest trading partner. Trade in goods alone is estimated at $130 billion a year, with pharmaceuticals and electronics — including Apple's new iPhones — among India's major exports.\nIndia has benefited from the punishing relationship that has developed between China and the United States. For decades, Apple had its popular products assembled in a large Taiwanese-owned factory in south China, using parts and components imported from small nations in Southeast Asia. Following the souring of relations between China and the United States, Apple moved a significant number of its operations from China to India. Some of India's exports to the United States are targeted at the large Indian diaspora in America. Indian Americans buy jewelry studded with diamonds and precious stones from makers in India.\nMashal followed his story about India's external relations with another coauthored with Hari Kumar. This time the analysts took a grim view of the situation, writing under a title — \"Humiliated by the US and slighted by China, India is left to reflect,\" that represented their view of the Indian situation. Prime Minister Modi spoke with President Putin on the phone following which he said that both sides vowed to deepen \"the India-Russia Special and Privileged Strategic Partnership\". Prime Minster Modi's national security adviser visited Moscow after Putin and Modi talked on the telephone to finalise details of a planned visit to India by the Russian president.\nThere was considerable handwringing in India the way Donald Trump's Washington had treated the country. Nirupama Rao, a former Indian ambassador to Beijing and Washington, said the American president's moves had upended \"the strategic logic of a very consequential partnership\" that had been carefully nurtured over more than two decades. There will be \"very pragmatic strategic recalibrations by New Delhi to protect its interests. India's growing economy allows its leaders breathing room, but it is still a moment of deep introspection for the country. We have to draw our lessons from that and really focus on the national priorities and what we need to do to become stronger and more influential,\" she said.\nMs Rao spoke with the press as the talks on trade issues with Washington had stalled after several inclusive rounds of discussions. After multiple rounds of talks between the technical teams from Washington and New Delhi, the two sides appeared to be close to finalising the first phase of bilateral relationship between the two nations that had become complicated overtime. The talks suggested that India was willing to open, to an extent, its long protected agriculture markets. Protecting the farming community in the areas close to Delhi, the India capital, had become a sensitive issue. In the summer of 2024, the Sikh farmers from the state of Punjab marched on New Delhi demanding the withdrawal of laws passed by the Modi government that would have allowed investments by large non-Punjabi enterprises in the province's agriculture. Having come under pressure, Modi withdrew the law.\nAmitabh Kant, until recently Prime Minister Modi's envoy for dealing with the Group of 20 economies, said that Trump had used strongarm tactics against other traditional American allies as well, and that before the year is out India and the United States could arrive at a mutually beneficial trade deal. \"But even if the trade issues are sorted out the trust would have been lost forever.\"\nNon-trade issues had also begun to get involved. Trump had begun to punish India for its relations with Moscow. He announced an additional 25 percent tariff imposed as penalty for India's increasing trade with Russia. The White House said that the addition to the already high tariff would go into effect at the end of August . Some analysts saw this move as a crude bargaining tactic to get more favourable trade deal with India and also to pressure Putin's Russia to do a deal on Ukraine with the United States and its western allies.\nAdded to these tensions is the sudden warming of relations between Washington and Islamabad. This is a subject I will take up in a later article. I will conclude this piece by quoting at some length a statement by Sanjaya Baru, an author and former adviser to Modi's predecessors: \"What we have now is a US president who is very egotistical person with the highly personalized style of leadership and an Indian prime minister who is also an egotistical person with a highly personalized style of leadership. When you have two leaders who have converted what is essentially a relationship between two nations into a relationship between individual leaders, I think this is the price that we probably are now paying.\"\nLeadership idiosyncrasies matter in those systems where the underlying political structures are weak. The four countries I have identified above whose relationships are defining the new global order have leadership in the hands of people who are idiosyncratic. That is not only the case with Donald Trump of the United States and Narendra Modi of India. The same can be said about China's Xi Jinping and Russia's Vladimir Putin.\nCOMMENTS\nComments are moderated and generally will be posted if they are on-topic and not abusive.\nFor more information, please see our Comments FAQ"
    },
    {
      "news_title": "India's Modi dangles tax cuts as US tariffs threaten to derail economy",
      "news_link": "https://www.khaleejtimes.com/business/economy/indias-modi-dangles-tax-cuts-as-us-tariffs-threaten-to-derail-economy",
      "bias": "Lean Right",
      "text": "Mon, Aug 25, 2025 | Rabi al-Awwal 1, 1447 | Fajr 04:36 | DXB 35°C\nTax reform could help shore up demand by reducing tax collections by between $13 billion and $17 billion\nIndian Prime Minister Narendra Modi's push to slash consumption taxes on everyday goods could deliver billions of dollars in annual relief and boost demand in an economy bracing for painful US tariffs, experts say.\nUS President Donald Trump has threatened to double import duties on India from 25 to 50 per cent to punish New Delhi for buying oil from Russia, saying the purchases help Moscow fund its invasion of Ukraine.\nThe prospective measure has clouded the outlook for the world's fifth-largest economy, with Indian exporters warning of plunging orders and severe job losses.\nNew Delhi has called Washington's move \"unfair, unjustified and unreasonable\" but is already seeking to cushion the blow, with Modi last week promising to \"bring down the tax burden on the common man\" during an annual speech to mark India's independence.\nHis proposed cuts to the goods and services tax (GST) would make everything from small cars to air conditioners cheaper for consumers, economists say. Currently, the tax operates under a complex four-tier structure, with rates ranging from five to 28 per cent.\nUnder Modi's reforms, most goods would fall into just two tiers, taxed at either five or 18 per cent.\nThe Indian leader has called the change a \"Diwali gift\", a reference to the annual Hindu festival of lights when consumers splurge on everything from gold and clothes to consumer electronics.\nTrump's tariffs -- and their impact on ordinary Indians -- will hinge on how much progress is made towards a Russia-Ukraine peace deal, and whether New Delhi can secure alternative oil suppliers before the US president's August 27 deadline.\nBut experts say Modi's tax reform could help shore up demand by reducing tax collections by between $13 billion and $17 billion.\nAnalysts at Emkay Global Financial Services called the policy a \"welcome reform towards boosting domestic consumption\".\nThey estimated that about the vast majority of items currently subject to the top 28 percent rate would be taxed at 18 percent, while \"nearly all\" in the 12 percent tier would move into the five-percent bracket.\nAnalysts at Motilal Oswal, an Indian financial services firm, said the changes would bring benefits to a wide range of sectors and \"sizeable savings\" to households.\nThe fate of the proposal ultimately rests with the GST Council, which includes representatives from state governments and has struggled to achieve broad consensus in the past.\nIf approved, the cuts would strain public finances, according to experts.\nHowever, they said, they could also help to offset tariff risks and burnish Modi's credentials among the middle class.\nThe proposal comes ahead of expected elections later this year in Bihar, a large, Hindu-majority state of 130 million people that is a key political battleground for Modi.\n\"The popular economic narrative right now is that of Trump's 50 percent tariffs and how the US-India relationship is seeing setbacks,\" Deepanshu Mohan, economist at O.P. Jindal Global University, told AFP.\n\"The GST readjustment is a strong response from Modi in that context. It's Modi telling the middle class: 'We are trying to make sure you have enough at your end,'\" Mohan said.\nBut, he added, it was also an acknowledgement that India's economy had not worked for its \"low middle-income class for some time\".\nAlthough economists have called for an overhaul of the GST system for years, Modi's surprise announcement comes as US-India ties hit a multi-decade low.\nEconomists estimate that if the two countries fail to sign a trade deal, Trump's tariffs could drag India's GDP growth below six per cent this fiscal year, lower than the central bank's projections of 6.5 per cent.\nNew Delhi's stance on Russian oil imports will become clearer by late September as most cargoes this month were contracted before Trump's threats, according to trade intelligence firm Kpler.\nKpler analyst Sumit Ritolia told AFP that while Indian refiners are showing \"growing interest\" in US, West African and Latin American crude, it was more indicative of \"greater flexibility, not a deliberate pivot\".\n\"Until there's a clear policy shift or sustained change in trade economics, Russian flows remain a core part of India's crude basket,\" Ritolia said.\nAs the clock ticks down on the tariff hike, the state of US-India trade negotiations remains uncertain.\nNew Delhi says it is committed to striking a deal, but Indian media reports suggest US negotiators have postponed a planned late-August visit to the Indian capital."
    },
    {
      "news_title": "India's Modi dangles tax cuts as US tariffs loom - Economy - The Jakarta Post",
      "news_link": "https://www.thejakartapost.com/business/2025/08/24/indias-modi-dangles-tax-cuts-as-us-tariffs-loom.html",
      "bias": "Lean Left",
      "text": "Can't find what you're looking for?\nView all search resultsCan't find what you're looking for?\nView all search resultsndian Prime Minister Narendra Modi's push to slash consumption taxes on everyday goods could deliver billions of dollars in annual relief and boost demand in an economy bracing for painful US tariffs, experts say.\nUS President Donald Trump has threatened to double import duties on India from 25 to 50 percent to punish New Delhi for buying oil from Russia, saying the purchases help Moscow fund its invasion of Ukraine.\nThe prospective measure has clouded the outlook for the world's fifth-largest economy, with Indian exporters warning of plunging orders and severe job losses.\nNew Delhi has called Washington's move \"unfair, unjustified and unreasonable\" but is already seeking to cushion the blow, with Modi last week promising to \"bring down the tax burden on the common man\" during an annual speech to mark India's independence.\nHis proposed cuts to the goods and services tax (GST) would make everything from small cars to air conditioners cheaper for consumers, economists say.\nCurrently, the tax operates under a complex four-tier structure, with rates ranging from five to 28 percent.\nUnder Modi's reforms, most goods would fall into just two tiers, taxed at either five or 18 percent.\nThe Indian leader has called the change a \"Diwali gift\", a reference to the annual Hindu festival of lights when consumers splurge on everything from gold and clothes to consumer electronics.\nTrump's tariffs -- and their impact on ordinary Indians -- will hinge on how much progress is made towards a Russia-Ukraine peace deal, and whether New Delhi can secure alternative oil suppliers before the US president's August 27 deadline.\nBut experts say Modi's tax reform could help shore up demand by reducing tax collections by between $13 billion and $17 billion.\nAnalysts at Emkay Global Financial Services called the policy a \"welcome reform towards boosting domestic consumption\".\nThey estimated that about the vast majority of items currently subject to the top 28 percent rate would be taxed at 18 percent, while \"nearly all\" in the 12 percent tier would move into the five-percent bracket.\nAnalysts at Motilal Oswal, an Indian financial services firm, said the changes would bring benefits to a wide range of sectors and \"sizeable savings\" to households.\nThe fate of the proposal ultimately rests with the GST Council, which includes representatives from state governments and has struggled to achieve broad consensus in the past.\nIf approved, the cuts would strain public finances, according to experts.\nHowever, they said, they could also help to offset tariff risks and burnish Modi's credentials among the middle class.\nThe proposal comes ahead of expected elections later this year in Bihar, a large, Hindu-majority state of 130 million people that is a key political battleground for Modi.\n\"The popular economic narrative right now is that of Trump's 50 percent tariffs and how the US-India relationship is seeing setbacks,\" Deepanshu Mohan, economist at O.P. Jindal Global University, told AFP.\n\"The GST readjustment is a strong response from Modi in that context. It's Modi telling the middle class: 'We are trying to make sure you have enough at your end,'\" Mohan said.\nBut, he added, it was also an acknowledgement that India's economy had not worked for its \"low middle-income class for some time\".\nAlthough economists have called for an overhaul of the GST system for years, Modi's surprise announcement comes as US-India ties hit a multi-decade low.\nEconomists estimate that if the two countries fail to sign a trade deal, Trump's tariffs could drag India's GDP growth below six percent this fiscal year, lower than the central bank's projections of 6.5 percent.\nNew Delhi's stance on Russian oil imports will become clearer by late September as most cargoes this month were contracted before Trump's threats, according to trade intelligence firm Kpler.\nKpler analyst Sumit Ritolia told AFP that while Indian refiners are showing \"growing interest\" in US, West African and Latin American crude, it was more indicative of \"greater flexibility, not a deliberate pivot\".\n\"Until there's a clear policy shift or sustained change in trade economics, Russian flows remain a core part of India's crude basket,\" Ritolia said.\nAs the clock ticks down on the tariff hike, the state of US-India trade negotiations remains uncertain.\nNew Delhi says it is committed to striking a deal, but Indian media reports suggest US negotiators have postponed a planned late-August visit to the Indian capital.\nShare your experiences, suggestions, and any issues you've encountered on The Jakarta Post. We're here to listen.\nThank you for sharing your thoughts. We appreciate your feedback.\nQuickly share this news with your network—keep everyone informed with just a single click!\nShare the best of The Jakarta Post with friends, family, or colleagues. As a subscriber, you can gift 3 to 5 articles each month that anyone can read—no subscription needed!\nGet the best experience—faster access, exclusive features, and a seamless way to stay updated."
    },
    {
      "news_title": "'Unfair, unjustified': India's Modi dangles tax cuts as Trump tariffs loom",
      "news_link": "https://www.geo.tv/latest/620172-unfair-unjustified-indias-modi-dangles-tax-cuts-as-trump-tariffs-loom",
      "bias": "Lean Right",
      "text": "August 24, 2025\nIndian Prime Minister Narendra Modi's push to slash consumption taxes on everyday goods could deliver billions of dollars in annual relief and boost demand in an economy bracing for painful US tariffs, experts say.\nUS President Donald Trump has threatened to double import duties on India from 25% to 50% to punish New Delhi for buying oil from Russia, saying the purchases help Moscow fund its invasion of Ukraine.\nThe prospective measure has clouded the outlook for the world's fifth-largest economy, with Indian exporters warning of plunging orders and severe job losses.\nNew Delhi has called Washington's move \"unfair, unjustified and unreasonable\" but is already seeking to cushion the blow, with Modi last week promising to \"bring down the tax burden on the common man\" during an annual speech to mark India's independence.\nHis proposed cuts to the goods and services tax (GST) would make everything from small cars to air conditioners cheaper for consumers, economists say.\nCurrently, the tax operates under a complex four-tier structure, with rates ranging from five to 28%.\nUnder Modi's reforms, most goods would fall into just two tiers, taxed at either five or 18%.\nThe Indian leader has called the change a \"Diwali gift\", a reference to the annual Hindu festival of lights when consumers splurge on everything from gold and clothes to consumer electronics.\nTrump's tariffs — and their impact on ordinary Indians — will hinge on how much progress is made towards a Russia-Ukraine peace deal, and whether New Delhi can secure alternative oil suppliers before the US president's August 27 deadline.\nBut experts say Modi's tax reform could help shore up demand by reducing tax collections by between $13 billion and $17 billion.\nAnalysts at Emkay Global Financial Services called the policy a \"welcome reform towards boosting domestic consumption\".\nThey estimated that about the vast majority of items currently subject to the top 28% rate would be taxed at 18%, while \"nearly all\" in the 12% tier would move into the 5% bracket.\nAnalysts at Motilal Oswal, an Indian financial services firm, said the changes would bring benefits to a wide range of sectors and \"sizeable savings\" to households.\nThe fate of the proposal ultimately rests with the GST Council, which includes representatives from state governments and has struggled to achieve broad consensus in the past.\nIf approved, the cuts would strain public finances, according to experts.\nHowever, they said, they could also help to offset tariff risks and burnish Modi's credentials among the middle class.\nThe proposal comes ahead of expected elections later this year in Bihar, a large, Hindu-majority state of 130 million people that is a key political battleground for Modi.\n\"The popular economic narrative right now is that of Trump's 50% tariffs and how the US-India relationship is seeing setbacks,\" Deepanshu Mohan, economist at OP Jindal Global University, told AFP.\n\"The GST readjustment is a strong response from Modi in that context. It's Modi telling the middle class: 'We are trying to make sure you have enough at your end,'\" Mohan said.\nBut, he added, it was also an acknowledgement that India's economy had not worked for its \"low middle-income class for some time\".\nAlthough economists have called for an overhaul of the GST system for years, Modi's surprise announcement comes as US-India ties hit a multi-decade low.\nEconomists estimate that if the two countries fail to sign a trade deal, Trump's tariffs could drag India's GDP growth below 6% this fiscal year, lower than the central bank's projections of 6.5%.\nNew Delhi's stance on Russian oil imports will become clearer by late September as most cargoes this month were contracted before Trump's threats, according to trade intelligence firm Kpler.\nKpler analyst Sumit Ritolia told AFP that while Indian refiners are showing \"growing interest\" in US, West African and Latin American crude, it was more indicative of \"greater flexibility, not a deliberate pivot\".\n\"Until there's a clear policy shift or sustained change in trade economics, Russian flows remain a core part of India's crude basket,\" Ritolia said.\nAs the clock ticks down on the tariff hike, the state of US-India trade negotiations remains uncertain.\nNew Delhi says it is committed to striking a deal, but Indian media reports suggest US negotiators have postponed a planned late-August visit to the Indian capital."
    },
    {
      "news_title": "India’s Modi dangles tax cuts as US tariffs loom",
      "news_link": "https://www.arabnews.com/node/2612821/world",
      "bias": "Lean Right",
      "text": "MUMBAI: Indian Prime Minister Narendra Modi’s push to slash consumption taxes on everyday goods could deliver billions of dollars in annual relief and boost demand in an economy bracing for painful US tariffs, experts say.\nUS President Donald Trump has threatened to double import duties on India from 25 to 50 percent to punish New Delhi for buying oil from Russia, saying the purchases help Moscow fund its invasion of Ukraine.\nThe prospective measure has clouded the outlook for the world’s fifth-largest economy, with Indian exporters warning of plunging orders and severe job losses.\nNew Delhi has called Washington’s move “unfair, unjustified and unreasonable” but is already seeking to cushion the blow, with Modi last week promising to “bring down the tax burden on the common man” during an annual speech to mark India’s independence.\nHis proposed cuts to the goods and services tax (GST) would make everything from small cars to air conditioners cheaper for consumers, economists say.\nCurrently, the tax operates under a complex four-tier structure, with rates ranging from five to 28 percent.\nUnder Modi’s reforms, most goods would fall into just two tiers, taxed at either five or 18 percent.\nThe Indian leader has called the change a “Diwali gift,” a reference to the annual Hindu festival of lights when consumers splurge on everything from gold and clothes to consumer electronics.\nTrump’s tariffs – and their impact on ordinary Indians – will hinge on how much progress is made toward a Russia-Ukraine peace deal, and whether New Delhi can secure alternative oil suppliers before the US president’s August 27 deadline.\nBut experts say Modi’s tax reform could help shore up demand by reducing tax collections by between $13 billion and $17 billion.\nAnalysts at Emkay Global Financial Services called the policy a “welcome reform toward boosting domestic consumption.”\nThey estimated that about the vast majority of items currently subject to the top 28 percent rate would be taxed at 18 percent, while “nearly all” in the 12 percent tier would move into the five-percent bracket.\nAnalysts at Motilal Oswal, an Indian financial services firm, said the changes would bring benefits to a wide range of sectors and “sizeable savings” to households.\nThe fate of the proposal ultimately rests with the GST Council, which includes representatives from state governments and has struggled to achieve broad consensus in the past.\nIf approved, the cuts would strain public finances, according to experts.\nHowever, they said, they could also help to offset tariff risks and burnish Modi’s credentials among the middle class.\nThe proposal comes ahead of expected elections later this year in Bihar, a large, Hindu-majority state of 130 million people that is a key political battleground for Modi.\n“The popular economic narrative right now is that of Trump’s 50 percent tariffs and how the US-India relationship is seeing setbacks,” Deepanshu Mohan, economist at O.P. Jindal Global University, said.\n“The GST readjustment is a strong response from Modi in that context. It’s Modi telling the middle class: ‘We are trying to make sure you have enough at your end,’” Mohan said.\nBut, he added, it was also an acknowledgement that India’s economy had not worked for its “low middle-income class for some time.”\nAlthough economists have called for an overhaul of the GST system for years, Modi’s surprise announcement comes as US-India ties hit a multi-decade low.\nEconomists estimate that if the two countries fail to sign a trade deal, Trump’s tariffs could drag India’s GDP growth below six percent this fiscal year, lower than the central bank’s projections of 6.5 percent.\nNew Delhi’s stance on Russian oil imports will become clearer by late September as most cargoes this month were contracted before Trump’s threats, according to trade intelligence firm Kpler.\nKpler analyst Sumit Ritolia said that while Indian refiners are showing “growing interest” in US, West African and Latin American crude, it was more indicative of “greater flexibility, not a deliberate pivot.”\n“Until there’s a clear policy shift or sustained change in trade economics, Russian flows remain a core part of India’s crude basket,” Ritolia said.\nAs the clock ticks down on the tariff hike, the state of US-India trade negotiations remains uncertain.\nNew Delhi says it is committed to striking a deal, but Indian media reports suggest US negotiators have postponed a planned late-August visit to the Indian capital.\nIndia’s Modi dangles tax cuts as US tariffs loom\nIndia’s Modi dangles tax cuts as US tariffs loom\n- Proposed cuts to the goods and services tax to make everything from small cars to air conditioners cheaper for consumers, economists say\n- As the clock ticks down on the tariff hike, the state of US-India trade negotiations remains uncertain"
    },
    {
      "news_title": "India's Modi dangles tax cuts as US tariffs loom",
      "news_link": "https://kdhnews.com/news/nation/indias-modi-dangles-tax-cuts-as-us-tariffs-loom/article_46a7c1e6-7cbb-5ccf-bd86-fd48a697a46f.html",
      "bias": "Center",
      "text": null
    },
    {
      "news_title": "India's Modi Dangles Tax Cuts As US Tariffs Loom",
      "news_link": "https://www.barrons.com/news/india-s-modi-dangles-tax-cuts-as-us-tariffs-loom-ce987f0b",
      "bias": "Center",
      "text": "India's Modi Dangles Tax Cuts As US Tariffs Loom\nIndian Prime Minister Narendra Modi's push to slash consumption taxes on everyday goods could deliver billions of dollars in annual relief and boost demand in an economy bracing for painful US tariffs, experts say.\nThe Barron's news department was not involved in the creation of the content above. This article was produced by AFP. For more information go to AFP.com.\n© Agence France-Presse\nContinue reading this article with a Barron’s subscription\nSUBSCRIBE NOW"
    },
    {
      "news_title": "India Says US Trade Negotiations Are Still Going on as Fresh Tariffs Loom",
      "news_link": "https://www.usnews.com/news/top-news/articles/2025-08-23/india-says-trade-negotiations-with-us-are-still-going-on",
      "bias": "Lean Left",
      "text": null
    },
    {
      "news_title": "India says US trade negotiations are still going on as fresh tariffs loom",
      "news_link": "https://www.reuters.com/world/china/india-says-us-trade-negotiations-are-still-going-fresh-tariffs-loom-2025-08-23/",
      "bias": "Center",
      "text": null
    },
    {
      "news_title": "US, India Trade Talks Are Moving Forward, Minister Says",
      "news_link": "https://www.bloomberg.com/news/articles/2025-08-23/us-india-trade-talks-are-moving-forward-minister-says",
      "bias": "Lean Left",
      "text": null
    },
    {
      "news_title": "India says US trade negotiations still going on as fresh tariffs loom",
      "news_link": "https://www.channelnewsasia.com/asia/india-us-trade-negotiations-ongoing-tariffs-russia-oil-5310576",
      "bias": "Center",
      "text": "India says US trade negotiations still going on as fresh tariffs loom\nMUMBAI: India's foreign minister said on Saturday (Aug 23) that trade negotiations with Washington are continuing but there are lines that New Delhi needs to defend, just days before hefty additional US tariffs are due to hit.\nIndian goods face additional US tariffs of up to 50 per cent, among the highest imposed by Washington, due to its increased purchases of Russian oil. A 25 per cent tariff has already come into effect, while the remaining 25 per cent is set to be enforced from Aug 27.\nA planned visit by US trade negotiators to New Delhi from Aug 25 to Aug 29 has been called off, dashing hopes that the levies may be lowered or postponed.\n\"We have some redlines in the negotiations, to be maintained and defended,\" Indian Foreign Minister Subrahmanyam Jaishankar said at an Economic Times forum event in New Delhi, singling out the interests of the country's farmers and small producers.\nIndia-US trade talks collapsed earlier this year due to India not agreeing to open its vast agricultural and dairy sectors. Bilateral trade between the world's largest and fifth-largest economy is worth over US$190 billion.\n\"It is our right to make decisions in our 'national interest',\" Jaishankar said.\nAnalysts at Capital Economics said on Friday that if the full US tariffs come into force and stick, the hit to India's economic growth would be 0.8 percentage points both this year and next.\n\"The longer-term harm could be even greater as a high tariff could puncture India’s appeal as a global manufacturing hub.\"\nThe Indian minister described US President Donald Trump's policy announcements as \"unusual\".\n\"We have not had a US president who conducts his foreign policy so publicly as the current one and (it) is a departure from the traditional way of conducting business with the world,\" Jaishankar said.\nHe also said Washington's concern over India's Russian oil purchases was not being applied to other major buyers such as China and European Union.\n\"If the argument is oil, then there are (other) big buyers. If argument is who is trading more (with Russia), than there are bigger traders,\" he said.\nRussia-European trade is bigger than India-Russia trade, he added.\nThe minister also said India's purchases of Russian oil had not been raised in earlier trade talks with the US before the public announcement of tariffs."
    },
    {
      "news_title": "India to defend 'red lines' as fresh US tariffs loom",
      "news_link": "https://thewest.com.au/business/india-to-defend-red-lines-as-fresh-tariffs-loom-c-19779747",
      "bias": "Lean Right",
      "text": "Close navigation menu\nSubscribe\nLog In\nSearch\nHome\nSubscriber Exclusive\nLatest\nToday's Paper\nPuzzles\nTimespool\nWest Rewards\nVanishing Cousins\nUp Late\nCourt in the Act\nNews\nReveal sub navigation\nChevron Down Icon\nWA News\nAustralia\nWorld\nRegional\nCrime\nCourts & Justice\nHealth\nEducation\nSport\nReveal sub navigation\nChevron Down Icon\nAFL\nCricket\nWest Coast Eagles\nFremantle Dockers\nAFLW\nWAFL\nBasketball\nSoccer\nNRL\nRugby Union\nHorse Racing\nNetball\nTennis\nMotorsport\nGolf\nBusiness\nReveal sub navigation\nChevron Down Icon\nMarkets\nProperty\nMining\nEnergy\nHerd On The Terrace\nYour Money\nAgriculture\nBulls N’ Bears\nThe Debrief\nPolitics\nReveal sub navigation\nChevron Down Icon\nFederal Politics\nState Politics\nLocal Government\nWorld Politics\nRegional\nReveal sub navigation\nChevron Down Icon\nSouth West\nGreat Southern\nGoldfields\nPeel/Rockingham\nGascoyne\nMid West\nKimberley\nPilbara\nOpinion\nReveal sub navigation\nChevron Down Icon\nEditorials\nBen Harvey\nJessica Page\nKate Emery\nKatina Curtis\nBasil Zempilas\nEmma Garlett\nKim MacDonald\nPaul Murray\nJustin Langer\nBelle Taylor\nLaura Newell\nAnxiety Aunt\nLifestyle\nReveal sub navigation\nChevron Down Icon\nFood\nDrink\nHealth & Wellbeing\nGarden\nRetirement\nFashion\nMotoring\nNew Homes\nReal Estate\nHouse That!\nSTM\nPLAY\nEntertainment\nReveal sub navigation\nChevron Down Icon\nCelebrity Gossip\nMovies\nTV\nMusic\nTheatre\nBooks\nArts\nCompetitions & Puzzles\nTravel\nReveal sub navigation\nChevron Down Icon\nWestern Australia\nAustralia\nAsia\nWest Travel Club\nPhotography\nTravel Tips\nEurope\nTechnology\nReveal sub navigation\nChevron Down Icon\nGadgets\nGaming\nInternet\nApps\nSmartphones\nHardware\nScience\nInnovation\nTelecommunications\nSecurity\nMenu\nHome\nSearch\nSearch\nThe West Australian\nToday's Paper\nPlace an Ad\nTuesday, 26 August 2025\nBusiness\nIndia to defend 'red lines' as fresh US tariffs loom"
    },
    {
      "news_title": "\"Not Something That...\": S Jaishankar Explains \"Red Lines\" In US Trade Negotiations",
      "news_link": "https://www.ndtv.com/india-news/s-jaishankar-explains-red-lines-in-india-us-trade-negotiations-9144639",
      "bias": "Lean Right",
      "text": null
    },
    {
      "news_title": "Jaishankar hits out at U.S. tariffs, says India will not compromise on farmers' interests",
      "news_link": "https://www.thehindu.com/news/national/jaishankar-hits-out-at-us-tariffs-says-india-will-not-compromise-on-farmers-interests/article69967779.ece",
      "bias": "Lean Left",
      "text": "External Affairs Minister S. Jaishankar on Saturday (August 23, 2025) hit out at the United States for what he called “unjustified and unreasonable” tariffs on Indian goods, after the Trump administration raised duties to over 50% as a penalty for India’s purchase of Russian oil.\nSpeaking at The Economic Times World Leaders Forum 2025, Mr. Jaishankar said India’s priority was to protect farmers and small producers, stressing that New Delhi would not compromise on their interests.\n“What we are concerned about is that red lines are primarily the interest of our farmers and, to some extent, our small producers. So when people pronounce that we have succeeded or failed, we as a government are committed to defending the interests of our farmers and small producers. We are determined on that. That’s not something we can compromise,” Mr. Jaishankar said.\n‘Oil dispute’\nThe Minister also argued that the tariff issue was being wrongly presented as an “oil dispute.” He noted that the same criticism levelled at India for purchasing Russian energy had not been applied to larger importers, such as China and European nations.\nBullying tactics: On India pushing back against the U.S., the EU\n“The second issue is that this is being presented as an oil issue. But why I say ‘being presented’ is because the same arguments that have been used to target India have not been applied to the largest oil importer, which is China, and have not been applied to the largest LNG importer, which is the European nations,” he said.\nMr. Jaishankar pointed out the contradiction in the West’s stance, saying Europe trades far more with Russia than India does.\n“And when people say we are funding the war and putting the money, Russia-European trade is bigger than India-Russia trade. So European money is not putting coffers? The overall Russia-EU trade is bigger than the Russia-India trade. If the argument is energy, they (the EU) are bigger buyers. If the argument is who is the bigger trader, they are bigger than us. India’s exports to Russia have grown, but not that much,” he added.\nThe Minister further said India has every right to take decisions in its own national interest. “The issue of decisions that we make in our national interest is our right. And I would say that’s what strategic autonomy is about,” he said.\nTalks with U.S. ongoing\nOn India-U.S. ties, Mr. Jaishankar said talks were ongoing despite tensions. “We are two big countries, as I say, the lines are not cut, people are talking to each other, and we will see where it goes,” he added.\nWhen asked about Washington’s new ambassador to India, Jaishankar avoided comment, saying, “Look, I am the Foreign Minister, I don’t comment on ambassadorial appointments of other countries.”\nEarlier this week, Jaishankar visited Russia, where he met Russian President Vladimir Putin, Deputy First PM Denis Manturov and Foreign Minister Sergey Lavrov. He also co-chaired the 26th session of the India-Russia Inter-Governmental Commission on Trade, Economic, Scientific, Technological and Cultural Cooperation (IRIGC-TEC).\nAccording to the Ministry of External Affairs (MEA), the visit included discussions on terrorism, the conflict in Ukraine, and regional developments in West Asia and Afghanistan. Mr. Jaishankar also conveyed Prime Minister Narendra Modi’s greetings to President Putin and discussed key bilateral and global issues.\nPublished - August 23, 2025 01:44 pm IST"
    },
    {
      "news_title": "'No Compromise On Farmers’ Interests': Jaishankar Highlights 'Red Line' In India-US Trade Talks",
      "news_link": "https://news.abplive.com/business/no-compromise-on-farmers-interests-jaishankar-highlights-red-line-in-india-us-trade-talks-1796187",
      "bias": "Lean Right",
      "text": "'No Compromise On Farmers’ Interests': Jaishankar Highlights 'Red Line' In India-US Trade Talks\nEAM S. Jaishankar slams US tariffs on Indian goods, defends farmers’ interests, stresses strategic autonomy, rejects mediation on Pakistan, and highlights double standards on Russian oil trade.\nExternal Affairs Minister S. Jaishankar on Saturday strongly criticized the United States for imposing steep tariffs on Indian exports, calling the move “unjustified and unreasonable.” His remarks came after the Trump administration raised duties to over 50 percent, penalizing India for continuing oil purchases from Russia.\nSpeaking at The Economic Times World Leaders Forum 2025, Jaishankar underscored that protecting India’s farmers and small producers remains the government’s top priority.\n“Our red lines are clear, our farmers and small producers. Defending their interests is non-negotiable, and that’s something we will not compromise,” he said.\nTariffs Framed as ‘Oil Dispute’\nJaishankar dismissed the notion that the dispute was about energy trade, pointing out a double standard in the West’s criticism of India.\n“This is being presented as an oil issue, but the same arguments have not been applied to China, the world’s largest oil importer, or to European nations, who are the biggest LNG buyers,” he noted.\nHighlighting the contradictions, he added, “Europe trades far more with Russia than India does. If the argument is that buying energy funds the war, then European money is flowing in larger volumes than India’s. Russia–EU trade is far bigger than Russia–India trade.”\nStrategic Autonomy and National Interest\nThe minister firmly defended India’s right to make independent choices in foreign policy.\n“Decisions we make in our national interest are our right. That is what strategic autonomy is about,” Jaishankar asserted.\nOn ongoing negotiations with Washington, he confirmed that dialogue continues despite tensions: “We are two big countries. The lines are not cut; people are talking to each other. We will see where it goes.”\nWhen asked about the new US ambassador to India, Jaishankar declined to comment, saying it was not his place to weigh in on another country’s diplomatic appointments.\nIndia-Russia Engagement\nJaishankar’s remarks followed his recent visit to Russia, where he met President Vladimir Putin, Deputy First PM Denis Manturov, and Foreign Minister Sergey Lavrov. He also co-chaired the 26th session of the India-Russia Inter-Governmental Commission on Trade, Economic, Scientific, Technological and Cultural Cooperation (IRIGC-TEC).\nAccording to the Ministry of External Affairs, discussions covered terrorism, the Ukraine conflict, West Asia, and Afghanistan. Jaishankar conveyed Prime Minister Narendra Modi’s greetings to Putin and discussed bilateral and global issues.\n#WATCH | Delhi: At The Economic Times World Leaders Forum 2025, EAM Dr S Jaishankar speaks on his meeting with Russian President Vladimir Putin, says, \"We have a practice of annual summits with the Russians. We are planning one at the end of the year. It's an annual exercise.… pic.twitter.com/6ljPU8wnug\n— ANI (@ANI) August 23, 2025\nReflecting on his talks with Putin, Jaishankar said India has consistently supported efforts for an early resolution to the conflict in Ukraine. “Our good wishes are there for an early end to the conflict on terms set by the parties themselves,” he said.\nRejecting Mediation on Pakistan\nReiterating India’s long-standing position, Jaishankar said New Delhi will not accept external mediation in its relations with Pakistan.\n“Since the 1970s, there has been a national consensus that we do not accept mediation on Pakistan. Our positions are very clear—whether on trade, farmers’ interests, or strategic autonomy,” he stressed.\n#WATCH | Delhi: At The Economic Times World Leaders Forum 2025, EAM Dr S Jaishankar says, \"On the issue of mediating (India-Pak conflict), since 1970s, for more than 50 years now, there's a national consensus in this country that we do not accept mediation in our relations with… pic.twitter.com/YtqEE6q2M1\n— ANI (@ANI) August 23, 2025\nOn Trump’s Public Diplomacy\nJaishankar also noted the unusual style of US President Donald Trump’s foreign policy.\n“We have not had a US president who has conducted foreign policy as publicly as the current one. Even domestic policies are being played out in public. Applying tariffs in this way, even for non-trade issues, is a novel approach,” he remarked, adding that the entire world is adjusting to this shift.\nDefiant Stand on Trade\nAddressing criticism of India’s energy trade, Jaishankar delivered a pointed message:\n“It’s funny to have a pro-business American administration accuse others of doing business. If you don’t like buying oil or refined products from India, don’t buy it. Nobody forces you. Europe buys, America buys—so if you don’t like it, simply don’t buy it.”"
    },
    {
      "news_title": "India says trade negotiations with US are still going on",
      "news_link": "https://www.straitstimes.com/asia/south-asia/india-says-trade-negotiations-with-us-are-still-going-on",
      "bias": "Lean Right",
      "text": "India says trade negotiations with US are still going on\nSign up now: Get ST's newsletters delivered to your inbox\nFollow topic:\nMUMBAI – India’s foreign minister Subrahmanyam Jaishankar said on Aug 23 that trade negotiations with the United States are still going on but there are lines that New Delhi needs to defend.\nIndian goods face additional US tariffs of up to 50 per cent, among the highest imposed by Washington, due to its increased purchases of Russian oil. A 25 per cent tariff has already come into effect, while the remaining 25 per cent is set to be enforced from Aug 27.\nA planned visit by US trade negotiators to New Delhi from Aug 25 to 29 has been called off\n“We have some redlines in the negotiations, to be maintained and defended,” Mr Subrahmanyam said at an event in New Delhi, singling out the interests of the country’s farmers and small producers.\nIndia-US trade talks collapsed earlier this year due to India not agreeing to open its vast agricultural and dairy sectors. Bilateral trade between the world’s largest and fifth largest economy is worth over US$190 billion (S$243 billion).\n“It is our right to make decisions in our ‘national interest’,” Mr Jaishankar said.\nAnalysts at Capital Economics said on Aug 22 that if the full US tariffs come into force and stick, the hit to India’s economic growth would be 0.8 percentage points both this year and next.\n“The longer-term harm could be even greater as a high tariff could puncture India’s appeal as a global manufacturing hub,” said the Indian minister, who described US President Donald Trump’s policy announcements as “unusual”.\n“We have not had a US president who conducts his foreign policy so publicly as the current one and it is a departure from the traditional way of conducting business with the world,” Mr Jaishankar said.\nHe also said Washington’s concern over India’s Russian oil purchases was not being applied to other major buyers such as China and the European Union.\n“If the argument is oil, then there are other big buyers. If the argument is who is trading more, than there are bigger traders,” he said.\nRussia-European trade is bigger than India-Russia trade, he added.\nThe minister also said India’s purchases of Russian oil had not been raised in earlier trade talks with the US before the public announcement of tariffs. REUTERS"
    },
    {
      "news_title": "S Jaishankar on India-US trade talks: ‘Negotiations continue, but we have some red lines’",
      "news_link": "https://www.moneycontrol.com/news/india/s-jaishankar-on-india-us-trade-talks-negotiations-continue-but-we-have-some-red-lines-13481599.html",
      "bias": "Lean Right",
      "text": "External affairs minister S Jaishankar on Saturday said that India-US trade negotiations are currently underway, however, the bottom line is that “we have some red lines” – just days before heavy extra US tariffs are due to hit Indian goods.\n“Negotiations are still going on in the sense that nobody said the negotiations are off. People do talk to each other. It is not like there's a 'kutti' there,” he said at the Economic Times World Leaders Forum 2025.\n“Where we are concerned, the red lines are primarily the interests of our farmers and, to some extent, of our small producers... We, as a government, are committed to defending the interests of our farmers and our small producers. We are very determined on that. That's not something that we can compromise on,” he added.\nTalks between India and the US collapsed as India, the world’s fifth-largest economy, opposed opening up its massive agricultural and dairy sectors, despite bilateral trade exceeding $190 billion.\n#WATCH | Delhi: At The Economic Times World Leaders Forum 2025, EAM Dr S Jaishankar says, \"Negotiations (India-US trade negotiations) are still going on. But the bottom line is we have some red lines. Negotiations are still going on in the sense that nobody said the negotiations… pic.twitter.com/deCHoeDSrx— ANI (@ANI) August 23, 2025\nIndian exports face US duties of up to 50 per cent -- which happens to be among the highest imposed by Washington -- after President Donald Trump announced extra tariffs as a punishment over purchases of Russian oil.\nCurrently, a 25 per cent tariff on the import of Indian goods into the US has come into effect, while the remaining 25 per cent is set to be enforced from August 27.\nOn a question over Trump’s hard stance against India, Jaishankar said, \"We've not had a US President who's conducted foreign policy as publicly as the current one. That itself is a departure that's not limited to India... President Trump's way of dealing with the world, even dealing with his own country, is a very major departure from the traditional orthodox manner of doing so.”\nEarlier, commerce minister Piyush Goyal said that India will address its future trade relationship with the United States with a \"very open mind\".\nSpeaking at the same event, Goyal said India is addressing the issue of trade with US with a \"very open mind, a positive outlook and the confidence that India-US relationship is very consequential and very important to both the countries.\"\nDiscover the latest Business News, Budget 2025 News, Sensex, and Nifty updates. Obtain Personal Finance insights, tax queries, and expert opinions on Moneycontrol or download the Moneycontrol App to stay updated!"
    },
    {
      "news_title": "High-Level PMO Meeting Tomorrow as 50% US Tariffs Kick In",
      "news_link": "https://www.prameyanews.com/highlevel-pmo-meeting-tomorrow-as-50-us-tariffs-kick-in",
      "bias": "unknown",
      "text": "Top-Level Meeting Called as US Tariffs Take Effect\nThe Prime Minister’s Office (PMO) will hold a high-level meeting on August 26 to finalize a support package for Indian exporters who are set to be hit by a steep increase in US tariffs. The crucial session comes as the new 50% duty on Indian goods entering the US market is scheduled to come into force on Wednesday.\nUrgent Need to Support Exporters\nThe meeting, which is expected to be chaired by the Principal Secretary to the Prime Minister, will review the various policy options to cushion the blow of the higher tariffs. The US has doubled the existing duties on Indian goods, a move that is expected to severely squeeze the profit margins of exporters and reduce their competitiveness in a key market. The commerce ministry has already been in consultation with export promotion councils to assess the impact.\nTargeted Relief Measures in Focus\nInstead of broad, economy-wide relief, the government is considering more targeted, sector-specific interventions. While exporters had requested a general emergency credit line, officials believe that specific support for the most affected industries could be more effective. The focus is particularly on protecting small and medium enterprises (SMEs) and export-oriented units, which are most vulnerable to such external shocks.\nThe discussions are expected to finalise the details of India’s response, with options like cluster-based working capital funds and sector-specific credit lines under active consideration. The meeting underscores the urgency with which the government is treating the issue as it prepares to navigate the significant economic challenge posed by the new US trade barriers."
    },
    {
      "news_title": "India plantea un gran recorte de impuestos frente a amenaza de aranceles de Donald Trump",
      "news_link": "https://bizrepublic.com/india-plantea-un-gran-recorte-de-impuestos-frente-a-amenaza-de-aranceles-de-donald-trump/",
      "bias": "unknown",
      "text": "NEW DELHI, India. August 25, 2025 — El primer ministro de India, Narendra Modi, plantea un importante recorte de impuestos a los bienes de consumo cotidiano para aliviar a la clase media ante la amenaza de una fuerte subida de aranceles estadounidenses. Los aranceles aplicados a los productos «made in India» que llegan a Estados Unidos, primer socio comercial del país más poblado del mundo, pasaron el 1 de agosto del 10 al 25%.\nAhora, el presidente Donald Trump amenaza con duplicarlos al 50%, como castigo a Nueva Delhi por comprar petróleo de Rusia, sujeta a sanciones occidentales por la invasión de Ucrania. Los aranceles de Trump dependerán del incierto avance de las negociaciones de paz entre Rusia y Ucrania, y de si India consigue un proveedor alternativo de petróleo antes del plazo del 27 de agosto impuesto por el presidente estadounidense.\nLa medida enturbia las perspectivas de la quinta mayor economía del planeta, y los exportadores indios advierten de un declive en los pedidos y pérdidas de empleos en caso de concretarse dicha subida arancelaria. Para amortiguar el golpe, Modi prometió «bajar la carga tributaria sobre la gente común», en un discurso anual pronunciado la pasada semana con motivo de la independencia de India.\nSu propuesta de recortar el impuesto sobre bienes y servicios (IBS) bajaría el precio de todo tipo de productos, según los economistas. El impuesto actualmente funciona con una compleja estructura de cuatro niveles que va del 5% al 28%. En virtud de la reforma de Modi, la mayoría de los productos entraría en dos niveles: 5% y 18%. Modi calificó la reforma como un «regalo diwali», en referencia al festival anual hindú de luces, cuando la gente compra de todo, desde oro y ropa hasta bienes electrónicos.\nAHORRO IMPORTANTE\nLos expertos consideran que la reforma tributaria de Modi podría ayudar a aumentar la demanda, al bajar la recaudación entre 13.000 y 17.000 millones de dólares. Analistas de Emkay Global Financial Services calificaron la medida como «una reforma bienvenida para impulsar el consumo interno». Calcularon que la gran mayoría de bienes actualmente sometidos al impuesto más elevado, del 28%, serán gravados a un 18%, mientras que «casi todos» los de la categoría del 12% pasarán a un 5%.\nAnalistas de la firma india de servicios financieros Motilal Oswal indicaron que la reforma traerá beneficios a una amplia gama de sectores, con ahorros importantes para los hogares. Pero el recorte depende del Consejo IBS, que incluye a representantes de los gobiernos estatales, donde Modi ha tenido dificultades en obtener un consenso. De ser aprobados, los cortes impactarán las finanzas públicas, según expertos.\nNo obstante, señalan también que ayudarán a compensar los riesgos por los aranceles y fortalecer la imagen de Modi entre la clase media. «La narrativa económica popular ahora es la de los aranceles de Trump del 50% y el retroceso en las relaciones Estados Unidos-India», comentó a AFP Deepanshu Mohan, economista de la Universidad O.P. Jindal Global.\n«El reajuste del IBS es una respuesta fuerte de Modi en ese contexto. Es Modi diciéndole a la clase media: ‘Estamos intentando asegurar que tú tengas suficiente’», señaló Mohan. Aun así, agregó, también es un reconocimiento de que la economía india no ha beneficiado «por mucho tiempo a su clase media baja».\nDIÁLOGO COMERCIAL\nLos economistas estiman que si India y Estados Unidos no alcanzan un acuerdo comercial, los aranceles golpearán el crecimiento económico indio, que será inferior a 6% este año fiscal, por debajo de la proyección del banco central de 6,5%. La posición india sobre la importación de crudo ruso quedará clara a finales de septiembre, porque la mayoría de los embarques actuales fueron contratados antes de las amenazas de Trump, según la firma de inteligencia Kpler.\nSumit Ritolia, analista de Kpler, dijo a AFP que «mientras no haya un claro giro político o un cambio sostenido en la economía comercial, los flujos desde Rusia serán parte integral de la canasta petrolera india». En tanto, el estado de las negociaciones comerciales Estados Unidos-India permanece incierto. India dice estar comprometida con alcanzar un acuerdo, pero reportes de la prensa india indican que negociadores estadounidenses aplazaron una visita a Nueva Delhi prevista para finales de agosto.\nCon información de Agence France-Presse (AFP)"
    },
    {
      "news_title": "Large-cap stock picks: Think bullish, but learn to live with & ignore volatility: 5 stocks from different sectors with an upside potential of up to 42% - GAGA INDIA",
      "news_link": "https://mrgaga.in/large-cap-stock-picks-think-bullish-but-learn-to-live-with-ignore-volatility-5-stocks-from-different-sectors-with-an-upside-potential-of-up-to-42/",
      "bias": "unknown",
      "text": "Synopsis\nThe probability of a correction if there is no positive development on the India-US trade deal is quite high. The fact, however, remains that the market has recovered each time there is some such crisis, and it will do so this time as well. But, as valuations are high at this point, the pace and breadth of recovery may differ when compared to the earlier corrections. So, just focus on stocks with a high probability of making it to the list that will lead the first wave of recovery. Those will be stocks where the businesses are on the right path and the runway for growth is clearly visible. Also, where the management has a track record.\nWhat will happen to the market if there is no solution achieved by August 27 and the additional 25% Trump tariff kicks in? The probability is that we will see higher volatility. Now, the question most investors would be grappling with would be: Will the market stay volatile today, tomorrow, or for that matter the whole of August and September? And, will it also correct further? Maybe, or maybe not. The fact is that no one can provide an accurate\n- FONT SIZE\nAbcSmall\nAbcMedium\nAbcLarge\nUh-oh! This is an exclusive story available for selected readers only.\nWorry not. You’re just a step away.\nWhat’s Included with\nETPrime Membership\n1Invest Wisely With Smart Market Tools & Investment Ideas\nInvestment Ideas\nGrow your wealth with stock ideas & sectoral trends.\nStock Reports Plus\nBuy low & sell high with access to Stock Score, Upside potential & more.\nBigBull Portfolio\nGet to know where the market bulls are investing to identify the right stocks.\nStock Analyzer\nCheck the score based on the company’s fundamentals, solvency, growth, risk & ownership to decide the right stocks.\nMarket Mood\nAnalyze the market sentiments & identify the trend reversal for strategic decisions.\nStock Talk Live at 9 AM Daily\nAsk your stock queries & get assured replies by ET appointed, SEBI registered experts.\n2Stay informed anytime, anywhere with ET ePaper\nePaper – Print View\nRead the PDF version of ET newspaper. Download & access it offline anytime.\nePaper – Digital View\nRead your daily newspaper in Digital View & get it delivered to your inbox everyday.\nWealth Edition\nManage your money efficiently with this weekly money management guide.\n3Exclusive Insights That Matter\n4Times Of India Subscription (1 Year)\nTOI ePaper\nRead the PDF version of TOI newspaper. Download & access it offline anytime.\nDeep Explainers\nExplore the In-depth explanation of complex topics for everyday life decisions.\nHealth+ Stories\nGet fitter with daily health insights committed to your well-being.\nPersonal Finance+ Stories\nManage your wealth better with in-depth insights & updates on finance.\nNew York Times Exclusives\nStay globally informed with exclusive story from New York Times.\n5Enjoy Complimentary Subscriptions From Top Brands\nTimesPrime Subscription\nAccess 20+ premium subscriptions like Spotify, Uber One & more.\nDocubay Subscription\nStream new documentaries from all across the world every day.\n6Get Inspired by Grandmasters\nSource link"
    },
    {
      "news_title": "India-U.S. Trade Talks Persist Despite New Tariffs - Blockchain & Cryptocurrencies Tabloid",
      "news_link": "https://theccpress.com/india-us-trade-talks-persist-despite-new-tariffs/",
      "bias": "unknown",
      "text": "- India’s trade negotiations with the U.S. persist despite new tariffs.\n- Farmers’ interests are prioritized by India.\n- Tariffs challenge several Indian export sectors.\nIndia’s Foreign Minister S. Jaishankar announced ongoing trade talks with the U.S. despite new tariffs linked to Russian oil imports, emphasizing protections for Indian farmers and small producers.\nThe trade tensions could affect sectors reliant on Indian exports, including agriculture and textiles, but have not yet impacted global cryptocurrency markets or caused regulatory responses.\nIndia’s External Affairs Minister, S. Jaishankar, reiterated that trade negotiations with the U.S. will continue. There is an emphasis on protecting India’s farmers and small producers amid escalating tariff tensions.\nKey players, including S. Jaishankar and Commerce Minister Piyush Goyal, defend India’s trading interests. The U.S. tariffs address India’s imports of Russian crude oil, yet trade talks will persist, maintaining crucial red lines.\nNew tariffs are creating economic challenges for Indian exporters, notably in sectors like agriculture and textiles. Despite economic strains, India is poised to protect its market position and community interests.\nOn a financial level, U.S. tariffs, increasing from 25% to 50%, aim to penalize trade tied to Russian oil. Politically, India remains firm in asserting its trade autonomy and small producers’ interests.\nMarket analysts observe potential shifts within sectors subjected to new tariffs. Still, firm stances by India might mitigate long-term economic repercussions.\nWhile crypto markets remain unaffected, analysts compare the crisis to the U.S.-China trade war. Historical parallels suggest limited crypto interference but emphasize India’s strategic capture of market tides.\n| Disclaimer: The content on The CCPress is provided for informational purposes only and should not be considered financial or investment advice. Cryptocurrency investments carry inherent risks. Please consult a qualified financial advisor before making any investment decisions. |"
    },
    {
      "news_title": "India-US Tariff War: We know our strength, Trump's method is different... Jaishankar spoke on the bitterness with the US",
      "news_link": "https://www.zoomnews.in/en/news-detail/we-know-our-strength-trumps-method-is-different-jaishankar-spoke-on-the-bitterness-with-the-us.html",
      "bias": "unknown",
      "text": "- India,\n- 23-Aug-2025 03:20 PM IST\nIndia-US Tariff War: After the India-Pakistan ceasefire and tariff war, tensions are being seen in the relations between New Delhi and Washington. US President Donald Trump has made sharp statements several times regarding tariffs on India. Recently, he announced to impose 50 percent tariff on India, which has further complicated the trade relations between the two countries. Meanwhile, India's Foreign Minister Dr. S Jaishankar openly expressed his views on the current relations and trade deal with America in a program.Trump's unique styleForeign Minister Jaishankar said, \"We are talking about all the options with America. We have not seen any American President till now who has conducted foreign policy in such a public and transparent manner. This is a big change in itself, which is not limited to India only. President Trump's way of dealing with the world and his country is very different.\"He further said that this style of Trump has brought a new dimension to global diplomacy. India is molding its policies understanding this change, but is giving priority to protecting its interests.Trade deal: Talks on, but red lines remainRegarding the ongoing talks on the India-US trade deal, Jaishankar said, \"Talks are still on. Nobody has said that the talks have stopped. People are communicating with each other, and it is not as if there has been any 'kutti' (difference).\" He made it clear that there are some red lines for India, especially to protect the interests of farmers and small producers.\"Our government is fully committed to protecting the interests of our farmers and small producers. This is an issue on which we cannot compromise. Our red lines are clear, and we are firm on them,\" Jaishankar asserted.Operation Sindoor and international diplomacyCommenting on the relationship between Pakistan and the US, Jaishankar said that there has been a long history of friendship between the two countries. However, he also pointed out that Pakistan has always done politics according to its convenience. “We have an understanding of our strengths and our relationships. Even during Operation Sindoor, there were dialogues with many countries, including the US. This is the normal process in international relations,” he said.Jaishankar also mentioned that there was dialogue with the US and other countries during Operation Sindoor, as is normal during times of war. This shows that India is strongly implementing its diplomatic strategy."
    },
    {
      "news_title": "Jaishankar Condemns U.S. Tariffs | India Supports Farmers' Rights Unwaveringly",
      "news_link": "https://www.mondialnews.com/2025/08/23/jaishankar-condemns-u-s-tariffs-pledges-indias-unwavering-support-for-farmers-rights/",
      "bias": "unknown",
      "text": "In a firm rebuttal to recent U.S. trade measures, External Affairs Minister S. Jaishankar has asserted that India will not compromise on the interests of its farmers amid escalating tariff disputes. Speaking amid growing tensions over agricultural imports and trade policies, Jaishankar emphasized the country’s commitment to protecting its domestic agricultural sector, underscoring the importance of fair and equitable trade practices. The statement comes as both nations navigate a complex economic relationship marked by competing interests and ongoing negotiations.\nJaishankar condemns US tariffs citing detrimental impact on Indian farmers\nIndia’s External Affairs Minister, S. Jaishankar, has sharply criticized the imposition of tariffs by the United States, underscoring the profound negative effects these measures have on Indian farmers. Speaking at a recent press conference, Jaishankar highlighted that such duties disrupt trade balances and threaten the livelihoods of the agricultural community, which forms the backbone of India’s rural economy. He emphasized that India remains committed to protecting its farmers and will actively seek resolutions through diplomatic dialogues and multilateral forums.\n- Impact on agriculture exports: Reduced competitiveness in U.S. markets\n- Threat to bilateral trade beyond agriculture, affecting key sectors\n- Calls for fair trade practices consistent with World Trade Organization norms\nIn addition to reiterating India’s resolve, Jaishankar pointed to the government’s ongoing initiatives aimed at uplifting farming communities amid global economic uncertainties. The minister assured that safeguarding farmers’ interests remains a non-negotiable priority as India navigates complex international trade dynamics.\n| Tariff Impact | Indian Crop Exported | Estimated Annual Loss (in million USD) |\n|---|---|---|\n| 5% on Almonds | Almonds | 120 |\n| 15% on Basmati Rice | Basmati Rice | 250 |\n| 10% on Spices | Various Spices | 70 |\nIndia reaffirms commitment to safeguarding agricultural sector amid international trade tensions\nExternal Affairs Minister S. Jaishankar firmly addressed growing concerns over the recent U.S. tariffs targeting Indian agricultural exports. In a clear message to international stakeholders, he emphasized that India’s agricultural sector is a national priority and that any external economic pressure will not deter the government’s resolve to protect farmers’ livelihoods. Jaishankar underscored the importance of fair trade practices and called for dialogue based on mutual respect rather than unilateral measures that could disrupt long-standing commercial ties.\nHighlighting India’s multifaceted approach, the minister detailed key strategies designed to bolster the sector against global volatility:\n- Enhanced subsidies and support for small and marginal farmers to improve production and market access.\n- Diversification initiatives encouraging crop variety improvements and sustainable farming techniques.\n- Investment in agro-infrastructure including cold storage and logistics to reduce post-harvest losses.\n- Strengthened export promotion councils to navigate trade complexities and seek new overseas markets.\n| Key Area | Measures | Expected Impact |\n|---|---|---|\n| Farmer Income | Direct benefit transfers, MSP reforms | Stabilized earnings |\n| Export Growth | Trade diversification, market access | Increased global footprint |\n| Infrastructure | Cold storage, rural roads | Reduced wastage |\n| Technology Adoption | Digital platforms, crop insurance | Enhanced resilience |\nExperts call for diplomatic dialogue to resolve tariff disputes and protect farmers’ livelihoods\nAs tensions escalate over recent U.S. tariff impositions, experts emphasize the urgent need for sustained diplomatic engagement between India and the United States. They argue that constructive dialogue remains the most viable path to de-escalate trade frictions without compromising the well-being of farmers, a group critically impacted by these economic measures. Rather than resorting to retaliatory tariffs or unilateral policy shifts, experts suggest that both countries focus on cooperative frameworks to address underlying concerns.\nKey recommendations put forth by analysts include:\n- Establishing bilateral trade committees with agricultural experts\n- Implementing transparent dispute resolution mechanisms\n- Prioritizing direct consultations with farming communities\n- Exploring mutual tariff reductions calibrated to protect vulnerable sectors\n| Stakeholder | Primary Concern | Proposed Solution |\n|---|---|---|\n| Indian Farmers | Market access and stable income | Safeguard tariff protections; seek fair trade terms |\n| U.S. Exporters | Reduction of Indian import barriers | Inclusive negotiations for gradual tariff easing |\n| Governments | Trade balance and diplomatic relations | Engage in continuous diplomatic talks |\nThe Conclusion\nAs tensions over trade policies continue to simmer, External Affairs Minister S. Jaishankar’s firm stance underscores India’s commitment to safeguarding its agricultural sector amid international pressure. The confrontation with U.S. tariffs highlights deeper challenges in bilateral relations, with New Delhi signaling that farmers’ welfare remains a non-negotiable priority. How this impasse will evolve remains to be seen, but for now, India’s resolve appears clear and unwavering."
    },
    {
      "news_title": "'Negotiations Continue, But We Have Some Red Lines': EAM Jaishankar On India-US Trade Deal",
      "news_link": "https://www.ndtvprofit.com/nation/negotiations-continue-but-we-have-some-red-lines-eam-jaishankar-on-india-us-trade-deal",
      "bias": "unknown",
      "text": "'Negotiations Continue, But We Have Some Red Lines': EAM Jaishankar On India-US Trade Deal\nIndia-US Trade Deal: The external affairs minister said trade is 'really the major issue' between the two countries.\nIndia has certain 'red-lines' about its trade negotiations with the US and India will not compromise on protecting the interests of farmers and small producers, External Affairs Minister S Jaishankar said on Saturday. \"We've not had a US president who has conducted foreign policy as publicly as the current one. That itself is a departure that's not limited to India,\" he said.\nThe relations between India and the US are on a downturn after Trump doubled tariffs on Indian goods to 50%, including 25% additional duties for India's purchase of Russian crude oil. The external affairs minister said trade is 'really the major issue' between the two countries.\nALSO READ\n'If You Have A Problem, Don't Buy Refined Petroleum Products From India': EAM Jaishankar To US\n\"The negotiations are still going on and the bottom line is we have some red lines. The red lines are primarily the interest of our farmers and to some extent small producers. So when people pronounced that we succeeded or failed,\" he said.\n\"My answer to this is, we as a government are committed to defend the interests of our farmers and small producers. We are very determined on that. That's not something we can compromise on,\" he added.\nThe external affairs minister also responded to allegations by Trump administration officials that India is 'profiteering' by buying discounted Russian crude oil, then selling refined petroleum products at premium prices in Europe.\n\"It's funny to have people who work for a pro-business American administration accusing other people of doing business. That's really curious. If you have a problem buying oil or refined products from India, don't buy it. Nobody forces you to buy it. But Europe buys, America buys, so you don't like it, don't buy it,\" he said.\nThe external affairs minister also rejected observations that India's relations with China are improving in view of strain in India-US ties.\n(With inputs from PTI)"
    },
    {
      "news_title": "Jaishankar says India won't compromise on farmers' interests - Asian News from UK",
      "news_link": "https://asianlite.com/2025/top-news/jaishankar-says-india-wont-compromise-on-farmers-interests/",
      "bias": "unknown",
      "text": "India’s External Affairs Minister S Jaishankar declared New Delhi will never compromise on protecting farmers and small producers, vowing resistance against unfair US tariffs and external pressure.\nExternal Affairs Minister S Jaishankar has blasted Washington’s fresh round of tariffs on Indian goods, calling them “unjustified and unreasonable,” as trade tensions between New Delhi and the Trump administration flare up once again.\nSpeaking at The Economic Times World Leaders Forum 2025 on Saturday, Jaishankar drew a firm line, stressing that India would not bow to external pressure when it came to safeguarding its farmers and small producers.\n“Our red lines are clear — protecting the interests of our farmers and small producers. That is not something we can compromise,” Jaishankar declared.\nThe Trump administration this week slapped punitive tariffs of more than 50 per cent on several Indian exports, citing New Delhi’s continued purchase of Russian oil. But Jaishankar dismissed the framing as misleading, arguing that India was being unfairly singled out while others escaped scrutiny.\n“This is being presented as an oil issue,” Jaishankar said, “but the same criticism has not been applied to China, the largest oil importer, or to European nations, the largest LNG importers. Europe’s trade with Russia far exceeds ours — if their money isn’t funding the war, why single out India?”\nThe minister underscored what he described as Western hypocrisy, pointing out that Russia-EU trade remains significantly larger than Russia-India trade. “India’s exports to Russia have grown, yes, but not dramatically. The numbers don’t justify the kind of pressure we’re facing,” he added.\nJaishankar used the moment to reiterate India’s broader doctrine of strategic autonomy. “The issue of decisions which we make in our national interest is our right. That is what strategic autonomy is about,” he said, drawing applause from the audience.\nDespite the friction, Jaishankar signalled that lines of communication between New Delhi and Washington remained open. “We are two big countries. The lines are not cut, people are talking, and we will see where it goes,” he noted.\nOn the appointment of Washington’s new ambassador to India, however, he refused to be drawn, quipping: “I am the Foreign Minister, I don’t comment on ambassadorial appointments of other countries.”\nJaishankar’s remarks come just days after a high-profile visit to Moscow, where he met President Vladimir Putin, Deputy PM Denis Manturov, and Foreign Minister Sergey Lavrov. He co-chaired the 26th session of the India-Russia Inter-Governmental Commission, covering trade, technology, energy, and regional security, while also conveying Prime Minister Narendra Modi’s greetings to Putin.\nThe talks, according to the Ministry of External Affairs, ranged across terrorism, the war in Ukraine, and security developments in West Asia and Afghanistan — signalling India’s determination to keep its diplomatic options open, even as pressure mounts from the West.\nWith Washington hardening its stance and Moscow tightening its embrace, New Delhi faces one of its toughest balancing acts yet — but Jaishankar’s message was clear: India won’t be dictated to on how it manages its economy, its energy supplies, or its sovereignty."
    },
    {
      "news_title": "We've not had a US president who...: Jaishankar amid tariff war",
      "news_link": "https://www.rediff.com/news/report/weve-not-had-a-us-president-who-jaishankar-amid-tariff-war/20250823.htm",
      "bias": "unknown",
      "text": "India has certain \"red lines\" in its negotiations for a trade deal with the United States and it will stand firm in protecting the interests of farmers and small producers, External Affairs Minister S Jaishankar said on Saturday, days before additional American tariffs on Indian goods are set to come into effect.\nJaishankar also sounded critical of the US for targeting New Delhi's energy ties with Moscow and wondered why the same yardstick has not been applied to China and the European Union, the largest importer of Russian crude oil and Russian LNG, respectively.\nThe external affairs minister, speaking at the Economic Times World Leaders Forum, also made it clear that India does not accept mediation in its relations with Pakistan and there has been a national consensus over it for more than 50 years.\nHis comments came in the face of President Donald Trump's repeated claims that he defused the India-Pakistan military conflict in May.\nJaishankar flagged trade and tariff, procurement of Russian crude oil and Washington's assertion on the conflict as the three main issues India has with the US at present.\nThe relations between New Delhi and Washington are on a downturn after Trump doubled tariffs on Indian goods to a whopping 50 per cent, including a 25 per cent additional duty for India's purchase of Russian crude oil.\nThe 25 per cent tariff has already come into effect and additional levies are due from August 27.\nJaishankar said that US President Trump's way of dealing with the world is a very major departure from the traditional way of doing so and the entire world is facing this issue.\n\"We've not had a US President who has conducted foreign policy as publicly as the current one. That itself is a departure that's not limited to India,\" he said.\nThe external affairs minister said trade is \"really the major issue\" between the two countries, adding India has certain \"red lines\" and that the negotiations for the proposed trade are underway.\n\"We as the government are committed to defend the interests of our farmers and small producers. We are very determined on that. That's not something we can compromise on,\" he said.\nThe negotiations for a bilateral trade deal between the two countries hit a roadblock after India refused to open up its agricultural and dairy sectors.\nThe external affairs minister also responded to repeated allegations by Trump administration officials that India is \"profiteering\" by buying discounted Russian crude oil and then selling refined petroleum products at premium prices in Europe and other places.\n\"It's funny to have people who work for a pro-business American administration accusing other people of doing business,\" Jaishankar said.\n\"That's really curious. If you have a problem buying oil or refined products from India, don't buy it. Nobody forces you to buy it. But Europe buys, America buys, so you don't like it, don't buy it,\" he said.\nJaishankar listed India's procurement of Russian crude oil as the second key issue in its ties with the US.\n\"The second issue, in a way, is being presented as an oil issue. But why I say it's being presented is because the same arguments which have been used to target India have not been applied to the largest oil importer, which is China, has not been applied to the largest LNG importer, which is the European Union,\" he said.\n\"And when people say we are funding the war or putting money in the coffers of (President Vladimir) Putin... the Russia-European Union trade is bigger than India-Russia trade. So is Europe not putting money into Putin's coffers,\" he asked.\nJaishankar acknowledged that India's procurement of Russian crude oil has gone up in the last few years and noted that it is driven by national interests.\n\"That's our right. In my business, we would say that's what strategic autonomy is about,\" he said.\n\"We are buying (Russian) oil to stabilise the oil market. Yes, it is in our national interest. We have never pretended otherwise, but we also say it is in global interest.\"\nThe external affairs minister indicated that Washington's claim on the India-Pakistan conflict is the third issue New Delhi has with the US.\n\"The third issue pertains to our own region, which is the issue of mediating. Since the 1970s, for more than 50 years now, there is a national consensus in this country that we do not accept mediation in our relations with Pakistan,\" he said.\nThe external affairs minister also rejected observations that India's relations with China are improving in view of the strain in New Delhi-Washington ties.\n\"I think it would be a mistaken analysis to try and crunch everything and make it into an integrated response to a very specific situation,\" he said."
    },
    {
      "news_title": "We have certain red lines: EAM Jaishankar on negotiations for trade deal with US",
      "news_link": "https://www.newsdrum.in/national/we-have-certain-red-lines-eam-jaishankar-on-negotiations-for-trade-deal-with-us-9726185",
      "bias": "unknown",
      "text": "New Delhi: India has certain \"red-lines\" in its trade negotiations with the US and New Delhi will not compromise on protecting the interests of farmers and small producers, External Affairs Minister S Jaishankar said on Saturday.\nJaishankar said the negotiations for a trade deal between the two sides are underway.\nSpeaking at the Economic Times World Leaders Forum, Jaishankar also said that US President Donald Trump's way of dealing with the world is a very major departure from the traditional way of doing so and the entire world is facing this issue.\n\"We've not had a US president who has conducted foreign policy as publicly as the current one. That itself is a departure that's not limited to India,\" he said.\nThe relations between New Delhi and Washington are on a downturn after Trump doubled tariffs on Indian goods to a whopping 50 per cent, including 25 per cent additional duties for India's purchase of Russian crude oil.\nThe external affairs minister said trade is \"really the major issue\" between the two countries.\n\"The negotiations are still going on and the bottom line is we have some red lines.\" \"The red lines are primarily the interest of our farmers and to some extent small producers. So when people pronounced that we succeeded or failed etc.\"\n\"My answer to this is -- we as a government are committed to defend the interests of our farmers and small producers. We are very determined on that. That's not something we can compromise on.\"\nThe external affairs minister also responded to repeated allegations by Trump administration officials that India is \"profiteering\" by buying discounted Russian crude oil and then selling refined petroleum products at premium prices in Europe and other places.\n\"It's funny to have people who work for a pro-business American administration accusing other people of doing business,\" Jaishankar said.\n\"That's really curious. If you have a problem buying oil or refined products from India, don't buy it. Nobody forces you to buy it. But Europe buys, America buys, so you don't like it, don't buy it,\" he added.\nThe external affairs minister also rejected observations that India's relations with China are improving in view of strain in New Delhi-Washington ties.\n\"I think it would be a mistaken analysis to try and crunch everything and make it into an integrated response to a very specific situation,\" he said."
    },
    {
      "news_title": "Jaishankar slammed us tariffs, says that India will not compromise on the interests of farmers",
      "news_link": "https://www.thelocalreport.in/jaishankar-slammed-us-tariffs-says-that-india-will-not-compromise-on-the-interests-of-farmers/",
      "bias": "unknown",
      "text": "New Delhi, 23 August: The Trump administration said that after extending more than 50 percent of the duty for the purchase of India’s Russian oil, External Affairs Minister S Jaishankar on Saturday said in the United States for “unfair and inappropriate and unfair” tariffs in the United States.\nSpeaking at the Economic Times World Leaders Forum 2025, Jaishankar said that India’s priority is to protect farmers and small producers, saying that New Delhi will not compromise on their interests.\n“We are worried about that red lines are mainly interested in our farmers and to some extent, our small producers. So when people say that we have succeeded or failed, we are committed to defending the interests of our farmers and small producers as a government. We are set on it. We can do nothing.”\nThe minister also argued that the tariff issue was incorrectly being presented as “oil dispute”. He said that the same criticism in India to buy Russian energy was not implemented to large importers, such as China and European nations.\n“The second issue is that it is being presented as an oil issue. But why do I say ‘is being presented’ because the same arguments used to target India have not been applied to the largest oil importer, which is China, and not applied to the largest LNG importer, which is European countries.”\nJaishankar pointed to the contradiction in the west stance, stating that Europe trades more with Russia than in India. “And when people say that we are financing war and putting money, Russia-European trade is larger than India-Russia trade. So European is not putting Coffeers Coffeers? Overall Russia-European Union’s trade is larger than Russia-India’s business. If logic is energy, they (European Union) are big. He said.” He said.\nThe minister further said that India has every right to take decisions in its national interest. He said, “The issue of decisions we make in our national interest is our right. And I would say what strategic autonomy is,” he said.\nOn Indo-American relations, Jaishankar said that negotiations were going on despite stress. He said, “We are two big countries, as I say, lines are not cut, people are talking to each other, and we will see where it goes,” he said.\nWhen asked about the new Washington’s new ambassador to India, Jaishankar refrained from the comment, saying, “Look, I am a foreign minister, I do not comment on the ambassador appointments of other countries.”\nEarlier this week, Jaishankar visited Russia, where he met Russian President Vladimir Putin, Deputy First PM Dennis Manturov and Foreign Minister Sergei Lavrov. He co-headed the 26th session of the Indo-Russian Commission on Trade, Economic, Scientific, Technical and Cultural Cooperation (IRIGC-Tea).\nAccording to the Ministry of External Affairs (Mea), the journey included discussion on terrorism, struggle in Ukraine and regional development in West Asia and Afghanistan. Jaishankar greeted President Putin on Prime Minister Narendra Modi and discussed major bilateral and global issues. (AI)"
    },
    {
      "news_title": "US tariffs on India over Russia trade ‘unjustified’, says S Jaishankar",
      "news_link": "https://madhyamamonline.com/india/us-tariffs-on-india-over-russia-trade-unjustified-says-s-jaishankar-1440398",
      "bias": "unknown",
      "text": "US tariffs on India over Russia trade ‘unjustified’, says S Jaishankar\ntext_fieldsNew Delhi: External Affairs Minister S. Jaishankar on Friday criticised Washington’s decision to impose additional tariffs on Indian goods, calling the move “unjustified and unreasonable.”\nHe stressed that New Delhi would continue trade negotiations with the United States but made it clear that India had “redlines” that must be defended.\nSpeaking at The Economic Times World Leaders Forum 2025, Jaishankar argued that the issue was being wrongly portrayed as a dispute over oil. “If the argument is oil, then there are (other) big buyers. If argument is who is trading more (with Russia), than there are bigger traders,” he said. He noted that Russia’s trade with Europe is much larger than its trade with India.\n“This is being presented as an oil issue. But why I say ‘being presented’ is because the same arguments that have been used to target India have not been applied to the largest oil importer, which is China, and the largest LNG importer, which is the European nations,” he added.\nThe minister underscored that discussions with Washington were ongoing, but India would not compromise on certain national interests. “We have some redlines in the negotiations, to be maintained and defended,” Jaishankar said.\nCurrently, Indian exports face additional US tariffs of up to 50% in response to India’s continued purchases of Russian oil. A 25% tariff has already been enforced, with a further 25% scheduled to come into effect from August 27."
    },
    {
      "news_title": "India draws ‘redlines’ in US trade talks",
      "news_link": "https://minutemirror.com.pk/india-draws-redlines-in-us-trade-talks-428156/",
      "bias": "unknown",
      "text": "NEW DELHI_ Indian External Affairs Minister Subrahmanyam Jaishankar on Saturday asserted that trade talks with Washington continued but emphasized that New Delhi would strongly uphold its “redlines,” even as new US tariffs loom to hurt Indian exports within days.\nAddressing an Economic Times conference in New Delhi, Mr. Jaishankar stated that even as talks with American officials went on, India’s farmers and small producers would not be offered up at the negotiating table. “We have some redlines in the negotiations, to be maintained and defended,” he stated, going on to say that New Delhi had the right to act in its “national interest.”\nHis statements are made at a crucial point in US-India relations, with President Donald Trump’s administration announcing further tariffs of as much as 50% on Indian products starting August 27. An initial tranche of 25% tariffs has already been implemented, and the second half is to be enforced next week.\nThe escalation follows Washington’s criticism of India’s sharply increased purchases of Russian oil, which US Treasury Secretary Scott Bessent recently described as “profiteering.” The Trump administration argues that New Delhi’s trade with Moscow undermines sanctions linked to the war in Ukraine.\nA scheduled visit by US trade negotiators to India between August 25 and 29 was suddenly called off, ending hopes of a last-minute deal to reduce or delay the tariff increases. The two sides had already run into trouble earlier this year as India rejected offers to open up its dairy and farm markets.\nEconomists say the higher tariffs will hurt India’s growth significantly. Capital Economics analysts estimated the levies will cut India’s GDP growth this year and next by 0.8 percentage points. “The longer-term damage might even be worse as a high tariff could deflate India’s image as a manufacturer for the world,” they warned.\nMr. Jaishankar meanwhile called Trump’s diplomacy “unusual,” observing that no American president before him had pursued foreign policy so openly. He also rejected Washington’s selective pressure, noting that major consumers of Russian oil such as China and the European Union had not been similarly penalized.\n“If the case is oil, there are [other] large buyers. If the case is who is doing more [trade with Russia], then there are larger traders,” he told said, indicating that trade volumes between Russia and the EU were much higher than those between Moscow and New Delhi.\nIn spite of the impending showdown, Jaishankar asserted India would make its economic decisions with sovereignty preserved. “It is our right to make decisions in our national interest,” he reiterated.\nWe welcome your contributions! Submit your blogs, opinion pieces, press releases, news story pitches, and news features to opinion@minutemirror.com.pk and minutemirrormail@gmail.com"
    },
    {
      "news_title": "Jaishankar: No compromise on farmers in India-US trade talks",
      "news_link": "https://www.newsbytesapp.com/news/india/jaishankar-explains-red-lines-in-us-trade-negotiations/story",
      "bias": "unknown",
      "text": "Jaishankar: No compromise on farmers in India-US trade talks\nWhat's the story\nExternal Affairs Minister S Jaishankar has reiterated India's firm commitment to safeguarding its farmers' interests and strategic autonomy in ongoing trade negotiations with the United States. Speaking at The Economic Times World Leaders Forum, he emphasized that these \"red lines\" are non-negotiable for India. \"Where we are concerned, the red lines are primarily the interests of our farmers and, to some extent, of our small producers,\" he said.\nTrade tensions\nUS pushing India to open markets to American agricultural products\nThe trade talks between India and the US have been stalled over major differences, with the US pressuring India to open its markets to American dairy, poultry, and agricultural products such as corn and soybeans. However, India continues to resist these demands due to concerns over genetically modified crops and their potential impact on health and the environment.\nPolitical commitment\nModi's stand on protecting farmers' interests\nPrime Minister Narendra Modi has also publicly committed to protecting farmers' interests. In his Independence Day speech, he said, \"Modi is standing like a wall against any harmful policy related to farmers, fishermen, and cattle rearers of India.\" Jaishankar also took a firm stand on India's strategic autonomy regarding Russian oil imports. He said decisions would be taken in the national interest despite external pressures.\nDiplomatic stance\nJaishankar rules out mediation with Pakistan\nOn the issue of mediation with Pakistan, Jaishankar reiterated India's long-standing position against it. He said, \"Since the 1970s... there's a national consensus in this country that we do not accept mediation in our relations with Pakistan.\" The minister emphasized that while India is open to dialogue and negotiation, it will not compromise on issues vital to its sovereignty and citizens' welfare."
    },
    {
      "news_title": "India says US trade negotiations are still going on as fresh tariffs",
      "news_link": "https://www.thedailystar.net/business/news/india-says-us-trade-negotiations-are-still-going-fresh-tariffs-loom-3968881",
      "bias": "unknown",
      "text": "India says US trade talks are still going on\nIndia's foreign minister said on Saturday that trade negotiations with Washington are continuing but there are lines that New Delhi needs to defend, just days before hefty additional US tariffs are due to hit.\nIndian goods face additional US tariffs of up to 50 percent, among the highest imposed by Washington, due to its increased purchases of Russian oil. A 25 percent tariff has already come into effect, while the remaining 25 percent is set to be enforced from August 27A planned visit by US trade negotiators to New Delhi from August 25-29 has been called off, dashing hopes that the levies may be lowered or postponed.\n\"We have some redlines in the negotiations, to be maintained and defended,\" Indian Foreign Minister Subrahmanyam Jaishankar said at an Economic Times forum event in New Delhi, singling out the interests of the country's farmers and small producers.\nIndia-US trade talks collapsed earlier this year due to India not agreeing to open its vast agricultural and dairy sectors. Bilateral trade between the world's largest and fifth largest economy is worth over $190 billion.\n\"It is our right to make decisions in our 'national interest',\" Jaishankar said.\nAnalysts at Capital Economics said on Friday that if the full US tariffs come into force and stick, the hit to India's economic growth would be 0.8 percentage points both this year and next.\n\"The longer-term harm could be even greater as a high tariff could puncture India's appeal as a global manufacturing hub.\"\nThe Indian minister described US President Donald Trump's policy announcements as \"unusual\".\n\"We have not had a US president who conducts his foreign policy so publicly as the current one and (it) is a departure from the traditional way of conducting business with the world,\" Jaishankar said.\nHe also said Washington's concern over India's Russian oil purchases was not being applied to other major buyers such as China and European Union.\n\"If the argument is oil, then there are (other) big buyers. If argument is who is trading more (with Russia), than there are bigger traders,\" he said.\nRussia-European trade is bigger than India-Russia trade, he added.\nThe minister also said India's purchases of Russian oil had not been raised in earlier trade talks with the US before the public announcement of tariffs.\nComments"
    },
    {
      "news_title": "Trade talks on with US but interest of farmers and small producers our priority: EAM Jaishankar - tennews.in: National News Portal",
      "news_link": "https://tennews.in/trade-talks-on-with-us-but-interest-of-farmers-and-small-producers-our-priority-eam-jaishankar/",
      "bias": "unknown",
      "text": "Trade talks on with US but interest of farmers and small producers our priority: EAM Jaishankar\nNew Delhi, Aug 23 (IANS) External Affairs Minister (EAM) S. Jaishankar on Saturday said that the India-US trade negotiations are still underway but “we have some red lines”, as the country stared at steep 50 per cent tariffs from August 27.\nSpeaking at the ‘Economic Times World Leaders Forum 2025’ here, EAM Jaishankar shared that negotiations with the US are underway.\n“What we are concerned about is that the red lines are primarily the interests of our farmers and, to some extent, of our small producers. We, as a government, are committed to defending the interests of our farmers and our small producers. We are very determined on that. That’s not something that we can compromise on,” the EAM told the gathering.\nThe EAM further said that US President Donald Trump’s way of dealing with the world, even dealing with his own country, “is a very major departure from the traditional orthodox manner of doing so”.\nEarlier, Commerce and Industry Minister Piyush Goyal said at the same event that the government’s approach in trade negotiations for free trade agreements with other countries will be guided by national interest and the priorities of Indian industry.\n“I’ve always held a very clear vision. When we do trade deals, I have to protect national interests. We usually now work with different countries with the pre-understanding, before even getting into negotiations: you respect my sensitivities, I respect your sensitivities. There are areas of concern in every country in the world,” the Commerce Minister said at the event on Friday.\nHe further stated that India is engaging regularly with the European Union and fast-tracking discussions on three to four more trade agreements.\n“The EU also has certain areas which are very sensitive to them. We respect that. As they respect ours. And, therefore, I think it will not be difficult to come to terms on the trade front,” the minister added.\nThe minister said that India’s relations with the US are “very consequential” and India has resilience, strength, and is full of possibilities as the world’s fastest-growing economy.\n–IANS\nna/svn\nComments are closed."
    },
    {
      "news_title": "Jaishankar slams US Tariffs, says India won’t compromise farmers’ interests",
      "news_link": "https://www.awazthevoice.in/india-news/jaishankar-slams-us-tariffs-says-india-won-t-compromise-farmers-interests-40749.html",
      "bias": "unknown",
      "text": "New Delhi\nExternal Affairs Minister S Jaishankar on Saturday hit out at the United States for what he called \"unjustified and unreasonable\" tariffs on Indian goods, after the Trump administration raised duties to over 50 per cent as a penalty for India's purchase of Russian oil.\nSpeaking at The Economic Times World Leaders Forum 2025, Jaishankar said India's priority was to protect farmers and small producers, stressing that New Delhi would not compromise on their interests.\n\"What we are concerned about is that red lines are primarily the interest of our farmers and, to some extent, our small producers. So when people pronounce that we have succeeded or failed, we as a government are committed to defending the interests of our farmers and small producers. We are determined on that. That's not something we can compromise,\" Jaishankar said.\nThe minister also argued that the tariff issue was being wrongly presented as an \"oil dispute.\" He noted that the same criticism levelled at India for purchasing Russian energy had not been applied to larger importers, such as China and European nations.\n\"The second issue is that this is being presented as an oil issue. But why I say 'being presented' is because the same arguments that have been used to target India have not been applied to the largest oil importer, which is China, and have not been applied to the largest LNG importer, which is the European nations,\" he said.\nJaishankar pointed out the contradiction in the West's stance, saying Europe trades far more with Russia than India does. \"And when people say we are funding the war and putting the money, Russia-European trade is bigger than India-Russia trade. So European money is not putting coffers? The overall Russia-EU trade is bigger than the Russia-India trade. If the argument is energy, they (EU) are bigger buyers. If the argument is who is the bigger trader, they are bigger than us. India's exports to Russia have grown, but not that much,\" he added.\nThe minister further said India has every right to take decisions in its own national interest. \"The issue of decisions which we make in our national interest is our right. And I would say that's what strategic autonomy is about,\" he said.\nOn India-US ties, Jaishankar said talks were ongoing despite tensions. \"We are two big countries, as I say, the lines are not cut, people are talking to each other, and we will see where it goes,\" he added.\nWhen asked about Washington's new ambassador to India, Jaishankar avoided comment, saying, \"Look, I am the Foreign Minister, I don't comment on ambassadorial appointments of other countries.\"\nEarlier this week, Jaishankar visited Russia, where he met Russian President Vladimir Putin, Deputy First PM Denis Manturov and Foreign Minister Sergey Lavrov. He also co-chaired the 26th session of the India-Russia Inter-Governmental Commission on Trade, Economic, Scientific, Technological and Cultural Cooperation (IRIGC-TEC).\nREAD MORE: C Shukkur and Sheena set off a quiet 'remarriage' tsunami among Muslims\nAccording to the Ministry of External Affairs (MEA), the visit included discussions on terrorism, the conflict in Ukraine, and regional developments in West Asia and Afghanistan. Jaishankar also conveyed Prime Minister Narendra Modi's greetings to President Putin and discussed key bilateral and global issues."
    },
    {
      "news_title": "Auto sector will continue to grow, our exports go beyond US, says Nitin Gadkari as Trump tariff deadline looms",
      "news_link": "https://indiashippingnews.com/auto-sector-will-continue-to-grow-our-exports-go-beyond-us-says-nitin-gadkari-as-trump-tariff-deadline-looms/",
      "bias": "unknown",
      "text": "Auto sector will continue to grow, our exports go beyond US, says Nitin Gadkari as Trump tariff deadline looms\nNEW DELHI : Union Roads, Highways and Transport Minister Shri Nitin Gadkari has said that India’s automobile sector is strong and will continue to grow, as it exports to many more countries than the United States.\nThe minister made these comments in an interview, with less than a week to go for the US’ additional 25 percent Russia oil penalty to kick in on Indian goods. The US is already levying an increased 25 percent tax on Indian imports, with the Russia levy, the duty will climb to 50 percent.\n“Our automobile sector is strong and continues to grow … I am confident that the way we are working on alternate fuels, bio fuels, electric, ethanol, methanol, (and) biodiesel, we will be the number one automobile market in the world,” Gadkari told in an exclusive interview.\nTatas, Mahindra and Mahindra are making good electric vehicles and won’t be impacted by Tesla’s entry, the minister said, adding the future of auto industry looks “very good”. While India exports to the US, it also exports to other countries, Gadkari added.\nWhile India’s auto exports rose 14 percent year-on-year in the first half of FY25 to 2,528,248 units, it doesn’t export much to the US. In 2024, India’s passenger car exports to the US were worth $8.9 million and auto parts $2.2 billion.\nAccording to a report from the heavy industries ministry, India exported automobile and auto components worth $35 billion in FY25. Saudi Arabia, South Africa, Mexico and the United Arab Emirates are the top destinations for Indian autos.\n“When I became minister of roads, transport and highways in 2014, we were at number 7 in the world. Now we are at number 3. America’s size of the market is Rs 78 lakh crore, China is Rs 49 lakh crore and we are a Rs 22 lakh crore automobile market,” he added.\nWhen asked if the Indian EV sector was ready to face competition from EV giants like Elon Musk-led Tesla, Gadkari said, “Anyone who wants to come to the Indian market can. Indian EV makers like Tatas, Mahindra are making good models.”\nIn terms of design, quality, cost Indian automakers are making good models. “The Indian EV market is projected to reach over $110 billion by 2029 and is dominated by domestic players,” he said.\n“Tesla is the latest entrant in the market and will be launching its imported Model Y SUV. However, the company faces high import duties that with lack of local manufacturing will make it prohibitively expensive for a majority of Indians.”\nTo a question if the government would extend more support to the EV sector, Gadkari said the segment was growing and does not need schemes or further support. “In the coming times, I see a bright future for the Indian automobile sector,” the minister said."
    },
    {
      "news_title": "Indian exports to China surge 20% in April–July FY26 - Maritime Gateway",
      "news_link": "https://www.maritimegateway.com/indian-exports-to-china-surge-20-in-april-july-fy26/",
      "bias": "unknown",
      "text": "India’s merchandise exports to China rose 20% year-on-year to $5.76 billion in the first four months of FY26 (April–July), compared to $4.80 billion in the same period last year, official data shows. The growth—driven by strong demand for energy products, electronics, and agricultural commodities—comes as a relief amid concerns over export losses from US tariff measures.\nIn FY25, India’s exports to China had contracted sharply by 14.5% to $14.25 billion, against $16.67 billion in FY24, with shipments declining in 11 out of 12 months. By contrast, FY26 has seen a consistent rebound from the start of the year:\n- April 2025: up 12.9% to $1.4 billion\n- May 2025: up 24% to $1.63 billion\n- June 2025: up 17% to $1.38 billion\n- July 2025: up 27% to $1.35 billion\nIf sustained, this trend could mark the first full-year recovery in Indian exports to China after last year’s slump, people familiar with the matter said.\nSector-wise growth\n- Energy products: Petroleum product exports nearly doubled to $883 million (95.3% growth).\n- Electronics: Shipments surged to $521 million (202.7%), reflecting industrial and consumer demand.\n- Agriculture: Oil meals at $41.7 million (2656.1%), rice at $32.2 million (1383.3%), and oil seeds at $16 million (1791.7%) led extraordinary gains.\n- Chemicals & traditional sectors: Organic and inorganic chemicals rose to $335.1 million (16.3%), spices to $234.5 million (21.9%), tea to $8.9 million (93.9%), and gems & jewellery to $11.5 million (72.7%).\n- Moderate growth: Marine products (5.1%), mica/coal/ores (3.0%), and ready-made garments (14.8%).\nDiplomatic boost\nThe rebound also comes on the back of recent positive diplomatic engagements. During Chinese Foreign Minister Wang Yi’s visit to New Delhi on August 19, both sides agreed to enhance bilateral trade, reopen border trade at Lipulekh, Shipki La, and Nathu La passes, and facilitate investment flows through “concrete measures,” according to India’s Ministry of External Affairs.\nDespite the recent gains, India still faces a wide trade deficit with China, which stood at $99.2 billion in FY25. Sustained export growth in FY26 could help narrow this gap."
    },
    {
      "news_title": "As US tariffs loom, India’s exports to China jump 18% amid renewed diplomatic outreach",
      "news_link": "https://www.indiaweekly.biz/us-tariffs-india-china-exports/",
      "bias": "unknown",
      "text": "Highlights:\n- India’s exports to China rose 18% year-on-year in Q1 FY26 to $4.4 billion, reversing two years of decline.\n- Petroleum product exports nearly doubled, while spices, organic chemicals, and marine products also saw strong growth.\n- The surge comes as the US prepares to impose a 50% tariff on Indian goods over energy ties with Russia.\n- China’s Foreign Minister Wang Yi visited India for talks with NSA Ajit Doval, agreeing to reopen border trade and boost connectivity.\n- Chinese envoy Xu Feihong pledged Beijing’s support, saying China would “stand with India against trade bullies.”\nIndia’s exports to China showed a strong rebound in the first quarter of the fiscal year 2026 (April to June), rising by 18 percent year-on-year to $4.4 billion, following two years of decline during the same period. This uptick comes against the backdrop of escalating trade tensions with the United States, where the Trump administration is set to impose a 50 percent tariff on Indian goods linked to energy imports from Russia. The new tariff regime is scheduled to take effect on August 27, 2025.\nThe sharp growth in exports to China was driven mainly by petroleum products, which nearly doubled from $452 million to $865 million. Other significant contributors included spices, which surged by 33 percent, organic chemicals that increased by 26 percent to $147 million, and marine products, which saw a modest 5 percent rise.\nThis growing trade momentum aligns with a fresh wave of diplomatic engagement between India and China. On August 18 and 19, China’s Foreign Affairs Minister Wang Yi visited India at the invitation of India’s National Security Advisor Ajit Doval. During the Special Representatives Dialogue, the two sides emphasized the importance of maintaining peace and tranquility along the border areas to enhance the overall development of bilateral ties.\nFollowing the discussions, India and China agreed on several economic and people-centric initiatives to boost cooperation. These include reopening border trade through strategic mountain passes such as Lipulekh, Shipki La, and Nathu La; resuming direct flights between the two countries; facilitating easier visa processes for business and tourism; increasing pilgrimage flows; and enabling greater bilateral trade and investment.\nFurther reaffirming China’s support for stronger trade relations, Chinese Ambassador to India Xu Feihong declared at the SCO Summit 2025 on August 20 that China stands “with India against trade bullies.” He highlighted the significance of unity and cooperation between two large neighbouring countries as essential to achieving “common development.”\nThis convergence of diplomatic outreach and trade growth illustrates how India and China are working to deepen economic ties despite global geopolitical pressures. As the US tightens its trade stance against India, New Delhi appears to be leveraging its relationship with Beijing to sustain its trade expansion and strategic interests.\nSuch developments signal a nuanced shift in India’s international commercial relations and underline the growing complexity of global trade dynamics in the current geopolitical climate.\nSnoop Dogg faces backlash after criticising LGBTQ+ representation in Pixar’s 'Lightyear'"
    },
    {
      "news_title": "Trump’s 50% tariffs could reshape India’s festive ad spend",
      "news_link": "https://www.socialsamosa.com/experts-speak/trump-50-tariffs-could-reshape-india-festive-ad-spend-9687726",
      "bias": "unknown",
      "text": "President Trump's announcement to double tariffs on Indian imports to 50%, effective August 27, 2025, has prompted India's advertising industry to reassess spending strategies and market positioning. The move, aimed at penalising India for purchasing Russian oil, affects nearly all of India's $86.5 billion in annual goods exports to the US. According to a BBC report, almost all of India's annual goods exports to the US stand to become commercially unviable if these rates sustain, with a potential GDP impact of 0.2-0.4% from even a 25% tariff.\nThe timing of this policy announcement is particularly crucial, coming as India's AdEx was expected to grow by 7.8% year-on-year to ₹1371 billion ($15.9 billion), according to MAGNA’s projections.\nHowever, the advertising market now faces budget reallocations as companies respond to changing trade dynamics. The timing coincides with India's festive season planning, when brands typically increase advertising investments across categories.\nFestive marketing strategies to face adjustment\nThe immediate casualties of Trump's tariff announcement are becoming clear, with export-oriented sectors that have traditionally been significant advertising spenders preparing for budget reductions. Krishnarao Buddha, Independent Brand Consultant and former Senior Category Head at Parle Products, explains the direct impact on specific sectors.\n\"The immediate impact will be felt most by export-oriented sectors with a high dependence on the US market, such as Gems & Jewellery, Textiles, Leather, Auto components, etc. These categories are likely to cut back ad spending first,\" Buddha says.\nThe gems and jewellery sector, traditionally a significant advertiser during festive seasons, faces particular challenges given its export dependence.\nSuresh Ramalingam, CEO, Ipsos India, believes that it will take a few months before the impact of 50% Trump Tariffs will be felt. While he echoes Buddha’s statement that there would be cutbacks in ad spending by certain sectors, including the automotive, retail and jewellery, Ramalingam comments, “domestic brands which instil national pride could capitalise on the opportunities emerging within the country and increase ad spends to woo domestic consumers.”\nThe tariff implementation timing, just before India's festive season, creates planning challenges for marketing strategies already in development.\n“Sectors heavily dependent on exports and imports could see the impact of these steep tariffs on the upcoming festival season and curtailing of sales promotion budgets – unless negotiations between India and the Trump administration lead to some resolution reaching the middle ground,” stated Ramalingam.\nThe festive period typically sees brands spending approximately $3.9 billion on advertising, marketing and promotions, according to media reports. Moreover, a report suggests that festive shoppers are planning to spend an average of Rs 16,500 this year, with the majority of consumers planning to start their festive shopping before September. Among these, 90% of shoppers believe online ads are important in helping them discover new products and promotions.\nRahul Vengalil, CEO & Co-founder, tgthr, provides context on the broader economic picture and its advertising implications.\n\"First things first, India runs on an internal consumption economy a lot more than exports. In the export also, 40% of our export categories are left out of the tariff.”\nApart from the few categories mentioned above, Vengalil believes that categories like Agro/Farming and Apparel/footwear will likely be impacted.\n“I believe from an advertising POV, this is more a psychological challenge, and if we look beyond the muddled waters, I think we should be fine,\" Vengalil says. “FMCGs are big spenders during the Diwali period & Coke/Pepsi group falls under this bracket, Food chains fall under this category, E-commerce giants like Amazon fall under this category. So there is going to be some tension, uncertainties and definite impact on the adex,\" he continues.\nHowever, he acknowledges the potential for consumer behaviour to drive broader market impacts. If consumers start taking emotional decisions and boycott US brands, then the situation could spiral for the worse.\nVigyan Verma, Founder of The Bottom Line, a brand consulting firm, comments that India benefits through exports of US brands manufactured in India (Apple, Nike, Levi's, etc), although industries like leather, textiles & apparel, and gems & jewellery are directly impacted by US tariffs. American brands with substantial festive advertising presence face the challenge of maintaining market presence while navigating potential consumer sentiment shifts.\nVerma says, “Robust local set-ups for US corporate brands like Coca-Cola, Pepsico, P&G, and Colgate-Palmolive exist along with manufacturing units, and these contribute to our economy and employment of our citizens.”\nHowever, Buddha expects strategic adaptations across festive marketing. \"The festive season marketing, typically a bellwether for annual ad spends, will require rapid adaptations, budgets may shrink for global luxury brands and imported categories, but surge for domestic brands leveraging the national pride.\"\nThis may lead to messaging that emphasises craftsmanship heritage while adjusting international market references.\nMedia planning could shift toward performance channels\nBudget pressures and the need for measurable results could accelerate existing trends toward digital and performance-driven advertising channels. Companies seeking cost-effective reach during uncertain periods could adjust their media mix strategies.\n\"On the media mix front, brands will trim high-cost TV and print in favour of performance-driven digital channels, micro-influencers and native content. Expect hyperlocal targeting, short-form video storytelling with a greater focus on measurable ROI,\" Buddha explains.\nThe shift toward performance-driven channels reflects immediate budget optimisation needs and longer-term strategic thinking about market engagement. Micro-influencer strategies offer authentic local voices and cost-effective reach, particularly valuable when brands navigate sensitive political and economic terrain.\nVengalil notes, “Videos will still remain the most important medium, be it digital or linear Television. Print will play a key role for a lot of retail clients in the coming days.\"\nHyperlocal targeting becomes more relevant as brands connect with specific regional sentiments and economic concerns. As per 2024 reports, 47% of Indian consumers were influenced by short-form videos while making their festive purchases. Short-form video content, already dominant in India's digital landscape, provides flexibility for rapid message adaptation as situations evolve.\nDomestic brands could find growth opportunities\nWhile some sectors contract spending, others have the potential for increased investment. Domestic-focused industries view the tariff situation as an opportunity to strengthen their market position and capture consumer attention.\n\"Conversely, certain sectors with huge domestic consumption like Agriculture produce, FMCG, homegrown electronics and regional consumer durables could see increased marketing investment as brands try to capitalise on the Vocal for Local sentiment,\" Buddha observes.\nIndia's FMCG sector, which grew 10.6% in the October-December quarter of 2024, driven by rural demand, is positioned to benefit from this shift.\nThe advertising industry's response requires balancing immediate crisis management with long-term strategic positioning. \"The chances of anti-American sentiments were somewhat high immediately after the additional 25% tariff announcement. Citizens may continue to view the United States as an unreliable partner, but that may not translate into hatred for American brands,\" Verma explains.\nExperts also believe that homegrown brands will try to use the 'Made in India' slogan in their messaging.\n\"If the crisis prolongs, the overall economy could get impacted, and then, of course, brands across board (not just American) could face business pressures leading up to the festive season, and that will require holistic tactical interventions- for example, pushing smaller packs, not just advertising spends and media mix tweaks,\" Verma adds.\nAs of now, BJP national spokesperson Syed Zadar Islam has claimed that India faces minimal tariff impact due to the \"57-58% contribution of local consumption to our GDP\".\nBut, if it were to affect brand spends, advertisers and agencies will need to focus on keeping consumer trust at the core with the agility to adapt messages and platforms, helping them maintain the momentum during this period of policy-induced uncertainty.\nPrime Minister Narendra Modi is most likely going to visit the United States in September for the United Nations General Assembly (UNGA) and could schedule a meeting with President Donald Trump.\nAs the August 27 implementation date approaches, decisions regarding budget allocation, messaging strategy, and media planning will influence India's advertising market trajectory. The tariff policy serves as a test of the industry's ability to adapt to changed economic conditions while maintaining market vitality and consumer engagement."
    }
  ]
}