{
  "story_id": "GN_20250822_193602_9483a3cf",
  "metadata": {
    "title": "FBI searches home of ex-Trump national security adviser John Bolton in classified documents probe: Report",
    "timestamp": "2025-08-22T19:36:02.427631",
    "url": "https://ground.news/article/exclusive-patels-fbi-raids-john-boltons-home-in-high-profile-national-security-probe"
  },
  "bias_distribution": {
    "total_sources": "66",
    "leaning_left": "16",
    "center": "30",
    "leaning_right": "12"
  },
  "perspective_summaries": {
    "left": [
      "The FBI raided John Bolton's home in Bethesda, Maryland, searching for classified records as part of a national security investigation, according to a source familiar with the matter confirmed to NBC News.",
      "Bolton served as national security adviser to President Donald Trump from 2018 to 2019 and has since become a critic of Trump, especially on his Russia policies.",
      "FBI Director Kash Patel posted on X that 'NO ONE is above the law& @FBI agents on mission,' indicating the significance of the raid.",
      "The raid signifies ongoing legal actions against perceived enemies of Trump, with Bolton previously under investigation for allegedly disclosing classified information in his memoir, The Room Where It Happened."
    ],
    "center": [
      "The Federal Bureau of Investigation raided the home of former Trump national security adviser John Bolton in Bethesda, Maryland, on August 22, 2025, as part of an investigation into classified documents.",
      "FBI Director Kash Patel stated, \"NO ONE is above the law...\" in relation to the raid on Bolton's home.",
      "The search marks a significant development in the probe into the handling of sensitive government materials by Bolton, who served as national security adviser from 2018 to 2019."
    ],
    "right": [
      "FBI agents raided the home of former National Security Adviser John Bolton in Bethesda, Maryland, on Friday, as reported by the New York Post.",
      "The investigation, ordered by FBI Director Kash Patel, focuses on classified documents that Bolton may possess, according to a senior U.S. official.",
      "Previously, Bolton faced scrutiny for his 2020 memoir, The Room Where It Happened, which critics claimed contained national security secrets, leading to a Justice Department inquiry.",
      "Kash Patel emphasized that 'NO ONE is above the law,' signaling the seriousness of the investigation."
    ]
  },
  "sources": [
    {
      "news_title": "FBI Raids Ex-US NSA John Bolton's Home Days After His Criticism Of Trump Tariffs",
      "news_link": "https://ground.news/interest/ndtv",
      "bias": "Lean Right",
      "actual_title": "Breaking News Headlines Today",
      "authors": [],
      "published_at": 