{
  "story_id": "GN_20250823_192639_c236c7e2",
  "metadata": {
    "title": "Trump says Intel has agreed to give US 10% stake in chipmaker",
    "timestamp": "2025-08-23T19:26:39.199761",
    "url": "https://ground.news/article/trump-says-intel-has-agreed-to-give-us-10-stake-in-chipmaker_307403"
  },
  "bias_distribution": {
    "total_sources": "114",
    "leaning_left": "20",
    "center": "24",
    "leaning_right": "17"
  },
  "perspective_summaries": {
    "left": [
      "President Donald Trump announced that the U.S. government has acquired a 10% stake in Intel, making it a significant shareholder in the company.",
      "This stake comes through converting $11.1 billion in previous government grants, with 433.3 million shares purchased at $20.47 each.",
      "Many critics argue that government ownership of Intel blurs the lines between public and private sectors, potentially harming the tech industry.",
      "Intel's CEO Lip-Bu Tan expressed gratitude for the confidence placed in the company, promising to advance U.S. technology leadership."
    ],
    "center": [
      "On Friday, President Donald Trump revealed that the U.S. government acquired a 10% ownership share in Intel by obtaining 433.3 million non-voting shares valued at $20.47 each.",
      "The stake resulted from converting $11.1 billion in previously allocated government funds and pledges under programs started by the Biden administration to boost domestic chip manufacturing.",
      "Intel is a struggling Silicon Valley company led by CEO Lip-Bu Tan, who faced criticism and calls for resignation earlier in August amid concerns over past Chinese investments.",
      "Commerce Secretary Howard Lutnick emphasized that the United States should reap the rewards from the agreement, while Tan commended Trump's efforts in fostering significant investments within a key sector.",
      "The government's stake, acquired without new spending and without board seats or voting rights, signals hope for Intel’s comeback but raises concerns about government influence and industry impacts."
    ],
    "right": [
      "President Donald Trump announced that the U.S. government will acquire a 10% stake in Intel, valued at approximately $11 billion, by converting existing grants into equity.",
      "The deal represents significant government intervention in a private company and aims to boost domestic semiconductor production amidst rising competition from foreign manufacturers, particularly China.",
      "Intel CEO Lip-Bu Tan confirmed the agreement during a discussion with Trump, who emphasized the importance of ensuring a return for American taxpayers rather than simply providing grants.",
      "Shares of Intel rose by 6.6%, indicating a positive market response to the announcement of the government's investment in Intel's stock."
    ]
  },
  "sources": [
    {
      "news_title": "Intel agrees to sell US a 10% stake in its business - West Hawaii Today",
      "news_link": "https://www.westhawaiitoday.com/2025/08/23/nation-world-news/intel-agrees-to-sell-us-a-10-stake-in-its-business/",
      "bias": "Lean Left",
      "text": "Intel agrees to sell US a 10% stake in its business\nSAN FRANCISCO — President Donald Trump said Friday that Intel, the troubled Silicon Valley chipmaker, had agreed to sell the U.S. government a 10% stake in its business, worth $8.9 billion, in one of the largest government interventions in a U.S. company since the rescue of the auto industry after the 2008 financial crisis.\nAt a news conference, Trump said the agreement had come out of negotiations last week with Lip-Bu Tan, Intel’s CEO.\n“I said, ‘I think it would be good having the United States as your partner.’ He agreed, and they’ve agreed to do it,” Trump said. “And I think it’s a great deal for them.”\nIntel said the United States would invest $8.9 billion in its stock, on top of $2.2 billion that the government has paid the company under the CHIPS and Science Act, a federal program signed into law in 2022 that delivered billions in grants to revive U.S. semiconductor manufacturing. The government will not take a board seat or have other governance rights at Intel.\n“We are grateful for the confidence the president and the administration have placed in Intel, and we look forward to working to advance U.S. technology and manufacturing leadership,” Tan said in a statement.\nIn a social media post, Commerce Secretary Howard Lutnick called the agreement “historic” and said it would strengthen U.S. leadership in semiconductors, which act as the brains of computers and are used in everything from toasters to cars and weapons. He included a photograph of himself beside Tan, whom he thanked “for striking a deal that’s fair to Intel and fair to the American People.”\nThe deal is perhaps the most notable government intervention in a U.S. company since 2008, when the government poured tens of billions into Chrysler and General Motors to prevent their collapse. The agreement was also the Trump administration’s latest effort to put its own stamp on the CHIPS Act, while trying to reinvigorate Intel. Trump and other officials have derided the CHIPS Act for handing out money without getting anything in return.\nLutnick said on CNBC this week that Trump had decided to “turn the money that Biden was going to just give away” into “equity for the American people.” He added, “Donald Trump is fixing what Biden got completely, totally and utterly wrong.”\nShares of Intel rose more than 6% on news of the U.S. deal. Founded in 1968, the company was an industry pioneer that produced faster and increasingly powerful chips over the years, turning Silicon Valley into the bedrock of the U.S. tech sector. But Intel has been on the ropes after it missed several waves of innovation, including the smartphone and artificial intelligence revolutions. Other chipmakers, such as Nvidia, have ascended instead.\nThe deal with the Trump administration came together quickly. Trump had called for Tan’s resignation in a social media post this month, citing the executive’s ownership stakes in Chinese companies. Days later, Tan met with Trump at the White House and discussed giving the U.S. government an equity stake in the chipmaker.\nOn Wednesday, Lutnick and David Zinsner, Intel’s finance chief, reached the framework for an agreement, two people with knowledge of the discussions said. Later that day, Intel’s board blessed the deal, these people said. Lutnick and Tan settled the terms Thursday, a person familiar with the meetings said.\nTan “walked in wanting to keep his job, and he ended up giving us $10 billion for the United States,” Trump said.\nThe deal could face a challenge from shareholders or others concerned about its legality. The CHIPS Act may not allow the U.S. government to convert grants into equity, lawyers and bankers who have studied the law said.\nThe Trump administration has taken an interventionist approach with private companies, but especially with the semiconductor industry. In recent months, the president has threatened to take away government grants from chip companies, restricted billions of dollars in sales of AI chips to China before changing his mind, proposed high tariffs on chips made outside the United States and demanded investments in new U.S. factories.\nTrump has particularly targeted the CHIPS Act, which President Joe Biden signed into law in 2022. It created $50 billion in funding to rebuild the U.S. semiconductor industry.\nOver the past 50 years, production of chips has shifted to Asia, with many being produced in Taiwan, a self-governing island that faces the threat of a Chinese takeover.\nIn March, Trump said he wanted to “get rid of the CHIP Act.” Since then, his administration has pressured chipmakers to increase their U.S. investments to receive some $36 billion in grants promised by the Biden administration.\nIntel was awarded $10.86 billion in such funding: $3 billion to produce chips for the Defense Department and $7.86 billion for projects in Arizona, New Mexico, Ohio and Oregon.\nThe Biden administration had debated how heavily to subsidize Intel, seeing it as an important American company but a troubled one.\nShortly after the company received approval of its $7.86 billion federal grant, it fired its CEO, Pat Gelsinger.\nIn March, Intel hired Tan, a well-regarded semiconductor investor and manager, to fix the business. He outlined a plan to cut staff, develop a new AI strategy and focus on finding customers for a future iteration of Intel’s chipmaking technology.\nAt the same time that Trump pressured Tan to resign, the administration was withholding some of Intel’s federal grants, according to the company’s financial filings. Intel, which had received $2.2 billion of the money it was awarded, said in a filing in June that it had submitted a request for an additional $850 million in reimbursements that it had not received.\nA White House official said Intel’s prospects warranted federal government involvement given the importance of semiconductors to the economy. The official said the government was exploring other actions it could take to shore up Intel’s position, but declined to specify.\nHaving the government be an investor in Intel could add to the perception that the company is too big to fail. It is also likely to raise questions about whether Trump and other U.S. officials could ultimately play a role in pressuring other companies to become Intel customers.\nA government stake may not solve Intel’s problems. The company has struggled to compete in producing the latest chips. Even if the Trump administration leans on companies like Apple, Nvidia and Qualcomm to buy from Intel, it remains to be seen if Intel can make the products that tech companies demand.\n“Once the government becomes a stakeholder, the question is: What will they do to protect their investments?” said Ben Bajarin, principal analyst at Creative Strategies, a tech research firm. “You don’t want to force companies to choose Intel. You want them to willingly choose to use Intel, but you may need to create incentives like tax breaks.”\nThis article originally appeared in The New York Times.\n© 2025 The New York Times Company"
    },
    {
      "news_title": "US secures 10% ownership in Intel as Trump prods new industrial policy",
      "news_link": "https://english.almayadeen.net/news/Economy/us-secures-10--ownership-in-intel-as-trump-prods-new-industr",
      "bias": "Left",
      "text": "US secures 10% ownership in Intel as Trump prods new industrial policy\nThe US will take a 10% equity stake in Intel under a Trump-backed deal converting CHIPS Act grants into ownership.\nUS President Donald Trump announced that the United States government will acquire a 10% equity stake in Intel, one of the world's most important chipmakers, marking one of the boldest interventions in corporate US in recent history.\nThe deal converts nearly $10 billion in government grants, initially given under the CHIPS Act, a federal program aimed at boosting domestic semiconductor production, into partial ownership of the company.\nThe government will purchase about 433 million shares of Intel at $20.47 each, below the market price, for a total of $8.9 billion. The stake comes with an option to buy an additional 5% in the future if Intel’s chip manufacturing arm, known as its foundry business, loses independence.\nOnce a global leader in semiconductor production, Intel has faced deep financial troubles. In 2024, the company reported an $18.8 billion annual loss, its worst performance since the 1980s.\nIntel’s foundry business, its attempt to manufacture chips for outside clients, has become a money-losing division, with billions in quarterly losses. Despite heavy investment, Intel has struggled to secure major customers, falling far behind rivals like Taiwan’s TSMC and South Korea’s Samsung.\nBeyond finances, Intel has also missed key technological shifts. The company largely sat out the artificial intelligence (AI) boom, leaving Nvidia to dominate that market, while also losing ground in its traditional markets to Advanced Micro Devices (AMD).\nThe role of the CHIPS Act\nThe CHIPS and Science Act, signed into law in 2022, was designed to strengthen the US' position in semiconductor production. At the time, the US produced only about 10% of the world’s chips, compared to nearly 40% in 1990. Meanwhile, about three-quarters of global chip manufacturing is concentrated in East Asia, raising concerns that the US economy and military could become vulnerable to supply chain disruptions.\nThe act provided $52.7 billion in incentives to semiconductor companies, of which Intel became the largest beneficiary, receiving nearly $11 billion in funding. However, the Trump administration’s decision to turn these grants into government ownership represents a fundamental shift in policy, ensuring that taxpayers directly contribute to Intel’s potential recovery.\nSemiconductors are essential components in nearly every modern technology, from smartphones and laptops to fighter jets, satellites, and missile systems.\nUS officials argue that relying on foreign suppliers for advanced chips poses a national security risk, and Trump framed the Intel deal as part of a larger strategy to guarantee that the US can produce its own advanced microchips at home.\nCommerce Secretary Howard Lutnick described the arrangement as “fair to Intel and fair to the American people,” stressing that the government’s stake is designed to be passive, without a seat on Intel’s board.\nIntel’s downsizing in \"Israel\"\nIntel’s struggles are not limited to the US. The company is undergoing its largest downsizing in more than a decade in \"Israel,\" where its workforce has fallen from 12,000 in 2021 to below 9,000 in mid-2025. For the first time, job cuts have reached its flagship plant in Kiryat Gat, which produces chips using older technologies that are no longer competitive globally.\nIntel has also suspended its massive $25 billion Fab 38 expansion project in the city, a move described by the Boycott, Divestment and Sanctions (BDS) movement as one of its biggest victories. These changes reflect Intel’s broader technological lag and financial strain, which have forced the company to cut costs globally.\nThe company’s leadership has also undergone major changes. Former CEO Pat Gelsinger was forced out in late 2024 after investors lost confidence in his strategy. He was replaced by Lip-Bu Tan in March 2025. Tan has focused on cost-cutting and securing external customers, moving away from the massive factory expansion plan pursued by his predecessor."
    },
    {
      "news_title": "Trump Has No Business Taking a Stake In Intel",
      "news_link": "https://www.realclearmarkets.com/2025/08/23/trump_has_no_business_taking_a_stake_in_intel_1130556.html",
      "bias": "Lean Right",
      "text": "Subscribe\nSign In\n|\nSubscribe\nTrump Has No Business Taking a Stake In Intel\nDavid Harsanyi\nWashington Examiner August 23, 2025\nAP\nThe Trump administration's decision to take a 10% stake in semiconductor maker Intel is just another example of nationalizing industries.\nRead Full Article »\nComment\nShow comments\nHide Comments\nLog In with your RCMG Account\nRegister\nRelated Articles\nMarket Overview\nFinancial Markets\nby TradingView\nSearch Stock Quotes\nSponsored by"
    },
    {
      "news_title": "Intel, Trump announce deal giving US a 10% stake in chipmaker",
      "news_link": "https://timesofmalta.com/article/intel-trump-announce-deal-giving-us-10-stake-chipmaker.1115087",
      "bias": "Center",
      "text": "Chipmaker Intel has agreed to give the US government a 10 per cent stake in its business, the company and President Donald Trump announced Friday.\nThe deal came after Trump's administration said Intel should give Washington an equity stake in exchange for large grants committed when Joe Biden was president.\nUnder the agreement, the US government will receive 433.3 million shares of common stock, representing a 9.9 per cent stake in the company, Intel said in a statement.\nThis amounts to an $8.9 billion investment, funded partially by $5.7 billion in grants awarded but not yet paid under the CHIPS and Science Act -- a major law passed during Biden's term that Trump has criticised.\nThe other $3.2 billion comes from an award to the company as part of the Secure Enclave program, Intel said.\nThe $8.9 billion investment would be in addition to $2.2 billion in CHIPS grants Intel has already received, taking the full amount to $11.1 billion, the company added.\n\"The United States of America now fully owns and controls 10% of INTEL,\" Trump posted on Truth Social.\nHe claimed that the country \"paid nothing for these shares\" after negotiations with Intel CEO Lip-Bu Tan.\nIntel noted in its statement: \"The government's investment in Intel will be a passive ownership, with no board representation or other governance or information rights.\"\nReferring to a meeting with Intel last week, Trump told reporters Friday: \"I said, I think you should pay us 10 per cent of your company.\"\n\"I said, I think it would be good having the United States as your partner... they've agreed to do it, and I think it's a great deal for them.\"\nCommerce Secretary Howard Lutnick said Friday on X: \"This historic agreement strengthens US leadership in semiconductors.\"\n'Slippery slope'\nIntel is one of Silicon Valley's most iconic companies, but its fortunes have been dwarfed by Asian powerhouses TSMC and Samsung, which dominate the made-to-order semiconductor business.\nThe CHIPS and Science Act was aimed at strengthening the US semiconductor industry, and the Biden administration had unveiled billions in grants through it.\nIt finalised a $7.9 billion award in direct funding to Intel in November 2024, according to a US Department of Commerce statement.\n\"This is a slippery slope,\" independent tech analyst Rob Enderle said of the United States taking a stake in Intel.\n\"This is one of those things that kind of brings chills because it's a step toward nationalising private business.\"\nScott Lincicome of the Cato Institute, a Washington think tank that promotes limited government, said on X Friday that the government having a stake in Intel would be \"a terrible decision, bad for almost everyone.\"\nHe said it would be \"bad for Intel's long-term viability, as politics, not commercial considerations, increasingly drive its decisions\" and that \"foreign governments might also target it.\"\nIn a statement, Tan of Intel said it is \"deeply committed to ensuring the world's most advanced technologies are American-made.\"\nThe company said it is investing more than $100 billion to expand its US sites.\nEarlier this month, Trump had demanded Tan resign after a Republican senator raised national security concerns over his links to firms in China.\nJapan-based tech investor SoftBank Group also recently said it would invest $2 billion in Intel."
    },
    {
      "news_title": "President Trump Announces U.S. Govt Takes 10% Stake in INTEL, Semiconductor and Chip Manufacturing - The Last Refuge",
      "news_link": "https://theconservativetreehouse.com/blog/2025/08/23/president-trump-announces-u-s-govt-takes-10-stake-in-intel-semiconductor-and-chip-manufacturing/",
      "bias": "Far Right",
      "text": "After concerns were raised by congress that Intel’s current CEO Lip-Bu Tan was a venture capitalist investing in Chinese companies, a concern shared by President Trump, apparently things have changed considerably.\nMr. Lip-Bu Tan came to the White House to address concerns about protecting U.S. national security interests. President Trump announces the U.S. government now has a 10% stake in the tech firm.\nPresident Trump (Truth Social) – “It is my Great Honor to report that the United States of America now fully owns and controls 10% of INTEL, a Great American Company that has an even more incredible future. I negotiated this Deal with Lip-Bu Tan, the Highly Respected Chief Executive Officer of the Company. The United States paid nothing for these Shares, and the Shares are now valued at approximately $11 Billion Dollars. This is a great Deal for America and, also, a great Deal for INTEL. Building leading edge Semiconductors and Chips, which is what INTEL does, is fundamental to the future of our Nation. MAKE AMERICA GREAT AGAIN! Thank you for your attention to this matter.”\nIntel has been struggling for the past several years, and President Trump has been focused on getting Semiconductor and Chip manufacturing established in the USA, a big national security issue. The Trump administration has been negotiating a 10% stake in Intel by converting grants the company was awarded under former President Joe Biden.\nObviously, I’m not a big fan of government collaboration with private corporations, but this approach aligns with a very specific national security issue. This sounds like something Commerce Secretary Lutnick and President Trump would structure as a win/win.\n“The government’s investment in Intel will be a passive ownership, with no Board representation or other governance or information rights. The government also agrees to vote with the Company’s Board of Directors on matters requiring shareholder approval, with limited exceptions.”\nSomeone will have to convince me that this is a good idea.\nSoftBank of Japan is also investing $2 billion. A side story that is missed out here.\nHow is a free 10% bad in any way?\nI just don’t like government ownership of businesses in any form.\nDetails of the Stake Acquisition:\nOn August 22, 2025, President Trump confirmed that the U.S. government would purchase a 9.9% stake in Intel for approximately $8.9 billion, translating to about $20.47 per share—below Intel’s recent market price of $24.80. This investment will be funded through previously awarded but unpaid grants under the CHIPS Act, which aims to support semiconductor manufacturing in the U.S.\nWhereas before under the CHIPS act the gov’t was giving away our tax payer and deficit spending money for free, Trump admin is getting 10% ownership in exchange for gov’t grants.\nHe monetized gov’t grants into asset acquisition for the Federal gov’t which is supposed to be for the benefit of We The People.\nThank you for that information.\nIsn’t the historic definition of Fascism that a government took part or whole ownership of a commercial enterprise??\nThis is the reason for giving pause, not that we want Intel to fail as a commercial entity. “National Security” is not a reason to accept or promote historic fascism.\nIF Trump were serious about meritocracy….now would have been the time to prove it.\nHe has injected our government into a place where it doesn’t belong operating: free captialism / markets.\nWe’re from the government and we’re here to “help.”\n… as in “help ourselves”\nIt’s not free. They are converting grants.\nIt gives government more incentive to tip the scales. Some companies should die off.\nAlways consider how this will be used unfavorably by those who want to control us.\nHow about regulations/legislations/permitting, etc. favorable to Intel, but not for rivals such as AMD?\nHow about specifying that every Federal PC has to utilize Intel chips. If the Feds are buying, then price doesn’t matter.\nHow about at least 1 out of every 10 chips has a backdoor into the PC they’re powering?\nBiden gave Intel $7.9b in grants.\nIntel is paying that back as $11b worth of shares (interest added I guess).\nNothing wrong with owning a non-controlling share. Future governments can always sell the shares off.\nSovereign wealth funds (govt owned) own shares all over the place. It’s an investment, not control of means of production.\nFirst it will be 10%….\nWill the USG demand a board seat, or maybe another 10%. Don’t like it!\nMy sentiments exactly! While we can trust this POTUS, we cannot trust successive administrations, regardless of party. Hopefully by the end of Trump’s term the USG is out of this venture.\nTrust\nNo\nOne!\nAgreed. Sounds like a win until you step back and think of the long-term consequences. When a Dem gets back into the office of POTUS (they will eventually), this essentially becomes a massive slush fund for all kinds of nefarious activity with no oversight or accountability.\nIntel could have rejected the grants. No corporation has to take the grants thus no government ownership.\nTo me, the government has no business picking winners and losers by “giving” grants to any company. But, since this is reality and it happened and Intel took the grants then tit for tat.\nIt is not within the Constitution’s definition of the proper role of government. And, a state should not be investing taxpayers money in stocks, like many do. I’ve never looked at Pres. Trump as a constitutionalist, but he often lands as one. A 10 percent ownership/control stake aligns with his business and opportunist mindset. Remember, it was national security concerns that birthed the 4th branch. I greatly respect Sundance’s understanding, but this smacks of socialist thought, which has been engraned into the past two generations so much that we often don’t know when we’re thinking it. Nothing about this sits well with me. But, I will listen to reason. Blind following… not so much.\nRemember what Ronald Reagan said.\nDon’t open the door if they ssy, “were the government and were here to help you”.\n(copy paste my reply to comment above)\nBiden gave Intel $7.9b in grants.\nIntel is paying that back as $11b worth of shares (interest added I guess).\nNothing wrong with owning a non-controlling share. Future governments can always sell the shares off.\nSovereign wealth funds (govt owned) own shares all over the place. It’s an investment, not control of means of production.\n‘Obviously, I’m not a big fan of government collaboration with private corporations, but this approach aligns with a very specific national security issue. ‘\nDefense of fascism ultimately ends up at “National Security”.\nIncluding the current US model of inverted fascism, or corporate-government “partnership” controlled largely from the corporate side.\nThe difference now is that the total surveillance panopticon and control systems are being built along with the fascism. You will either conform and assimilate or be cut off.\nAnd the financial control will be accomplished without CBDC, by stablecoin incorporating the government control via the “public- private partnership” (fascism) sidestepping the central banks and Federal Reserve.\nIt’s all frogmarching us toward the planned end state:\nTotalitarian US participating in the coming totalitarian “multi-polar global governance”.\nWhat about the things degrading the US, like the drugs, economic down force, and biowarfare democide of the coerced genetic manipulation injections? Glad you asked, this and the other degradation programs executing are evidently intended to weaken the US opposition to the frog boil warming up. Political opposition becomes nigh impossible when the people are struggling to survive with the illness and increased deaths in their families from the drugs and the shots, compounded by the economic falling.\nAs long as there is complete transparency, no political influence or corporate governance, I’m good with it.\nhow else can the taxpayers get back the billions in ‘Chip Grants’ that Biden gave to Intel?\nObiden’s “10% for the Big Guy” was to enrich himself to America’s detriment, but President Trump’s is to enrich the People for America’s blessing.\n“Donald Trump gave up his wealth for America. Joe Biden gave up America for his wealth. Know the difference. Donald Trump was too patriotic for Washington, DC.”—Brigitte Gabriel\nI cannot understand why it is so important to have government money invested into huge companies when we do not need these big monopolies but rather many smaller companies. These used to serve the public well so if regulation was seriously reduced they would be able to function economically.\nSounds like a creative win/win/win.\nBut then need to pay attention to future downsides.\nAnd at some future point hopefully, commit these shares to reduce the catastrophic\nnational debt.\nThis is part of the strategic counter to China’s threat against Taiwan.\nThe urgent problem was to allow Intel’s current CEO Lip-Bu Tan to continue\nto guide Intel to success at the leading edge of chip technology despite his\nties to China. Trump and others think Tan can do that.\nThis is much better than the Biden, hose it with $money and grift and\nmove on to another debacle and take a nap, approach.\nMany upsides to this. But adults need to pay attention,\nto see that it does not slip back into more Biden level corruption.\nI am vigorously opposed to this action.\nI don’t care if there might be a “good” reason to do this. But the Federal government has NO BUSINESS owning even one share of any private sector business — no matter how “vital” to national security!\nVery disappointed in this action.\nIntel Public Statement Here:\n“The government’s investment in Intel will be a passive ownership, with no Board representation or other governance or information rights. The government also agrees to vote with the Company’s Board of Directors on matters requiring shareholder approval, with limited exceptions.”\nI think this is the key element, the government will largely be passive but has retained the right to vote against the board of directors on limited exceptions. Major corporate decisions such as mergers and acquisitions, election of the board, or amendment of the bylaws require shareholder consent. It is in these details that the US Government is likely gaining the protection against Intel being merged or acquired by a non-US (read: Chinese) corporation. Other than the limited exceptions, the USG shares will support all board actions.\nI do not like gov’t owning private businesses. Trump needs to sell those shares before he leaves office b/c Dems will abuse such ownership if they get back in power!\nA colleague of mine – spent most of his career at intel – was laid off a few weeks ago here in AZ. He was part of many others getting pink slips. Semi cos are dumping us citizen talent while complaining they need more h1b. Its frustrating to see america first progress of maga, but the reality is that dot com bust 2.0 seems to be accelerating.\nIs it possible we are witnessing the next phase of non kinetic ww3? USG gets control of key industries in wartime. Its happened before.\nSo… from some guys in California who started Intel to Lip-Bu_Tan who turned the company towards China…\nThe guy has an impressive background for sure, but when we offshored chip manufacturing because it was cheap slave labor, I lost my faith in the American ideal of innovation + manufacturing. Tons of people in America lost their jobs during that transition. I had the privilege of touring a sub-micron facility in Santa Clara back in the day before all the big layoffs. And then there was the onslaught of H1B Visa holders. And Musk can go to hell on that point.\nI welcome Trump pushing to get manufacturing back on our soil. Not sure this move is the right way, but I’m just a grain of sand in the sea of opinions.\nhttps://en.wikipedia.org/wiki/Lip-Bu_Tan"
    },
    {
      "news_title": "'Trump Wasn't Hired To Run A Hedge Fund,' Says Peter Schiff As Intel Deal Divides Experts Amid Calls To Break Taiwan Dependence For Chips - NVIDIA (NASDAQ:NVDA), Intel (NASDAQ:INTC)",
      "news_link": "https://www.benzinga.com/markets/tech/25/08/47296593/trump-wasnt-hired-to-run-a-hedge-fund-says-peter-schiff-as-intel-deal-divides-experts-amid-calls-to-break-taiwan-dependence-for-chips",
      "bias": "Center",
      "text": "Economists and tech analysts are divided over President Donald Trump's decision to give the U.S. government a 10% stake in Intel Corporation INTC, with some calling it unconstitutional and others praising it as crucial for national security and semiconductor independence.\nTrump Announces Historic Intel Stake\nIntel shares climbed in after-hours trading on Friday after Trump took to Truth Social to reveal that the U.S. now \"fully owns and controls 10% of Intel,\" valued at about $11 billion.\nTrump said he negotiated the deal with CEO Lip-Bu Tan, declaring it a \"great deal for America\" that would cement the country's leadership in advanced chip manufacturing.\nIntel also confirmed that the stake includes an $8.9 billion investment funded by $5.7 billion in unpaid CHIPS Act grants and $3.2 billion from the Secure Enclave program.\nThe government's investment brings its total support to Intel to $11.1 billion.\nThis development follows SoftBank Group’s SFTBF SFTBY recent $2 billion investment in Intel, which secured the Japanese conglomerate an approximately 2% stake in the chipmaker.\nSee Also: Under AMD, Qualcomm Competitive Heat, Intel Gets Hit With Fitch Credit Downgrade\nSchiff Blasts Move As ‘Unconstitutional'\nEconomist Peter Schiff criticized the equity purchase, warning it erodes free-market principles. \"The U.S. Govt. taking a 10% stake in $INTC is not only unconstitutional, it's a bad idea,\" Schiff posted on X, formerly Twitter.\n\"Trump wasn't hired to run a hedge fund. This sets a very bad precedent as it moves our nation further away from free-market capitalism.\"\nWhen asked, isn't it better to invest rather than give billions in grants, Schiff replied, \"We shouldn’t do that either. But we don’t want the government to buy into private businesses.\"\nNewman Defends Strategic Investment\nDaniel Newman, CEO of Futurum Group, argued the move is vital for U.S. technology leadership. \"Funny to see some of the same people that cheered about ‘Chips Act Grants' losing their minds about the government investing in INTC,\" Newman wrote on X.\n\"Being able to manufacture leading-edge chips independent of Taiwan is existential. Or risk falling behind in AI and falling behind as the world's economic leader.\"\nEarlier this week, Commerce Secretary Howard Lutnick stressed the importance of producing chips in the U.S. rather than relying on Taiwan, home to Taiwan Semiconductor Manufacturing Co. TSM and just 80 miles from China.\nAs per reports, TSMC is responsible for producing over 90% of the world's most advanced computer chips.\nTrump's Involvement In The Broader Semiconductor Market\nThe announcement underscores Trump's semiconductor strategy, which includes 100% tariffs on foreign-made chips unless companies commit to U.S. manufacturing.\nThe administration has touted investments from Nvidia Corporation NVDA and Intel as national security victories.\nNotably, just earlier this month, Trump demanded Intel CEO Tan's immediate resignation after reports surfaced regarding his alleged ties to China.\nPrice Action: Intel stock closed up 1.05% in after-hours trading on Friday, according to Benzinga Pro.\nAccording to Benzinga's Edge Stock Rankings, INTC continues to display an upward price trend across short, medium and long-term periods. Additional performance details are available here.\nRead Next:\nDisclaimer: This content was partially produced with the help of AI tools and was reviewed and published by Benzinga editors.\nImage via Shutterstock\nEdge Rankings\nPrice Trend\n© 2025 Benzinga.com. Benzinga does not provide investment advice. All rights reserved."
    },
    {
      "news_title": "US government takes 10% stake in Intel in unusual bid to revive chipmaking",
      "news_link": "https://www.techspot.com/news/109181-us-government-takes-10-stake-intel-unusual-bid.html",
      "bias": "Center",
      "text": null
    },
    {
      "news_title": "Trump Says Intel Agreed to Give US a Stake in Its Company",
      "news_link": "https://www.newsmax.com/us/trump-intel-us-equity-stake/2025/08/22/id/1223588/",
      "bias": "Right",
      "text": "President Donald Trump said that Intel has agreed to give the U.S. government a 10% stake in its business.\n\"It is my Great Honor to report that the United States of America now fully owns and controls 10% of INTEL, a Great American Company that has an even more incredible future. I negotiated this Deal with Lip-Bu Tan, the Highly Respected Chief Executive Officer of the Company,\" Trump said in a post on Truth Social.\n\"The United States paid nothing for these Shares, and the Shares are now valued at approximately $11 Billion Dollars. This is a great Deal for America and, also, a great Deal for INTEL. Building leading edge Semiconductors and Chips, which is what INTEL does, is fundamental to the future of our Nation. MAKE AMERICA GREAT AGAIN! Thank you for your attention to this matter.\"\nSpeaking with reporters on Friday, Trump said the deal came out of a meeting last week with Intel CEO Lip Bu Tan — which came days after the president called for Tan to resign over his past ties to China.\n“I said, I think it would be good having the United States as your partner,” Trump said. “He agreed, and they’ve agreed to do it.”\nIntel did not immediately respond to a request for comment on the agreement.\nThe struggling Silicon Valley chipmaker has a market cap of just over $100 billion. The agreement comes just after Japanese technology giant SoftBank Group disclosed Monday that it is accumulating its 2% stake in Intel.\nThe official announcement is expected to come later Friday, according to a White House official who was not authorized to speak publicly ahead of an announcement and spoke on condition of anonymity.\nThe Trump administration has been in talks to secure a 10% stake in Intel in exchange for converting government grants that were pledged to Intel under President Joe Biden. If the deal is completed, the U.S. government would become one of Intel’s largest shareholders and blur the traditional lines separating the public sector and private sector in a country that remains the world’s largest economy.\nIn his second term, Trump has been leveraging his power to reprogram the operations of major computer chip companies. The administration is requiring Nvidia and Advanced Micro Devices, two companies whose chips are helping to power the craze around artificial intelligence, to pay a 15% commission on their sales of chips in China in exchange for export licenses.\nTrump’s interest in Intel is also being driven by his desire to boost chip production in the U.S., which has been a focal point of the trade war that he has been waging throughout the world. By lessening the country’s dependence on chips manufactured overseas, the president believes the U.S. will be better positioned to maintain its technological lead on China in the race to create artificial intelligence.\nThat’s what the president said August 7 in an unequivocal post calling for Intel CEO Lip-Bu Tan to resign less than five months after the Santa Clara, California, company hired him. The demand was triggered by reports raising national security concerns about Tan’s past investments in Chinese tech companies while he was a venture capitalist. But Trump backed off after Tan professed his allegiance to the U.S. in a public letter to Intel employees and went to the White House to meet with the president, who applauded the Intel CEO for having an “amazing story.”\nThe company isn’t commenting about the possibility of the U.S. government becoming a major shareholder, but Intel may have little choice because it is currently dealing from a position of weakness. After enjoying decades of growth while its processors powered the personal computer boom, the company fell into a slump after missing the shift to the mobile computing era unleashed by the iPhone’s 2007 debut.\nIntel has fallen even farther behind in recent years during an artificial intelligence craze that has been a boon for Nvidia and AMD. The company lost nearly $19 billion last year and another $3.7 billion in the first six months of this year, prompting Tan to undertake a cost-cutting spree. By the end of this year, Tan expects Intel to have about 75,000 workers, a 25% reduction from the end of last year.\nAlthough rare, it’s not unprecedented for the U.S. government to become a significant shareholder in a prominent company. One of the most notable instances occurred during the Great Recession in 2008 when the government injected nearly $50 billion into General Motors in return for a roughly 60% stake in the automaker at a time it was on the verge of bankruptcy. The government ended up with a roughly $10 billion loss after it sold its stock in GM.\nU.S. Commerce Secretary Howard Lutnick told CNBC during a Tuesday interview that the government has no intention of meddling in Intel’s business, and will have its hands tied by holding non-voting shares in the company. But some analysts wonder if the Trump administration’s financial ties to Intel might prod more companies looking to curry favor with the president to increase their orders for the company’s chips.\nIntel was among the biggest beneficiaries of the Biden administration’s CHIPS and Science Act, but it hasn’t been able to revive its fortunes while falling behind on construction projects spawned by the program.\nThe company has received about $2.2 billion of the $7.8 billion pledged under the incentives program — money that Lutnick derided as a “giveaway” that would better serve U.S. taxpayers if it’s turned into Intel stock. “We think America should get the benefit of the bar\nCopyright 2025 The Associated Press. All rights reserved. This material may not be published, broadcast, rewritten or redistributed without permission."
    },
    {
      "news_title": "Trump says Intel agreed to give US government 10% equity stake in $10 billion deal",
      "news_link": "https://www.firstpost.com/world/trump-says-intel-agreed-to-give-us-government-10-equity-stake-under-10-billion-deal-13927281.html",
      "bias": "Lean Right",
      "text": "President Donald Trump said Intel Corp. has agreed to hand the US government a ten per cent equity stake, with a formal announcement expected on Friday, according to people familiar with the matter.\nHailing the deal as a “multibillion-dollar win for taxpayers” and a turning point for the struggling chipmaker, Trump said the partial ownership marked a new era in how Washington supports critical industries.\nThe move would represent an extraordinary level of intervention in an American company, breaking with long-held norms that such measures are usually reserved for times of war or systemic financial crisis. Intel declined to comment on the timing of the announcement. Shares in the company rose as much as 6.6 per cent on Friday.\nCommerce Secretary Howard Lutnick underscored the shift in approach, telling CNBC earlier this week that the goal is to “get a good return for the American taxpayer instead of just giving grants away.”\nAlthough the administration has not disclosed full details of its negotiations with Intel, a US official said companies expanding their US investments—such as Taiwan Semiconductor Manufacturing Co. and Micron Technology Inc.—would not be required to offer equity in exchange for federal support.\nThe Intel deal underscores both risks and rewards: the possibility of heavy taxpayer losses if the investment falters, but also the chance of reviving a company that once led the chip industry and is now seen as falling behind competitors.\nTrump has increasingly tied industrial policy to direct state involvement. In early August, he announced Nvidia Corp. and Advanced Micro Devices Inc. had agreed to give the government 15 per cent of revenue from AI chip sales to China. Earlier this year, he also secured a “Golden Share” from Nippon Steel Corp. in its deal for United States Steel Corp., granting him veto power over key decisions."
    },
    {
      "news_title": "US government snaps up 10% of Intel for $8.9B",
      "news_link": "https://www.theregister.com/2025/08/23/us_government_snaps_up_10/",
      "bias": "Center",
      "text": "US government snaps up 10% of Intel for $8.9B\nThe funds were already allocated under the CHIPS Act and Secure Enclave program\nCongratulations America, your government now owns 10 percent of troubled domestic chipmaker Intel.\nIntel and the government announced the deal late on Friday. Under it, Intel will get $5.7 billion in grants that officials had allocated but not yet paid under former President Biden's CHIPS and Science Act. The government gave Chipzilla an additional $3.2 billion under the Secure Enclave program, which is supposed to be used to develop high-security chips for US government and military use. Intel has already received $2.2 billion in CHIPS grants so far, giving it quite the war chest.\n\"It is my Great Honor to report that the United States of America now fully owns and controls 10% of Intel, a Great American Company that has an even more incredible future,\" President Trump announced on his social media site Truth Social.\n\"I negotiated this Deal with Lip-Bu Tan, the Highly Respected Chief Executive Officer of the Company. The United States paid nothing for these Shares, and the Shares are now valued at approximately $11 Billion Dollars. This is a great Deal for America and, also, a great Deal for Intel.\"\nIndeed, Intel's shares closed the day up more than 5%, giving the company a market cap of nearly $110 billion, which would make the US government's stake worth about $11 billion. That said, the government did not pay nothing for the shares, although it used money that had already been allocated under previous programs, so no new money was spent.\nIntel has been desperately trying to drum up more funding as it seeks to regain its position as one of the top chipmakers in the world. The cash will give it a much-needed lifeline to rebuild its advanced chip-making capabilities and move production stateside and away from Asian vendors like TSMC.\nThe deal also represents a personal win for the relatively new CEO, who took over in March. At the start of the month, the president was calling for Tan's resignation as he was \"highly CONFLICTED,\" but after some frantic diplomacy he's now back in the government's good books it seems.\n\"As the only semiconductor company that does leading-edge logic R&D and manufacturing in the US, Intel is deeply committed to ensuring the world’s most advanced technologies are American made,\" said Tan in a statement.\n\"President Trump’s focus on U.S. chip manufacturing is driving historic investments in a vital industry that is integral to the country’s economic and national security. We are grateful for the confidence the President and the Administration have placed in Intel, and we look forward to working to advance US technology and manufacturing leadership.\"\n- Uncle Sam eyes slice of Intel in return for CHIPS Act cash\n- Trump does a 180 on Intel chief following White House meeting\n- India's PM laments missing out on global chipmaking dominance – in 1964!\n- GlobalFoundries inks domestic chipmaking deal with Cirrus Logic\nIn addition to taking a 10 percent stake, the government reserves the right to buy an additional 5 percent of the company at $20 per share, a considerable discount on the current stock market price of around $25. The government won't have a seat on the board, and has said it will back the current management with \"limited exceptions.\"\n\"Intel is excited to welcome the United States of America as a shareholder, helping to create the most advanced chips in the world,\" said the United States Secretary of Commerce Howard Lutnick. \"As more companies look to invest in America, this administration remains committed to reinforcing our country’s dominance in artificial intelligence while strengthening our national security.\"\nRumors about the investment have circulated for a while and, on the face of it, looks like a very good deal for American taxpayers. For decades Intel has spent tens of billions propping up its share price with stock buybacks and returns to investors, while failing to get to grips with advanced chip design and manufacturing.\nUnder the circumstances just handing them money with nothing to show for it would look like a dumb move. Now the US has a direct stake in a domestic chip company that could prove both lucrative, and also is necessary to ensure the US gets its chips from a friendly supplier in the homeland. ®"
    },
    {
      "news_title": "Trump turns $11.1 billion in US government funds into a 10 percent",
      "news_link": "https://www.arabnews.com/node/2612723/world",
      "bias": "Lean Right",
      "text": "WASHINGTON: President Donald Trump on Friday announced the US government has secured a 10 percent stake in struggling Silicon Valley pioneer Intel in a deal that was completed just a couple weeks after he was depicting the company’s CEO as a conflicted leader unfit for the job.\n“The United States of America now fully owns and controls 10 percent of INTEL, a Great American Company that has an even more incredible future,” Trump wrote in a post.\nThe US government is getting the stake through the conversion of $11.1 billion in previously issued funds and pledges. All told, the government is getting 433.3 million shares of non-voting stock priced at $20.47 apiece — a discount from Friday’s closing price at $24.80. That spread means the US government already has a gain of $1.9 billion, on paper.\nThe remarkable turn of events makes the US government one of Intel’s largest shareholders at a time that the Santa Clara, California, company is in the process of jettisoning more than 20,000 workers as part of its latest attempt to bounce back from years of missteps taken under a variety of CEOs.\nIntel’s current CEO, Lip-Bu Tan, has only been on the job for slightly more than five months, and earlier this month, it looked like he might be on shaky ground already after some lawmakers raised national security concerns about his past investments in Chinese companies while he was a venture capitalist. Trump latched on to those concerns in an August 7 post demanding that Tan resign.\nBut Trump backed off after the Malaysian-born Tan professed his allegiance to the US in a public letter to Intel employees and went to the White House to meet with the president, leading to a deal that now has the US government betting that the company is on the comeback trail after losing more than $22 billion since the end of 2023. Trump hailed Tan as “highly respected” CEO in his Friday post.\nIn a statement, Tan applauded Trump for “driving historic investments in a vital industry” and resolved to reward his faith in Intel. “We are grateful for the confidence the President and the Administration have placed in Intel, and we look forward to working to advance US technology and manufacturing leadership,” Tan said.\nIntel’s current stock price is just slightly above where it was when Tan was hired in March and more than 60 percent below its peak of about $75 reached 25 years ago when its chips were still dominating the personal computer boom before being undercut by a shift to smartphones a few years later. The company’s market value currently stands at about $108 billion — a fraction of the current chip kingpin, Nvidia, which is valued at $4.3 trillion.\nThe stake is coming primarily through US government grants to Intel through the CHIPS and Science Act that was started under President Joe Biden’s administration as a way to foster more domestic manufacturing of computer chips to lessen the dependence on overseas factories.\nBut the Trump administration, which has regularly pilloried the policies of the Biden administration, saw the CHIPs act as a needless giveaway and is now hoping to make a profit off the funding that had been pledged to Intel.\n“We think America should get the benefit of the bargain,” US Commerce Secretary Howard Lutnick said earlier this week. “It’s obvious that it’s the right move to make.”\nAbout $7.8 billion had been been pledged to Intel under the incentives program, but only $2.2 billion had been funded so far. Another $3.2 billion of the government investment is coming through the funds from another program called “Secure Enclave.”\nAlthough US government can’t vote with its shares and won’t have a seat on Intel’s board of directors, critics of the deal view it as a troubling cross-pollination between the public and private sectors that could hurt the tech industry in a variety of ways.\nFor instance, more tech companies may feel pressured to buy potentially inferior chips from Intel to curry favor with Trump at a time that he is already waging a trade war that threatens to affect their products in a potential scenario cited by Scott Lincicome, vice president of general economics for the Cato Institute.\n“Overall, it’s a horrendous move that will have real harms for US companies, US tech leadership, and the US economy overall,” Lincicome posted Friday.\nThe 10 percent stake could also intensify the pressure already facing Tan, especially if Trump starts fixating on Intel’s stock price while resorting to his penchant for celebrating his past successes in business.\nNancy Tengler, CEO of money manager Laffer Tengler Investments, is among the investors who abandoned Intel years ago because of all the challenges facing Intel.\n“I don’t see the benefit to the American taxpayer, nor do I see the benefit, necessarily to the chip industry,” Tengler said while also raising worries about Trump meddling in Intel’s business.\n“I don’t care how good of businessman you are, give it to the private sector and let people like me be the critic and let the government get to the business of government.,” Tengler said.\nAlthough rare, it’s not unprecedented for the US government to become a significant shareholder in a prominent company. One of the most notable instances occurred during the Great Recession in 2008 when the government injected nearly $50 billion into General Motors in return for a roughly 60 percent stake in the automaker at a time it was on the verge of bankruptcy. The government ended up with a roughly $10 billion loss after it sold its stock in GM.\nThe US government’s stake in Intel coincides with Trump’s push to bring production to the US, which has been a focal point of the trade war that he has been waging throughout the world. By lessening the country’s dependence on chips manufactured overseas, the president believes the US will be better positioned to maintain its technological lead on China in the race to create artificial intelligence.\nEven before gaining the 10 percent stake in Intel, Trump had been leveraging his power to reprogram the operations of major computer chip companies. The administration is requiring Nvidia and Advanced Micro Devices, two companies whose chips are powering the AI craze, to pay a 15 percent commission on their sales of chips in China in exchange for export licenses.\nTrump turns $11.1 billion in US government funds into a 10 percent stake in downtrodden Intel\nhttps://arab.news/ypqd4\nTrump turns $11.1 billion in US government funds into a 10 percent stake in downtrodden Intel\n- US govt getting the stake through the conversion of $11.1 billion in previously issued funds and pledges, making a gain of $1.9 billion, on paper\n- Remarkable turn of events comes at a time that the chipmaker is in the process of laying off more than 20,000 workers in bid to bounce back from years of missteps"
    },
    {
      "news_title": "US Government Makes $8.9B Investment to Take 10% Stake in Intel",
      "news_link": "https://www.cnet.com/tech/computing/us-government-makes-8-9b-investment-to-take-10-stake-in-intel/#ftag=CAD590a51e",
      "bias": "Center",
      "text": null
    },
    {
      "news_title": "US Secures 10% Intel Stake After Trump Pushes Deal With CEO Lip-Bu Tan",
      "news_link": "https://www.news18.com/world/us-secures-10-intel-stake-after-trump-pushes-deal-with-ceo-lip-bu-tan-ws-l-9522688.html",
      "bias": "Lean Right",
      "text": "US Secures 10% Intel Stake After Trump Pushes Deal With CEO Lip-Bu Tan\nEarlier this month, President Trump called on Tan to resign, accusing him of questionable ties to China. Tan dismissed the allegations as “misinformation”.\nThe US government has acquired a 10% stake in Intel, President Donald Trump announced Friday in a Truth Social post. Trump revealed that he had asked Intel CEO Lip-Bu Tan to finalise the agreement during a recent meeting at the White House.\nIntel confirmed the deal in a statement published on its website Friday afternoon, disclosing that the government will invest $8.9 billion in Intel common stock. This new investment adds to the $2.2 billion in CHIPS Act grants previously awarded to the company but not yet disbursed, bringing the total federal support to $11.1 billion.\nRecommended Stories\nAccording to Intel, the funds will come from grants previously promised under the CHIPS and Science Act, passed during President Joe Biden’s administration. The legislation is aimed at bolstering the domestic semiconductor industry in the face of increasing global competition, particularly from China.\n“He agreed, and they’ve agreed to do it, and I think it’s a great deal for them,\" Trump told on Friday. “He walked in wanting to keep his job, and he ended up giving us $10 billion for the US,\" he added, referring to Intel CEO Lip-Bu Tan.\nOn Truth Social, Trump described the move as a win for both the company and the country, “Great Deal for America and, also, a great Deal for INTEL. Building leading edge Semiconductors and Chips, which is what INTEL does, is fundamental to the future of our Nation.\" As part of the agreement, the government will receive a five-year warrant priced at $20 per share.\nIntel CEO has recently faced scrutiny from Trump. Earlier this month, he called on Tan to resign, accusing him of questionable ties to China. Tan dismissed the allegations as “misinformation\" in a note to Intel employees, according to a report by the BBC.\nAccording to NBC, Trump also recently convinced chipmakers Nvidia and AMD to pay the US government 15% of revenue from certain China sales in exchange for export licenses.\n- Location :\n- First Published:"
    },
    {
      "news_title": "Trump turns US$11.1B in U.S. government funds into a 10% stake in downtrodden Intel",
      "news_link": "https://www.bnnbloomberg.ca/business/2025/08/22/trump-turns-us111b-in-us-government-funds-into-a-10-stake-in-downtrodden-intel/",
      "bias": "Lean Left",
      "text": "WASHINGTON – U.S. President Donald Trump on Friday announced the U.S. government has secured a 10 per cent stake in struggling Silicon Valley pioneer Intel in a deal that was completed just a couple weeks after he was depicting the company’s CEO as a conflicted leader unfit for the job.\n“The United States of America now fully owns and controls 10 per cent of INTEL, a Great American Company that has an even more incredible future,” Trump wrote in a post.\nThe U.S. government is getting the stake through the conversion of US$11.1 billion in previously issued funds and pledges. All told, the government is getting 433.3 million shares of non-voting stock priced at $20.47 apiece -- a discount from Friday’s closing price at $24.80. That spread means the U.S. government already has a gain of $1.9 billion, on paper.\nThe remarkable turn of events makes the U.S. government one of Intel’s largest shareholders at a time that the Santa Clara, California, company is i n the process of jettisoning more than 20,000 workers as part of its latest attempt to bounce back from years of missteps taken under a variety of CEOs.\nIntel’s current CEO, Lip-Bu Tan, has only been on the job for slightly more than five months, an d earlier this month, it looked like he might be on shaky ground already after some lawmakers raised national security concerns about his past investments in Chinese companies while he was a venture capitalist. Trump latched on to those concerns in an August 7 post demanding that Tan resign.\nBut Trump backed off after the Malaysian-born Tan professed his allegiance to the U.S. in a public letter to Intel employees and went to the White House to meet with the president, leading to a deal that now has the U.S. government betting that the company is on the comeback trail after losing more than $22 billion since the end of 2023. Trump hailed Tan as “highly respected” CEO in his Friday post.\nIn a statement, Tan applauded Trump for “driving historic investments in a vital industry” and resolved to reward his faith in Intel. “We are grateful for the confidence the President and the Administration have placed in Intel, and we look forward to working to advance U.S. technology and manufacturing leadership,” Tan said.\nIntel’s current stock price is just slightly above where it was when Tan was hired in March and more than 60 per cent below its peak of about $75 reached 25 years ago when its chips were still dominating the personal computer boom before being undercut by a shift to smartphones a few years later. The company’s market value currently stands at about $108 billion - a fraction of the current chip kingpin, Nvidia, which is valued at $4.3 trillion.\nThe stake is coming primarily through U.S. government grants to Intel through the CHIPS and Science Act that was started under President Joe Biden’s administration as a way to foster more domestic manufacturing of computer chips to lessen the dependence on overseas factories.\nBut the Trump administration, which has regularly pilloried the policies of the Biden administration, saw the CHIPs act as a needless giveaway and is now hoping to make a profit off the funding that had been pledged to Intel.\n“We think America should get the benefit of the bargain,” U.S. Commerce Secretary Howard Lutnick said earlier this week. “It’s obvious that it’s the right move to make.”\nAbout $7.8 billion had been been pledged to Intel under the incentives program, but only $2.2 billion had been funded so far. Another $3.2 billion of the government investment is coming through the funds from another program called “Secure Enclave.”\nAlthough U.S. government can’t vote with its shares and won’t have a seat on Intel’s board of directors, critics of the deal view it as a troubling cross-pollination between the public and private sectors that could hurt the tech industry in a variety of ways.\nFor instance, more tech companies may feel pressured to buy potentially inferior chips from Intel to curry favor with Trump at a time that he is already waging a trade war that threatens to affect their products in a potential scenario cited by Scott Lincicome, vice president of general economics for the Cato Institute.\n“Overall, it’s a horrendous move that will have real harms for U.S. companies, U.S. tech leadership, and the U.S. economy overall,” Lincicome posted Friday.\nThe 10 per cent stake could also intensify the pressure already facing Tan, especially if Trump starts fixating on Intel’s stock price while resorting to his penchant for celebrating his past successes in business.\nNancy Tengler, CEO of money manager Laffer Tengler Investments, is among the investors who abandoned Intel years ago because of all the challenges facing Intel.\n“I don’t see the benefit to the American taxpayer, nor do I see the benefit, necessarily to the chip industry,” Tengler said while also raising worries about Trump meddling in Intel’s business.\n“I don’t care how good of businessman you are, give it to the private sector and let people like me be the critic and let the government get to the business of government.,” Tengler said.\nAlthough rare, it’s not unprecedented for the U.S. government to become a significant shareholder in a prominent company. One of the most notable instances occurred during the Great Recession in 2008 when the government injected nearly $50 billion into General Motors in return for a roughly 60 per cent stake in the automaker at a time it was on the verge of bankruptcy. The government ended up with a roughly $10 billion loss after it sold its stock in GM.\nThe U.S. government’s stake in Intel coincides with Trump’s push to bring production to the U.S., which has been a focal point of the trade war that he has been waging throughout the world. By lessening the country’s dependence on chips manufactured overseas, the president believes the U.S. will be better positioned to maintain its technological lead on China in the race to create artificial intelligence.\nEven before gaining the 10 per cent stake in Intel, Trump had been leveraging his power to reprogram the operations of major computer chip companies. The administration is requiring Nvidia and Advanced Micro Devices, two companies whose chips are powering the AI craze, to pay a 15 per cent commission on their sales of chips in China in exchange for export licenses.\nBy Michelle L. Price And Michael Liedtke, The Associated Press\nLiedtke reported from San Ramon, California."
    },
    {
      "news_title": "Why Intel Stock Soared Today @themotleyfool #stocks $INTC",
      "news_link": "https://www.fool.com/investing/2025/08/22/why-intel-stock-soared-today/",
      "bias": "Lean Left",
      "text": "Intel (INTC 5.64%) stock is leaping higher in Friday's trading thanks to a pair of bullish catalysts. The semiconductor company's share price gained 5.5% in a day of trading that saw the S&P 500 jump 1.5% and the Nasdaq Composite surge 1.8%.\nIntel's valuation climbed today thanks to a speech from Federal Reserve chair Jerome Powell that increased hopes among investors for an interest rate cut at the central bank's meeting next month. The stock also got a boost from a report suggesting that the Trump administration was on the verge of announcing that it was on track to acquire a 10% stake in the company.\nInterest rate news boosted Intel stock today\nPowell gave a speech this morning that has restored market confidence in a September interest rate cut and the potential for another rate cut later in the year. The Fed has kept rates relatively high in order to combat inflation, but investors have been hoping that the central bank will deliver cuts and create a stronger environment for stocks and other assets.\nWhile Powell said that inflation continued to present challenges, he indicated that weakness in the U.S. economy was looking like the bigger risk factor. His comments seemed to indicate that the Fed is leaning toward cutting rates next month, and they helped power gains for Intel and many other tech stocks today.\nIntel also rose thanks to major U.S. investment news\nBloomberg published a report today stating that President Donald Trump was on track to announce that the U.S. government would be taking a nearly 10% equity position in Intel. The official announcement wound up arriving after the market closed today, but Trump did confirm that he had met with CEO Lip-bu Tan and that the U.S. will be taking a 10% stake in Intel.\nThe development will allow Intel to receive funding that had been apportioned to it through the CHIPS Act. It also opens the door for additional government support as artificial intelligence (AI) chip designs and chip fabrication technologies become increasingly important to the economy and national security."
    },
    {
      "news_title": "Trump, Intel Announce Deal Giving US 10% Stake In Chipmaker",
      "news_link": "https://www.ndtv.com/world-news/donald-trump-intel-announce-deal-giving-us-10-stake-in-chipmaker-9142868#publisher=newsstand",
      "bias": "Lean Right",
      "text": null
    },
    {
      "news_title": "Trump turns $11.1B in US government funds into a 10% stake in downtrodden Intel",
      "news_link": "https://www.santafenewmexican.com/ap/business/trump-turns-11-1b-in-us-government-funds-into-a-10-stake-in-downtrodden-intel/article_e98e1a00-f6fe-5e46-a3d7-50e7fd54c731.html",
      "bias": "Center",
      "text": null
    },
    {
      "news_title": "Intel begins new chapter as US becomes biggest shareholder",
      "news_link": "https://www.wenatcheeworld.com/arena/finance/intel-begins-new-chapter-as-us-becomes-biggest-shareholder/article_b0bb422c-d1db-575b-8967-c5457f21079d.html",
      "bias": "Center",
      "text": null
    },
    {
      "news_title": "'Not what I voted for': MAGA decries Trump's latest move as 'socialism'",
      "news_link": "https://www.alternet.org/maga-trump-socialism/",
      "bias": "Left",
      "text": "'Not what I voted for': MAGA decries Trump's latest move as 'socialism'\nOn Friday, President Donald Trump announced that the U.S. government was now a part-owner of a major publicly traded tech company. The reaction among his base was less than enthusiastic.\nTrump announced via his Truth Social platform that as of Friday the U.S. is a multibillion-dollar shareholder in Intel as part of an agreement with CEO Lip-Bu Tan — with the U.S. supposedly paying nothing for its new stake. The announcement notably came roughly two weeks after Trump's angry social media tirade against Tan, in which he demanded that Tan \"resign immediately\" from his role due to his investments in Chinese tech companies.\n\"It is my Great Honor to report that the United States of America now fully owns and controls 10% of INTEL, a Great American Company that has an even more incredible future,\" Trump wrote in his signature style of oddly placed capital letters. \"I negotiated this Deal with Lip-Bu Tan, the Highly Respected Chief Executive Officer of the Company. The United States paid nothing for these Shares, and the Shares are now valued at approximately $11 Billion Dollars. This is a great Deal for America and, also, a great Deal for INTEL. Building leading edge Semiconductors and Chips, which is what INTEL does, is fundamental to the future of our Nation. MAKE AMERICA GREAT AGAIN! Thank you for your attention to this matter.\"\nREAD MORE: 'I am the pick of the president!' Trump loyalist booted from job livid over her dismissal\nWhile some of the responses to the Trump administration's post on X announcing the news were complimentary, many replies were deeply critical of the government taking ownership of a private company. One user who described themselves in their bio as a \"Constitutional Conservative\" wrote: \"Not what I voted for. I voted against this specifically.\" Conservative podcast host @amandatalks_ tweeted: \"ngl [not gonna lie] don't love this guys.\"\n\"I'm a Republican but I do not agree with this,\" another user posted. \"Government and privately owned businesses should not mix.\"\n\"Governments shouldn't own private business,\" tweeted retired Naval officer Mike Rodman.\nAerospace engineer Michael Heil also weighed in, responding to the White House's post by writing: \"Not good. Even partial government ownership of private industry is socialism.\"\nREAD MORE: 'Had a fit': Trump raged at Secret Service over White House sleeping arrangements"
    },
    {
      "news_title": "Intel agrees to give US government $8.9B stake in its company",
      "news_link": "https://www.opb.org/article/2025/08/22/intel-trump-us-government-stake/",
      "bias": "Center",
      "text": "Chipmaker Intel has agreed to give the U.S. government a nearly 10% stake in its business.\nIntel, which has a major research and development campus in Hillsboro, Oregon, said in a statement the U.S. government will buy $8.9 billion in Intel common stock.\nNearly $6 billion of that will be funded with previously awarded, but not yet paid, grants from the U.S. CHIPS and Science Act, according to the company.\n“President Trump’s focus on U.S. chip manufacturing is driving historic investments in a vital industry that is integral to the country’s economic and national security,” Intel CEO Lip-Bu Tan said in the statement.\n“We are grateful for the confidence the President and the Administration have placed in Intel, and we look forward to working to advance U.S. technology and manufacturing leadership.”\nIntel said the government’s investment will not include voting or governance power.\nSpeaking with reporters on Friday, Trump said the deal came out of a meeting last week with Intel CEO Tan — which came days after the president called for him to resign over his past ties to China.\n“I said, I think it would be good having the United States as your partner,” Trump said. “He agreed, and they’ve agreed to do it.”\nThe struggling Silicon Valley chipmaker has a market cap of just over $100 billion. The agreement comes after Japanese technology giant SoftBank Group said Monday it’s accumulating a 2% stake in Intel.\nIntel is headquartered in California but considers its Hillsboro campus the heart of its research and development. The semiconductor firm employs around 18,000 people in Oregon, making it among the state’s largest private employers.\nOnce the world’s top chipmaker, Intel fell behind in the race to develop technology for smartphones and artificial intelligence. The company reported a loss of nearly $19 billion last year, after recording a $1.7 billion profit in 2023.\nTan was brought on as CEO to help the company catch up. Since he took over at the helm earlier this year, the company has announced it would slow down manufacturing and shed thousands of jobs. Last month the company told Oregon officials it was cutting nearly 2,400 positions from its facilities in Washington County.\nCommerce Secretary Howard Lutnick foreshadowed the announcement of the government’s stake in Intel in an interview on CNBC earlier this week. It drew criticism from both of Oregon’s U.S. Senators.\n“This is nothing more than corporate extortion from Donald Trump and his cabinet of bobbleheads acting more like a mob family squeezing out protection money than an administration working in our economy’s best interests,” Sen. Ron Wyden, a Democrat, said in a statement to OPB on Wednesday.\nSen. Jeff Merkley, D-Oregon, said the move would hurt the semiconductor industry instead of help give it a needed boost.\n“This latest scheme is nothing more than an attempt to distract from Trump’s chaotic tariff and trade policies that are hurting American businesses and consumers and causing chaos in the market,” Merkley said in a statement.\nWhat’s happening?\nThe Trump administration has been in talks to secure a stake in Intel in exchange for converting government grants that were pledged to Intel under President Joe Biden. The deal makes U.S. government one of Intel’s largest shareholders, and blurs the traditional lines separating the public sector and private sector in a country that remains the world’s largest economy.\nWhy would Trump do this?\nIn his second term, Trump has been leveraging his power to reprogram the operations of major computer chip companies. The administration is requiring Nvidia and Advanced Micro Devices, two companies whose chips are helping to power the craze around artificial intelligence, to pay a 15% commission on their sales of chips in China in exchange for export licenses.\nTrump’s interest in Intel is also being driven by his desire to boost chip production in the U.S., which has been a focal point of the trade war that he has been waging throughout the world. By lessening the country’s dependence on chips manufactured overseas, the president believes the U.S. will be better positioned to maintain its technological lead on China in the race to create artificial intelligence.\nDidn’t Trump want Intel’s CEO to quit?\nThat’s what the president said Aug. 7 in an unequivocal post calling for Intel CEO Lip-Bu Tan to resign less than five months after the Santa Clara, California, company hired him. The demand was triggered by reports raising national security concerns about Tan’s past investments in Chinese tech companies while he was a venture capitalist. But Trump backed off after Tan professed his allegiance to the U.S. in a public letter to Intel employees. Tan also went to the White House to meet with the president, who applauded the Intel CEO for having an “amazing story.”\nWhy would Intel do a deal?\nIntel may have little choice because it is currently dealing from a position of weakness. After enjoying decades of growth while its processors powered the personal computer boom, the company fell into a slump after missing the shift to the mobile computing era unleashed by the iPhone’s 2007 debut.\nIntel has fallen even farther behind in recent years during an artificial intelligence craze that has been a boon for Nvidia and AMD. The company lost nearly $19 billion last year and another $3.7 billion in the first six months of this year, prompting Tan to undertake a cost-cutting spree. By the end of this year, Tan expects Intel to have about 75,000 workers, a 25% reduction from the end of last year.\nIs this deal unusual?\nAlthough rare, it’s not unprecedented for the U.S. government to become a significant shareholder in a prominent company. One of the most notable instances occurred during the Great Recession in 2008 when the government injected nearly $50 billion into General Motors in return for a roughly 60% stake in the automaker at a time it was on the verge of bankruptcy. The government ended up with a roughly $10 billion loss after it sold its stock in GM.\nWould the government run Intel?\n“The government’s investment in Intel will be a passive ownership, with no Board representation or other governance or information rights,” Intel said in its statement about the deal. “The government also agrees to vote with the Company’s Board of Directors on matters requiring shareholder approval, with limited exceptions.”\nU.S. Commerce Secretary Howard Lutnick told CNBC during a Tuesday interview that the government has no intention of meddling in Intel’s business, and will have its hands tied by holding non-voting shares in the company.\nBut some analysts wonder if the Trump administration’s financial ties to Intel might prod more companies looking to curry favor with the president to increase their orders for the company’s chips.\nWhat government grants does Intel receive?\nIntel was among the biggest beneficiaries of the Biden administration’s CHIPS and Science Act, but it hasn’t been able to revive its fortunes while falling behind on construction projects spawned by the program.\nThe company has received about $2.2 billion of the $7.8 billion pledged under the incentives program."
    },
    {
      "news_title": "US government announces 10% stake in chipmaker Intel",
      "news_link": "https://www.bbc.com/news/articles/cvg3zpdl3xdo",
      "bias": "Center",
      "text": "White House announces chipmaker Intel to give US government 10% stake\nUS Secretary of Commerce Howard Lutnick said on Friday that the federal government will take a 10% stake in US chipmaker Intel.\n\"This historic agreement strengthens US leadership in semiconductors, which will both grow our economy and help secure America's technological edge,\" Lutnick wrote on X in a post accompanied by a photo of himself with Intel CEO Lip-Bu Tan.\nPresident Donald Trump revealed the deal earlier on Friday during remarks in the Oval Office, calling it a \"great deal for them\".\nShares of the Santa Clara, California-based chipmaker soared more than 5% on Friday.\nIntel said in a statement that the US government would make a $8.9bn (£6.6bn) investment in Intel common stock.\nThe funds were set to come from grants that were previously awarded but not yet paid, Intel said, including monies promised under the US CHIPS and Science Act which was passed during President Joe Biden's administration.\n\"As the only semiconductor company that does leading-edge logic R&D and manufacturing in the US, Intel is deeply committed to ensuring the world's most advanced technologies are American made,\" Mr Tan said in a statement.\n\"President Trump's focus on US chip manufacturing is driving historic investments in a vital industry that is integral to the country's economic and national security,\" he added.\nThe CHIPS Act was passed with the aim of reshoring chip manufacturing in the United States.\nIntel has struggled in recent years to build out more chip capacity and has fallen far behind rival Nvidia whose market cap has soared past the $4tn mark while Intel's has languished around $100bn.\nThe one-time Silicon Valley icon has failed to capitalise on the development of mobile technology and, more recently, artificial intelligence which Nvidia has dominated.\nUnder attack\nIntel had found itself in US President Donald Trump's crosshairs in recent weeks.\nEarlier this month, Trump called on Mr Tan to immediately resign, accusing him of having problematic ties to China.\nTrump called Mr Tan \"highly conflicted\" for alleged investments in companies which the US says are linked to the Chinese military.\nMr Tan referred to the accusations as \"misinformation\" in a note sent to Intel staff, in which he defended himself and said he had \"always operated within the highest legal and ethical standards.\"\nMr Tan is a US citizen born in Malaysia and raised in Singapore.\nIt is legal for Americans to invest in Chinese firms.\nTrump's attack came after Republican Senator Tom Cotton delivered a letter to Intel's board raising similar concerns and questioning the company's ability to be a \"responsible steward of American taxpayer dollars and to comply with applicable security regulations\".\nMr Tan visited the White House to meet with Trump after the president's attacks.\nA 'creative idea'\nFriday's announcement comes after White House Press Secretary Karoline Leavitt called the proposal \"a creative idea that's never been done before\" earlier in the week.\nThe Trump administration recently ordered Nvidia and AMD to give the government a 15% cut of the revenue from AI chip sales to China, according to reports.\nWhile the approach is considered unusual, Jacob Feldgoise, a Senior Data Research Analyst at Georgetown University's Center for Security and Emerging Technology, drew parallels between the equity stake and the previous approach of giving Intel grant funding.\n\"It's still in service of the same overall objective which is taking a more direct role in private markets to advance US economic and national security objectives, particularly around maintaining technological leadership – or really regaining it – when it comes to semiconductor manufacturing,\" Mr Feldgoise told the BBC.\nThe deal is considered rare in the modern era, but not without precedent.\nDuring the Great Financial Crisis in 2008, the US government took a majority stake in automaker General Motors which was poised to enter into bankruptcy protection.\nIt eventually exited its position, incurring a loss of about $10bn.\nMr Feldgoise said the Trump administration took a similar approach earlier this year in a deal with MP Materials, a Nevada-based company that mines rare earth metals.\nThat agreement has come under scrutiny from public-interest watchdog groups amid revelations that the Department of Defense depended on a Cold War-era law to circumvent procurement and contracting laws.\nSign up for our Tech Decoded newsletter to follow the world's top tech stories and trends. Outside the UK? Sign up here."
    },
    {
      "news_title": "Intel agrees to give US 10% stake in company",
      "news_link": "https://gazette.com/news/wex/intel-agrees-to-give-us-10-stake-in-company/article_ee0c92a2-32e9-5075-a4ed-eab217af4722.html",
      "bias": "Center",
      "text": "President Donald Trump said Friday that chipmaker Intel has agreed to give the U.S. government a 10% equity stake in the company, a historic government intervention.\nTrump said during a news conference that the deal came after negotiations with Intel CEO Lip-Bu Tan.\n“I said, ‘I think it would be good, having the United States as your partner.’ He agreed, and they’ve agreed to do it,” Trump said. “And I think it’s a great deal for them.”\nIntel announced the move in a press release. As part of the deal, the U.S. will get 433,323,000 shares of the tech company. The U.S. has reportedly pledged to release nearly $9 billion in funding under the 2022 Chips and Science Act.\n“As the only semiconductor company that does leading-edge logic [Research & Development] and manufacturing in the U.S., Intel is deeply committed to ensuring the world’s most advanced technologies are American made,” Tan said. “President Trump’s focus on U.S. chip manufacturing is driving historic investments in a vital industry that is integral to the country’s economic and national security.\"\nInvestors welcomed the news, and Intel’s stock closed up more than 5.5% on Friday.\nCommerce Secretary Howard Lutnick praised the deal on social media and thanked the Intel CEO for his work with the administration in securing the agreement.\nTRUMP TARIFFS WILL REDUCE DEFICITS BY $4 TRILLION OVER NEXT DECADE, CBO SAYS\n“BIG NEWS: The United States of America now owns 10% of Intel, one of our great American technology companies,” Lutnick said. “This historic agreement strengthens U.S. leadership in semiconductors, which will both grow our economy and help secure America’s technological edge.”\nThe agreement is a historically large one. It might represent the most historic government intervention since the U.S. stepped in to bail out the auto industry during the 2008 financial crisis.\nIt adds to a string of unusual moves by the Trump administration to intervene directly in private business.\nSome of the deals have been opposed by free-market conservatives. Sen. Rand Paul (R-KY) criticized the government stake in Intel, saying in a tweet Thursday that it would be \"a step toward socialism.\"\nIntel has struggled to keep pace with rivals in recent years as the demand for chips has exploded with the boom in artificial intelligence. The U.S. has sought to encourage domestic manufacturing of chips, including through the CHIPS Act.\n“Building leading edge Semiconductors and Chips, which is what INTEL does, is fundamental to the future of our Nation,” Trump said in a post to Truth Social Friday afternoon."
    },
    {
      "news_title": "US to take nearly 10% stake in Intel",
      "news_link": "https://www.bizjournals.com/portland/news/2025/08/22/intel-u-s-takes-99-percent-stake.html?ana=brss_3389",
      "bias": "Center",
      "text": null
    },
    {
      "news_title": "It's official: The US government is taking a nearly 10% stake in Intel",
      "news_link": "https://www.businessinsider.com/trump-says-intel-agreed-us-investment-deal-stock-price-2025-8",
      "bias": "Lean Left",
      "text": "- The US government has reached a deal to take a 9.9% stake in Intel.\n- The deal involves the US investing $8.9 billion in Intel common stock.\n- President Donald Trump talked about the agreement on Friday during remarks at the White House.\nThe US government is officially investing in Intel, a remarkable development and a rare example of the government getting financially involved in a private company.\nUnder the terms of the deal, the US is investing $8.9 billion into the chipmaker, \"reflecting the confidence the Administration has in Intel to advance key national priorities and the critically important role the company plays in expanding the domestic semiconductor industry,\" the chipmaker said in a Friday announcement.\nThe agreement means the US government will hold a 9.9% stake in Intel.\n\"The $8.9 billion investment is in addition to the $2.2 billion in CHIPS grants Intel has received to date, making for a total investment of $11.1 billion,\" Intel said.\n\"Under the terms of today's announcement, the government agrees to purchase 433.3 million primary shares of Intel common stock at a price of $20.47 per share, equivalent to a 9.9% stake in the company,\" Intel added. \"This investment provides American taxpayers with a discount to the current market price while enabling the US and existing shareholders to benefit from Intel's long-term business success.\"\nEarlier on Friday, President Donald Trump talked about the agreement and his discussions with Intel CEO Lip-Bu Tan. Intel's stock soared following the remarks, finishing the trading day up nearly 6%. The stock was trading down around 1% in after-hours trading following Intel's confirmation of a deal.\n\"The government's investment in Intel will be a passive ownership, with no Board representation or other governance or information rights,\" Intel said in its announcement. \"The government also agrees to vote with the Company's Board of Directors on matters requiring shareholder approval, with limited exceptions.\"\nA struggling American tech giant whose CEO came under political scrutiny\nIntel has seen its market share decline as foreign rivals like the Taiwan Semiconductor Manufacturing Company grow.\nThe company is attempting a turnaround, and its CEO recently found himself caught up in political crosshairs.\nTrump met with Intel's CEO earlier this month at the White House after calling for Tan's \"immediate\" resignation due to his reported investments in Chinese companies. Following the meeting, Trump sounded a much different tone, praising Tan's \"amazing story.\"\nTrump talked about some of his recent deal discussions with Tan in his White House remarks on Friday.\n\"I said, you know what, I think the United States should be given 10% of Intel,\" Trump said. \"And he said, I would consider that. I said, well, I'd like you to do that because Intel's been left behind as, you know, compared to Jensen.\"\n\"I said I think it would be good having the United States as your partner. He agreed. And they've agreed to do it, and I think it's a great deal for them, and I think it's a great deal,\" Trump added.\n\"He walked in wanting to keep his job, and he wound up giving us $10 billion to the United States. So we picked up $10 billion,\" Trump said. \"And we do a lot of deals like that. I'll do more of them.\"\nEarlier in the week, Treasury Secretary Scott Bessent said that the US would not use any stake in Intel to pressure companies.\n\"Yeah, the last thing we're going to do is put pressure, is to take a stake and then try to drum up business,\" Bessent said during an interview on CNBC.\nTrump has repeatedly criticized the bipartisan CHIPS and Science Act, but like his predecessor, he wants to increase the share of semiconductors made in the US.\n\"A revitalized US chip industry will generate thousands of high-paying jobs, reinforce our technological leadership, and protect our supply chains from disruption by foreign rivals,\" reads Trump's AI Action Plan, which was published last month.\nSemiconductors are difficult to manufacture, especially the more advanced a chip becomes. Still, they are a major component in everything from smartphones to AI. Global chip shortages, exacerbated by the COVID-19 pandemic, heightened concerns that the US is too reliant on foreign production for the cornerstone of modern technology. Intel is one of just a handful of US companies that both manufactures and designs chips.\nThe US taking a stake in Intel illustrates the White House's growing support for aggressive intervention into the private sector. The US holds a so-called \"golden share\" in United States Steel Corp, and the Pentagon announced in July that it would take a $400 million preferred equity stake in MP Materials Corp, a US-based rare earth producer.\n\"As the only semiconductor company that does leading-edge logic R&D and manufacturing in the US, Intel is deeply committed to ensuring the world's most advanced technologies are American-made,\" Intel CEO Tan said in the Friday announcement."
    },
    {
      "news_title": "Intel secures $8.9B investment from U.S. Government after agreement with Trump administration",
      "news_link": "https://www.koin.com/news/intel-secures-8-9b-investment-from-u-s-government-after-agreement-with-trump-administration/",
      "bias": "Center",
      "text": null
    },
    {
      "news_title": "Trump says Intel CEO agreed to hand the U.S. a 10% stake in chipmaking company",
      "news_link": "https://qz.com/trump-intel-stake-shareholder",
      "bias": "Center",
      "text": null
    },
    {
      "news_title": "US to take 10% equity stake in Intel, in Trump's latest corporate move",
      "news_link": "https://www.channelnewsasia.com/world/us-take-10-equity-stake-intel-trumps-latest-corporate-move-5309921",
      "bias": "Center",
      "text": "US to take 10% equity stake in Intel, in Trump's latest corporate move\nUnder the agreement, the US government will purchase a 9.9 per cent stake in Intel for US$8.9 billion, or US$20.47 per share.\nWASHINGTON: US President Donald Trump said on Friday (Aug 22) the US government would take a 10 per cent stake in Intel under a deal with the struggling chipmaker that converts government grants into an equity share, the latest extraordinary intervention by the White House in corporate America.\nThe deal puts Trump on better terms with Intel CEO Tan Lip-Bu, after he recently said the Malaysian-born Chinese American business executive should step down due to conflicts of interest.\nIt will ensure that the chipmaker will receive about US$10 billion in funds for building or expanding factories in the US.\nUnder the agreement, the US will purchase a 9.9 per cent stake in Intel for US$8.9 billion, or US$20.47 per share, which represents a discount of about US$4 from Intel's closing share price of US$24.80 on Friday.\nThe purchase of the 433.3 million Intel shares will be made with funding from the US$5.7 billion in unpaid grants from the Biden-era CHIPS Act and US$3.2 billion awarded to Intel for the Secure Enclave programme, also awarded under Trump's predecessor Joe Biden.\nIntel stock rose roughly 1 per cent in the extended session on Friday after closing up 5.5 per cent during regular trading.\nTrump met with Tan on Friday, a White House official said. That followed Trump's Aug 11 meeting with the Intel CEO after Trump demanded that Tan resign over his ties to Chinese firms.\n\"He walked in wanting to keep his job and he ended up giving us $10 billion for the United States. So we picked up $10 billion,\" Trump said on Friday.\nCommerce Secretary Howard Lutnick said on X that Tan had struck a deal \"that's fair to Intel and fair to the American people\".\nPLAYING CATCH UP\nThe Intel investment marks the latest unusual deal with US companies, including a US government agreement allowing AI chip giant Nvidia to sell its H20 chips to China in exchange for receiving 15 per cent of those sales.\nOther recent deals include an agreement for the Pentagon to become the largest shareholder in a small mining company, MP Materials, to boost output of rare earth magnets and the US government's winning a \"golden share\" with certain veto rights as part of a deal to allow Japan's Nippon Steel to buy US Steel.\nThe federal government's broad intervention in corporate matters has worried critics, who say Trump's actions create new categories of corporate risk.\nAhead of the US deal with Intel, Japan's SoftBank agreed to take a US$2 billion stake in the chip maker on Monday.\nSome industry observers still question Intel's ability to surmount its problems.\nDaniel Morgan, senior portfolio manager at Synovus Trust, said Intel's problems are beyond a cash infusion from SoftBank or equity interest from the government, singling out Intel's contract chip manufacturing business, known as its foundry unit.\n\"Without government support or another financially stronger partner, it will be difficult for the Intel foundry unit to raise enough capital to continue to build out more Fabs at a reasonable rate,\" he said.\nIntel \"needs to catch up with TSMC from a technological perspective to attract business\", he added.\nThe US government's stake is to be passive ownership and does not include a board seat, Intel said.\nThe government will be required to vote with Intel's board when shareholder approval is necessary, with \"limited exceptions\". Intel did not specify the exceptions.\nThe equity stake also includes a five-year warrant at US$20 a share for an additional 5 per cent of Intel stock, which the US can use if Intel loses control of the foundry business.\nFederal backing could give Intel more breathing room to revive its loss-making foundry business, analysts said. It has ceded the AI market to Nvidia and has lost market share to Advanced Micro Devices (AMD) in its central processor business for several years.\nIt has also faced challenges in attracting customers to its new factories. Tan, who became CEO in March, has been tasked to turn around the American chipmaking icon, which recorded an annual loss of US$18.8 billion in 2024 - its first such loss since 1986. The company's last fiscal year of positive adjusted free cash flow was 2021.\nReuters reported exclusively in April that Tan invested at least US$200 million in hundreds of Chinese advanced manufacturing and chip firms, some of which were linked to the Chinese military.\nTan founded venture capital firm Walden International in 1987. Through the company, he became a seed investor in Semiconductor Manufacturing International Corp, China's largest chip foundry.\nTan, who was raised in Singapore, was also the CEO of Cadence Design from 2008 through December 2021, during which the chip design software maker sold products to a Chinese military university believed to be involved in simulating nuclear explosions.\nLast month, Cadence agreed to plead guilty and pay more than US$140 million to resolve the US charges over the sales, which Reuters first reported."
    },
    {
      "news_title": "U.S. to Acquire Stake in Intel",
      "news_link": "https://www.theamericanconservative.com/u-s-to-acquire-stake-in-intel/",
      "bias": "Right",
      "text": "President Donald Trump announced Friday that the U.S. federal government will take a 10 percent stake in the chip manufacturer Intel. This share, worth about $10 billion at current stock prices, will be acquired by converting grants provided to the company under the former President Joe Biden’s CHIPS Act into equity.\nSubscribe Today\nGet daily emails in your inbox\nThe proposal, Trump said, came from Intel CEO Lip-Bu Tan, who Trump argued should resign earlier this year. “He walked in wanting to keep his job, and he ended up giving us $10 billion for the United States,” said the president.\nShareholders will need to approve the acquisition, and the government may face legal challenges. If the deal goes through, the resulting stake will be one of the largest government interventions in industry since the Great Recession. The government will not have voting rights.\nIn recent years, the U.S. has been working to shore up its domestic chip-manufacturing industry in the face of growing Chinese dominance."
    },
    {
      "news_title": "US to get 10% stake in Intel: Trump",
      "news_link": "https://www.aa.com.tr/en/americas/us-to-get-10-stake-in-intel-trump/3666864",
      "bias": "Right",
      "text": "ISTANBUL\nThe US will take a 10% stake in Intel, President Donald Trump announced Friday.\nSpeaking at a White House news conference, he said the semiconductor producer was the world's largest and most powerful chip company until it began to leave and relocate to other countries, particularly Taiwan.\nCiting his meeting with CEO Lip-Bu Tan earlier this month, he said Intel can go to Taiwan, but the US will impose a 100% tariff, or a 200%, 300%, or 500% tariff. \"Anybody that sells into the US has to pay,\" he said.\nOn Aug. 12, Trump and Tan met at the White House after the US president demanded Tan \"immediately\" resign for alleged ties to Chinese companies with military connections.\nTrump praised Tan's \"success and rise\" as \"an amazing story\" following the meeting, calling it \"a very interesting one.\"\nOn Friday, he said about Tan: \"That's right, he should resign. And he came in, he saw me, (and) we talked for a while. I liked him a lot. I thought he was very good.\n\"I thought he was somewhat a victim. But, you know, nobody's a total victim.\"\nTrump said he offered to take 10% of Intel, and Tan responded: \"I would consider that. I said, Well, I'd like you to do that, because Intel has been left behind.\"\nTrump claimed that Intel would be a \"giant\" right now, but the company had \"bad management\" over the years, and \"they got lost.\"\n\"I think he should pay us 10% of your company. And they said, 'Yes,' that's about $10 billion. I don't get it.\n\"This comes to the US of America,” he said. “It's a great deal for them, and I think it's a great deal. He walked in wanting to keep his job, and he ended up giving us $10 billion to the US.\"\n\"And we do a lot of deals like that. I'll do more of them,\" he added.\nSoftBank in Japan also purchased $2 billion worth of Intel stock this week.\nIntel's share price rose 6.3% as of 1830GMT after Trump's announcement"
    },
    {
      "news_title": "Trump Makes Big Announcement About New 'Deal' Between US Government and Intel",
      "news_link": "https://redstate.com/beccalower/2025/08/22/trump-makes-big-announcement-about-deal-between-us-government-and-intel-n2193134",
      "bias": "Right",
      "text": "On Friday evening, President Trump announced that the United States government had struck a deal with tech company Intel, in which the company will sell 10 percent ownership of its business. He took to his Truth Social account to share the news:\nIt is my Great Honor to report that the United States of America now fully owns and controls 10% of INTEL, a Great American Company that has an even more incredible future. I negotiated this Deal with Lip-Bu Tan, the Highly Respected Chief Executive Officer of the Company. The…\n— Trump Truth Social Posts On X (@TrumpTruthOnX) August 22, 2025\n\"It is my Great Honor to report that the United States of America now fully owns and controls 10% of INTEL, a Great American Company that has an even more incredible future,\" he wrote. \"I negotiated this Deal with Lip-Bu Tan, the Highly Respected Chief Executive Officer of the Company.\"\n\"The United States paid nothing for these Shares, and the Shares are now valued at approximately $11 Billion Dollars,\" Trump added. \"This is a great Deal for America and, also, a great Deal for INTEL. Building leading edge Semiconductors and Chips, which is what INTEL does, is fundamental to the future of our Nation.\"\nAs usual, the president closed with, \"MAKE AMERICA GREAT AGAIN! Thank you for your attention to this matter.\"\nAs we previously wrote, the Trump administration called out the country's dependence on overseas suppliers for many of the products we depend on, like semiconductors--referring to it as a \"national security problem\" that Pres. Trump would work to fix:\n.@SecScottBessent: This is a national security problem, which we saw during COVID with our supply chains — and President Trump has decided that we cannot be at risk like that, dependent on foreign countries for our crucial medicines, for semiconductors, for shipping. pic.twitter.com/1XkWcv7qjd\n— Rapid Response 47 (@RapidResponse47) April 6, 2025\nSecretary Bessent said: (emphasis added)\nThis has been years in the building. Years in the making. This unsustainable system, our trading partners have taken advantage of us, we can see that through the large surpluses, we see that through the large budget deficit, and also, this is a national security problem which we saw during COVID. We saw, during COVID, that optimal supply chains are not resilient. And what I could say, is that the only good outcome from COVID is that it was a beta test for what would happen if our supply chains got broken. And President Trump has... decided, that we cannot be at risk like that for our crucial medicines, for semiconductors, for shipping, and we are going to move forward so the American people can know that they are going to have a more secure future.\nSEE ALSO: Talking Tariffs and Supply Chains: Treasury Secretary Scott Bessent and NEC Director Kevin Hassett\nHere's what we know so far about how the agreement with Intel was reached:\nAt a news conference, Mr. Trump said the agreement had come out of negotiations last week with Lip-Bu Tan, Intel’s chief executive.\n“I said, ‘I think it would be good having the United States as your partner.’ He agreed, and they’ve agreed to do it,” Mr. Trump said. “And I think it’s a great deal for them.”\nIntel said the United States would invest $8.9 billion in its stock, on top of $2.2 billion that the government has paid the company under the CHIPS and Science Act, a federal program signed into law in 2022 that delivered billions in grants to revive U.S. semiconductor manufacturing. The government will not take a board seat or have other governance rights at Intel.\n...\nThe deal with the Trump administration came together quickly. Mr. Trump had called for Mr. Tan’s resignation in a social media post this month, citing the executive’s ownership stakes in Chinese companies. Days later, Mr. Tan met with Mr. Trump at the White House and discussed giving the U.S. government an equity stake in the chipmaker.\nOn Wednesday, Mr. Lutnick and David Zinsner, Intel’s finance chief, reached the framework for an agreement, two people with knowledge of the discussions said. Later that day, Intel’s board blessed the deal, these people said. Mr. Lutnick and Mr. Tan settled the terms on Thursday, a person familiar with the meetings said.\nMr. Tan “walked in wanting to keep his job, and he ended up giving us $10 billion for the United States,” Mr. Trump said.\nTan said in a statement:\n“We are grateful for the confidence the president and the administration have placed in Intel, and we look forward to working to advance U.S. technology and manufacturing leadership.\"\nSecretary of Commerce Howard Lutnick also spread the word, in an X post that included a photo with himself and the Intel CEO:\nBIG NEWS: The United States of America now owns 10% of Intel, one of our great American technology companies.\n— Howard Lutnick (@howardlutnick) August 22, 2025\nThis historic agreement strengthens U.S. leadership in semiconductors, which will both grow our economy and help secure America’s technological edge.\nThanks to Intel… pic.twitter.com/AYMuX14Rgi\nIn the post, Lutnick wrote, \"BIG NEWS: The United States of America now owns 10% of Intel, one of our great American technology companies.\"\nThe Commerce Secretary continued, \"This historic agreement strengthens U.S. leadership in semiconductors, which will both grow our economy and help secure America’s technological edge.\"\nHe also thanked Intel CEO Lip-Bu Tan \"for striking a deal that’s fair to Intel and fair to the American People.\"\nThis story is developing. RedState will provide updates as warranted.\nEditor's Note: President Trump is leading America into the \"Golden Age\" as Democrats try desperately to stop it.\nPlease help us continue to report on President Trump's successes. Join RedState VIP and use promo code FIGHT to get 60% off your membership.\nJoin the conversation as a VIP Member"
    },
    {
      "news_title": "Trump Says Intel Agreed to Give Us a Stake in Its Company",
      "news_link": "https://vinnews.com/2025/08/22/trump-says-intel-agreed-to-give-us-a-stake-in-its-company/",
      "bias": "Center",
      "text": "WASHINGTON (AP) — President Donald Trump said that Intel has agreed to give the U.S. government a 10% stake in its business.\nJoin our WhatsApp groupSubscribe to our Daily Roundup Email\nSpeaking with reporters on Friday, Trump said the deal came out of a meeting last week with Intel CEO Lip Bu Tan — which came days after the president called for Tan to resign over his past ties to China.\n“I said, I think it would be good having the United States as your partner,” Trump said. “He agreed, and they’ve agreed to do it.”\nThe official announcement is expected to come later Friday, according to a White House official who was not authorized to speak publicly ahead of an announcement and spoke on condition of anonymity.\nWhat’s happening?\nThe Trump administration has been in talks to secure a 10% stake in Intel in exchange for converting government grants that were pledged to Intel under President Joe Biden. If the deal is completed, the U.S. government would become one of Intel’s largest shareholders and blur the traditional lines separating the public sector and private sector in a country that remains the world’s largest economy.\nWhy would Trump do this?\nIn his second term, Trump has been leveraging his power to reprogram the operations of major computer chip companies. The administration is requiring Nvidia and Advanced Micro Devices, two companies whose chips are helping to power the craze around artificial intelligence, to pay a 15% commission on their sales of chips in China in exchange for export licenses.\nTrump’s interest in Intel is also being driven by his desire to boost chip production in the U.S., which has been a focal point of the trade war that he has been waging throughout the world. By lessening the country’s dependence on chips manufactured overseas, the president believes the U.S. will be better positioned to maintain its technological lead on China in the race to create artificial intelligence.\nDidn’t Trump want Intel’s CEO to quit?\nThat’s what the president said August 7 in an unequivocal post calling for Intel CEO Lip-Bu Tan to resign less than five months after the Santa Clara, California, company hired him. The demand was triggered by reports raising national security concerns about Tan’s past investments in Chinese tech companies while he was a venture capitalist. But Trump backed off after Tan professed his allegiance to the U.S. in a public letter to Intel employees and went to the White House to meet with the president, who applauded the Intel CEO for having an “amazing story.”\nWhy would Intel do a deal?\nThe company isn’t commenting about the possibility of the U.S. government becoming a major shareholder, but Intel may have little choice because it is currently dealing from a position of weakness. After enjoying decades of growth while its processors powered the personal computer boom, the company fell into a slump after missing the shift to the mobile computing era unleashed by the iPhone’s 2007 debut.\nIntel has fallen even farther behind in recent years during an artificial intelligence craze that has been a boon for Nvidia and AMD. The company lost nearly $19 billion last year and another $3.7 billion in the first six months of this year, prompting Tan to undertake a cost-cutting spree. By the end of this year, Tan expects Intel to have about 75,000 workers, a 25% reduction from the end of last year.\nWould this deal be unusual?\nAlthough rare, it’s not unprecedented for the U.S. government to become a significant shareholder in a prominent company. One of the most notable instances occurred during the Great Recession in 2008 when the government injected nearly $50 billion into General Motors in return for a roughly 60% stake in the automaker at a time it was on the verge of bankruptcy. The government ended up with a roughly $10 billion loss after it sold its stock in GM.\nWould the government run Intel?\nU.S. Commerce Secretary Howard Lutnick told CNBC during a Tuesday interview that the government has no intention of meddling in Intel’s business, and will have its hands tied by holding non-voting shares in the company. But some analysts wonder if the Trump administration’s financial ties to Intel might prod more companies looking to curry favor with the president to increase their orders for the company’s chips.\nWhat government grants does Intel receive?\nIntel was among the biggest beneficiaries of the Biden administration’s CHIPS and Science Act, but it hasn’t been able to revive its fortunes while falling behind on construction projects spawned by the program.\nThe company has received about $2.2 billion of the $7.8 billion pledged under the incentives program — money that Lutnick derided as a “giveaway” that would better serve U.S. taxpayers if it’s turned into Intel stock. “We think America should get the benefit of the bar.\nWinning"
    },
    {
      "news_title": "Trump says Intel agreed to give US a stake in its company",
      "news_link": "https://www.macombdaily.com/2025/08/22/trump-intel/",
      "bias": "Center",
      "text": "By MICHELLE L. PRICE and MICHAEL LIEDTKE, Associated Press\nWASHINGTON (AP) — President Donald Trump on Friday announced the U.S. government has secured a 10% stake in struggling Silicon Valley pioneer Intel in a deal that was completed just a couple weeks after he was depicting the company’s CEO as a conflicted leader unfit for the job.\n“The United States of America now fully owns and controls 10% of INTEL, a Great American Company that has an even more incredible future,” Trump wrote in a post.\nThe U.S. government is getting the stake through the conversion of $11.1 billion in previously issued funds and pledges. All told, the government is getting 433.3 million shares of non-voting stock priced at $20.47 apiece — a discount from Friday’s closing price at $24.80. That spread means the U.S. government already has a gain of $1.9 billion, on paper.\nThe remarkable turn of events makes the U.S. government one of Intel’s largest shareholders at a time that the Santa Clara, California, company is i n the process of jettisoning more than 20,000 workers as part of its latest attempt to bounce back from years of missteps taken under a variety of CEOs.\nIntel’s current CEO, Lip-Bu Tan, has only been on the job for slightly more than five months, an d earlier this month, it looked like he might be on shaky ground already after some lawmakers raised national security concerns about his past investments in Chinese companies while he was a venture capitalist. Trump latched on to those concerns in an August 7 post demanding that Tan resign.\nBut Trump backed off after the Malaysian-born Tan professed his allegiance to the U.S. in a public letter to Intel employees and went to the White House to meet with the president, leading to a deal that now has the U.S. government betting that the company is on the comeback trail after losing more than $22 billion since the end of 2023. Trump hailed Tan as “highly respected” CEO in his Friday post.\nIn a statement, Tan applauded Trump for “driving historic investments in a vital industry” and resolved to reward his faith in Intel. “We are grateful for the confidence the President and the Administration have placed in Intel, and we look forward to working to advance U.S. technology and manufacturing leadership,” Tan said.\nIntel’s current stock price is just slightly above where it was when Tan was hired in March and more than 60% below its peak reached 25 years ago when its chips were still dominating the personal computer boom before being undercut by a shift to smartphones a few years later. The company’s market value currently stands at about $108 billion – a fraction of the current chip kingpin, Nvidia, which is valued at $4.3 trillion.\nThe stake is coming primarily through U.S. government grants to Intel through the CHIPS and Science Act that was started under President Joe Biden’s administration as a way to foster more domestic manufacturing of computer chips to lessen the dependence on overseas factories.\nBut the Trump administration, which has regularly pilloried the policies of the Biden administration, saw the CHIPs act as a needless giveaway and is now hoping to make a profit off the funding that had been pledged to Intel.\n“We think America should get the benefit of the bargain,” U.S. Commerce Secretary Howard Lutnick said earlier this week. “It’s obvious that it’s the right move to make.”\nAbout $7.8 billion had been been pledged to Intel under the incentives program, but only $2.2 billion had been funded so far. Another $3.2 billion of the government investment is coming through the funds from another program called “Secure Enclave.”\nAlthough U.S. government can’t vote with its shares and won’t have a seat on Intel’s board of directors, critics of the deal view it as a troubling cross-pollination between the public and private sectors that could hurt the tech industry in a variety of ways.\nFor instance, more tech companies may feel pressured to buy potentially inferior chips from Intel to curry favor with Trump at a time that he is already waging a trade war that threatens to affect their products in a potential scenario cited by Scott Lincicome, vice president of general economics for the Cato Institute.\n“Overall, it’s a horrendous move that will have real harms for U.S. companies, U.S. tech leadership, and the U.S. economy overall,” Lincicome posted Friday.\nThe 10% stake could also intensify the pressure already facing Tan, especially if Trump starts fixating on Intel’s stock price while resorting to his penchant for celebrating his past successes in business.\nNancy Tengler, CEO of money manager Laffer Tengler Investments, is among the investors who abandoned Intel years ago because of all the challenges facing Intel.\n“I don’t see the benefit to the American taxpayer, nor do I see the benefit, necessarily to the chip industry,” Tengler said while also raising worries about Trump meddling in Intel’s business.\n“I don’t care how good of businessman you are, give it to the private sector and let people like me be the critic and let the government get to the business of government.,” Tengler said.\nAlthough rare, it’s not unprecedented for the U.S. government to become a significant shareholder in a prominent company. One of the most notable instances occurred during the Great Recession in 2008 when the government injected nearly $50 billion into General Motors in return for a roughly 60% stake in the automaker at a time it was on the verge of bankruptcy. The government ended up with a roughly $10 billion loss after it sold its stock in GM.\nThe U.S. government’s stake in Intel coincides with Trump’s push to bring production to the U.S., which has been a focal point of the trade war that he has been waging throughout the world. By lessening the country’s dependence on chips manufactured overseas, the president believes the U.S. will be better positioned to maintain its technological lead on China in the race to create artificial intelligence.\nEven before gaining the 10% stake in Intel, Trump had been leveraging his power to reprogram the operations of major computer chip companies. The administration is requiring Nvidia and Advanced Micro Devices, two companies whose chips are powering the AI craze, to pay a 15% commission on their sales of chips in China in exchange for export licenses.\nLiedtke reported from San Ramon, California."
    },
    {
      "news_title": "Trump says Intel agreed to give US a stake in its company, reports AP.",
      "news_link": "https://www.devdiscourse.com/article/Newsalert/3591173-trump-says-intel-agreed-to-give-us-a-stake-in-its-company-reports-ap",
      "bias": "Center",
      "text": null
    },
    {
      "news_title": "Trump Says Intel Agreed To Give U.S. A Stake In Its Company",
      "news_link": "https://www.huffpost.com/entry/trump-intel_n_68a8c431e4b0d5177bea7585",
      "bias": "Left",
      "text": "WASHINGTON (AP) — President Donald Trump said that Intel has agreed to give the U.S. government a 10% stake in its business.\nSpeaking with reporters on Friday, Trump said the deal came out of a meeting last week with Intel CEO Lip Bu Tan — which came days after the president called for Tan to resign over his past ties to China.\n“I said, I think it would be good having the United States as your partner,” Trump said. “He agreed, and they’ve agreed to do it.”\nThe official announcement is expected to come later Friday, according to a White House official who was not authorized to speak publicly ahead of an announcement and spoke on condition of anonymity.\nWhat’s happening?\nThe Trump administration has been in talks to secure a 10% stake in Intel in exchange for converting government grants that were pledged to Intel under President Joe Biden. If the deal is completed, the U.S. government would become one of Intel’s largest shareholders and blur the traditional lines separating the public sector and private sector in a country that remains the world’s largest economy.\nWhy would Trump do this?\nIn his second term, Trump has been leveraging his power to reprogram the operations of major computer chip companies. The administration is requiring Nvidia and Advanced Micro Devices, two companies whose chips are helping to power the craze around artificial intelligence, to pay a 15% commission on their sales of chips in China in exchange for export licenses.\nTrump’s interest in Intel is also being driven by his desire to boost chip production in the U.S., which has been a focal point of the trade war that he has been waging throughout the world. By lessening the country’s dependence on chips manufactured overseas, the president believes the U.S. will be better positioned to maintain its technological lead on China in the race to create artificial intelligence.\nDidn’t Trump want Intel’s CEO to quit?\nThat’s what the president said August 7 in an unequivocal post calling for Intel CEO Lip-Bu Tan to resign less than five months after the Santa Clara, California, company hired him. The demand was triggered by reports raising national security concerns about Tan’s past investments in Chinese tech companies while he was a venture capitalist. But Trump backed off after Tan professed his allegiance to the U.S. in a public letter to Intel employees and went to the White House to meet with the president, who applauded the Intel CEO for having an “amazing story.”\nWhy would Intel do a deal?\nThe company isn’t commenting about the possibility of the U.S. government becoming a major shareholder, but Intel may have little choice because it is currently dealing from a position of weakness. After enjoying decades of growth while its processors powered the personal computer boom, the company fell into a slump after missing the shift to the mobile computing era unleashed by the iPhone’s 2007 debut.\nIntel has fallen even farther behind in recent years during an artificial intelligence craze that has been a boon for Nvidia and AMD. The company lost nearly $19 billion last year and another $3.7 billion in the first six months of this year, prompting Tan to undertake a cost-cutting spree. By the end of this year, Tan expects Intel to have about 75,000 workers, a 25% reduction from the end of last year.\nWould this deal be unusual?\nAlthough rare, it’s not unprecedented for the U.S. government to become a significant shareholder in a prominent company. One of the most notable instances occurred during the Great Recession in 2008 when the government injected nearly $50 billion into General Motors in return for a roughly 60% stake in the automaker at a time it was on the verge of bankruptcy. The government ended up with a roughly $10 billion loss after it sold its stock in GM.\nWould the government run Intel?\nU.S. Commerce Secretary Howard Lutnick told CNBC during a Tuesday interview that the government has no intention of meddling in Intel’s business, and will have its hands tied by holding non-voting shares in the company. But some analysts wonder if the Trump administration’s financial ties to Intel might prod more companies looking to curry favor with the president to increase their orders for the company’s chips.\nWhat government grants does Intel receive?\nIntel was among the biggest beneficiaries of the Biden administration’s CHIPS and Science Act, but it hasn’t been able to revive its fortunes while falling behind on construction projects spawned by the program.\nThe company has received about $2.2 billion of the $7.8 billion pledged under the incentives program — money that Lutnick derided as a “giveaway” that would better serve U.S. taxpayers if it’s turned into Intel stock. “We think America should get the benefit of the bar"
    },
    {
      "news_title": "Intel agrees to deal that would give US nearly 10% stake",
      "news_link": "https://www.dispatch.com/story/news/nation-world/2025/08/22/intel-agrees-to-equity-deal-with-us-trump-says/85782538007/",
      "bias": "Center",
      "text": "Intel agrees to deal that would give US nearly 10% stake\n(This story was updated to accurately reflect the most current information.)\nPresident Donald Trump said on Aug. 22 that the U.S. would take a nearly 10% stake in Intel under a deal with the struggling chipmaker that converts government grants into an equity share, the latest extraordinary intervention by the White House in corporate America.\nThe deal puts Trump on better terms with Intel CEO Lip-Bu Tan, after the president recently said the CEO should step down due to conflicts of interest. It will ensure that the chipmaker will receive about $10 billion in funds for building or expanding factories in the U.S.\nThe U.S. agreed to purchase a 9.9% stake in Intel for $8.9 billion at a price of $20.47 a share, which is a discount of about $4 per share from Intel's closing share price of $24.80 on Aug. 22.\nThe government will purchase the 433.3 million shares with funding from the $5.7 billion in unpaid CHIPS Act grants and $3.2 billion awarded to Intel for the Secure Enclave program, also awarded under Trump's predecessor, Democratic President Joe Biden.\nIntel stock rose roughly 1% in the extended session on Aug. 22 after closing up 5.5% during regular trading.\n“Intel is deeply committed to ensuring the world’s most advanced technologies are American made,” Tan said in an Aug. 22 statement. “We are grateful for the confidence the President and the Administration have placed in Intel, and we look forward to working to advance U.S. technology and manufacturing leadership.”\nThe development follows a meeting between CEO Lip-Bu Tan and Trump earlier this month that was sparked by Trump's demand for the Intel chief's resignation over his ties to Chinese firms.\n\"He walked in wanting to keep his job and he ended up giving us $10 billion for the United States,\" Trump said Aug. 22.\nCommerce Secretary Howard Lutnick said in an Intel news release: “As more companies look to invest in America, this administration remains committed to reinforcing our country’s dominance in artificial intelligence while strengthening our national security.”\nThe move also follows a $2 billion capital injection from SoftBank Group in what was a major vote of confidence for the troubled U.S. chipmaker in the middle of a turnaround.\nFederal backing could give Intel more breathing room to revive its loss-making foundry business, analysts said, but it still suffers from a weak product roadmap and challenges in attracting customers to its new factories.\nThe company is spending $28 billion on a pair of semiconductor fabs in Licking County, Ohio. The project has faced repeated delays from an initially aggressive timeline.\nIntel discussion part of unprecedented Trump moves\nTrump, who met with Tan on Aug. 11, has taken an unprecedented approach to national security.\nThe U.S. president has pushed for multibillion-dollar government tie-ups in semiconductors and rare earths, such as a pay-for-play deal with Nvidia and an arrangement with rare-earth producer MP Materials, to secure criticalminerals.\nTan, who took the top job at Intel in March, has been tasked to turn around the American chipmaking icon, which recorded an annual loss of $18.8 billion in 2024 — its first such loss since 1986. The company's last fiscal year of positive adjusted free cash flow was 2021.\nOhio senators express support for federal stake in Intel\nTrump's comments come as Ohio's two senators this week said they would consider supporting the administration taking a stake in the chipmaker.\nSen. Jon Husted showed support for a federal stake in Intel in a string of posts Aug. 21 on X, formerly known as Twitter.\n\"A federal ownership stake in Intel might make sense for taxpayers,\" Husted posted. \"Either way, two issues remain: lowering production costs and ensuring strong customer demand.\"\nRepublican Sen. Bernie Moreno, who has called for more scrutiny of how Intel has spent government funding, also said this week that he would support the administration taking a stake in Intel. Moreno said having the government take a stake in Intel was \"common sense,\" and he said he wouldn't consider it a bailout.\n\"The U.S. taxpayer said, 'Hey, we're going to give you the money, here you go, make semiconductors in America,'\" Moreno said at the City Club of Cleveland. \"What's happened? The facility's sitting there. It's a big gigantic construction site. It's not producing anything.\"\nIntel's Ohio factories delayed amid financial troubles\nIntel's first Ohio microchip plant was originally slated to open in New Albany in 2025. But, the company's finances have forced it to delay the first factory opening to 2030 or 2031.\nIn July, Intel announced it would \"further slow\" the pace of construction on its Ohio factories. It was unclear at the time how the latest slowdown would impact the company's timeline for its Ohio One campus.\nAmong the construction expected to continue is pouring concrete for the fabs and support buildings, steel work and groundworks for support structures. Intel expects to spend more than $1 billion on the project in 2025 alone.\nIn preparation for its promised $28 billion factories, Intel has already started hiring Ohioans and training them at pre-existing company facilities in Arizona, New Mexico and Oregon.\nIntel's Ohio factories are part of a larger effort to bring semiconductor manufacturing back to the United States, a move that experts and government leaders have said is critical to national security.\nThe company was awarded $7.865 billion in funding as part of the federal CHIPS Incentives Program. At least $1.5 billion of that funding was set to go toward the New Albany project, according to the U.S. Department of Commerce. An agreement between Intel and the Ohio Department of Development offered the company $300 million in grants to help with the construction of each factory, as long as they were completed by the end of 2028.\n(Reporting by Aditya Soni in Bengaluru and David Shepardson, Andrea Shalal and Nandita Bose in Washington, additional reporting by Juby Babu in Mexico City and Max A. Cherney in San Francisco; Editing by Sandra Maler, Matthew Lewis and Leslie Adler)\nDispatch reporter Max Filby contributed to this story."
    },
    {
      "news_title": "Trump Announces Major Deal With Computer Giant: ‘A Great Deal For America’",
      "news_link": "https://www.dailywire.com/news/trump-announces-major-deal-with-computer-giant-a-great-deal-for-america",
      "bias": "Right",
      "text": "President Donald Trump announced a major deal on Friday that he said would give the United States full control of 10% of the computer company Intel.\nTrump announced the deal first in a post on his Truth Social platform, where he touted the arrangement as “a great Deal for America and, also, a great Deal for INTEL.” The president said that he himself had negotiated the deal with Intel CEO Lip-Bu Tan.\n“It is my Great Honor to report that the United States of America now fully owns and controls 10% of INTEL, a Great American Company that has an even more incredible future,” Trump posted. “I negotiated this Deal with Lip-Bu Tan, the Highly Respected Chief Executive Officer of the Company.”\n“The United States paid nothing for these Shares, and the Shares are now valued at approximately $11 Billion Dollars,” he added. “This is a great Deal for America and, also, a great Deal for INTEL. Building leading edge Semiconductors and Chips, which is what INTEL does, is fundamental to the future of our Nation. MAKE AMERICA GREAT AGAIN! Thank you for your attention to this matter.”\n— Rapid Response 47 (@RapidResponse47) August 22, 2025\nCommerce Secretary Howard Lutnick also touted the deal in a similar post on Friday afternoon, saying, “BIG NEWS: The United States of America now owns 10% of Intel, one of our great American technology companies. This historic agreement strengthens U.S. leadership in semiconductors, which will both grow our economy and help secure America’s technological edge. Thanks to Intel CEO @LipBuTan1 for striking a deal that’s fair to Intel and fair to the American People.”\nThe Intel CEO’s tone was equally optimistic as he, too, posted news of the arrangement along with the same photo Lutnick had shared.\nEnd of Summer Sale – Get 40% off New DailyWire+ Annual Memberships\n“Just met with President Trump to announce a historic agreement: the U.S. government is investing $8.9B in @Intel to boost American semiconductor leadership,” he posted. “I’m excited about the work ahead to ensure the most advanced silicon technology and computing products of the future are designed and built right here in the USA. Thank you @potus and @howardlutnick for the confidence you have in Intel to deliver for our country.”\nJust met with President Trump to announce a historic agreement: the U.S. government is investing $8.9B in @Intel to boost American semiconductor leadership.\nI’m excited about the work ahead to ensure the most advanced silicon technology and computing products of the future are… pic.twitter.com/8PUcJyiNJu\n— Lip-Bu Tan (@LipBuTan1) August 22, 2025\nA report from The Associated Press gave some details on the arrangement, which saw the United States “getting the stake through the conversion of $11.1 billion in previously issued funds and pledges. All told, the government is getting 433.3 million shares of non-voting stock priced at $20.47 apiece — a discount from Friday’s closing price at $24.80. That spread means the U.S. government already has a gain of $1.9 billion, on paper.”"
    },
    {
      "news_title": "Trump turns $11.1B in US government funds into a 10% stake in Intel",
      "news_link": "https://katu.com/news/local/trump-turns-111b-in-us-government-funds-into-a-10-stake-in-intel",
      "bias": "Center",
      "text": "WASHINGTON (AP) — President Donald Trump on Friday announced the U.S. government has secured a 10% stake in struggling Silicon Valley pioneer Intel in a deal that was completed just a couple weeks after he was depicting the company's CEO as a conflicted leader unfit for the job.\n“The United States of America now fully owns and controls 10% of INTEL, a Great American Company that has an even more incredible future,” Trump wrote in a post.\nThe U.S. government is getting the stake through the conversion of $11.1 billion in previously issued funds and pledges. All told, the government is getting 433.3 million shares of non-voting stock priced at $20.47 apiece — a discount from Friday's closing price at $24.80. That spread means the U.S. government already has a gain of $1.9 billion, on paper.\nThe remarkable turn of events makes the U.S. government one of Intel's largest shareholders at a time that the Santa Clara, California, company is i n the process of jettisoning more than 20,000 workers as part of its latest attempt to bounce back from years of missteps taken under a variety of CEOs.\nIntel's current CEO, Lip-Bu Tan, has only been on the job for slightly more than five months, an d earlier this month, it looked like he might be on shaky ground already after some lawmakers raised national security concerns about his past investments in Chinese companies while he was a venture capitalist. Trump latched on to those concerns in an August 7 post demanding that Tan resign.\nBut Trump backed off after the Malaysian-born Tan professed his allegiance to the U.S. in a public letter to Intel employees and went to the White House to meet with the president, leading to a deal that now has the U.S. government betting that the company is on the comeback trail after losing more than $22 billion since the end of 2023. Trump hailed Tan as “highly respected” CEO in his Friday post.\nIn a statement, Tan applauded Trump for “driving historic investments in a vital industry” and resolved to reward his faith in Intel. “We are grateful for the confidence the President and the Administration have placed in Intel, and we look forward to working to advance U.S. technology and manufacturing leadership,” Tan said.\nIntel's current stock price is just slightly above where it was when Tan was hired in March and more than 60% below its peak of about $75 reached 25 years ago when its chips were still dominating the personal computer boom before being undercut by a shift to smartphones a few years later. The company's market value currently stands at about $108 billion - a fraction of the current chip kingpin, Nvidia, which is valued at $4.3 trillion.\nThe stake is coming primarily through U.S. government grants to Intel through the CHIPS and Science Act that was started under President Joe Biden's administration as a way to foster more domestic manufacturing of computer chips to lessen the dependence on overseas factories.\nBut the Trump administration, which has regularly pilloried the policies of the Biden administration, saw the CHIPs act as a needless giveaway and is now hoping to make a profit off the funding that had been pledged to Intel.\n\"We think America should get the benefit of the bargain,” U.S. Commerce Secretary Howard Lutnick said earlier this week. “It’s obvious that it’s the right move to make.”\nAbout $7.8 billion had been been pledged to Intel under the incentives program, but only $2.2 billion had been funded so far. Another $3.2 billion of the government investment is coming through the funds from another program called “Secure Enclave.”\nAlthough U.S. government can't vote with its shares and won't have a seat on Intel's board of directors, critics of the deal view it as a troubling cross-pollination between the public and private sectors that could hurt the tech industry in a variety of ways.\nFor instance, more tech companies may feel pressured to buy potentially inferior chips from Intel to curry favor with Trump at a time that he is already waging a trade war that threatens to affect their products in a potential scenario cited by Scott Lincicome, vice president of general economics for the Cato Institute.\n“Overall, it’s a horrendous move that will have real harms for U.S. companies, U.S. tech leadership, and the U.S. economy overall,” Lincicome posted Friday.\nThe 10% stake could also intensify the pressure already facing Tan, especially if Trump starts fixating on Intel's stock price while resorting to his penchant for celebrating his past successes in business.\nNancy Tengler, CEO of money manager Laffer Tengler Investments, is among the investors who abandoned Intel years ago because of all the challenges facing Intel.\n“I don’t see the benefit to the American taxpayer, nor do I see the benefit, necessarily to the chip industry,” Tengler said while also raising worries about Trump meddling in Intel's business.\n“I don’t care how good of businessman you are, give it to the private sector and let people like me be the critic and let the government get to the business of government.,” Tengler said.\nAlthough rare, it’s not unprecedented for the U.S. government to become a significant shareholder in a prominent company. One of the most notable instances occurred during the Great Recession in 2008 when the government injected nearly $50 billion into General Motors in return for a roughly 60% stake in the automaker at a time it was on the verge of bankruptcy. The government ended up with a roughly $10 billion loss after it sold its stock in GM.\nThe U.S. government's stake in Intel coincides with Trump's push to bring production to the U.S., which has been a focal point of the trade war that he has been waging throughout the world. By lessening the country’s dependence on chips manufactured overseas, the president believes the U.S. will be better positioned to maintain its technological lead on China in the race to create artificial intelligence.\nEven before gaining the 10% stake in Intel, Trump had been leveraging his power to reprogram the operations of major computer chip companies. The administration is requiring Nvidia and Advanced Micro Devices, two companies whose chips are powering the AI craze, to pay a 15% commission on their sales of chips in China in exchange for export licenses.\n—-\nLiedtke reported from San Ramon, California."
    },
    {
      "news_title": "President Trump Says U.S. To Take 10% Stake In Intel",
      "news_link": "https://www.tampafp.com/president-trump-says-u-s-to-take-10-stake-in-intel/",
      "bias": "Lean Right",
      "text": "President Donald Trump announced on Friday that the U.S. government has agreed to acquire a 10% stake in Intel, the struggling Silicon Valley chipmaker.\nThe deal, which would convert existing government grants into an equity stake, would make the U.S. one of Intel’s largest shareholders. Trump said the agreement was reached during a recent meeting with Intel CEO Lip-Bu Tan, days after the president had publicly called for his resignation.\n“I said, I think it would be good having the United States as your partner,” Trump told reporters. “He agreed, and they’ve agreed to do it.”\nREAD: DOJ Releases Ghislaine Maxwell Interview, Trump And Clinton Allegations Addressed\nThe White House is expected to make an official announcement later today. Intel has not yet responded to requests for comment.\nThe Trump administration has been in discussions to secure a 10% stake in Intel in exchange for converting government grants that were originally pledged under the previous administration. If the deal is completed, it would blur the traditional lines between the public and private sectors in the U.S. The potential agreement comes on the heels of Japanese tech giant SoftBank Group disclosing its own 2% stake in the chipmaker.\nThis move is part of the administration’s broader strategy to reshape the U.S. semiconductor industry. In his second term, Trump has been actively leveraging his power to influence major chip companies. For instance, his administration has required Nvidia and Advanced Micro Devices to pay a 15% commission on their chip sales in China in exchange for export licenses.\nREAD: Florida Gov Unleashes New Immigration Enforcement Operation, Apprehends 200\nTrump’s interest in Intel is also driven by his goal of boosting domestic chip production. By reducing the country’s reliance on chips manufactured overseas, the president believes the U.S. can maintain its technological leadership, particularly in the race to develop artificial intelligence. The president has pointed to the need to compete with companies like Nvidia, which has gained a dominant position in the AI chip market.\nThe announcement marks a significant reversal from just weeks ago, when President Trump demanded the resignation of Intel’s CEO on August 7. The demand came after reports raised national security concerns about Lip-Bu Tan’s past investments in Chinese tech companies.\nHowever, Trump changed his stance after Tan publicly affirmed his allegiance to the U.S. and met with the president at the White House.\nREAD: Defense Secretary Pete Hegseth Fires DIA Chief After Iran Assessment Media Leak\n“I said, well, if that’s right, he should resign,” Trump said, referring to the initial reports. After meeting Tan, however, he stated, “I liked him a lot. I thought he was very good. I thought he was somewhat a victim.” It was during that meeting that Trump proposed the idea of the U.S. government becoming a partner in the company.\nPlease make a small donation to the Tampa Free Press to help sustain independent journalism. Your contribution enables us to continue delivering high-quality, local, and national news coverage.\nConnect with us: Follow the Tampa Free Press on Facebook and Twitter for breaking news and updates.\nSign up: Subscribe to our free newsletter for a curated selection of top stories delivered straight to your inbox."
    },
    {
      "news_title": "Trump Claims Intel Will Provide US Government with a 10% Stake",
      "news_link": "https://themondonews.com/all/technology/trump-claims-intel-will-provide-us-government-with-a-10-stake/",
      "bias": "unknown",
      "text": "Donald Trump and Secretary of Commerce Howard Lutnick have announced that the US government has secured a groundbreaking 10% stake in Intel through a partnership with struggling chip manufacturers. This marks another significant intervention by Corporate America’s White House.\nLutnick stated on X: “Big News: The United States now owns 10% of Intel, one of our nation’s leading technology firms. We extend our gratitude to Intel CEO @Lipbutan1 for negotiating fair agreements benefit Americans.”\nTrump met with Lipbu Tang on Friday and posed for a photo with Lutnick. This move was prompted by the US president’s demand for Intel’s resignation regarding its ties with Chinese companies after a previous meeting between Tang and Trump earlier this month.\n“He approached us to continue his efforts and ultimately committed $1 billion to the US, so we secured a billion,” Trump shared on Friday.\nAlthough Trump did not detail the $10 billion sum, it approximately corresponds to the financial assistance Intel receives from the government under the Chips and Science Act to build a US chip manufacturing facility.\nIntel’s investment is the latest in a series of extraordinary deals brokered by the US administration under Trump, including allowing AI chip giant Nvidia to sell H20 chips to China. Amd has similarly pursued a comparable transaction.\nAdditionally, the Department of Defense is poised to become the principal stakeholder in small mining companies, enhancing the production of rare earth magnets, with the US government negotiating specific veto rights and “golden shares” as part of a deal enabling Nippon Steel to acquire US steel.\nThe extensive range of US government interventions in corporate affairs is raising concerns among critics who argue that Trump’s measures will establish a new category of corporate risk.\nThis development follows a $2 billion capital infusion from SoftBank Group, a significant endorsement for a troubled US chipmaker now navigating a turnaround. Daniel Morgan, senior portfolio manager at Synovus Trust, mentioned that Intel’s challenges extend beyond the financial boosts from SoftBank or government profits.\n“Without government backing and strong financial allies, it’s tough for Intel’s Foundry units to generate enough capital to keep expanding fabs at a reasonable pace,” he stated. “We need to catch up with TSMC [Taiwan Semiconductor Manufacturing Company] to be competitive technically.”\nThe 10% stake is valued at approximately $10 billion at the current stock price. Lutnick noted this week that these shares do not confer voting rights, meaning the US government cannot dictate the company’s operational decisions.\nFederal backing could provide Intel with more leeway to revitalize its struggling casting business, analysts observe, though it still faces weaknesses in its product roadmap and challenges in attracting customers to its new factories.\nTang, who took on a leading role at Intel in March, has the responsibility of reviving the iconic American chipmaker, which reported a loss of $18.8 billion in 2024—the first loss since 1986.\nSource: www.theguardian.com"
    },
    {
      "news_title": "The US government takes a 10% stake in Intel; Howard Lutnick said earlier the US won't be on the board or play a role in Intel's governance; INTC closes up 5%+",
      "news_link": "https://biztoc.com/x/6df626518e59789b",
      "bias": "unknown",
      "text": "The US government takes a 10% stake in Intel; Howard Lutnick said earlier the US won't be on the board or play a role in Intel's governance; INTC closes up 5%+\nwsj.com/tech/trump-to-announce-u-s-taking-nearly-10-stake-in-intel-1a38225d?reflink=desktopwebshare_permalink&st=dBUj8F\nThis story appeared on wsj.com, 2025-08-23 10:44:34.982000."
    },
    {
      "news_title": "US Government to Acquire 10% Stake in Intel in $8.9 Billion Deal",
      "news_link": "https://mediatalkafrica.com/229774/us-government-to-acquire-10-stake-in-intel-in-8-9-billion-deal/",
      "bias": "unknown",
      "text": "US Secures 10% Stake in Intel in a Historic Deal Worth $8.9 Billion\nIn a groundbreaking agreement, the US government has secured a 10% stake in chipmaker Intel, according to an announcement by the company and President Donald Trump. The deal, valued at $8.9 billion, marks a significant step in bolstering US leadership in the semiconductor industry.\nUnder the terms of the agreement, the US government will receive 433.3 million shares of common stock, representing a 9.9% stake in the company. This investment will be partially funded by $5.7 billion in grants awarded through the CHIPS and Science Act, a major law passed during President Joe Biden’s term.\nPresident Trump hailed the deal as a major victory, claiming that the US “paid nothing” for the shares. Intel, however, clarified that the government’s investment would be a passive ownership with no board representation or governance rights.\nCommerce Secretary Howard Lutnick emphasized the significance of the agreement, stating that it strengthens US leadership in semiconductors. However, not everyone shares the same optimism. Independent tech analyst Rob Enderle cautioned that the deal marks a “slippery slope” towards nationalizing private business, while Scott Lincicome of the Cato Institute warned that it could be detrimental to Intel’s long-term viability.\nIntel CEO Lip-Bu Tan expressed the company’s commitment to ensuring the world’s most advanced technologies are American-made, stating that Intel is investing over $100 billion to expand its US sites. The deal comes as the US semiconductor industry faces stiff competition from Asian powerhouses TSMC and Samsung.\nThe agreement also follows a recent announcement by Japan-based tech investor SoftBank Group to invest $2 billion in Intel. As the US seeks to maintain its edge in the rapidly evolving tech landscape, this deal marks a significant step towards bolstering its leadership in the semiconductor industry."
    },
    {
      "news_title": "The US government is taking an $8.9 billion stake in Intel - Los Angeles Weekly Times",
      "news_link": "https://losangelesweeklytimes.com/the-us-government-is-taking-an-8-9-billion-stake-in-intel/",
      "bias": "unknown",
      "text": "President Donald Trump says the US government is taking a 10 percent stake in chip maker Intel. Trump shared the news during a press conference on Friday, though an official announcement is still forthcoming, Reuters reports. News of a plan to convert Intel’s previously promised CHIPS Act funding into equity in the company was first reported earlier in August.\nA meeting between Intel CEO Lip-Bu Tan and Trump following the President’s call for Tan to resign seems to be the source of the deal. “He walked in wanting to keep his job and he ended up giving us 10 billion dollars for the United States. So we picked up 10 billion,” Trump shared during the press conference.\nIntel later announced more details on the investment. The company said in a press release that the government will “make an $8.9 billion investment in Intel common stock.” It adds that the equity stake will be funded by $5.7 billion previously earmarked for Intel as part of the CHIPS act, and $3.2 billion awarded as part of the Secure Enclave program. Intel had previously recieved $2.2 billion in CHIPS grants, bringing the government’s total spend on the chipmaker to $11.1 billion. The government paid $20.47 per share, so the $8.9 billion investment is equivalent to a 9.9 percent stake in the company.\nIt’s important to note that the government investing in Intel is not the same thing as receiving free money, it’s the exact opposite. Despite earlier comments from US Commerce Secretary Howard Lutnick suggesting the stake would be non-voting, common stock does come with voting rights. Intel does note that the investment will be passive, with no board representation, and that the government has agreed to vote with its board of directors “on matters requiring shareholder approval, with limited exceptions.”\nIntel was supposed to receive up to $10.86 billion in federal funding to expand its chip manufacturing business in the US as part of the CHIPS Act. By agreeing to this deal, Tan is likely trying to make sure that funding still goes through, one of several drastic moves to keep Intel afloat. Tan assumed the title of CEO following Pat Gelsinger’s sudden retirement in 2024. Since taking over, he’s already committed to cutting Intel’s workforce by 20 percent. Even with lower costs and guaranteed investment, the company’s future is still uncertain: Intel is reportedly struggling to make its next-gen Panther Lake chips at scale.\nThe Trump administration says it won’t seek similar equity deals with other recipients of CHIPS act funding. That hasn’t stopped them from making other equally unprecedented financial arrangements. NVIDIA and AMD reportedly struck a deal with the US government that gives the companies the ability to export products to China in exchange for 15 percent of their profits.\nUpdate, August 22, 6:20PM ET: This story was updated after publish with more information on the deal from Intel, and the headline was changed to the dollar figure, rather than the previously stated “10 percent” amount. A section quoting US Commerce Secretary Howard Lutnick saying that the stake was non-voting was also ammended to reflect the final details of the deal.\nRead the original article here"
    },
    {
      "news_title": "Trump says Intel CEO agreed to give US government 10% of company",
      "news_link": "https://www.postguam.com/business/world/trump-says-intel-ceo-agreed-to-give-us-government-10-of-company/article_8b29c9ca-57df-464e-b3ab-b6db44178394.html",
      "bias": "unknown",
      "text": "President Donald Trump said Intel’s CEO has agreed to give the U.S. government roughly 10 percent of the chipmaker in an extraordinary intervention of the federal government into a private tech company.\n“I think you should pay us 10 percent of your company,” Trump said, recounting his earlier conversation with Intel chief executive Lip-Bu Tan at an event on Friday. “That’s about $10 billion.” Trump described the arrangement as a “deal.”\n“I said, I think it would be good having the United States as your partner,” Trump said. “He agreed, and they’ve agreed to do it.”\n“BIG NEWS,” Commerce Secretary Howard Lutnick said in a post on X later on Friday. “The United States of America now owns 10% of Intel, one of our great American technology companies. This historic agreement strengthens U.S. leadership in semiconductors, which will both grow our economy and help secure America’s technological edge.”\nIntel declined to comment.\nAn unprecedented approach to US business\nThe announcement from Trump is the latest in his unprecedented approach to U.S. business and industrial policy. Earlier in August, he struck an agreement with Nvidia and another chipmaker, Advanced Micro Devices, to grant the two companies a license to export chips to China in exchange for 15 percent of their Chinese sales.\nThe U.S. government has in the past taken stakes in companies during times of crisis, but it is rare. In 2009, the U.S. government under President Barack Obama took a 60 percent stake in GM as part of the company’s restructuring after its bankruptcy and government bailout. The government later sold the shares.\nIt is unclear whether a deal would give the government a board seat or any formal decision-making ability at Intel. But if it goes ahead, the U.S. government will be closely tied to the fate of Intel. The company’s shares jumped 7 percent after Trump spoke about it.\nIntel was the largest recipient of U.S. funds as part of the Biden-era Chips Act, which sought to provide government grants and tax breaks to semiconductor companies that agreed to build new factories in the United States. The government agreed to give Intel around $11 billion in grants under the law, which Trump had criticized on the campaign trail.\nTreasury Secretary Scott Bessent and Lutnick confirmed earlier in the week that the administration was seeking an equity stake in Intel, drawing mixed responses and creating unusual alliances. Sen. Rand Paul (R-Kentucky) called it a “terrible idea” and a “step toward socialism,” while Bernie Sanders (I-Vermont) said he supported the idea of taxpayers getting a return on investment for their grants to Intel.\nChris Miller, an economics historian and author of the book “Chip War,’ said it was difficult to judge whether a deal would have a positive or negative impact until further details emerge.\n‘Unhelpful political influence’\n“The questions I have are first, what are the guardrails to ensure that a government stake doesn’t result in unhelpful political influence on the company, and, second, how exactly a government stake will facilitate the financial turnaround,” he said.\nIntel, long America’s most important computer chip company, has fallen far from that perch in the last decade. The company largely missed the smartphone boom, with competitors like Qualcomm stepping in to win huge amounts of business making computer chips for mobile phones.\nDan Hutcheson, vice chair of the tech consultancy TechInsights, said that Intel, once the world’s premier chipmaker, has struggled in recent years due to “a series of bad management decisions,” including its decision in 2018 to start outsourcing the manufacturing of some of its advanced chips to Taiwan Semiconductor Manufacturing Company, which meant it lost valuable learning experience of fabricating those chips itself at large scales.\n“It’s like cheating on a test,” Hutcheson said. “You might have gotten a good grade, but you didn’t learn it.”\nIntel’s then-CEO Pat Gelsinger was ousted by the board in December, as a consequence of the company recording an annual loss of $18.8 billion for 2024, its first such loss since 1986.\nTan, his replacement, had come in with an ambitious plan to revive the company’s fortunes but quickly came under criticism from some lawmakers for his extensive former investments in China, the United States’ primary technological adversary.\n‘Highly conflicted’\nTrump demanded Tan’s resignation earlier this month, calling him “highly conflicted” due to investments in China. Tan issued a statement saying he followed “the highest legal and ethical standards” and flew to Washington for a meeting with Trump on Aug. 11.\nTrump said Friday that Intel had been the most powerful chip company in the world but that it has since been “left behind.” He said he liked Tan a lot from their meeting and that the Intel CEO was “very good” and “somewhat a victim.”\nPrivate companies including Intel, Taiwan Semiconductor Manufacturing and Samsung all received billions of dollars in funding in return for promising to spend more inside the U.S. in the coming years.\nIntel, long America’s most important computer chip company, has fallen far from that perch in the last decade. The company largely missed the smartphone boom, with competitors like Qualcomm stepping in to win huge amounts of business making computer chips for mobile phones.\nThe AI boom has set Intel back even further. Nvidia, which for years took a back seat to Intel as a niche maker of computer chips focused on gaming consoles, was early to adjust to the wave of demand for high-end chips that allow AI algorithms to process large amounts of information. Now, Nvidia is worth over $4 trillion, while Intel is worth just over $100 billion.\nStill, because Intel makes its own chips, unlike Nvidia, which relies on Taiwanese producers, Intel has been seen as a critical piece of America’s semiconductor manufacturing comeback.\nThe company agreed to spend over $90 billion in the coming years as part of its agreement with the government to receive the Chips Act funding. But in recent months, it has canceled new chip manufacturing plants in Europe and delayed a key new factory in Ohio."
    },
    {
      "news_title": "Trump strikes US deal to buy 10% of Intel - TechCentral",
      "news_link": "https://techcentral.co.za/trump-strikes-us-deal-to-buy-10-of-intel/268977/",
      "bias": "unknown",
      "text": "US President Donald Trump said on Friday that the US would take a 10% stake in Intel under a deal with the struggling chip maker that converts government grants into an equity share, the latest extraordinary intervention by the White House in corporate America.\nThe deal puts Trump on better terms with Intel CEO Lip-Bu Tan, after the president recently said the CEO should step down due to conflicts of interest. It will ensure that the chip maker will receive about US$10-billion in funds for building or expanding factories in the US.\nUnder the agreement, the US will purchase a 9.9% stake in Intel for $8.9-billion, or $20.47/share, which represents a discount of about $4 from Intel’s closing share price of $24.80 on Friday.\nThe purchase of the 433.3 million Intel shares will be made with funding from the $5.7-billion in unpaid grants from the Biden-era Chips Act and $3.2-billion awarded to Intel for the Secure Enclave programme, also awarded under Trump’s predecessor, Democratic President Joe Biden.\nIntel stock rose roughly 1% in the extended session on Friday after closing up 5.5% during regular trading.\nTrump met with Tan on Friday, a White House official said. That followed Trump’s 11 August meeting with the Intel CEO after Trump demanded that Tan resign over his ties to Chinese firms.\n“He walked in wanting to keep his job and he ended up giving us $10-billion for the United States. So we picked up $10 billion,” Trump said on Friday.\nCommerce secretary Howard Lutnick said on X that Tan had struck a deal “that’s fair to Intel and fair to the American people”.\nFoundry fumbles\nThe Intel investment marks the latest unusual deal with US companies, including a government agreement allowing AI chip giant Nvidia to sell its H20 chips to China in exchange for receiving 15% of those sales.\nOther recent deals include an agreement for the Pentagon to become the largest shareholder in a small mining company, MP Materials, to boost output of rare-earth magnets and the US government’s winning a “golden share” with certain veto rights as part of a deal to allow Japan’s Nippon Steel to buy US Steel.\nThe federal government’s broad intervention in corporate matters has worried critics, who say Trump’s actions create new categories of corporate risk.\nRead: Intel shares dive as Trump calls for CEO’s immediate exit\nAhead of the US deal with Intel, Japan’s SoftBank agreed to take a $2 billion stake in the chip maker on Monday.\nSome industry observers still question Intel’s ability to surmount its problems.\nDaniel Morgan, senior portfolio manager at Synovus Trust, said Intel’s problems are beyond a cash infusion from SoftBank or equity interest from the government, singling out Intel’s contract chip manufacturing business, known as its foundry unit.\n“Without government support or another financially stronger partner, it will be difficult for the Intel foundry unit to raise enough capital to continue to build out more fabs at a reasonable rate,” he said. Intel “needs to catch up with TSMC from a technological perspective to attract business”, he added.\nThe government’s stake is to be passive ownership and does not include a board seat, Intel said. The government will be required to vote with Intel’s board when shareholder approval is necessary, with “limited exceptions”. Intel did not specify the exceptions.\nThe equity stake also includes a five-year warrant at $20/share for an additional 5% of Intel stock, which the US can use if Intel loses control of the foundry business.\nFederal backing could give Intel more breathing room to revive its loss-making foundry business, analysts said, but it ceded the AI market to Nvidia and has lost market share to AMD in its CPU business for several years. It has also faced challenges in attracting customers to its new factories.\nTan, who became CEO in March, has been tasked to turn around the American chip-making icon, which recorded an annual loss of $18.8-billion in 2024 — its first such loss since 1986. The company’s last fiscal year of positive adjusted free cash flow was 2021. — Aditya Soni, David Shepardson, Andrea Shalal and Nandita Bose, with Juby Babu and Max A Cherney, (c) 2025 Reuters\nGet breaking news from TechCentral on WhatsApp. Sign up here."
    },
    {
      "news_title": "US Takes Nearly 10% Intel Stake, Clinching Unorthodox Deal",
      "news_link": "https://www.ndtvprofit.com/business/us-takes-nearly-10-pc-intel-stake-clinching-unorthodox-deal",
      "bias": "unknown",
      "text": "US Takes Nearly 10% Intel Stake, Clinching Unorthodox Deal\nIntel shares rose 5.5% to $24.80 at the close in New York on Friday.\nPresident Donald Trump sealed a deal that gives the US government a nearly 10% stake in Intel Corp., part of an unconventional bid to reinvigorate the beleaguered company and boost domestic chip manufacturing.\nUnder the agreement, the US will receive 433.3 million shares of common stock — representing 9.9% of the fully diluted common shares in Intel — according to a statement from the company. The $8.9 billion investment will be funded by grants from the US Chips and Science Act and Secure Enclave program that had previously been extended but not yet paid, Intel said, confirming a report by Bloomberg News.\nTogether with the $2.2 billion in Chips Act money that Intel already received, the investment totaled $11.1 billion. The government will be a passive owner, with no board seat or other governance or information rights, Intel said.\n“We are grateful for the confidence the president and the administration have placed in Intel, and we look forward to working to advance US technology and manufacturing leadership,” Intel Chief Executive Officer Lip-Bu Tan said in the statement.\nIntel shares rose 5.5% to $24.80 at the close in New York on Friday. They slipped about 1% in choppy postmarket trading after the deal was finalized.\nIn a social media post, Trump described the transaction as a “great Deal for America and, also, a great Deal for INTEL.”\n“Building leading edge Semiconductors and Chips, which is what INTEL does, is fundamental to the future of our Nation,” he said.\nBIG NEWS: The United States of America now owns 10% of Intel, one of our great American technology companies.\n— Howard Lutnick (@howardlutnick) August 22, 2025\nThis historic agreement strengthens U.S. leadership in semiconductors, which will both grow our economy and help secure Americaâs technological edge.\nThanks to Intelâ¦ pic.twitter.com/AYMuX14Rgi\nThe US taking partial ownership marks a stunning level of intervention in an American company, cutting against the principles of free-market capitalism that investors and policymakers have long considered sacrosanct except in the most extraordinary situations, such as war or a systemic economic crisis.\nThe administration considers it an extraordinary and unique situation — and sees semiconductor production as a matter of national security, a White House official said. Intel is one of a small number of American companies capable of making chips at scale on domestic soil, the official said, and the administration looks to avoid shortages like those in recent years that rattled US supply chains.\nThough the administration telegraphed its intentions with Intel in recent weeks, the move creates untold risks that could distort markets and the flow of capital as well as lead to massive taxpayer losses. But the government’s bet could also pay off in a major way for a onetime industry pioneer. Intel has faced a turbulent stretch with investors worried it is losing its technological edge and falling too far behind competitors.\nThe approach represents a new way for Trump to wield Chips Act funding, after long assailing the law signed by his predecessor, former President Joe Biden. Trump has said the law’s subsidies for semiconductor manufacturers didn’t provide any return for US taxpayers. Intel was already poised to be the biggest beneficiary of money from the Chips Act.\nAs part of the pact, the government will receive a five-year warrant — at $20 per share for an additional 5% of common stock — that’s only exercisable if Intel ceases to own at least 51% of its chip-manufacturing business. PJT Partners served as Intel’s financial adviser on the transaction.\nSanta Clara, California-based Intel touted its more than $100 billion effort to expand manufacturing in the US and its new factory in Arizona, which is set to begin high-volume production this year. But it didn’t discuss a facility planned for Ohio that has been repeatedly delayed.\nThe deal represents a dramatic reversal from earlier this month, when Trump called for Tan’s ouster and accused him of being “highly conflicted” because of concerns over his earlier ties to China. Those remarks prompted the sit-down between the president and the Intel CEO, laying the groundwork for Friday’s deal.\n“I said, ‘You know what? I think the United States should be given 10% of Intel,’ and he said, ‘I would consider that,’ and I said, ‘Well, I’d like you to do that,’” Trump said of his discussion with Tan.\nCommerce Secretary Howard Lutnick has signaled that Trump wants to see more direct benefits to the US from funding key companies instead of just giving away grants. Lutnick worked to finalize the details of the agreement since Tan and Trump’s meeting.\nWhile the White House has cast the Intel deal as a possible template for other companies, they haven’t said which ones it may be having similar discussions with. A US official, however, said that companies that are boosting US investment pledges, including Taiwan Semiconductor Manufacturing Co. and Micron Technology Inc., will not be pressured to offer equity in exchange for funding.\nThe fresh infusion of nearly $9 billion instantly boosts growth prospects for the company. It also opens the door to partnerships that could be critical in developing new intellectual property and technology, areas where Intel has lagged in recent years.\nStill, in order for government ownership to boost Intel, Trump will have to do more than just take a stake. Wall Street analysts don’t expect money alone to turn around the company, which has suffered from years of declining sales and market share. But there is a possibility that pressure from Trump will help line up more clients for Intel’s production arm, potentially justifying the cost of expanding domestic manufacturing.\n“Trump kind of becomes your salesman,” said Dan Morgan, a senior portfolio manager at Synovus Trust who has covered the company since the 1990s.\nLining up more Intel clients might be a tough sell for Trump. The company’s chip-manufacturing arm is widely considered inferior to rivals and it still must build new cutting-edge facilities.\n“Beside money, Intel needs customers,” Bernstein analyst Stacy Rasgon said in a note to clients. “Funding a buildout with no customers probably won’t end well for shareholders, of whom the US government would be the largest under this situation,” he said.\nIn its statement, Intel said it was “deeply engaged” with current and potential clients and partners that could help build up the US chip supply chain. Microsoft Corp., Dell Technologies Inc., HP Inc. and Amazon.com Inc.’s AWS all pledged support as part of the announcement.\n“The industry needs a strong and resilient US semiconductor industry, and no company is more important to this mission than Intel,” Michael Dell, CEO of the namesake computer maker, said in the statement.\nThe Intel deal exemplifies how Trump has embraced a new brand of economic statecraft in his second term, as he looks to bolster domestic manufacturing, rebalance trade ties and ensure American dominance in critical sectors.\nTrump in early August announced a legally questionable arrangement with Nvidia Corp. and Advanced Micro Devices Inc., in which they agreed to give the US government 15% of revenue generated from sales of artificial intelligence chips to China.\nThat followed Trump securing a “golden share” from Nippon Steel Corp. that gives the president power to make decisions over United States Steel Corp., which the Japanese steelmaker acquired. The Defense Department last month also announced that it will take a $400 million equity stake in little-known US rare-earths firm MP Materials Corp."
    },
    {
      "news_title": "Intel Reportedly in Talks With Major Investors for Discounted Equity Raise",
      "news_link": "https://digitalmarketreports.com/news/46727/intel-reportedly-in-talks-with-major-investors-for-discounted-equity-raise/",
      "bias": "unknown",
      "text": "Intel is exploring additional equity investments from major backers at discounted rates, according to people familiar with the matter. The move comes just days after the company secured a $2 billion injection from SoftBank.\nDespite the boost, Intel’s stock tumbled nearly 7% on Wednesday, erasing earlier gains tied to the SoftBank deal and reports that the Trump administration may step in with its own involvement.\nGovernment Pressure and Investor Concerns\nCommerce Secretary Howard Lutnick said this week that any U.S. support from the CHIPS Act should come with an equity stake for Washington, underscoring the administration’s tougher stance on corporate accountability.\n“They need money to build whatever it is that the customers may actually, ultimately want,” CNBC’s David Faber noted on-air. “And having the CHIPS Act money, which is free, so to speak, no strings attached, become equity is not helpful to them because it’s dilutive.”\nStruggles in AI and Manufacturing\nIntel is in the middle of a turnaround plan after years of shrinking sales and dwindling market share. The company has lagged behind rivals in capitalizing on the AI chip boom while pouring billions into its foundry business, which has yet to secure a significant customer.\nLeadership has also shifted. Lip-Bu Tan took over as CEO in March after Pat Gelsinger’s ouster. Earlier this month, President Donald Trump publicly called for Tan’s resignation, labeling him “highly CONFLICTED,” though the president’s tone softened following Tan’s visit to the White House.\nAuthor’s Opinion\nIntel’s situation highlights the risks of trying to rebuild an empire in the middle of a rapidly shifting industry. Pouring money into factories without a clear pipeline of customers is dangerous, no matter how much political or corporate backing exists. Intel still has brand recognition and Washington’s attention, but if it can’t secure major AI chip orders soon, no amount of discounted equity will stop it from losing relevance in a market where speed and partnerships matter most.\nFeatured image credit: Morton Lin via Flickr\nFor more stories like it, click the +Follow button at the top of this page to follow us."
    },
    {
      "news_title": "TechChannel News US acquires 10% stake in Intel for $8.9b",
      "news_link": "https://techchannel.news/us-acquires-10-stake-in-intel-for-8-9b/",
      "bias": "unknown",
      "text": "- Trump is linking national security interests with aggressive industrial policy: giant government investments in semiconductors, rare earths—and even creative “pay-for-play” deals with AI titans like Nvidia.\nUS President Donald Trump announced that the United States would take a 10 per cent stake in struggling chip giant Intel. The surprise move is turning heads—not just for its size ($8.9 billion), but for how boldly the White House is inserting itself into America’s corporate engine room.\nThe US government has agreed to purchase 9.9 per cent of Intel, making them a real heavyweight in the legacy chipmaker’s future. The purchase price? $20.47 per share, which is a relatively sweet deal, considering Intel closed Friday at $24.80. That’s about $4 below the market—nothing to sneeze at for taxpayers footing the bill.\nTo pay for the shares, the White House is tapping two big sources: $5.7 billion in still-unspent Chips Act grants and $3.2 billion slated for a project called Secure Enclave. Together, those funds make the acquisition possible without needing a new Congressional fight over spending.\nHigh-stakes negotiations\nIntel’s CEO, Lip-Bu Tan, has had a whirlwind month. He was called to a tense sit-down with President Trump earlier in August—a meeting originally triggered by Trump’s fiery call for Tan to quit over his history with Chinese firms.\nInstead of walking out with a pink slip, Tan seems to have walked away with $10 billion for Intel and a deal that’s got tongues wagging across the financial sector.\nAfter the accord, Commerce Secretary Howard Lutnick didn’t waste a minute declaring: “The United States of America now owns 10 per cent of Intel.” He emphasised that the transaction was “fair to Intel and fair to the American People,” positioning it as a win-win—though critics may see it differently.\nA pattern of unusual moves\nFriday’s Intel investment is only the latest in a string of extraordinary government interventions:\n- The US clinched a deal with Nvidia: it must let Washington receive a 15 per cent cut of H20 AI chip sales to China.\n- The Pentagon is about to become the biggest shareholder in a lesser-known rare earth magnet maker.\n- The government snatched up a “golden share” with powerful veto rights as Nippon Steel seeks to acquire US Steel.\nThese policy pivots are stirring discomfort among critics who worry that ever-deeper government entanglement could reshape how risks are calculated in corporate America.\nWhy Intel? Why now?\nIntel has suffered a bruising two years, posting an eye-popping $18.8 billion loss in 2024—the first red ink the company’s seen since the 1980s. Their once-mighty foundry business is coughing and wheezing, falling far behind Taiwan’s TSMC in technology and market share.\nThe White House also insists it’s not seeking similar deals with other chipmakers, like TSMC or Micron, for now.\nBut overall, Trump’s break-the-mold approach is clear. He’s linking national security interests with aggressive industrial policy: giant government investments in semiconductors, rare earths—and even creative “pay-for-play” deals with AI titans like Nvidia.\nIt’s a bold and risky path, and the results are bound to ripple through both the economy and policy debates for years to come."
    },
    {
      "news_title": "Trump says Intel will give US government a 10% stake in its business – UK Times",
      "news_link": "https://uk-times.com/trump-says-intel-will-give-us-government-a-10-stake-in-its-business-uk-times/",
      "bias": "unknown",
      "text": "The Trump administration and Intel have reached an agreement for the U.S. government to own nearly 10 percent of the struggling chip maker, the president announced on Friday.\n“The United States paid nothing for these Shares, and the Shares are now valued at approximately $11 Billion Dollars,” Trump wrote on Truth Social, claiming the agreement means the government “fully owns and controls” a major portion of the company.\n“This is a great Deal for America and, also, a great Deal for INTEL. Building leading edge Semiconductors and Chips, which is what INTEL does, is fundamental to the future of our Nation,” he added.\nFunding for the $11.1 billion deal comes from $2.2 billion in funding Intel received under the 2022 CHIPS and Science Act, plus $5.7 billion from the act the company was awarded but has not received, as well as $3.2 in funds already awarded as part of the Secure Enclave national security program, the company announced on its website.\nThe stake is in the form of passive ownership and does not give the government board representation or other governance rights, Intel said, adding that the U.S. had an option to purchase further shares.\n“As the only semiconductor company that does leading-edge logic R&D and manufacturing in the U.S., Intel is deeply committed to ensuring the world’s most advanced technologies are American made,” Intel CEO Lip-Bu Tan said in a statement. “President Trump’s focus on U.S. chip manufacturing is driving historic investments in a vital industry that is integral to the country’s economic and national security.”\nThe deal marks a striking change in tone from the administration, as well as the most consequential government investment in a single U.S. company since the multi-billion-dollar auto bailout of GM and Chrysler during the 2008 financial crisis.\nEarlier this month, Trump called on Tan to resign, accusing the CEO of being “highly conflicted” because of his past work and investments in the Chinese tech sector.\nThe administration said the deal sprang from negotiations last week with the Intel boss, who “walked in wanting to keep his job, and he ended up giving us $10 billion for the United States,” Trump said at a news conference.\nA framework for the deal between Commerce Secretary Howard Lutnick and Intel finance chief David Zinsner was solidified on Wednesday, The New York Times reports.\nFollowing the announcement of the deal, Lutnick praised the agreement “as fair to Intel and fair to the American People,” posting a photo on X of himself with Tan.\n“This historic agreement strengthens U.S. leadership in semiconductors, which will both grow our economy and help secure America’s technological edge,” Lutnick wrote.\nThe deal could face legal challenges from shareholders, and some experts say it’s unclear if the CHIPS Act funds can legally be turned into equity.\nSome observers were also unsure if a government investment would turn things around for Intel, a pioneering Silicon Valley chip maker that has struggled in recent years as competitors like Nvidia outpaced it on key innovations like chips for artificial intelligence.\n“The questions I have are first, what are the guardrails to ensure that a government stake doesn’t result in unhelpful political influence on the company, and, second, how exactly a government stake will facilitate the financial turnaround,” economic historian Chris Miller told The Washington Post.\nIntel shares were up more than 5.5 percent as of Friday afternoon.\nThe Trump administration previously sharply criticized the Biden-era CHIPS Act for awarding billions to revive the U.S. semiconductor industry, which makes key components for computers and numerous other devices with digital components, arguing the act was a giveaway to companies that didn’t result in enough benefit to the American people.\nThe White House, which has also negotiated “golden share”-style government influence over Nippon Steel’s investment in U.S. Steel, has shown particular interest in putting Trump’s mark on the semiconductor industry, which has largely moved to Asia in recent decades.\nTrump said this month he plans to put a 100 percent tariff on computer chips unless companies build in the U.S., and the administration agreed to a deal to receive 15 percent of Nvidia and AMD’s revenues from the sale of the companies’ chips in China."
    },
    {
      "news_title": "Trump announces U.S. to take 10% stake in Intel",
      "news_link": "https://sjvsun.com/u-s/trump-announces-u-s-to-take-10-stake-in-intel/",
      "bias": "unknown",
      "text": "President Donald Trump announced that the United States will acquire a 10% equity stake in Intel, marking a significant government investment in the struggling chipmaker.\nAn official announcement of the deal is expected soon, with Trump scheduled to meet Intel CEO Lip-Bu Tan to discuss the arrangement further.\nDriving the news: This development follows a recent meeting between Trump and Tan, initially sparked by Trump demanding Tan’s resignation over his connections to Chinese firms.\n- Trump highlighted that while Tan sought to keep his job, Intel ended up agreeing to provide $10 billion to the U.S., roughly equal to the amount Intel would receive from CHIPS Act grants intended to fund new chip manufacturing plants domestically.\nThe big picture: The proposed 10% stake corresponds to approximately $10 billion at current Intel share prices.\n- Commerce Secretary Howard Lutnick clarified that the government’s equity stake would be non-voting, meaning the U.S. would not have direct control over Intel’s business operations.\n- Intel’s shares responded positively to the news, rising over 6%.\nZoom out: Similar deals include an agreement with Nvidia allowing the sale of AI chips to China in exchange for the U.S. government receiving 15% of those sales revenues.The Pentagon is poised to become the largest shareholder in a small mining company boosting rare earth magnet production, critical for defense and technology sectors.\n- Additionally, the government secured a “golden share” with veto rights as part of allowing Nippon Steel to acquire U.S. Steel, highlighting heightened regulatory involvement.\n- CEO Lip-Bu Tan, who took the helm in March, is leading a major turnaround initiative for Intel, which posted an $18.8 billion annual loss in 2024 – its first since 1986 – with the last positive adjusted free cash flow reported in 2021."
    },
    {
      "news_title": "Trump Administration Seals Landmark Deal: U.S. Government Now Holds 10% Stake in Intel",
      "news_link": "https://patriot.tv/trump-administration-seals-landmark-deal-u-s-government-now-holds-10-stake-in-intel/",
      "bias": "unknown",
      "text": "Commerce Secretary Howard Lutnick delivered major news on Friday, confirming that the United States has finalized an investment deal with Intel, securing a 10% ownership stake in the semiconductor powerhouse. This development marks a significant step in bolstering America’s position in global technology amid ongoing concerns about supply chain vulnerabilities and competition from abroad.\nThe agreement stems from negotiations tied to the 2022 CHIPS and Science Act, which aimed to revitalize domestic chip production. Under the terms, the U.S. gains a nonvoting equity position in Intel in return for federal funding support.\nWhile specific financial details remain under wraps, the move aligns with efforts to ensure taxpayer dollars yield tangible returns for national interests. Intel, for its part, has committed billions to constructing advanced manufacturing facilities in Ohio, with full operations expected by 2030. This follows an $8 billion grant finalized last fall to accelerate those projects.\nLutnick shared the update via a post on X, emphasizing the deal’s importance for economic growth and security.\n“The United States of America now owns 10% of Intel, one of our great American technology companies,” he wrote. “This historic agreement strengthens U.S. leadership in semiconductors, which will both grow our economy and help secure America’s technological edge. Thanks to Intel CEO Lip-Bu Tan for striking a deal that’s fair to Intel and fair to the American People.”\nPresident Donald Trump had hinted at the arrangement earlier in the week, highlighting it as a way to expand American influence over critical industries. Sources indicate the stake could be valued around $10 billion, reflecting Intel’s substantial market presence and the scale of federal incentives involved. For conservatives, this represents a pragmatic approach to industrial policy—using government resources not for endless subsidies, but to foster self-reliance and protect against foreign dependencies, particularly from China and Taiwan, where much of the world’s chip production is concentrated.\nThe CHIPS Act itself, passed under a previous administration, has faced criticism for slow rollout and bureaucratic hurdles. Yet under Trump’s leadership, deals like this one demonstrate a renewed focus on execution, prioritizing American workers and innovation. Intel’s Ohio investments alone promise thousands of high-paying jobs in a heartland state, underscoring the administration’s commitment to rebuilding manufacturing at home.\nCritics from the left may decry increased government involvement in private enterprise, but proponents argue it’s essential for safeguarding national security in an era of geopolitical tensions. As Lutnick noted, the pact benefits both Intel and the public, positioning the U.S. to lead in semiconductors—a sector vital for everything from consumer electronics to defense systems.\nThis deal could set a precedent for future public-private partnerships, ensuring that American ingenuity drives global progress while keeping strategic assets firmly under domestic control. With operations ramping up in the coming years, the long-term impacts on the economy and technology landscape will be worth watching closely.\nFor Emergency Preparedness, Don’t Forget the Meds\nBeing prepared is more than just a good idea—it’s essential. We stock up on non-perishable food, bottled water, flashlights, and first-aid supplies, but one critical aspect often gets overlooked: access to vital medications. What happens if pharmacies close, prescriptions can’t be filled, or you’re cut off from medical care during an emergency?\nThat’s where Jase Medical steps in, offering a reliable solution to ensure you and your family have the medications you need when it matters most.\nJase Medical specializes in emergency preparedness kits designed to provide peace of mind through physician-reviewed, prescription medications delivered right to your door. Their flagship product, the Jase Case, is a comprehensive emergency antibiotic and medication kit priced at $289.95.\nThis kit includes 10 essential medications—five life-saving antibiotics and five symptom relief meds—that can treat over 50 common infections and illnesses, from urinary tract infections and pneumonia to skin infections and traveler’s diarrhea. With 28 add-on options available, you can customize the kit to fit your specific needs, including a KidCase for children ages 2-11.\nThe process is straightforward and hassle-free. Simply visit Patriot.tv/meds, complete an online evaluation, and have your order reviewed by a board-certified physician. Once approved, the medications are shipped discreetly from a licensed pharmacy to your U.S. address (with plans for Canada shipping coming soon). Each kit comes with detailed Med Cards outlining symptoms, dosing, and usage, making it easy to administer even in high-stress situations. These medications are shelf-stable and designed for long-term storage, empowering you to handle medical emergencies without relying on external help.\nFor those on the move, Jase Medical also offers the Jase Go kit for $129.95, a compact travel med kit covering over 30 common conditions encountered during adventures or trips. And for ongoing needs, Jase Daily provides an extended supply of your prescribed chronic medications to safeguard against disruptions in supply chains or extreme weather events.\nDon’t just take our word for it—thousands of satisfied customers have given Jase Medical a 4.9-star rating, praising its role in true preparedness. As radio host Glenn Beck warns, “The supply lines for antibiotics already are stressed to the max. Please have some antibiotics on hand… You can do it through Jase.”\nWhether you’re prepping for a hurricane, a power outage, or simply the uncertainties of daily life, Jase Medical ensures you’re not caught off guard. Head to patriot.tv/meds today to customize and order your emergency kit—because when it comes to your health and safety, it’s better to be prepared than sorry.\nIt’s called socialism.\nFunny, last I checked the federal government wasn’t supposed to be doing that. Makes for de facto state owned companies.\nTerrible development. We should be restoring the free market, not weakening it.\nIsnt that fascism?”\nNot only is this illegal, it’s a bail out way too late for Intel. China will no longer buy any of their chips thanks to Trump. Or Nvidia either. Some 64% of their business is gone overnight. So the US wants to get into the chip game? If it wasn’t so sad, it would be laughable."
    },
    {
      "news_title": "Intel says the US will make an $8.9B investment by purchasing 433.3M primary shares of Intel common stock for $20.47/share; INTC closed on August 22 at $24.80",
      "news_link": "http://www.techmeme.com/250822/p25",
      "bias": "unknown",
      "text": "| Wall Street Journal: |\n| Intel: |\n| Mark Gurman / Bloomberg: |\n| Sarah Perez / TechCrunch: |\n| Alexandr Wang / @alexandr_wang: |\n| Samantha Subin / CNBC: |\n| Newley Purnell / Bloomberg: |\n| Paige Smith / Bloomberg: |\n| CNBC: |\n| Tanaya Macheel / CNBC: |\n| Bloomberg: |\n| Richard Henderson / Bloomberg: |\n| Arasu Kannagi Basil / Reuters: |\n| Sarah Perez / TechCrunch: |\n| Reuters: |\n| Bloomberg: |\n| Nikkei Asia: |\nThis is a Techmeme archive page. It shows how the site appeared at 10:45 PM ET, August 22, 2025.\nThe most current version of the site as always is available at our home page. To view an earlier snapshot click here and then modify the date indicated.\n| Daniel Thomas / Financial Times: |\n| Financial Times: |\n| Munsif Vengattil / Reuters: |\n| Nikou Asgari / Financial Times: |\n| David Heaney / UploadVR: |\n| Financial Times: |\n| Casey Crownhart / MIT Technology Review: |"
    },
    {
      "news_title": "Intel will give the U.S. government a 10% stake, Trump says - TPR: The Public's Radio",
      "news_link": "https://thepublicsradio.org/npr/intel-will-give-the-u-s-government-a-10-stake-trump-says/",
      "bias": "unknown",
      "text": "President Trump said on Friday he had asked Intel CEO Lip-Bu Tan for a 10% stake in the company during a recent meeting at the White House.\n“He agreed, and they’ve agreed to do it, and I think it’s a great deal for them,” Trump told reporters. “He walked in wanting to keep his job, and he ended up giving us $10 billion for the United States,” Trump said.\nNeither Intel nor the White House press team immediately responded to requests for comment.\nBut should such a deal move ahead, it would be a highly unusual step — it would mark an escalation in the Trump administration’s efforts to push chipmakers to manufacture in the United States, and a new milestone in how willing CEOs are to cede the president an unprecedented amount of control over their companies.\nThe nature of how a deal might work is not yet clear — and neither is the response of Intel’s board or shareholders.\nEarlier this week, Commerce Secretary Howard Lutnick told CNBC that a potential deal for an Intel stake would convert grants to Intel from the 2022 CHIPS and Science Act into equity. The law authorized a total of nearly $53 billion in government funding for chip-related activities.\n“So we’ll deliver the money, which was already committed under the Biden administration. We’ll get equity in return for it,” Lutnick said, adding the stake would not give the government voting or governance rights in Intel.\nAfter Trump’s remarks, Lutnick posted on X that the U.S. “now owns 10% of Intel,” and he called it a “historic agreement.”\nIntel, once a leader in chip production, has faced a raft of problems in recent years.\nIt has stumbled in the race to feed soaring data center demand for chips used to build artificial intelligence models known as graphics processing units, or GPUs. The leader in that field is Intel’s Santa Clara, California-based neighbor Nvidia, now the world’s biggest company with a market capitalization of over $4 trillion.\n(Earlier in August, Trump announced that Nvidia would pay the U.S. government 15% of its revenues of H20 chip sales in China in exchange for being allowed to sell them there. An Nvidia spokesperson declined to comment to NPR on the 15% figure, and in a statement, the company said it follows “rules the U.S. government sets for our participation in worldwide markets.”)\nIntel’s revenue has fallen in recent years, driving its market capitalization down. This year, the company reported net losses for the first two quarters.\nPresident Trump took direct aim at Intel CEO Tan earlier this month, calling on him to resign following reports he invested in a range of Chinese tech companies. Days later, Tan went to the White House for a face-to-face meeting with the president, after which Trump called the meeting “interesting” and Tan a “success.”\nIntel is planning to invest more than $28 billion in two chip production facilities in Ohio, but the plans have been delayed and analysts say it is unclear if there will be sufficient demand for the chips the company eventually produces.\n“One of the questions that we still haven’t seen answers to yet in the public sphere, at least, is how this discussion about equity financing relates to the question of who’s going to be the customer for Intel’s factories that are being built and their processes or their manufacturing processes that are being brought online,” said Chris Miller, a professor at Tufts University and the author of Chip War: The Fight for the World’s Most Critical Technology.\n“That’s a key part of the puzzle,” he said, adding it was too early to know if a potential equity deal would be a boon for Intel or complicate the company’s efforts to try to lead the field again."
    },
    {
      "news_title": "Trump Moves to Take 10% Stake in Intel as U.S. Seeks Semiconductor Edge - Channelchek",
      "news_link": "https://www.channelchek.com/news-channel/trump-moves-to-take-10-stake-in-intel-as-u-s-seeks-semiconductor-edge",
      "bias": "unknown",
      "text": "The Biden-era CHIPS Act was designed to revive America’s semiconductor sector, but under the Trump administration, that funding is taking a new form: direct equity ownership. On Friday, President Trump announced that the U.S. government will acquire a 10% stake in Intel, a move aimed at stabilizing the struggling chipmaker and cementing its role in America’s technology future.\nThe announcement sparked immediate investor reaction, sending Intel shares up more than 7% in midday trading. The move represents one of the most aggressive interventions in U.S. industrial policy in recent years, underscoring Washington’s belief that semiconductors are not only an economic priority but also a national security imperative.\nIntel has endured a turbulent few years. Once the undisputed leader in computer processors, the company has seen its dominance erode as rivals Advanced Micro Devices and Qualcomm gained ground in the PC market. Meanwhile, Nvidia has surged ahead in artificial intelligence chips, leaving Intel far behind in one of the fastest-growing and most strategically critical corners of the tech world.\nFinancially, the company has struggled to contain mounting losses. Its manufacturing division continues to bleed cash, while its market capitalization of roughly $111 billion is less than half of what it was in 2021. Under current CEO Lip-Bu Tan, Intel has been forced to make difficult cuts, laying off 15% of its workforce and shelving ambitious international expansion plans, including new facilities in Europe.\nStill, Intel holds unique strategic importance. It remains the only U.S.-based company capable of producing advanced semiconductors at scale, a capability that has become increasingly vital as the global chip supply chain faces geopolitical risks. With tensions between the U.S. and China intensifying, reshoring semiconductor manufacturing has become a bipartisan priority in Washington.\nTrump’s announcement also comes just days after Japan’s SoftBank Group revealed a $2 billion investment in Intel, signaling international confidence that the company may yet succeed in its turnaround. Even so, the road ahead remains challenging. Intel’s $20 billion Ohio chip complex—once heralded as the centerpiece of America’s semiconductor revival—has been delayed again, reflecting the company’s struggle to balance ambition with financial discipline.\nAt the same time, Intel is trying to reinvent itself as a contract chip manufacturer, or foundry, capable of producing semiconductors for other firms. Microsoft and Amazon have already signed agreements to use Intel’s newest 18A chip technology, but Intel itself remains its largest foundry customer, raising questions about whether it can truly scale the business to rival Taiwan Semiconductor Manufacturing Company (TSMC).\nThe U.S. government’s decision to become a shareholder in Intel adds a new layer of complexity. Supporters argue it provides Intel with the financial stability and political backing it needs to remain competitive in a cutthroat industry. Critics, however, caution that government ownership could distort market dynamics and discourage private-sector innovation.\nFor now, markets appear optimistic. Intel’s rally suggests investors see Washington’s stake as a sign of long-term commitment to keeping the company afloat. With global demand for chips set to surge alongside artificial intelligence, electric vehicles, and cloud computing, Intel’s future may hinge on whether government backing can help it reclaim its leadership position in one of the world’s most consequential industries."
    }
  ]
}