{
  "story_id": "GN_20250825_221633_3443ccb0",
  "metadata": {
    "title": "Japanese City Proposes Two-Hour Daily Limit for Smartphone Use",
    "timestamp": "2025-08-25T22:16:33.562253",
    "url": "https://ground.news/article/japanese-city-proposes-two-hour-daily-limit-for-smartphone-use_95fe80"
  },
  "bias_distribution": {
    "total_sources": "70",
    "leaning_left": "7",
    "center": "13",
    "leaning_right": "15"
  },
  "perspective_summaries": {
    "left": [
      "On Thursday, Toyoake City proposed the Ordinance Regarding the Promotion of Appropriate Use of Smartphones and the Like, recommending residents limit non-work and non-school smartphone use to two hours per day and plans to bring it to a city assembly vote next week.",
      "Officials cite health risks such as sleep disturbance, aiming to prevent excessive use of smartphones, personal computers and tablets harming health and family life, Mayor Masafumi Koki said.",
      "The draft specifies curfews urging elementary school students to avoid smartphones after 9:00 p.m. and junior high students and older after 10:00 p.m., applying to all Toyoake City's roughly 68,000-plus residents; officials say this is likely Japan's first municipal smartphone limit.",
      "Responding to backlash, Mayor Masafumi Koki clarified the two-hour smartphone limit is not mandatory and the guidelines recognize smartphones' usefulness in daily life.",
      "The ordinance will be considered by the city assembly next week, with Toyoake planning to collaborate with tech companies, schools and community centers to encourage voluntary adherence while officials note the initiative builds on national efforts and attracts attention from Nigeria."
    ],
    "center": [
      "On Thursday, Toyoake City proposed the Ordinance Regarding the Promotion of Appropriate Use of Smartphones and the Like, recommending residents limit non-work and non-school smartphone use to two hours per day and plans to bring it to a city assembly vote next week.",
      "Officials cite health risks such as sleep disturbance, aiming to prevent excessive use of smartphones, personal computers and tablets harming health and family life, Mayor Masafumi Koki said.",
      "The draft specifies curfews urging elementary school students to avoid smartphones after 9:00 p.m. and junior high students and older after 10:00 p.m., applying to all Toyoake City's roughly 68,000-plus residents; officials say this is likely Japan's first municipal smartphone limit.",
      "Responding to backlash, Mayor Masafumi Koki clarified the two-hour smartphone limit is not mandatory and the guidelines recognize smartphones' usefulness in daily life.",
      "The ordinance will be considered by the city assembly next week, with Toyoake planning to collaborate with tech companies, schools and community centers to encourage voluntary adherence while officials note the initiative builds on national efforts and attracts attention from Nigeria."
    ],
    "right": [
      "A Japanese city, Toyoake, proposes a two-hour daily smartphone limit for users outside of work or school, with no penalties for exceeding it.",
      "Mayor Masafumi Koki highlighted the proposal's aim to prevent health issues like sleep problems related to excessive device use.",
      "The draft recommends elementary students avoid smartphones after 9:00 PM and junior high students after 10:00 PM.",
      "If the ordinance is passed next week, it will come into effect in October."
    ]
  },
  "sources": [
    {
      "news_title": "Japanese city proposes two-hour daily limit for smartphone use",
      "news_link": "https://www.japantimes.co.jp/news/2025/08/22/japan/society/japan-city-proposes-two-hour-daily-smartphone-limit/",
      "bias": "Center",
      "text": "The city of Toyoake in Aichi Prefecture will urge all smartphone users to limit screen time to two hours a day outside work or school under a proposed ordinance that includes no penalties.\nThe limit — which will be recommended for all residents in the city — will not be binding and there will be no penalties incurred for higher usage, according to the draft ordinance.\nThe proposal aims \"to prevent excessive use of devices causing physical and mental health issues ... including sleep problems,\" Toyoake Mayor Masafumi Koki said in a statement on Friday.\nWith your current subscription plan you can comment on stories. However, before writing your first comment, please create a display name in the Profile section of your subscriber account page."
    },
    {
      "news_title": "Japanese city seeks to limit screen time to two hours",
      "news_link": "https://www.thenews.com.pk/latest/1337695-japanese-city-seeks-to-limit-screen-time-to-two-hours",
      "bias": "Lean Right",
      "text": "TOKYO: A city in Japan is set to advise all smartphone users to restrict screen time to two hours a day outside work or school, under a proposed ordinance that carries no penalties.\nThe guideline — aimed at residents of Toyoake City in central Japan — will be not be binding and there will be no penalties for exceeding the suggested limit, according to the draft.\nThe proposal aims \"to prevent excessive use of devices causing physical and mental health issues... including sleep problems,\" mayor Masafumi Koki said in a statement on Friday.\nThe draft urges elementary school students to avoid smartphones after 9:00pm, and junior high students and older are advised not to use them after 10:00pm.\nThe move prompted an online backlash, with many calling the plan unrealistic.\n\"I understand their intention, but the two-hour limit is impossible,\" one user wrote on social media platform X.\n\"In two hours, I cannot even read a book or watch a movie (on my smartphone),\" wrote another.\nOthers said smartphone use should be a decision for families to make themselves.\nThe angry response prompted the mayor to clarify that the two-hour limit was not mandatory, emphasising that the guidelines \"acknowledge smartphones are useful and indipensable in daily life\".\nThe ordinance will be considered next week, and if passed, it will come into effect in October.\nIn 2020, western Kagawa region issued a first-of-its kind ordinance calling for children to be limited to an hour a day of gaming during the week, and 90 minutes during school holidays.\nIt also suggested children aged 12 to 15 should not be allowed to use smartphones later than 9:00pm, with the limit rising to 10:00pm for children between 15 and 18.\nJapanese youth spend slightly over five hours on average a day online on weekdays, according to a survey published in March by the Children and Families Agency.\nApple has a partnership with OpenAI that integrates ChatGPT into iPhones, iPads and Macs\nDragon capsule of billionaire Elon Musk's SpaceX company detached from International Space Station on Friday\nAstronauts board gumdrop-shaped capsule that is scheduled for splashdown in Pacific Ocean on Saturday\nAli Afzaal from Khyber Medical College, secures gold for his innovative project titled “Sleep 10 Hours in 2”\nSam Altman praises latest model, saying \"level of capability here is a huge improvement\"\nNew version of AI chatbot is rolling out free to all its users, says ChatGPT maker in briefing with journalists"
    },
    {
      "news_title": "Japanese city proposes two-hour daily smartphone limit",
      "news_link": "https://www.nzherald.co.nz/world/japanese-city-proposes-two-hour-daily-smartphone-limit/HMBO3OXFXVDXPPOVBNUQVKLEYA/",
      "bias": "Center",
      "text": "“I understand their intention, but the two-hour limit is impossible,” one user wrote on social media platform X.\n“In two hours, I cannot even read a book or watch a movie [on my smartphone],” wrote another.\nOthers said smartphone use should be a decision for individual families to make.\nThe angry response prompted the mayor to clarify the two-hour limit was not mandatory, emphasising the guidelines “acknowledge smartphones are useful and indispensable in daily life”.\nThe ordinance will be considered next week and if passed, it will come into effect in October.\nIn 2020, western Kagawa region issued a first-of-its-kind ordinance calling for children to be limited to an hour a day of gaming during the week, and 90 minutes during school holidays.\nIt also suggested children aged 12 to 15 should not be allowed to use smartphones later than 9pm, with the limit rising to 10pm for children between 15 and 18.\nJapanese youth spend slightly over five hours on average a day online on weekdays, according to a survey published in March by the Children and Families Agency.\n– Agence France-Presse"
    },
    {
      "news_title": "Japan city proposes two-hour daily smartphone limit",
      "news_link": "https://www.channelnewsasia.com/east-asia/japan-two-hour-daily-smartphone-limit-toyoake-5308476",
      "bias": "Center",
      "text": "Japan city proposes two-hour daily smartphone limit\nTOKYO: A Japanese city will urge all smartphone users to limit screen time to two hours a day outside work or school under a proposed ordinance that includes no penalties.\nThe limit - which will be recommended for all residents in central Japan's Toyoake City - will not be binding and there will be no penalties incurred for higher usage, according to the draft ordinance.\nThe proposal aims \"to prevent excessive use of devices causing physical and mental health issues ... including sleep problems\", mayor Masafumi Koki said in a statement on Friday (Aug 22).\nThe draft urges elementary school students to avoid smartphones after 9pm, and junior high students and older are advised not to use them after 10pm.\nThe move prompted an online backlash, with many calling the plan unrealistic.\n\"I understand their intention, but the two-hour limit is impossible,\" one user wrote on social media platform X.\n\"In two hours, I cannot even read a book or watch a movie (on my smartphone),\" wrote another.\nOthers said smartphone use should be a decision for families to make themselves.\nThe angry response prompted the mayor to clarify that the two-hour limit was not mandatory, emphasising that the guidelines \"acknowledge smartphones are useful and indipensable in daily life\".\nThe ordinance will be considered next week, and if passed, it will come into effect in October.\nIn 2020, western Kagawa region issued a first-of-its kind ordinance calling for children to be limited to an hour a day of gaming during the week, and 90 minutes during school holidays.\nIt also suggested children aged 12 to 15 should not be allowed to use smartphones later than 9pm, with the limit rising to 10pm for children between 15 and 18.\nJapanese youth spend slightly over five hours on average a day online on weekdays, according to a survey published in March by the Children and Families Agency."
    },
    {
      "news_title": "Japanese city proposes two-hour screen time limit",
      "news_link": "https://english.alarabiya.net/News/world/2025/08/22/japanese-city-proposes-twohour-screen-time-limit",
      "bias": "Lean Right",
      "text": null
    },
    {
      "news_title": "Japan City Proposes Two-hour Daily Smartphone Limit",
      "news_link": "https://www.barrons.com/news/japan-city-proposes-two-hour-daily-smartphone-limit-27f684da",
      "bias": "Center",
      "text": "Japan City Proposes Two-hour Daily Smartphone Limit\nA Japanese city will urge all smartphone users to limit screen time to two hours a day outside work or school under a proposed ordinance that includes no penalties.\nThe Barron's news department was not involved in the creation of the content above. This article was produced by AFP. For more information go to AFP.com.\n© Agence France-Presse\nContinue reading this article with a Barron’s subscription\nSUBSCRIBE NOW"
    },
    {
      "news_title": "Japanese city considering limiting smartphone use to 2 hours daily",
      "news_link": "https://www.aa.com.tr/en/asia-pacific/japanese-city-considering-limiting-smartphone-use-to-2-hours-daily/3665774",
      "bias": "Right",
      "text": "Japanese city considering limiting smartphone use to 2 hours daily\nToyoake likely to soon present draft ordinance to local assembly\nANKARA\nA Japanese city is considering limiting smartphone use for its residents to two hours a day amid concerns about the effect of excessive technology exposure, media reports said Thursday.\nThe ordinance drafted by the city of Toyoake in Aichi province is likely to be the first municipal regulation in Japan that targets a limit on the use of smartphones and other electronic devices, Kyodo News reported, citing local officials.\nIf the local assembly passes the ordinance, it will take effect Oct. 1.\n\"We want the ordinance to provide an opportunity for people to think about how they use smartphones,\" according to an official.\nBut there is no penalty proposed for those who will violate the ordinance.\nThe draft ordinance also recommends that elementary school students stop using smartphones by 9 pm, and junior high and older students put their devices away by 10 pm.\nWhile recognizing that smartphones, computers, and tablets are essential tools, the draft cautions that excessive use of social media and video streaming can harm health and family life.\n*Writing by Islamuddin Sajid"
    },
    {
      "news_title": "Japan city drafts ordinance to cap smartphone use at 2 hours per day",
      "news_link": "https://english.kyodonews.net/articles/-/59582",
      "bias": "Center",
      "text": "NAGOYA - A central Japan city said Thursday it will seek to pass an ordinance recommending all residents limit smartphone use to two hours a day outside of work and school amid concerns over the impact of excessive technology exposure, though there will be no penalties proposed.\nThe ordinance drafted by the city of Toyoake in Aichi Prefecture is likely to be the first such municipal regulation in Japan that targets a limit on the use of smartphones and other electronic devices, according to the city. If passed by the local assembly, the ordinance will come into effect on Oct. 1.\n\"We want the ordinance to provide an opportunity for people to think about how they use smartphones,\" an official said.\nTo ensure that children get a good night's sleep, the draft ordinance urges elementary school students to refrain from using smartphones after 9 p.m. and junior high students and older to put their devices down by 10 p.m.\nThe draft acknowledged that smartphones, personal computers and tablets are necessities, but warned that overuse of social media and video streaming may have a negative impact on health and family life.\nThe city will work with schools and parents to promote the healthy use of electronic devices, according to the draft ordinance."
    },
    {
      "news_title": "Japanese city to ask children to use smartphones for just 2 hours a day",
      "news_link": "https://www.straitstimes.com/asia/east-asia/japanese-city-to-ask-kids-to-only-use-smartphones-for-2-hours-per-day",
      "bias": "Lean Right",
      "text": "Japanese city to ask children to use smartphones for just 2 hours a day\nSign up now: Get ST's newsletters delivered to your inbox\nFollow topic:\nTOKYO – A city in Japan will attempt to encourage children to limit their smartphone use to just two hours a day through an ordinance, the local government said on Aug 21, but enforcement will not be easy.\nThe move by the city of Toyoake in Aichi prefecture to set guidelines for the use of smartphones and other electronic devices outside of school hours is likely the first such attempt in Japan.\nIf enacted, the ordinance will come into effect on Oct 1.\nThe ordinance will urge primary school pupils to refrain from using smartphones after 9pm, and junior high students and older to put their devices down by 10pm to ensure they get a good night’s sleep.\nGiven the difficulties in enforcing such a directive, there will be no penalties for violating the guidelines, officials said. The ordinance will acknowledge that smartphones, personal computers and tablets are necessities of daily life, but will warn that excessive use of social media and video streaming may have a negative impact on health and family life.\nThe city will work with schools and parents to promote the healthy use of electronic devices, officials said.\n“We want the ordinance to provide an opportunity for people to think about how they use smartphones,” an official said. KYODO NEWS"
    },
    {
      "news_title": "Japanese city pushes two-hour daily smartphone limit to promote healthier sleep for its citizens, particularly school-age children",
      "news_link": "https://www.tomshardware.com/phones/japanese-city-pushes-two-hour-daily-smartphone-limit-to-promote-healthier-sleep-for-its-citizens-particularly-school-age-children",
      "bias": "unknown",
      "text": "Japanese city pushes two-hour daily smartphone limit to promote healthier sleep for its citizens, particularly school-age children\nToyoake in Aichi Prefecture seeks to pass this ordinance soon, though it will be non-binding and without penalty.\nA city in central Japan is considering regulating smartphone use to benefit the health of its citizens. Kyodo News reports that the local government in Toyoake, in Aichi Prefecture, intends “to pass an ordinance recommending all residents limit smartphone use to two hours a day outside of work and school.” Parents may welcome the regulation as a tool to limit their child’s screen time, but it is admitted that there will be no official penalties for those who ‘overuse’ their smartphones.\nThe new regulation affecting smart device users will be put before a local assembly between now and October 1, 2025. If the ordinance receives the green light, it will take effect on the same day.\nThough the source report indicates that the scope of the draft ordinance by the local authority is “all residents,” elsewhere it focuses on children of school age.\nA Toyoake official told Kyodo that “We want the ordinance to provide an opportunity for people to think about how they use smartphones.” The rules might seem particularly important as a tool to help influence the parents of children who own smartphones and are of school age.\nThe stereotypically studious kids in Japan, with their structured, demanding timetables, often supplemented by cram schools that run into the evening, could revolt at further restrictions on their free time. However, the “ordinance urges elementary school students to refrain from using smartphones after 9 p.m. and junior high students and older to put their devices down by 10 p.m.,” according to the source report.\nWe are familiar with studies linking health and well-being impacts to excessive screen time. Being glued to screens in the evenings can be particularly disruptive to a good night’s sleep.\nLocal governments, such as those in the city of Toyoake, Japan, often pass ordinances regulating matters like noise control, public safety, and other regional issues. Some of these regulations will be backed by fines and penalties. In the context of smartphone use, we aren’t surprised there is no proposed penalty, as Toyoake seems to be really pushing the boundaries of personal choices outside of school and work environments.\nGet Tom's Hardware's best news and in-depth reviews, straight to your inbox.\nFollow Tom's Hardware on Google News to get our up-to-date news, analysis, and reviews in your feeds. Make sure to click the Follow button.\nMark Tyson is a news editor at Tom's Hardware. He enjoys covering the full breadth of PC tech; from business and semiconductor design to products approaching the edge of reason.\n-\nNotton Ah yes, the good old kick-the-can-down-the-road method of dealing with societal problems.Reply -\nhotaru251 If you said this 8 yrs ago i'd of called you mad...however seeing how always online from a young age damages them w/ all the brainrot over stimulation...i'd support this, but only up until around 12 as Teen is more likely to have other hobbies/friends.Reply"
    },
    {
      "news_title": "Japanese City Proposes Two-Hour Daily Smartphone Limit",
      "news_link": "https://www.rainsmediaradio.com/2025/08/japanese-city-proposes-two-hour-daily.html",
      "bias": "unknown",
      "text": "A city in Japan, on August 20, 2025, proposed a two-hour daily smartphone usage limit to address concerns about digital addiction among residents.\nThe initiative, announced in Kanagawa Prefecture, targets youth and adults, aiming to promote healthier lifestyles and reduce screen time’s impact on mental well-being. Local officials, led by the city’s mayor, cited rising cases of social isolation and sleep disorders as key drivers for the policy.\nThe proposal encourages voluntary adherence, with schools and community centers offering workshops to foster balanced technology use. It includes guidelines for parents to monitor children’s smartphone habits, emphasizing outdoor activities and face-to-face interaction.\nThe city plans to collaborate with tech companies to develop apps that track and limit usage, creating a model for other municipalities. The initiative builds on Japan’s efforts to address digital overreliance, seen in similar campaigns nationwide.\nThe plan has sparked debate, with some praising its focus on mental health, while others question its practicality in a tech-driven society. Nigeria, with its growing smartphone penetration, watches the proposal as a potential framework for addressing similar concerns. The Kanagawa initiative tests Japan’s ability to balance innovation with well-being, setting a precedent for global digital policies as cities navigate the challenges of modern connectivity."
    },
    {
      "news_title": "Japan city plans 2-hour phone limit",
      "news_link": "https://minutemirror.com.pk/japan-city-plans-2-hour-phone-limit-427730/",
      "bias": "unknown",
      "text": "TOKYO: A city in central Japan has launched a proposal to persuade people to cut their use of smartphones to only two hours a day away from work and school, in what officials say is an effort to address growing fears over health and wellbeing.\nThe draft ordinance, revealed on Friday by Toyoake City in Aichi Prefecture, calls on children and adults to reduce screen time, citing associations between prolonged use and physical and mental health issues, such as sleep disturbance and lower concentration.\nAccording to the proposal, schoolchildren in elementary school would be encouraged not to use smartphones after 9pm, junior high school students and above after 10pm. Similar limits would also be suggested to adults but would be voluntary and without punishment.\nWe want to avoid overuse of devices that can lead to health problems,” Toyoake mayor Masafumi Koki said, emphasizing that the draft guidelines are not designed to curtail freedom but to encourage healthier lifestyles. “We recognize that smartphones are convenient and indispensable in everyday life.\nBut the initiative immediately provoked a fierce backlash online, with several doubting its viability. “Two hours is not possible. Within that time, I cannot even watch a movie,” said one user on social media platform X. Another asserted that the choice on smartphone usage should be left to families, not city officials.\nThe mayor then specified that the ordinance was not obligatory, stressing that it would be only recommended. The draft is to be voted on by the city assembly next week and, if passed, will be in force as of October.\nJapan has tried such measures earlier too. In 2020, the western prefecture of Kagawa implemented Japan’s first ordinance restricting children to an hour of gaming on weekdays and 90 minutes on holidays. It also suggested that children aged 12-15 must quit using smartphones by 9pm and teenagers up to 18 years must quit by 10pm.\nIn spite of all that, smartphone use is firmly rooted in Japanese culture. Japanese kids and teens average just over five hours of online time on weekdays, more than twice the level recommended by Toyoake, a government survey released in March found.\nAlthough detractors label the new plan as unrealistic, its proponents say increasing public awareness of excessive use of the internet is a step in the right direction. For the time being, Toyoake’s plan is symbolic — a reminder of the escalating debate about the role of technology in contemporary life.\nWe welcome your contributions! Submit your blogs, opinion pieces, press releases, news story pitches, and news features to opinion@minutemirror.com.pk and minutemirrormail@gmail.com"
    },
    {
      "news_title": "Japan city suggests two-hour daily smartphone cap",
      "news_link": "https://www.digitalphablet.com/news/japan-city-suggests-two-hour-daily-smartphone-cap/",
      "bias": "unknown",
      "text": "Select Language:\nA Japanese city is proposing an ordinance encouraging residents to limit their daily non-working or non-school screen time to two hours, without imposing any penalties if the guideline is exceeded. This initiative applies to all residents of Toyoake City in central Japan and is entirely voluntary, with no enforcement measures. The goal is to address concerns about excessive device usage contributing to health problems like sleep disturbances, as explained by Mayor Masafumi Koki on Friday.\nThe draft recommends elementary school children not use smartphones after 9:00 p.m., while junior high and older students are advised to switch off after 10:00 p.m. The proposal has sparked online criticism, with many arguing that the two-hour limit is impractical. Comments on social media include remarks like, “I get their intention, but two hours isn’t realistic,” and “I can’t even read a book or watch a movie on my phone in that time.”\nSome people believe the decision about smartphone use should be left to families rather than mandated by city officials. Responding to the backlash, the mayor clarified that the two-hour cap isn’t mandatory and emphasized that the guidelines recognize smartphones as essential tools in everyday life.\nThe proposed ordinance will be reviewed next week, and if approved, it will take effect in October. This isn’t the first local effort of its kind; in 2020, Kagawa Prefecture introduced a pioneering regulation limiting children’s gaming to one hour on weekdays and 90 minutes during holidays. The regulation also suggested that children aged 12 to 15 should not use smartphones past 9:00 p.m., extending to 10:00 p.m. for those aged 15 to 18.\nAccording to a March survey by Japan’s Children and Families Agency, Japanese youth spend just over five hours online on weekdays on average."
    },
    {
      "news_title": "Japan city drafts ordinance to cap smartphone use at 2 hours per day - Manila Standard",
      "news_link": "https://manilastandard.net/news/special-feature/314632995/japan-city-drafts-ordinance-to-cap-smartphone-use-at-2-hours-per-day.html",
      "bias": "unknown",
      "text": "A central Japan city said Thursday it will seek to pass an ordinance recommending all residents limit smartphone use to two hours a day outside of work and school amid concerns over the impact of excessive technology exposure, though there will be no penalties proposed.\nThe ordinance drafted by the city of Toyoake in Aichi Prefecture is likely to be the first such municipal regulation in Japan that targets a limit on the use of smartphones and other electronic devices, according to the city. If passed by the local assembly, the ordinance will come into effect on Oct. 1.\n“We want the ordinance to provide an opportunity for people to think about how they use smartphones,” an official said.\nTo ensure that children get a good night’s sleep, the draft ordinance urges elementary school students to refrain from using smartphones after 9 p.m. and junior high students and older to put their devices down by 10 p.m.\nThe draft acknowledged that smartphones, personal computers and tablets are necessities, but warned that overuse of social media and video streaming may have a negative impact on health and family life.\nThe city will work with schools and parents to promote the healthy use of electronic devices, according to the draft ordinance."
    },
    {
      "news_title": "City in Japan proposes ordinance with daily smartphone usage limit, even for adults",
      "news_link": "https://soranews24.com/2025/08/22/city-in-japan-proposes-ordinance-with-daily-smartphone-usage-limit-even-for-adults/",
      "bias": "unknown",
      "text": "Ironically, this really doesn’t seem like the best way for civic leaders to be using their time.\nOn Thursday, the city of Toyoake, in Aichi Prefecture, announced that it plans to introduce a municipal draft ordinance at its upcoming city council session. Titled “Ordinance Regarding the Promotion of Appropriate Use of Smartphones and the Like,” the proposal includes official limit guidelines on the amount of time per day that residents of the city should be allowed to use their smartphones and other electronic devices.\nThis might sound familiar to those who remember how, in 2020, the prefectural assembly of Kagawa passed an ordinance capping smartphone and gaming time for children living in the prefecture. However, the proposed Toyoake ordinance wouldn’t just apply to kids, but to all of the 68,000-plus people living in the city, full-grown adults included.\nThe ordinance draft calls on residents of Toyoake to limit their time using smartphones, gaming devices, tablets, and PCs to two hours per day, while granting exceptions to work or study-related use.\n▼ “No, no, you’ve got it all wrong, see?!? We’re not playing these games for fun…we’re professional e-sport competitors, so we’re playing Fatal Fury for work reasons…yeah, that’s what we’re doing…”\nThe rationale behind the proposal is that a stated concern that excessive use of such devices disrupts lifestyle rhythms, adversely impacts health, and reduces the amount of conversation between family members. Regarding the proposal, 56-year-old mayor Masafumi Koki said “While acknowledging that smartphones are a convenient lifestyle tool, I want residents to consider the societal issue of their appropriate use.”\nThe proposed ordinance also includes guidelines that, to ensure they’re getting enough sleep, elementary school-age children not use smartphones and other devices past 9 p.m., and older children should shut them off no later than 10 p.m., again, ostensibly, with the exception that they may continue using the devices for scholastic purposes.\nAs with other government attempts to establish blanket limits, the proposal appears to fail to consider several aspects of how and when people use smartphones and other devices, as well as overlooking how other hobbies can be just as problematic if over-indulged in. For example, under the ordinance, if you spent two hours playing games, then put down your phone and picked up a paper book to read, that would be fine. But if you do the exact same thing, only you were reading an e-book, then no, that would be bad, the ordinance says. Likewise, the ordinance says you really shouldn’t be watching YouTube videos for more than two hours, because watching online videos for that long is bad for anyone. On the other hand, if you’re watching TV, a medium that’s perhaps more familiar to the city council members since it was around during their own childhoods? Well then, the ordinance doesn’t have anything bad to say about that, so you have its de-facto blessing to watch as many hours of cheesy TV dramas or celebrity gossip talk shows as you feel like. Heck, as long as you turn off you electronic devices after two hours, the ordinance is fine with you spending that extra time getting drunk, gambling, or doing any number of less-than-wholesome activities, since, again, the limits would apply to adults too.\n▼ Clearly, it’s the PC time that this guy needs to limit, not his alcohol intake.\nAs for blanket usage limits being a way to promote family communication, that’s also questionable. It’s outdated to think that all households consist of a husband, wife, and two kids, who’d all gather in the living room and have deep, meaningful conversations if the government would just tell them when to get off their phones. For many adults who live alone, their phone is their primary way to stay connected to the important people in their lives. Especially for those living far away from family and friends for work or school reasons, or whose jobs require them to work nights or holidays, a face-to-face chat might not be something they can easily do, and so text messages, photo sharing, and other online methods are often how they keep in touch on a day-to-day basis.\nIf ratified by the Toyoake city council, the Ordinance Regarding the Promotion of Appropriate Use of Smartphones and the Like will go into effect on October 1. This is, thankfully, a case in which the stupid cloud has a silver lining, as the ordinance, in its current form, contains no provisions for enforcement or penalties for non-compliance. Still, with people across Japan struggling with rapidly rising consumer prices, rice shortages, increasing bear attacks, and all sorts of other problems in recent months, it sure seems like there are more important issues for the nation’s politicians to be working on than trying to police full-grown adults’ smartphone leisure time.\nSource: Yomiuri Shimbun, Chunichi Shimbun\nTop image: Pakutaso\nInsert images: Pakutaso (1, 2)\n● Want to hear about SoraNews24’s latest articles as soon as they’re published? Follow us on Facebook and Twitter!\nLeave a Reply"
    }
  ]
}