{
  "story_id": "GN_20250822_191748_bd7eb635",
  "metadata": {
    "title": "FBI searches home of ex-Trump national security adviser John Bolton in classified documents probe: Report",
    "timestamp": "2025-08-22T19:17:48.962123",
    "url": "https://ground.news/article/exclusive-patels-fbi-raids-john-boltons-home-in-high-profile-national-security-probe"
  },
  "bias_distribution": {
    "total_sources": "66",
    "leaning_left": "16",
    "center": "30",
    "leaning_right": "12"
  },
  "perspective_summaries": {
    "left": [
      "The FBI raided John Bolton's home in Bethesda, Maryland, searching for classified records as part of a national security investigation, according to a source familiar with the matter confirmed to NBC News.",
      "Bolton served as national security adviser to President Donald Trump from 2018 to 2019 and has since become a critic of Trump, especially on his Russia policies.",
      "FBI Director Kash Patel posted on X that 'NO ONE is above the law& @FBI agents on mission,' indicating the significance of the raid.",
      "The raid signifies ongoing legal actions against perceived enemies of Trump, with Bolton previously under investigation for allegedly disclosing classified information in his memoir, The Room Where It Happened."
    ],
    "center": [
      "The Federal Bureau of Investigation raided the home of former Trump national security adviser John Bolton in Bethesda, Maryland, on August 22, 2025, as part of an investigation into classified documents.",
      "FBI Director Kash Patel stated, \"NO ONE is above the law...\" in relation to the raid on Bolton's home.",
      "The search marks a significant development in the probe into the handling of sensitive government materials by Bolton, who served as national security adviser from 2018 to 2019."
    ],
    "right": [
      "FBI agents raided the home of former National Security Adviser John Bolton in Bethesda, Maryland, at 7 a.m. ET on orders from FBI Director Kash Patel, as reported by the New York Post.",
      "The investigation focuses on potential classified documents that Bolton may possess, and it was allegedly halted during the Biden administration for political reasons, according to a senior U.S. official.",
      "Bolton was previously scrutinized over his 2020 memoir, The Room Where It Happened, which was examined by the Justice Department for potentially disclosing classified information.",
      "In a post on X, Kash Patel stated, 'NO ONE is above the law... @FBI agents on mission,' following the raid."
    ]
  },
  "sources": [
    {
      "news_title": "FBI Raids Ex-US NSA John Bolton's Home Days After His Criticism Of Trump Tariffs",
      "news_link": "https://ground.news/interest/ndtv",
      "bias": "Lean Right"
    },
    {
      "news_title": "FBI raids Trump adviser-turned-critic John Bolton’s home in ‘national security probe’",
      "news_link": "https://ground.news/interest/the-independent_ff73a6",
      "bias": "Lean Left"
    },
    {
      "news_title": "FBI Raids John Bolton's Home In National Security Investigation",
      "news_link": "https://ground.news/interest/the-daily-caller",
      "bias": "Right"
    },
    {
      "news_title": "'NO ONE is above the law': FBI raids former national security adviser John Bolton's home",
      "news_link": "https://ground.news/interest/conservative-review",
      "bias": "Right"
    },
    {
      "news_title": "FBI searches home of former Trump national security adviser John Bolton",
      "news_link": "https://ground.news/interest/the-washington-post",
      "bias": "Lean Left"
    },
    {
      "news_title": "US: FBI searches home of John Bolton",
      "news_link": "https://ground.news/interest/deutsche-welle",
      "bias": "Center"
    },
    {
      "news_title": "The Latest: FBI searches home of ex-Trump national security adviser John Bolton, AP source says",
      "news_link": "https://ground.news/interest/ivpressonlinecom",
      "bias": "Center"
    },
    {
      "news_title": "FBI raids former national security adviser John Bolton's home in a probe to find classified records",
      "news_link": "https://ground.news/interest/nbc-news",
      "bias": "Lean Left"
    },
    {
      "news_title": "FBI searches home of former national security adviser John Bolton reports say: Live updates",
      "news_link": "https://ground.news/interest/usa-today",
      "bias": "Lean Left"
    },
    {
      "news_title": "FBI Raids John Bolton’s Residence, Reports Say",
      "news_link": "https://ground.news/interest/forbes",
      "bias": "Center"
    },
    {
      "news_title": "FBI Raids John Bolton's Home in Classified Documents Probe",
      "news_link": "https://ground.news/interest/newsmax",
      "bias": "Right"
    },
    {
      "news_title": "Breaking: John Bolton's home raided by the FBI",
      "news_link": "https://ground.news/interest/msnbc",
      "bias": "Left"
    },
    {
      "news_title": "FBI Agents Search John Bolton's Maryland Home As Part Of Classified Records Probe: Reports",
      "news_link": "https://ground.news/interest/huffpost",
      "bias": "Left"
    },
    {
      "news_title": "John Bolton has home raided by federal agents amid national security breach fears",
      "news_link": "https://ground.news/interest/gbnewscom",
      "bias": "Lean Right"
    },
    {
      "news_title": "John Bolton's home raided by FBI: Live updates",
      "news_link": "https://ground.news/interest/newsweek",
      "bias": "Center"
    },
    {
      "news_title": "FBI raids home of former Trump national security advisor John Bolton",
      "news_link": "https://ground.news/interest/cnbc",
      "bias": "Center"
    },
    {
      "news_title": "FBI conducts search at John Bolton’s home",
      "news_link": "https://ground.news/interest/cnn",
      "bias": "Lean Left"
    },
    {
      "news_title": "John Bolton's home raided by federal agents, sources say",
      "news_link": "https://ground.news/interest/fox-news_a44aba",
      "bias": "Right"
    },
    {
      "news_title": "National Security Probe Targets Former Trump Adviser John Bolton",
      "news_link": "https://ground.news/interest/devdiscourse",
      "bias": "Center"
    },
    {
      "news_title": "FBI searches home of former Trump national security adviser John Bolton, AP source says",
      "news_link": "https://ground.news/interest/associated-press-news",
      "bias": "Lean Left"
    },
    {
      "news_title": "FBI descends on ex-Trump official John Bolton's home in early morning raid: report",
      "news_link": "https://ground.news/interest/raw-story",
      "bias": "Left"
    },
    {
      "news_title": "FBI raids John Bolton’s home 'over classified documents' after Trump fallout",
      "news_link": "https://ground.news/interest/the-us-sun",
      "bias": "Lean Right"
    },
    {
      "news_title": "Exclusive | Patel’s FBI raids John Bolton’s home in high-profile national security probe",
      "news_link": "https://ground.news/interest/new-york-post",
      "bias": "Lean Right"
    },
    {
      "news_title": "FBI searches home of former Trump adviser John Bolton in documents probe: AP",
      "news_link": "https://ground.news/interest/fox5-dc",
      "bias": "Center"
    },
    {
      "news_title": "FBI agents raid former National Security Adviser John Bolton’s home",
      "news_link": "https://ground.news/interest/justthenewscom",
      "bias": "Lean Right"
    },
    {
      "news_title": "FBI raids home of Trump's ex-national security advisor John Bolton",
      "news_link": "https://ground.news/interest/nbc-dallas-fort-worth",
      "bias": "Lean Left"
    },
    {
      "news_title": "Fmr. FBI agent weighs in on FBI's raid of John Bolton's home",
      "news_link": "https://ground.news/interest/biztoc",
      "bias": "unknown"
    },
    {
      "news_title": "FBI searches home of former Trump adviser John Bolton",
      "news_link": "https://ground.news/interest/perthnow",
      "bias": "unknown"
    },
    {
      "news_title": "FBI searches home of former Trump National Security Adviser John Bolton",
      "news_link": "https://ground.news/interest/dailytruthreport",
      "bias": "unknown"
    }
  ]
}