{
  "story_id": "GN_20250825_222230_0be9e044",
  "metadata": {
    "title": "Advocates warn federal budget cuts could reduce diversity and inclusion initiatives",
    "timestamp": "2025-08-25T22:22:30.252448",
    "url": "https://ground.news/article/advocates-warn-federal-budget-cuts-could-reduce-diversity-and-inclusion-initiatives"
  },
  "bias_distribution": {
    "total_sources": "25",
    "leaning_left": "9",
    "center": "4",
    "leaning_right": "0"
  },
  "perspective_summaries": {
    "left": [
      "Advocates are concerned that federal budget cuts could threaten diversity and inclusion initiatives aimed at hiring people with disabilities.",
      "Khedr noted that diversity, equity, and inclusion programs are typically the first to be cut during tough times.",
      "Only 62% of working-age Canadians with disabilities are employed, compared to 78% of those without disabilities.",
      "A spokesperson indicated that issues related to people with disabilities are no longer a priority in cabinet discussions."
    ],
    "center": [
      "Advocates are concerned that federal budget cuts could threaten diversity and inclusion initiatives aimed at hiring people with disabilities.",
      "Khedr noted that diversity, equity, and inclusion programs are typically the first to be cut during tough times.",
      "Only 62% of working-age Canadians with disabilities are employed, compared to 78% of those without disabilities.",
      "A spokesperson indicated that issues related to people with disabilities are no longer a priority in cabinet discussions."
    ],
    "right": [
      "Advocates are concerned that federal budget cuts could threaten diversity and inclusion initiatives aimed at hiring people with disabilities.",
      "Khedr noted that diversity, equity, and inclusion programs are typically the first to be cut during tough times.",
      "Only 62% of working-age Canadians with disabilities are employed, compared to 78% of those without disabilities.",
      "A spokesperson indicated that issues related to people with disabilities are no longer a priority in cabinet discussions."
    ]
  },
  "sources": [
    {
      "news_title": "Advocates warn federal budget cuts could reduce diversity and inclusion initiatives",
      "news_link": "https://www.winnipegfreepress.com/canada/2025/08/25/advocates-warn-federal-budget-cuts-could-reduce-diversity-and-inclusion-initiatives",
      "bias": "Center",
      "text": "Advocates warn federal budget cuts could reduce diversity and inclusion initiatives\nAdvertisement\nRead this article for free:\nor\nAlready have an account? Log in here »\nTo continue reading, please subscribe:\nMonthly Digital Subscription\n$1 per week for 24 weeks*\n- Enjoy unlimited reading on winnipegfreepress.com\n- Read the E-Edition, our digital replica newspaper\n- Access News Break, our award-winning app\n- Play interactive puzzles\n*Billed as $4.00 plus GST every four weeks. After 24 weeks, price increases to the regular rate of $19.00 plus GST every four weeks. Offer available to new and qualified returning subscribers only. Cancel any time.\nMonthly Digital Subscription\n$4.75/week*\n- Enjoy unlimited reading on winnipegfreepress.com\n- Read the E-Edition, our digital replica newspaper\n- Access News Break, our award-winning app\n- Play interactive puzzles\n*Billed as $19 plus GST every four weeks. Cancel any time.\nTo continue reading, please subscribe:\nAdd Winnipeg Free Press access to your Brandon Sun subscription for only\n$1 for the first 4 weeks*\n*$1 will be added to your next bill. After your 4 weeks access is complete your rate will increase by $0.00 a X percent off the regular rate.\nRead unlimited articles for free today:\nor\nAlready have an account? Log in here »\nOTTAWA – Advocates are raising concerns that upcoming federal budget cuts and expected job losses in the public service will jeopardize programs intended to hire and promote people with disabilities.\n“(Diversity, equity and inclusion) is often an add-on, right? It’s never a core, no matter how hard we try. So usually it’s the first to be cut when times are tough,” said Rabia Khedr, the national director of Disability Without Poverty.\nKhedr said people with disabilities often have to overcome significant barriers to get hired. “They have to prove themselves, they have to be a hundred times better than the able-bodied person to shift the hiring manager’s attitudes,” she said.\nLinda Simpson is the director and founder of Performance Plus Rehabilitative Care in Ottawa. Her organization provides employment services to people with disabilities and other marginalized groups, including newcomers to Canada.\nShe said the job market was already highly competitive, but since the new Liberal government took over and began talk of cutting costs, “we’re just on sort of a holding pattern, because they don’t know what’s happening in their department.”\nMost federal departments and agencies have been directed to find savings of up to 15 per cent by 2028.\nThe Liberals promised during the election campaign to cap, and not cut, the public service, but the Canadian Centre for Policy Alternatives warned in a recent report that budget cuts could result in almost 57,000 fewer jobs in the public service.\nThe federal auditor general is planning to release a report next year that examines the recruitment, retention and promotion of people with disabilities in the federal public service.\nJust 62 per cent of working-age Canadians with disabilities have jobs, compared to 78 per cent of people without disabilities. The federal government’s employment strategy for Canadians with disabilities aims to close that gap by 2040.\nAs of 2024, 21,089 people with disabilities were working in the federal public service, up from 12,893 in 2021, according to the most recent employment equity report for the public service.\nThat is below the rate of workforce availability, which is the metric used to measure the share of the Canadian workforce that’s eligible for work in the federal public service. But the report did find representation of people with disabilities among government executives was above the rate of workforce availability.\nSimpson said some government departments are falling behind when it comes to providing meaningful accommodations, and the return to mandatory in-office work is an added challenge.\n“There are some stellar departments, but there is a lot of work to be done. I interface with people every day and people leave their jobs because there’s no sense of belonging,” she said.\nPrime Minister Mark Carney’s leaner cabinet eliminated a minister of diversity, inclusion and persons with disabilities. Responsibility for the portfolio falls to Jobs and Families Minister Patty Hajdu, and to Leslie Church, Hajdu’s parliamentary secretary.\nHajdu was not made available for an interview, and her office referred questions to the department.\n“As part of our commitment to an accessible and inclusive public service, we have hired nearly 7,000 employees with disabilities in the past five years,” said a statement from an Employment and Social Development Canada spokesperson.\nThe statement noted the government had a target of hiring 5,000 people between 2019 and 2025. It did not say whether a new target has been set.\nThe statement, and the minister’s office, did not directly answer whether the government would commit to maintaining such hiring practices even as it seeks to slash costs. The statement said the government is “dedicated to removing barriers and furthering inclusive hiring, retention, and career progression.”\nThe planned federal budget cuts come at the same time as a broader chill on diversity, equity and inclusion programs.\nThe U.S. president has vowed to end DEI, claiming it is discriminatory. Donald Trump has signed a series of executive orders that eliminate federal offices and programs, end grant programs and force federal contractors to certify that they do not operate DEI programs.\nThe result of the policy change and recent court decisions has been that major companies like Boeing, McDonald’s, Meta and Walmart have dropped their DEI commitments.\nThat’s led to concerns that diversity and inclusion programs will fall by the wayside in corporate Canada, too.\n“A lot of companies are multinational,” said Inclusion Canada CEO Krista Carr. “All of this stuff trickles.”\nCarr said advocates have long struggled for recognition even within inclusion initiatives.\n“One of the things we struggle with is when people think about diversity, they actually don’t usually think about people with disabilities,” she said.\nAnd advocates say not having a minister dedicated to the file signals that it’s less of a priority for the Carney government.\n“We don’t think that the issues of people with disabilities are as (much of a) priority around the cabinet table as they used to be. So we have our work cut out to keep sharing the struggles,” Khedr said.\n— With files from Catherine Morrison and The Associated Press\nThis report by The Canadian Press was first published Aug. 25, 2025."
    }
  ]
}