{
  "story_id": "GN_20250823_214249_ba5911ac",
  "metadata": {
    "title": "US says it killed top ISIS official in Syria",
    "timestamp": "2025-08-23T21:42:49.723739",
    "url": "https://ground.news/article/us-raid-in-northern-syria-kills-senior-isis-financier"
  },
  "bias_distribution": {
    "total_sources": "12",
    "leaning_left": "1",
    "center": "3",
    "leaning_right": "6"
  },
  "perspective_summaries": {
    "left": [
      "American forces killed a senior ISIS official during a raid in northern Syria on August 19, as announced by the United States Central Command .",
      "This official was a key financier for ISIS and involved in planning attacks in Syria and Iraq.",
      "He was considered a threat to American forces and the new Syrian government led by President Ahmed al-Sharaa.",
      "CENTCOM Commander Admiral Brad Cooper stated that the U.S. will continue to pursue ISIS terrorists with unwavering determination."
    ],
    "center": [
      "American forces killed a senior ISIS official during a raid in northern Syria on August 19, as announced by the United States Central Command .",
      "This official was a key financier for ISIS and involved in planning attacks in Syria and Iraq.",
      "He was considered a threat to American forces and the new Syrian government led by President Ahmed al-Sharaa.",
      "CENTCOM Commander Admiral Brad Cooper stated that the U.S. will continue to pursue ISIS terrorists with unwavering determination."
    ],
    "right": [
      "American forces killed a senior ISIS official during a raid in northern Syria on August 19, as announced by the United States Central Command .",
      "This official was a key financier for ISIS and involved in planning attacks in Syria and Iraq.",
      "He was considered a threat to American forces and the new Syrian government led by President Ahmed al-Sharaa.",
      "CENTCOM Commander Admiral Brad Cooper stated that the U.S. will continue to pursue ISIS terrorists with unwavering determination."
    ]
  },
  "sources": [
    {
      "news_title": "Senior ISIS official killed in Syria, CENTCOM says",
      "news_link": "https://www.clevelandjewishnews.com/jns/senior-isis-official-killed-in-syria-centcom-says/article_19fe0df3-f207-5c77-9846-fc9fed3bff71.html",
      "bias": "Lean Right",
      "text": "A senior ISIS member and financier for the terror group was killed during an American raid in northern Syria on Aug. 19, U.S. Central Command announced on Thursday.\nThe U.S. military did not name the terrorist but said that he planned attacks in Syria and in Iraq.\n“He had relationships throughout the ISIS network in the region, posing a direct threat to U.S. and coalition forces and the new Syrian government,” according to the Israeli military.\n“We will continue to pursue ISIS terrorists with unwavering determination throughout the region,” stated Adm. Brad Cooper, commander of CENTCOM.\nThe post Senior ISIS official killed in Syria, CENTCOM says appeared first on JNS.org."
    },
    {
      "news_title": "U.S. forces kill senior ISIS member in Syria raid",
      "news_link": "https://wng.org/sift/u-s-forces-kill-senior-isis-member-in-syria-raid-1755865723",
      "bias": "Right",
      "text": "U.S. forces kill senior ISIS member in Syria raid\nU.S. Central Command troops killed a senior member of the Islamic State terrorist group during an Aug. 19 raid, the military said Thursday evening. The terrorist financed and planned attacks in Syria and Iraq, according to the statement from Central Command. The military operation brought him down in Atimah, in northern Syria. U.S. soldiers killed him because his relationships throughout the terrorist group’s network threatened the United States and the Syrian government, according to the statement.\nBrad Cooper, the commander of U.S. Central Command, said the operation was part of the military’s mission to ensure the lasting defeat of the terrorist group. U.S. forces would continue to pursue terrorists in the region, he said.\nIs the terrorist’s death a major setback for the Islamic State group? The head of the United Nations’ counter-terrorism office, Vladimir Voronkov, on Wednesday said that the terrorist organization so far maintained its operational capacity despite the deaths of leaders. It wasn’t clear from his remarks if Voronkov knew about or was referencing the U.S. operation of the day before. However, he did expect the group to recover from the March death of its deputy leader in charge of operational planning within six months.\nDig deeper: Read my previous report for more details on the threat the Islamic State group poses in several areas, particularly Africa.\nAn actual newsletter worth subscribing to instead of just a collection of links. —Adam\nSign up to receive The Sift email newsletter each weekday morning for the latest headlines from WORLD’s breaking news team.\nPlease wait while we load the latest comments...\nComments\nPlease register, subscribe, or log in to comment on this article."
    },
    {
      "news_title": "Senior ISIS member killed in northern Syria, US CENTCOM says",
      "news_link": "https://www.aa.com.tr/en/middle-east/senior-isis-member-killed-in-northern-syria-us-centcom-says/3666169",
      "bias": "Right",
      "text": "Senior ISIS member killed in northern Syria, US CENTCOM says\n‘We will continue to pursue ISIS terrorists with unwavering determination, throughout the region,’ says CENTCOM commander\nISTANBUL\nUS Central Command said Friday that its forces killed a senior ISIS member and key financier in a raid in Atimah, northern Syria.\nThe raid conducted on August 19 eliminated the ISIS figure which “had relationships throughout the ISIS network in the region, posing a direct threat to US and Coalition forces and the new Syrian Government.”\n“We will continue to pursue ISIS terrorists with unwavering determination, throughout the region” said ADM Brad Cooper, Commander, CENTCOM. “Together with our partners and allies, CENTCOM remains steadfast in our commitment of ensuring the lasting defeat of ISIS and the protection of the U.S. homeland.”"
    },
    {
      "news_title": "CENTCOM forces kill senior ISIS official in Syria",
      "news_link": "https://www.jpost.com/middle-east/article-864992",
      "bias": "Center",
      "text": "The senior ISIS member was a key financier who planned attacks in Syria and Iraq, CENTCOM reported.\nA shirt bearing ISIS insignia, found on a terrorist who attempted to carry out a terror attack in Qalandiya, the West Bank, December 7, 2024.(photo credit: Police Spokesperson )ByJERUSALEM POST STAFF"
    },
    {
      "news_title": "U.S. raid in northern Syria kills senior ISIS financier",
      "news_link": "https://bnonews.com/index.php/2025/08/u-s-raid-in-northern-syria-kills-senior-isis-financier/",
      "bias": "Center",
      "text": "World\nU.S. raid in northern Syria kills senior ISIS financier\nU.S. forces have killed a senior ISIS official during a raid in northern Syria, U.S. Central Command (CENTCOM) announced.\nThe operation took place on Tuesday in Atimah, near the Turkish border, where CENTCOM said its forces targeted an ISIS member described as a key financier who planned attacks in Syria and Iraq.\nThe individual maintained connections across ISIS’s network in the region and posed what officials called a direct threat to U.S. and Coalition forces as well as Syria’s new government.\nISIS remnants continue to operate in Syria’s north and east. The group, which once controlled large swaths of territory in Syria and Iraq, has been reduced to insurgent cells that launch sporadic ambushes, assassinations, and bombings.\nThe strike comes amid shifting U.S. policy toward Syria. In June, President Donald Trump revoked longstanding U.S. sanctions on Damascus following the ouster of Bashar al-Assad and the formation of a new government under President Ahmed al-Sharaa.\nWhile Washington has lifted broad economic restrictions, sanctions remain in place against individuals tied to terrorism, narcotics trafficking, and Assad-era abuses.\n“We will continue to pursue ISIS terrorists with unwavering determination, throughout the region,” said Admiral Brad Cooper, commander of CENTCOM. “Together with our partners and allies, CENTCOM remains steadfast in our commitment of ensuring the lasting defeat of ISIS and the protection of the U.S. homeland.”\n-\nWorld1 week ago\n5.6-magnitude earthquake hits Queensland, felt in Brisbane\n-\nUS News5 days ago\nExplosion reported as cargo ship catches fire in Baltimore Harbor\n-\nLegal1 week ago\nVirginia man fires at officers trying to serve warrant, injuring 3\n-\nLegal2 days ago\nCalifornia Amber Alert: 2 boys abducted from foster care in Los Angeles\n-\nLegal1 week ago\nTexas Amber Alert: 16-year-old Skye Meiler missing in Spring\n-\nWorld1 week ago\nUS drone flies over central Mexico in operation requested by Mexican government\n-\nPolitics4 days ago\nJustice Department eases enforcement of D.C. rifle and shotgun ban\n-\nWorld1 week ago\nUS will deploy air and naval forces to Southern Caribbean to target cartels"
    },
    {
      "news_title": "US says it killed top ISIS official in Syria",
      "news_link": "https://thehill.com/policy/defense/5464790-us-says-it-killed-top-isis-official-in-syria/",
      "bias": "Center",
      "text": null
    },
    {
      "news_title": "CENTCOM announces US forces killed a senior ISIS official during raid in Syria",
      "news_link": "https://justthenews.com/government/security/centcom-announces-us-forces-killed-senior-isis-official-during-raid-syria",
      "bias": "Lean Right",
      "text": "CENTCOM announces US forces killed a senior ISIS official during raid in Syria\nThe Defense Department did not reveal the name of the ISIS official, but said the raid took place on Tuesday, Aug. 19. The official has been identified as a key financier who helped orchestrate attacks in Syria and Iraq.\nThe United States Central Command (CENTCOM) on Thursday announced that American forces successfully killed a senior ISIS official during a raid in northern Syria earlier this week.\nThe Defense Department did not reveal the name of the ISIS official, but said the raid took place on Tuesday, Aug. 19. The official has been identified as a key financier who helped orchestrate attacks in Syria and Iraq.\nThe service said he posed a threat to American forces and the new Syrian government because he had ISIS contacts in the region.\n“We will continue to pursue ISIS terrorists with unwavering determination, throughout the region” CENTCOM Commander Admiral Brad Cooper said in a statement. “Together with our partners and allies, CENTCOM remains steadfast in our commitment of ensuring the lasting defeat of ISIS and the protection of the U.S. homeland.”\nThe raid comes as the United States relaxes its sanctions against Syria after former dictator Bashar Assad was ousted in December. Syrian President Ahmed al-Sharaa has been leading the Middle Eastern country since January.\nMisty Severi is a news reporter for Just The News. You can follow her on X for more coverage."
    },
    {
      "news_title": "Senior ISIS Leader Killed in US-Syrian Raid",
      "news_link": "https://english.aawsat.com/arab-world/5177487-senior-isis-leader-killed-us-syrian-raid",
      "bias": "Lean Right",
      "text": "Not long after Texas surgeon Mohammed Adeel Khaleel arrived at a Gaza City hospital in early August, a 17-year-old was brought in with gunshot wounds to both legs and one hand, sustained when he went to collect food at an aid site.\nIn the emergency room, Khaleel said he noted the ribs protruding from the teen's emaciated torso, an indication of severe malnutrition. When doctors at Al-Ahli Hospital stabilized the patient, he raised his heavily bandaged hand and pointed to his empty mouth, Khaleel said.\n“The level of hunger is really what’s heartbreaking. You know, we saw malnutrition before, back in November, already starting to happen. But now the level is just, it’s beyond imagination,” Khaleel, a spinal surgeon on his third volunteer stint in Gaza, said in an interview.\nOn Friday, the Integrated Food Security Phase Classification, or IPC, the leading authority on global hunger crises, said for the first time that parts of Gaza are in famine and warned that it is spreading. For months, UN agencies, aid groups and experts had warned that Israel's blockade and ongoing offensive were pushing the territory to the brink.\nIn the 24 hours following the famine announcement, eight people in Gaza died of malnutrition-related causes, bringing the overall toll of such deaths during the war to 281, according to Gaza's Health Ministry, which is part of the Hamas-run government and staffed by medical professionals. A US medical nonprofit working in Gaza says one in six children under 5 is affected by acute malnutrition.\nIsrael rejected the famine announcement, calling it an “outright lie” and pointing to its recent efforts to allow in more food after it eased a complete 2½ month blockade in May. It has accused Hamas of siphoning off aid — allegations disputed by the United Nations, which says Israeli restrictions and a breakdown of law and order make it extremely difficult to deliver food to the most vulnerable.\nKhaleel, who spoke to The Associated Press ahead of the announcement, said the evidence of deprivation was already clear.\n“Just the degree of weight loss, post-operative complications and starvation that we’re seeing. That wouldn’t surprise me at all if it was called famine,” said Khaleel, who traveled to Gaza as an independent volunteer via the World Health Organization.\nAt Gaza City’s Shifa Hospital earlier in the week, nutrition director Dr. Mohammad Kuheil led an AP journalist to the bedside of a thin-limbed girl. Aya Sbeteh, 15, was wounded in an airstrike. But her recovery has been set back by weakness from lack of food that her family says has reduced her weight by more than a third.\n“All we have are grains like lentils, sometimes,” said her father, Yousef Sbeteh, 44. “Even flour is unaffordable.\"\nThe sick, wounded and young are most vulnerable\nAnother patient, Karam Akoumeh, lay with sunken cheeks, his thin skin stretched like plastic wrap across his rib cage. His intestines were seriously damaged when he was shot while going out to collect flour, his family said, compromising his digestive system.\nNow he is one of 20 people at Shifa brought in for abdominal wounds and increasingly malnourished because of a shortage of intravenous nutritional supplements, the doctor said.\nAkoumeh’s father, Atef, said the lack of supplements compounded the hunger that reduced Karam's weight from 62 kilograms (136 pounds) to just 35 kilos (77 pounds).\n“I checked throughout all Gaza’s hospitals for it (the supplements), but I have not found any,” he said.\nIsraeli officials have pointed out that some of those said to have died from malnutrition had preexisting conditions. But doctors and other experts say that is to be expected, as famine first preys on the most vulnerable, including babies and small children.\nDoctors and others see signs of hunger everywhere\nOutside the hospital, the shortage of nutrients is equally dire, doctors and civilians say.\n“There are no protein sources, only plant-based protein from legumes. Meat and chicken are not available. Dairy products are not available, and fruits are also unavailable,” said Kuheil, the doctor in charge of nutrition at Shifa.\nIn Gaza City on Friday, Palestinians displaced from elsewhere recounted a desperate search for food.\n“We’re starving. We eat once a day. Will we be more hungry than we are now? There’s nothing left,” said Dalia Shamali, whose family has been repeatedly displaced from their home in nearby Shijaiyah.\nShe said they spent most of their money over the last two years moving from one part of Gaza to another as the Israeli military issued evacuation orders. With Israel allowing more food in recently, the price of flour and other food items has been dropping, but the family still can't afford them, Shamali said.\nHunger agency says famine is expected to spread\nIn its announcement Friday, the IPC said famine in Gaza City is likely to spread across the territory without a ceasefire and a flood of humanitarian aid.\nSome of the IPC's conclusions were echoed in a report by a group that organizes medical missions to Gaza, which described a “catastrophic rise in severe malnutrition” among children and pregnant women.\nOne of every six children in Gaza under 5 is now affected by acute malnutrition, said the report by US nonprofit MedGlobal, based on observations by its staff in four of Gaza’s five governorates. The group warned that all young children in Gaza are at risk of starving without intervention.\nKhaleel, the Texas doctor, said he would leave it to others with more expertise to measure exactly what constitutes famine.\nBut he knows what he saw in three weeks of treating patients in Gaza, most of the time at the hospital in Gaza City. Again and again, medical workers cut open patients' clothing to treat injuries, revealing a loss of muscle and fat caused by hunger that left skin stretched tight over protruding bones.\n“These patients, a number of them that we’re seeing are just exposed ribs, severely skinny extremities,” he said. “And you know that they’re just not getting calories in.”"
    },
    {
      "news_title": "US troops kill senior Isis member in Syria",
      "news_link": "https://www.telegraph.co.uk/world-news/2025/08/21/us-troops-kill-senior-isis-member-syria/",
      "bias": "Lean Right",
      "text": "A senior member of the Islamic State group was killed by US forces in Syria on Wednesday, a US official said.\nThe dawn raid in the north of the country was the second by US troops since former president Bashar al-Assad was toppled in December.\nAhmed al-Sharaa, Syria’s new president, has pledged to prevent a resurgence of Islamic State with the country part of an anti-Isis alliance that includes the US-led coalition fighting the terror group.\nThe raid took place at 2am and involved a joint airdrop operation in which troops were dispatched by parachute to the town of Atmeh, in Idlib province.\nSuch risky ground operations, rather than drone strikes, often signal that the target is particularly prominent and likely to be embedded with civilians in a deliberate effort to ward off an air attack.\nThe US official, speaking on the condition of anonymity, said the operation killed a senior Isis member who was seen as a strong candidate to become the leader of the group in Syria.\nIsis has strengthened since fall of Assad\nA Syrian security source and the country’s state-owned Al-Ikhbariyah said the target was trying to escape when he was killed.\nAnother Syrian source said the target was Iraqi and was married to a French national. It was not immediately clear what happened to his wife.\nAbdelqader al-Sheikh, a neighbour, said he was up late with his son when he heard a noise in the yard next door.\n“I called out, ‘Who are you?’ and they started speaking to me in English, telling me to put my hands up,” Mr Al-Sheikh told Reuters.\nHe said the armed forces stayed on the roofs of surrounding houses for the next two hours and that he could hear someone nearby speaking Arabic in an Iraqi accent.\nIn July, the Pentagon said its forces had conducted a raid in Aleppo province that resulted in the death of a senior Islamic State leader and his two adult Islamic State-affiliated sons.\nLate last year, the US announced that its military had roughly doubled the number of its troops in Syria, to 2,000, but Donald Trump, the US president, has since expressed scepticism about keeping US boots on the ground.\nWhile severely weakened since its peak around 10 years ago, Isis has witnessed a resurgence in Syria since the fall of Assad.\nIn late May, the group claimed its first attack on the new government’s forces since it took power when it planted a bomb on a “vehicle of the apostate regime” in the desert of the southern province of Sweida.\nIsis opposes the new rule in Damascus spearheaded by Mr al-Sharaa, who once ran al-Qaeda’s branch in Syria and fought against Islamic State."
    },
    {
      "news_title": "US Raid Kills Future ISIS Leader in Northwest Syria",
      "news_link": "https://www.sofx.com/us-raid-kills-future-isis-leader-in-northwest-syria/",
      "bias": "unknown",
      "text": "The United States Central Command (CENTCOM) killed a senior ISIS commander, viewed as the group’s likely future leader, in a pre-dawn raid in Atmeh, near Syria’s border with Turkey, on Wednesday.\nThe coalition targeted Abu Hafs al-Hashimi al-Qurashi, an Iraqi national. The Syrian Observatory for Human Rights said another Iraqi citizen was killed during the operation. No U.S. troops were killed or injured in the raid.\nA Syrian security source and state-owned Al-Ikhbariya reported the target was killed while attempting to flee.\nCENTCOM confirmed the strike and described al-Qurashi as a key financier behind planned attacks in Syria and Iraq. “He had relationships throughout the ISIS network in the region, posing a direct threat to U.S. and Coalition forces and the new Syrian Government,” CENTCOM said.\nCENTCOM Forces Kill Senior ISIS Official in Atimah, Syria\nU.S. Central Command forces conducted a successful raid in northern Syria on August 19, killing a senior ISIS member and key financier who planned attacks in Syria and Iraq. He had relationships throughout the ISIS… pic.twitter.com/eORiOthb6G\n— U.S. Central Command (@CENTCOM) August 21, 2025\nA U.S. official told Fox News al-Qurashi was viewed as a strong candidate to become the ISIS Syria Emir, a role that would have posed a direct threat to U.S. and Coalition forces as well as the new Syrian government.\nThis is the second U.S. operation in northern Syria since President Ahmed al-Sharaa replaced Bashar al-Assad. In July, U.S. forces killed ISIS leader Dhiya’ Zawba Muslih al-Hardani and his two sons in Aleppo’s al-Bab region.\n“We will continue to pursue ISIS terrorists with unwavering determination, throughout the region.” CENTCOM Commander Adm. Brad Cooper said. Together with our partners and allies, CENTCOM remains steadfast in our commitment to ensuring the lasting defeat of ISIS and the protection of the U.S. homeland.”"
    }
  ]
}