{
  "story_id": "GN_20250825_214029_f655725e",
  "metadata": {
    "title": "Israel has begun first stages of its planned assault on Gaza City, says Israeli military spokesman",
    "timestamp": "2025-08-25T21:40:29.675110",
    "url": "https://ground.news/article/israel-has-begun-first-stages-of-its-planned-assault-on-gaza-city-says-israeli-military-spokesman_29669e"
  },
  "bias_distribution": {
    "total_sources": "169",
    "leaning_left": "37",
    "center": "28",
    "leaning_right": "23"
  },
  "perspective_summaries": {
    "left": [
      "The Israeli military has commenced the first stages of its planned assault on Gaza City, with forces already positioned at the outskirts according to IDF spokesperson Brigadier General Effie Defrin.",
      "Around 130,000 Israeli reservists will be mobilized for Operation Gideon's Chariots 2, with 60,000 already deployed, due to escalating military actions against Hamas.",
      "The Gaza Health Ministry reported that 56 Palestinians were killed by Israeli fire, with ongoing evacuations ordered in central Gaza's Jabalya area.",
      "U.N. Secretary-General Antonio Guterres has called for an immediate ceasefire in Gaza to prevent further civilian casualties and urged the reversal of settlement expansions in the West Bank."
    ],
    "center": [
      "On Wednesday, Israel initiated preliminary operations around Gaza City, with IDF troops securing its outskirts and mobilizing 60,000 reservists for an expanded military campaign.",
      "The operation follows nearly two years of conflict triggered by Hamas attacks on October 7, 2023, with Netanyahu directing to shorten timelines to defeat Hamas.",
      "The offensive is expected to displace thousands of Palestinians amid severe food shortages and humanitarian aid expansions, while Israelis face declining soldier morale and calls for broader military drafts.",
      "Effie Defrin stated, \"we'll do our best not to harm the hostages,\" emphasizing intelligence use to protect them amid ongoing hostage negotiations and pressure on Hamas.",
      "The operation and settlement expansions have sparked domestic protests and international condemnation, underscoring severe regional instability and uncertainty about conflict resolution."
    ],
    "right": [
      "The IDF has commenced its invasion of Gaza City, confirmed by IDF Spokesman Brig.-Gen. Effie Defrin.",
      "During the invasion, ten terrorists were killed by IDF forces, who also suffered three wounded soldiers, one seriously.",
      "A proposal for a 60-day ceasefire and the release of ten hostages is being mediated by Egypt and Qatar.",
      "Prime Minister Benjamin Netanyahu and Defense Minister Israel Katz are set to approve plans for capturing Gaza City amid ongoing hostage deal negotiations."
    ]
  },
  "sources": [
    {
      "news_title": "Palestinians fear advancing Israeli assault on Gaza City",
      "news_link": "https://www.aljazeera.com/video/newsfeed/2025/8/24/palestinians-fear-advancing-israeli-assault-on-gaza-city",
      "bias": "Lean Left",
      "text": "Palestinians fear advancing Israeli assault on Gaza City\nPalestinians fear advancing Israeli assault on Gaza City\nAs Israel’s military advances further in towards Gaza City, Palestinians like Mohammed Zaher fear another forced expulsion with nowhere to go. Exhausted and trapped, he pleads for the war to end, describing life under occupation as unbearable.\nPublished On 24 Aug 2025"
    },
    {
      "news_title": "Gaza's biggest city in chaos ahead of imminent Israeli assault",
      "news_link": "https://www.9news.com.au/world/israel-gaza-update-gaza-city-in-chaos-ahead-of-imminent-israeli-assault/c6c53e3a-50d4-41f5-b8a7-a20a42bd020f",
      "bias": "Lean Right",
      "text": "Warning: This story contains content that some readers may find disturbing.\nTwo years ago, Gaza's largest city was sprawling with life. Classrooms brimmed with schoolchildren, markets were full of shoppers and beachside cafes offered respite for those escaping the stresses of a besieged enclave.\nGaza City boasts a rich history, inhabited for thousands of years and shaped by successive takeovers from ancient civilisations. It served as a key landing point for Palestinians displaced during Israel's founding in 1948 and has hundreds of millennia-old sites documenting its past.\nIt was therefore no surprise that Islamist militant group Hamas chose Gaza City as its de facto capital when it seized control of the strip in 2007.\nREAD MORE: Dad's tiny selfless act ends in tragedy\nYears of conflict, a crippling blockade and Hamas' autocratic rule made life for Palestinians hard. But the institutions set up by the militants, with help from regional governments like Qatar and a robust United Nations aid system, gave some structure to the strip's exhausted population.\nAn established underground smuggling system gave Gaza City a taste of the outside world amid the land, air and sea siege imposed by neighbours Israel and Egypt – who both designate Hamas a terror organisation.\nWhile life was far from easy in Gaza City, with half the population unemployed and Hamas' police strictly patrolling the streets, you could still get a matcha latte on the way to a yoga studio, or relax in a park.\nToday, what was once the cultural and financial hub of the enclave, lies in lawless ruins, devastated by months of a brutal Israeli assault triggered by Hamas' deadly attack on Israel almost two years ago.\nAnd as Israel's plans to launch a new offensive on the densely populated area to eliminate Hamas militants hiding underground, Palestinians of the Gaza historic city reckon, once again, with mounting fears of survival.\nLife in Gaza City\nNormal life in the coastal enclave collapsed after Israel's brutal retaliation to Hamas' attack.\nHundreds of thousands sheltering in shattered buildings of the city have been left to fend for themselves after the fall of Hamas' policing apparatus. Unclear about their future, residents of Gaza City listen for news of the next food shipment, or the sudden sound of a trickle of salty water from bathroom pipes – which would give them a rare chance for a shower.\nIsrael does not allow journalists into Gaza. CNN spoke to several of Gaza City's residents to paint a picture of how the city looks amidst the war.\nTens of thousands of Israeli strikes have left the city's many towers lying in rubble as garbage and sewage water flood the streets. Black smoke from burning plastic and wood, used by residents for fuel, fill the skies and the sounds of overhead Israeli drones buzz non-stop amid sporadic blasts from airstrikes nearby.\nA chaotic web of wires from street generators supply power to those who can afford to pay. Markets display a random assortment of exorbitantly priced food items, possibly looted by criminal gangs from the few aid trucks Israel allows into the strip.\nHospitals and pharmacies no longer function, and hygiene products remain a scarcity for Palestinians, who say infestations of lice, a lack of vitamins, with no food have left them ill and weak.\nAs night falls, armed thugs roam the streets and families pick up guns to protect themselves. Cash can be transferred to Gaza through an informal banking system – but those seeking to withdraw it are forced to pay up to 50 per cent in commission to individuals and groups controlling the money supply.\nDogs 'eating so many bodies'\nMajdi Abu Hamdi, 40, a father of four, said dust from the explosions chokes the streets and seeps into the homes that are still standing, where blown-out windows make it hard to breathe.\nEven stray dogs have changed their behaviour, he told CNN.\n\"At night, we hear dogs howling. They have turned wild from eating so many bodies. Their barking has changed, becoming fierce,\" he said.\n\"They are even dangerous to people, attacking residents savagely. Two days ago, by mistake, a cat walked near them. More than 20 dogs attacked and tore it apart.\nHe continued, \"People may be 30 years old, but the exhaustion of war makes them look 70\".\n\"Hunger and poor food wear them down. We only use the bathroom every three days because of lack of food and high prices,\" he said.\nHamas, once so visible on the streets of Gaza City, is now absent. Its political offices, organisational municipalities and police stations are destroyed, and its militants stay hidden.\n\"The sons of bitches have no control, it's not like old times … but sometimes you find them appearing suddenly, you don't know where from,\" said Abu Mohamed, a resident of Gaza City who opposes Hamas.\nThe resident, who didn't provide his full name out of fear of Hamas' retaliation, said the group has no forces visibly present, and civilians do not know how the group organises itself.\n\"They don't have specific places where they gather. They have their own special ways on how they communicate or how they organise… we don't know how they do that,\" Abu Mohamed said of Hamas.\nBashar Taleb, a journalist in Gaza City, questioned the purpose of Hamas' weapons if they fail to protect Palestinians.\n\"What is the use of the weaponry if it has not protected a single civilian, and has not prevented the hunger and the continuous death that has lasted for nearly seven hundred days among innocent civilians who have no power in this war,\" Taleb wrote on Facebook.\n\"I want one reasonable person to answer me or to give me just one benefit, even a single benefit, of Hamas's weapons.\"\nHamas isn't a 'static institution'\nWhen an agreement was reached with Israel for a ceasefire and the release of some hostages in January, armed members of Hamas emerged en masse wearing their full uniform at a public square in Gaza City. It was Hamas' reminder that the group was still alive months after Israel set out to destroy it.\nIn the weeks that followed, Hamas choreographed ceremonies to parade its strength during scheduled releases of Israeli hostages captured on October 7. The ceremonies were so infuriating to Israel that it threatened to withdraw from the agreement.\nIn one of the most recent videos circulating on social media and geolocated by CNN, an armed group of masked men chanted for Hamas' armed wing – Al Qassam Brigades – while carrying automatic weapons. The video, released in August, showed masked militants setting fire to a vehicle and threatening \"thieves and businessmen\" who steal aid.\nSelf-styled as 'Al Rade'a, or \"The Deterring\", the subgroup said in its first statement that it was formed by Hamas' security apparatus to \"deter monopolising businessmen\" and gangs who collaborate with Israel in Gaza.\nAl Rade'a claimed that it executed people who belong to gangs that collaborate with Israel, including six people last month in the southern city of Khan Younis.\n\"Let's not forget Hamas is not a static institution or figure. They started out with a certain number of fighters on October 7, and then given the destruction and deaths inside Gaza, they've also gone on a recruiting spree and replaced folks that were there,\" Alex Plitsas, a military expert and senior non-resident fellow for the Atlantic Council, told CNN.\nIt is near-impossible to establish an accurate picture of the number of Hamas militants remaining in Gaza City.\n\"Hamas is not a uniform force, while their government was elected in Gaza and they have institutions that they're responsible for, their military wing doesn't operate like a uniform military… they effectively act like an insurgent force for an elected government that is in the middle of a war, and they don't play by the rules,\" Plitsas said.\n'They know we're coming'\nThe takeover and occupation of the largest city in northern Gaza, which Netanyahu said is one of the last Hamas strongholds, will require the Israeli military to bring in 60,000 more reserve troops and extend the service of another 20,000, in addition to those already called up.\nAn Israeli source said this week that the military will give Palestinians approximately two months to evacuate the densely populated area before the assault begins, setting a symbolic deadline of October 7, the two-year mark of the war.\nAnother Israeli military official could not provide a figure on how many Hamas forces are in Gaza City, but the official said the Israel Defense Forces (IDF) has not ventured deep into the area in nearly two years of war.\nThe expectation is that troops will face an enemy that has had time to dig in, using its extensive tunnel network under Gaza City.\n\"They know we're coming, so they prepare for that,\" the official said.\nThe Hamas \"metro\", as Israel calls it, is more than just a system of uniform tunnels, the official explained. It's far more complex than the IDF anticipated, with larger strategic hubs and branches, as well as smaller tactical tunnels for quick movement and surprise attacks.\nOnce Gaza City is evacuated, the IDF will likely strike an expanded set of targets in the dense urban area, the official added, including sites that weren't struck before because of the density of the civilian population.\nBut Israel's incoming operation is drawing warning from governments and aid groups, who remain concerned about the Israeli military's conduct over the past two years amid a high civilian casualty rate, reports of war crimes, human rights abuses and aid blockades.\n\"The Israeli military would probably take a couple of months to go into every single building, clear it up and hit all the tunnels. Is it possible? Yes,\" Plitsas said.\n\"Is it extremely difficult and will it take a lot of troops to clear and take all the territory? Also yes.\"\nDOWNLOAD THE 9NEWS APP: Stay across all the latest in breaking news, sport, politics and the weather via our news app and get notifications sent straight to your smartphone. Available on the Apple App Store and Google Play."
    },
    {
      "news_title": "Israeli army warns demolishing Gaza City could take ‘over a year’: Report",
      "news_link": "https://thecradle.co/articles-id/32738",
      "bias": "Left",
      "text": null
    },
    {
      "news_title": "Gaza’s biggest city in chaos ahead of imminent Israeli assault: report",
      "news_link": "https://www.dawn.com/news/1936870",
      "bias": "Lean Left",
      "text": "Gaza City, which served as a key landing point for Palestinians displaced during Israel’s founding in 1948, lies in “lawless ruins” after Israel’s relentless bombardment, CNN notes.\nIsrael does not allow journalists into Gaza. CNN spoke to several of Gaza City’s residents to shed light on how the city looks as Israel’s plans to launch a new offensive.\n“Black smoke from burning plastic and wood, used by residents for fuel, fill the skies and the sounds of overhead Israeli drones buzz non-stop amid sporadic blasts from airstrikes nearby.”\nWith no functioning hospitals and pharmacies, and scarce hygiene products, Palestinians say infestations of lice, a lack of vitamins, and no food have left them ill and weak.\n“As night falls, armed thugs roam the streets and families pick up guns to protect themselves,” CNN adds.\nRead more here."
    },
    {
      "news_title": "Gaza’s biggest city is in chaos ahead of an imminent Israeli assault",
      "news_link": "https://www.cnn.com/2025/08/24/middleeast/gaza-city-chaos-israel-intl",
      "bias": "Lean Left",
      "text": "Two years ago, Gaza’s largest city was sprawling with life. Classrooms brimmed with schoolchildren, markets were full of shoppers and beachside cafes offered respite for those escaping the stresses of a besieged enclave.\nGaza City boasts a rich history, inhabited for thousands of years and shaped by successive takeovers from ancient civilizations. It served as a key landing point for Palestinians displaced during Israel’s founding in 1948 and has hundreds of millennia-old sites documenting its past.\nIt was therefore no surprise that Islamist militant group Hamas chose Gaza City as its de facto capital when it seized control of the strip in 2007.\nYears of conflict, a crippling blockade and Hamas’ autocratic rule made life for Palestinians hard. But the institutions set up by the militants, with help from regional governments like Qatar and a robust United Nations aid system, gave some structure to the strip’s exhausted population.\nAn established underground smuggling system gave Gaza City a taste of the outside world amid the land, air and sea siege imposed by neighbors Israel and Egypt – who both designate Hamas a terror organization. While life was far from easy in Gaza City, with half the population unemployed and Hamas’ police strictly patrolling the streets, you could still get a matcha latte on the way to a yoga studio, or relax in a park.\nToday, what was once the cultural and financial hub of the enclave, lies in lawless ruins, devastated by months of a brutal Israeli assault triggered by Hamas’ deadly attack on Israel almost two years ago. And as Israel’s plans to launch a new offensive on the densely populated area to eliminate Hamas militants hiding underground, Palestinians of the Gaza historic city reckon, once again, with mounting fears of survival.\nLife in Gaza City\nNormal life in the coastal enclave collapsed after Israel’s brutal retaliation to Hamas’ attack.\nHundreds of thousands sheltering in shattered buildings of the city have been left to fend for themselves after the fall of Hamas’ policing apparatus. Unclear about their future, residents of Gaza City listen for news of the next food shipment, or the sudden sound of a trickle of salty water from bathroom pipes – which would give them a rare chance for a shower.\nIsrael does not allow journalists into Gaza. CNN spoke to several of Gaza City’s residents to paint a picture of how the city looks amidst the war.\nTens of thousands of Israeli strikes have left the city’s many towers lying in rubble as garbage and sewage water flood the streets. Black smoke from burning plastic and wood, used by residents for fuel, fill the skies and the sounds of overhead Israeli drones buzz non-stop amid sporadic blasts from airstrikes nearby.\nA chaotic web of wires from street generators supply power to those who can afford to pay. Markets display a random assortment of exorbitantly priced food items, possibly looted by criminal gangs from the few aid trucks Israel allows into the strip.\nHospitals and pharmacies no longer function, and hygiene products remain a scarcity for Palestinians, who say infestations of lice, a lack of vitamins, with no food have left them ill and weak.\nAs night falls, armed thugs roam the streets and families pick up guns to protect themselves. Cash can be transferred to Gaza through an informal banking system – but those seeking to withdraw it are forced to pay up to 50% in commission to individuals and groups controlling the money supply.\nDogs ‘eating so many bodies’\nMajdi Abu Hamdi, 40, a father of four, said dust from the explosions chokes the streets and seeps into the homes that are still standing, where blown-out windows make it hard to breathe.\nEven stray dogs have changed their behaviour, he told CNN. “At night, we hear dogs howling. They have turned wild from eating so many bodies. Their barking has changed, becoming fierce.”\n“They are even dangerous to people, attacking residents savagely. Two days ago, by mistake, a cat walked near them. More than twenty dogs attacked and tore it apart,” he said.\nHe continued, “People may be thirty years old, but the exhaustion of war makes them look seventy. Hunger and poor food wear them down. We only use the bathroom every three days because of lack of food and high prices.”\nHamas, once so visible on the streets of Gaza City, is now absent. Its political offices, organizational municipalities and police stations are destroyed, and its militants stay hidden.\n“The sons of bitches have no control, it’s not like old times… but sometimes you find them appearing suddenly, you don’t know where from,” said Abu Mohamed, a resident of Gaza City who opposes Hamas.\nThe resident, who didn’t provide his full name out of fear of Hamas’ retaliation, said the group has no forces visibly present, and civilians do not know how the group organizes itself.\n“They don’t have specific places where they gather. They have their own special ways on how they communicate or how they organize… we don’t know how they do that,” Abu Mohamed said of Hamas.\nBashar Taleb, a journalist in Gaza City, questioned the purpose of Hamas’s weapons if they fail to protect Palestinians.\n“What is the use of the weaponry if it has not protected a single civilian, and has not prevented the hunger and the continuous death that has lasted for nearly seven hundred days among innocent civilians who have no power in this war,” Taleb wrote on Facebook.\n“I want one reasonable person to answer me or to give me just one benefit, even a single benefit, of Hamas’s weapons.”\nHamas isn’t a ‘static institution’\nWhen an agreement was reached with Israel for a ceasefire and the release of some hostages in January, armed members of Hamas emerged en masse wearing their full uniform at a public square in Gaza City. It was Hamas’ reminder that the group was still alive months after Israel set out to destroy it.\nIn the weeks that followed, Hamas choreographed ceremonies to parade its strength during scheduled releases of Israeli hostages captured on October 7. The ceremonies were so infuriating to Israel that it threatened to withdraw from the agreement.\nIn one of the most recent videos circulating on social media and geolocated by CNN, an armed group of masked men chanted for Hamas’ armed wing – Al Qassam Brigades – while carrying automatic weapons. The video, released in August, showed masked militants setting fire to a vehicle and threatening “thieves and businessmen” who steal aid.\nSelf-styled as ‘Al Rade’a, or ‘The Deterring,’ the subgroup said in its first statement that it was formed by Hamas’ security apparatus to “deter monopolizing businessmen” and gangs who collaborate with Israel in Gaza.\nAl Rade’a claimed that it executed people who belong to gangs that collaborate with Israel, including six people last month in the southern city of Khan Younis.\n“Let’s not forget Hamas is not a static institution or figure. They started out with a certain number of fighters on October 7, and then given the destruction and deaths inside Gaza, they’ve also gone on a recruiting spree and replaced folks that were there,” Alex Plitsas, a military expert and senior non-resident fellow for the Atlantic Council, told CNN.\nIt is near-impossible to establish an accurate picture of the number of Hamas militants remaining in Gaza City.\n“Hamas is not a uniform force, while their government was elected in Gaza and they have institutions that they’re responsible for, their military wing doesn’t operate like a uniform military… they effectively act like an insurgent force for an elected government that is in the middle of a war, and they don’t play by the rules,” Plitsas said.\n‘They know we’re coming’\nThe takeover and occupation of the largest city in northern Gaza, which Netanyahu said is one of the last Hamas strongholds, will require the Israeli military to bring in 60,000 more reserve troops and extend the service of another 20,000, in addition to those already called up.\nAn Israeli source said this week that the military will give Palestinians approximately two months to evacuate the densely populated area before the assault begins, setting a symbolic deadline of October 7, the two-year mark of the war.\nAnother Israeli military official could not provide a figure on how many Hamas forces are in Gaza City, but the official said the Israel Defense Forces (IDF) has not ventured deep into the area in nearly two years of war.\nThe expectation is that troops will face an enemy that has had time to dig in, using its extensive tunnel network under Gaza City\n“They know we’re coming,” the official said, “so they prepare for that.”\nThe Hamas “metro,” as Israel calls it, is more than just a system of uniform tunnels, the official explained. It’s far more complex than the IDF anticipated, with larger strategic hubs and branches, as well as smaller tactical tunnels for quick movement and surprise attacks.\nOnce Gaza City is evacuated, the IDF will likely strike an expanded set of targets in the dense urban area, the official added, including sites that weren’t struck before because of the density of the civilian population.\nBut Israel’s incoming operation is drawing warning from governments and aid groups, who remain concerned about the Israeli military’s conduct over the past two years amid a high civilian casualty rate, reports of war crimes, human rights abuses and aid blockades.\n“The Israeli military would probably take a couple of months to go into every single building, clear it up and hit all the tunnels. Is it possible? Yes,” Plitsas said, “Is it extremely difficult and will it take a lot of troops to clear and take all the territory? Also yes.”"
    },
    {
      "news_title": "In Gaza, Even the Cost of a Grave Has Become a Luxury",
      "news_link": "https://truthout.org/articles/in-gaza-even-the-cost-of-a-grave-has-become-a-luxury/",
      "bias": "Left",
      "text": "Honest, paywall-free news is rare. Please support our boldly independent journalism with a donation of any size.\nAs we live in Gaza under the fear of rockets and Israeli bombardment, and with looming threats of an invasion by the Israeli government in full view of the world, in our markets, residents are fighting yet another war — one against soaring prices. It is a war that has drained pockets, exhausted people, and turned daily life into a burden no less cruel than the bombing. The calls of street vendors echo between the narrow alleys and their prices seem to float upward without limit, while purchasing power shrinks by the day. The blockade chokes the the whole Strip; salary cuts deepen the struggle; and battered banknotes are often rejected by shopkeepers. The challenge is no longer only to secure food, but also to obtain the most basic non-food necessities, which have themselves become luxuries in wartime.\nAmong the goods that have, tragically, become “war necessities” in Gaza is wood, which became increasingly important after cooking gas ran out and Israel banned its entry. With demand surging ever since Israel resumed its war after breaking the ceasefire, people began breaking apart their own wooden belongings or scavenging rubble for pieces to burn for cooking or heating water.\nIn my own family, we dismantled our wooden chairs and even cut the branches of the rose bushes we had planted in our garden, which once gave our home a touch of beauty. We were not alone. Our neighbors cut down all the olive trees their grandfather had planted. The soaring price of firewood forces us to burn anything made of wood before we even think of buying ready-cut wood — which, in any case, often comes from olive trees or other trees that survived the bulldozing of farmland by Israeli tanks. Venturing into border areas to collect wood is a dangerous gamble; the army designates such areas as “red zones.” When we bought enough wood just to bake bread, it cost us about U.S. $16 — and that was just the cost of cooking material. Meanwhile, ingredients essential for making bread, like flour and yeast, came to around $73 last month amid constantly fluctuating prices that rise or fall depending on traders’ decisions and the number of trucks Israel allows in.\nNever miss another story\nGet the news you want, delivered to your inbox every day.\nThe cost is not just financial; our bodies pay a heavy price. My brother grows exhausted chopping wood by hand, while the smoke from burning it causes him shortness of breath and stings his eyes. My mother sits by the fire for nearly an hour to prepare a simple meal that would take half the time or less when cooking with gas. Day after day, I watch her body weaken, her back ache, her hands darken from the flames. Even my own hands have grown dry from washing blackened pots and pans covered with soot and ash, especially now that good-quality dish soap has disappeared from the shelves.\nOnce, I sent my brother Musab to buy dish soap. He came back with a poor-quality, locally-made product sold at a high price. With raw materials depleted and factories lacking the means to produce quality goods, local detergents are watery and weak, forcing us to use much more to get dishes clean. Shampoo is the same — mostly water, tinted with color and a little soap, ineffective for washing hair. A liter of these local cleaning products costs between $10 and $15, while a “lucky” find of an imported shampoo costs $26. Even water for washing dishes or bathing now requires a long walk under the sun, hauling a barrel to the nearest filling station, where a generator pumps water from a well for a fee of about $26 — enough for just one family. Larger families need to refill more than once a day.\nClothing is not spared, either. Demand has surged, as two years of war and displacement have left many with nothing but their official documents. But local tailors are forced to make clothes from whatever fabrics they can find. Garments that once cost $11 now sell for $29.\nDuring one trip to the market, my heart ached as I remembered when our shops were filled with elegant, fashionable clothes. Now, looking at the racks before us, we had no choice but to buy the poor-quality clothes in their faded colors. My sister joked as we headed to a stationery store that she would throw away the clothes she bought during the war and replace them with colorful, trendy outfits in the latest fashions. But as she said this, I fell silent, wondering: The latest fashions of which year? Will the war really end this year, or will it drag on for more than two?\nMy thoughts were cut short by the voice of the shop owner telling me that printing my university slides would cost $43. I had expected a high price, but not this high — printing the same material used to cost no more than $15. Seeing my surprise, he explained that printer ink is running out in the Strip and that he now must buys it at an inflated price. The high cost of electricity also boosts the price up even further. When I asked about pens and notebooks, he told me a single pen costs $1.50, and a 60-page notebook costs $17.\nI left the shop feeling hopeless about Gaza and the level of devastation that has been imposed on us. As usual, I found no transport home — many cars have been destroyed, and fuel shortages are severe. If you find a vehicle to take you anywhere, you’re lucky. The only option now is a large, open truck with a roof covering, fitted with long benches that seat about ten people, while the rest stand on a small platform at the back. It’s a makeshift invention you’d only see in Gaza, along with donkeys and horses used for transportation.\nI sat in the truck with about ten other passengers, mostly women. The weariness was plain on their faces, a lifeless pallor the war had painted on them. All the talk was about prices that fluctuate as if they are determined by the stock market — a pack of ten diapers costs $29 while infant formula and other baby needs are unaffordable. Some had sold their gold, others discussed what to cook that day, the commission rates that had reached 50 percent. They spoke of shopkeepers refusing to accept paper currency; sellers charge higher prices for payments made via bank transfer instead of cash — for example, a $50 bag of sugar might cost $70 if paid through the bank. Stories piled one upon another, each one a window into a life few outside of Gaza have ever felt, a life that has left most people here walking as bodies without souls — the living dead.\nEven the “luxury” of death has become more expensive in Gaza. Dying is the easiest thing here, but after death, a grave — including digging, stones, and labor — costs between $290 and $377. Because of the lack of space, workers often bury more than one body in the same grave. When my grandfather passed away a few months ago he was buried above the grave of his brother, who died long ago. This is a glimpse into daily life here: whether alive or dead, you have to pay.\nThis battle that every resident of Gaza is forced to fight is one born of a deliberate policy imposed by Israel. It leaves the average Palestinian in Gaza to ask the same question day after day: Have prices gone down today?\nAn urgent appeal for your support\nTruthout relies on reader support to publish independent journalism, free from political and corporate influence.\nUnfortunately, donations are down. At a moment when our journalism is most necessary, we are struggling to meet our operational costs due to worsening political censorship.\nTruthout may end this month in the red without additional help, so we’ve launched a fundraiser. We have 72 hours to hit our $30,000 goal. Please make a tax-deductible gift to Truthout at this critical time!"
    },
    {
      "news_title": "Hamas has one top strategy: End the war and survive – Knowhere News",
      "news_link": "https://knowherenews.com/hamas-has-one-top-strategy-end-the-war-and-survive/",
      "bias": "Center",
      "text": "Israel’s Tel Aviv Hamas is facing a challenge almost two years after launching the surprise attack that ignited the conflict with Israel.\nIsrael has hammered its combat force, its charismatic leadership has all but been killed, and Arab nations are putting unprecedented pressure on its ceasefire negotiators to relinquish its weapons and its authority.\n“Hamas is facing its worst crisis yet,” stated Esmat Mansour, a Palestinian political commentator and former fighter residing in the West Bank who maintains contact with Hamas officials. “Hamas faces pressures from all directions: from Israel, from the street, from the West and from Arab countries.”\nIsrael’s most recent threat to besiege Gaza City, after forcing hundreds of thousands of Palestinians to leave the city and putting soldiers inside to battle in what Israel views as one of Hamas’ final significant strongholds, is the source of the greatest urgent pressure. This week, military officials urged hospitals to prepare for evacuation, and Prime Minister Benjamin Netanyahu directed military planners to expedite preparations for the Gaza City operation.\nThe world’s hunger specialists have declared that famine conditions have already spread to Gaza, and civilians there are bearing the brunt of Israel’s war, including bombardment, displacement, and acute food shortages.\nIn a statement last month, the 22 Arab League nations demanded for the first time that Hamas relinquish control of Gaza and turn up its weapons.\nThese tensions reached a peak this week when Hamas agreed to terms the U.S. had initially suggested that would maintain Israeli soldiers’ substantial territorial control in Gaza and put aside its initial objections to an Egyptian and Qatari ceasefire proposal. Israel is thinking about how to react.\nHamas is aware of Israel’s superior military might and is working to eliminate it as a political and military power in Gaza. According to Mansour, Hamas’ plan is to cling onto its only negotiating chip—the Israeli hostages it still has—and hope that Israel’s situation will shift in its favor.\n“Time plays to Hamas’ benefit, not to Netanyahu’s benefit,” Mansour asserts. “The [Israeli] military is worn out, Israeli protests are growing, the government may fall, and there may be international pressure, particularly due to the pictures of hunger, with Europe putting pressure on the United States.” “There is nothing worse than surrender,” declares Hamas. Why should I give up? I’m sticking to my guns, and perhaps things will work out in my favor and I’ll have a chance to negotiate from a stronger position.”\nAccording to Mansour, the “main goal of Hamas is to exist and only to exist.”\nHamas believes it has popular support on the Arab street\nAt the moment, Hamas is working to strengthen ties with Arab regimes.\nIbrahim Al-Madhoun, a Palestinian analyst from Gaza who is residing in Istanbul and connected to Hamas, claims that “the main disagreement between Hamas and the Arab countries is the armed struggle that Hamas employs in its clashes with the Israeli occupation.” “But all the Arab states understand that Palestine is a vital cause and Hamas is the most important player in the cause the Arab nations love Hamas.”\nHamas confuses Arab sympathy for Gaza’s suffering with Hamas support, according to Samir Ghattas, an Egyptian security researcher who focuses on Hamas and Gaza.\n“The hostages are Hamas’ only weapon. “Hamas has no cards at all without the hostages,” Ghattas stated. “There is no future for Hamas in Gaza as the people there blame Hamas for what’s happened, after they blame Israel and Netanyhu for the killing and destruction.”\nHamas is increasing its guerrilla warfare\nAlthough the majority of Hamas’ military capabilities have been destroyed by Israel, the organization still operates as isolated guerrilla groups in Gaza.\nA squad of Hamas terrorists rushed an Israeli military post in southern Gaza on Wednesday, sparking close-quarters combat in an unusual action. The Israeli military claims that the majority of the Hamas militants were killed.\nIsrael believes a soldier may have been kidnapped by Hamas. The ambush shows that Hamas is still prepared to fight to the death.\nMohammed Ahmad, 35, thinks Hamas cannot afford to give up its weaponry at this time in Gaza City.\n“No one will accept during a battle and a continuous fight with the occupation to surrender their weapons,” Ahmad asserts. “The Israelis will not leave Gaza if Hamas surrenders its weapons.”\nThe cost of the battle, according to 22-year-old Amjad Saleh, is being borne by civilians rather than Hamas.\n“Hamas is completely absent. He claims that we are punished because their commanders are either overseas or operating in the tunnels beneath Gaza. “The plan for displacement is coming,” he states.\nMass displacement is Palestinians’ biggest concern now\nIn order to seize control of Gaza City and expel hundreds of thousands of Palestinians to southern Gaza, close to the Egyptian border, Israel’s military is requesting tens of thousands additional soldiers. Eventually, Israel wants to relocate as many Palestinians as it can to other nations.\nTo prevent the larger worry of a huge exodus of Palestinians from Gaza into Egypt or elsewhere, that may be one of the main reasons Egypt is helping to suggest a new ceasefire and for Hamas to endorse it.\nFrom London, Abu Bakr Bashir provided a report. This article was submitted by Nuha Musleh from the West Bank’s Ramallah.\nCopyright 2025 NPR"
    },
    {
      "news_title": "The looming battle for Gaza City",
      "news_link": "https://www.npr.org/2025/08/23/nx-s1-5509585/the-looming-battle-for-gaza-city",
      "bias": "Lean Left",
      "text": "The looming battle for Gaza City\nAs Israel prepares for another major military offensive in Gaza, a new report says Gaza is in the grip of a full-blown famine. Will Israel accept a ceasefire deal or attack Gaza's biggest urban hub?\nSCOTT DETROW, HOST:\nAs Israel prepares for another major military offensive in Gaza, a new report says Gaza is in the grip of a full-blown famine. Experts from the Integrated Food Security Phase Classification, or IPC, say more than a half-million people in the devastated territory face catastrophic conditions and that more than 130,000 children under the age of 5 risk death from malnutrition this year. NPR's international affairs correspondent Jackie Northam joins us from Tel Aviv to talk about the latest in this nearly 2-year-old war in Gaza. Hi, Jackie.\nJACKIE NORTHAM, BYLINE: Hi, Scott.\nDETROW: Jackie, this is such a damning report on what's happening in Gaza. What has been Israel's reaction?\nNORTHAM: Well, Israeli officials immediately came out and said the report was both biased and false. Prime Minister Benjamin Netanyahu called the findings an outright lie saying, you know, that Israel doesn't have a policy of starvation and that food it sends into Gaza is stolen by Hamas for its own purposes. But, you know, Scott, Israel has restricted food and medicine and the like into Gaza, and even earlier this year, it prevented any aid from going in for a couple of months.\nRecently, some food is being distributed through U.S.-backed centers, but hundreds of Palestinians have been shot dead by Israeli forces trying to get food at those sites since they were open. So, you know, it's a dire situation, and the IPC, in its report, warned that the famine will get worse.\nDETROW: And at the same time, as we have been hearing, Netanyahu said this week, he approved an operation to send the Israeli military into Gaza City to clear out Hamas militants. What is the end goal of this new operation?\nNORTHAM: Well, you're right. This is shaping up to be a major offensive. Israel considers Gaza City to be one of the last major Hamas strongholds, and the military is already preparing the groundwork to take control. And that includes intensive bombing over the last few nights, which has killed dozens of people, including children, and calling up 60,000 reservists earlier this week, bringing the total up to about 120,000, and they'll work along with active duty soldiers. Netanyahu explained to Sky News Australia what the endgame is. Here he is.\n(SOUNDBITE OF ARCHIVED RECORDING)\nPRIME MINISTER BENJAMIN NETANYAHU: I've said that this war could end today. It can end it if Hamas lays down its arms and releases the remaining 50 hostages, at least 20 of which are alive. And that's our goal - to get all the hostages out, to disarm Hamas, demilitarize Gaza.\nNORTHAM: You know, Scott, it's unlikely Hamas will lay down its arms at this point, and it's seen as wanting to hold on to at least some of the hostages for leverage in any negotiations with Israel. There was a ceasefire proposal on the table, which Hamas agreed to, earlier this week under pressure from Egypt and Qatar. And there was one similar proposed by the U.S. that Israel initially agreed to, but now it's unclear whether Netanyahu will agree to it. And the thinking is the military offensive will help soften up Hamas so Israel can achieve more in any deal.\nDETROW: Let's go back to that humanitarian crisis, though, and the widespread hunger. What does that mean for Palestinians if and when this offensive on Gaza City is launched?\nNORTHAM: Well, the military has been telling Palestinians and, you know, medical facilities to get out of the city before the assault gets fully underway. This is - this will be urban warfare, and Gaza City is densely populated. So we're talking hundreds of thousands of Palestinians being told to evacuate. The problem is, where do they go? The situation isn't any better in the South towards the Egyptian border. There's already a humanitarian crisis there. And, you know, many Gazans have been uprooted several times since October 2023, when Hamas launched a deadly attack on southern Israel. You know, many of them are out of money, and again, there's this famine that's gripped Gaza.\nDETROW: How are Israelis reacting to the news of this coming offensive?\nNORTHAM: You know, there is a lot of anger, and there have been protests. Last weekend, we saw hundreds of thousands of Israeli take to the streets, including here in Tel Aviv. Many people want a ceasefire deal to bring home the Israeli hostages. And there's a fear that a new Israeli offensive in Gaza City could lead to the death of more hostages, you know, as well as Israeli troops.\nDETROW: NPR's Jackie Northam talking to us from Tel Aviv. Thank you so much.\nNORTHAM: Thank you, Scott.\nCopyright © 2025 NPR. All rights reserved. Visit our website terms of use and permissions pages at www.npr.org for further information.\nAccuracy and availability of NPR transcripts may vary. Transcript text may be revised to correct errors or match updates to audio. Audio on npr.org may be edited after its original broadcast or publication. The authoritative record of NPR’s programming is the audio record."
    },
    {
      "news_title": "Famine-stricken Gaza City faces looming Israeli military offensive",
      "news_link": "https://www.france24.com/en/video/20250823-famine-stricken-gaza-city-faces-looming-israeli-military-offensive",
      "bias": "Center",
      "text": "One of your browser extensions seems to be blocking the video player from loading. To watch this content, you may need to disable it on this site.\nFamine-stricken Gaza City faces looming Israeli military offensive\nThe world's leading authority on food crises, the IPC. warned the Gaza Strip's largest city is gripped by famine, and that it's likely to spread across the territory without a ceasefire and an end to restrictions on humanitarian aid. The determination comes after months of warnings by aid groups that Israel's restrictions of food and other aid into Gaza, and its military offensive, were causing starvation among Palestinian civilians, particularly children. In July alone, more than 12,000 children were identified as acutely malnourished, a six-fold increase since January, according to UN agencies. UNICEF called the signs unmistakable. UNICEF Spokesperson Tess Ingram joins FRANCE 24's Mark Owen for a deeper understanding of the harrowing plight of civilians in war-torn Gaza.\nRead less Read more"
    },
    {
      "news_title": "Gaza City mothers say hunger blocks escape of looming Israeli offensive",
      "news_link": "https://www.independent.co.uk/tv/news/gaza-city-famine-israel-attack-video-b2812966.html",
      "bias": "Lean Left",
      "text": "Independent TV\nShowing now | News\n01:33\n‘Death is better than displacement’: Gaza City mothers say hunger blocks escape of looming Israeli offensive\nPalestinian mothers have warned that their hunger is preventing them from moving away from Gaza City as Israel warned that Gaza’s largest city would be destroyed unless Hamas yields to their terms.\nOn Friday, 22 August, the Integrated Food Security Phase Classification, or IPC, said famine is occurring in Gaza City, home to hundreds of thousands of Palestinians, and that it could spread south to Deir al-Balah and Khan Younis by the end of September.\nDisplaced Palestinian women said there's no place for them to go as a potential Israeli offensive looms.\nRabiha Abu Odeh, who was displaced from Beit Hanoun, said: \"We are unable to move. Death is better than displacement.... We are unable to walk or live like this anymore. There is no food or water. We are unable to walk because of the lack of food."
    },
    {
      "news_title": "Middle East: Israel begins military operation in Gaza City",
      "news_link": "https://www.dw.com/en/middle-east-israel-begins-military-operation-in-gaza-city/live-73711480",
      "bias": "Center",
      "text": "Middle East: Israel begins major offensive in Gaza City\nPublished August 21, 2025last updated August 22, 2025What you need to know\nIsrael has announced the start of ground operations in Gaza City, prompting the remaining civilians in the area to flee to the south. The military is expected to call up 60,000 reservists for the offensive.\nPrime Minister Benjamin Netanyahu confirmed he approved the new offensive and \"at the same time\" instructed Israel to begin negotiations to bring about the return of hostages in Gaza and \"the end of the war under conditions acceptable to Israel.\"\nThis blog has now closed. Thank you for reading.\nHere are all the headlines from Israel, Gaza, and the wider Middle East on Thursday, August 21:\nWATCH — NGO warns Gaza children's 'psychological scars will last a lifetime'\nWith Israel's offensive in Gaza City underway, DW spoke with Dan Stewart from the UK-based aid group Save the Children.\nStewart, speaking from Deir al-Balah south of Gaza City, said that the dire humanitarian situation has left many children traumatized, severely malnourished and too weak to cry.\nIsraeli data shows civilians make up at least 83% of Gaza dead: media investigation\nA joint investigation from three media houses alleges that more than four out of five people killed in Gaza up until May 2025 were civilians.\nThe investigation by the Israeli-Palestinian publication +972 Magazine, the Hebrew-language Local Call and The Guardian analyzed data from a classified Israeli military database.\nThe database lists 8,900 militant fighters from Hamas and Palestinian Islamic Jihad as dead or probably dead as of May 2025.\nThat represents only 17% of the 53,000 Palestinians killed in Israel's war in Gaza up until that time, meaning some 83% of deaths are civilians, the investigation found.\nThe figures \"contradict by a huge margin the public statements of Israeli army and government officials throughout the war, which have generally claimed a 1:1 or 2:1 ratio of civilian to militant casualties,\" +972 Magazine writes.\nIn their articles on the investigation, the news organizations cited the Israeli military as saying the figures presented in the investigation were incorrect and didn't reflect the data available in the IDF's systems.\nThe death tolls published by the Hamas-run Gaza Health Ministry don't distinguish between civilians and militants.\nDozens of Palestinians killed in Israeli strikes on Gaza\nDozens of Palestinians were killed by Israeli strikes on Gaza on Thursday, according to local medics.\nIsraeli attacks killed 36 Palestinians, the AP news agency reported citing local hospitals.\nGaza's civil defense agency said 45 Palestinians died across the Gaza Strip in various Israeli attacks, including several casualties from a strike on Gaza City.\nNetanyahu gives instruction to 'immediately begin negotiations' for return of hostages\nIsraeli Prime Minister Benjamin Netanyahu said on Thursday that Israel will immediately begin negotiations to release hostages in Gaza and bring about \"the end of the war under conditions acceptable to Israel.\"\nIt comes as the Israel Defense Forces (IDF) prepares to call up around 60,000 military reservists amid a fresh offensive in Gaza City.\n\"I have come to approve the IDF's plans to take control of Gaza City and defeat Hamas,\" Netanyahu said in a video statement.\n\"At the same time, I have instructed to immediately begin negotiations for the release of all our hostages and the end of the war under conditions acceptable to Israel.\"\nOn Monday, Hamas said it sent \"a positive response\" to a ceasefire plan put forward by international mediators Qatar and Egypt. Israel has not yet responded to the proposal.\nMany malnourished people from Gaza will not survive being displaced, UNRWA chief warns\nThe head of the UN's Palestinian relief agency, UNRWA, said many malnourished civilians will not survive Israel's new offensive in Gaza City.\n\"We have a population that is extremely weak that will be confronted with a new major military operation,\" Philippe Lazzarini told a press conference in Geneva.\n\"Many will simply not have the strength to undergo a new displacement.\"\nUNRWA health centers in Gaza have reported a six-fold increase in the number of severely malnourished children since March.\n\"Many of them will not survive,\" Lazzarini said.\n\"It is a manufactured and fabricated famine. It is deliberate,\" he added. \"Food has been used as an instrument of war.\"\nPalestinian NGO chief says Gaza City residents ordered to evacuate to 'unsafe area'\nIsrael's new ground offensive in Gaza City threatens to displace Palestinians to areas that are unsafe, overcrowded and lack adequate supplies, a Palestinian NGO chief told DW.\n\"We have high concerns about the lives of tens of thousands of people who could be killed,\" Amjad Shawa, head of the Palestinian NGO Network, said from Gaza City.\n\"And at the same time, forcible displacement of about 1,000,000 Palestinians to the south area where it's no space in that area, no infrastructure, no facilities, no tents, nothing.\"\nShawa said there were already a large number of displaced Palestinians in the south of the Gaza Strip, and that ordering more Palestinians to evacuate south would exacerbate the humanitarian crisis there.\n\"Israelis are sending messages to go to an area called Al Mawasi, which is west of Khan Younis, which is overwhelmed by 600,000 people who are displaced from Rafah, from Khan Younis, and every day this area is under Israeli attack,\" Shawa said.\n\"It's an unsafe area and there is no space for any tents to be put there.\"\nShawa called on the international community to push for a ceasefire in the Gaza Strip.\n\"This is real time for the international community to act to stop this military operation and to go back to ceasefire negotiations in order to have an end to this war,\" he said.\nTurkish ports reportedly ask ships to declare they are not carrying arms to Israel\nTurkish ports have begun requiring vessels docking in their harbors to provide proof that they are not carrying weapons to Israel, shipping sources told news outlets.\nWhile there appears to be no official statement on the practice, several sources told reporters that it has been verbally communicated to ports throughout Turkey.\nHarbormasters are to ask for spoken, if not also written, confirmation that docking vessels are not bringing military equipment or hazardous materials to Israel.\nLast year, Turkey severed its $7 billion economic relationship with Israel over the war in Gaza.\nPalestinian children start third year without school\nThe UN's Palestinian relief agency (UNRWA) took to social media to decry how Israel's war in Gaza has disrupted the education of hundreds of thousands of children.\n\"Instead of learning, children spend their time searching for water and food,\" the agency wrote on X, noting that this coming fall marks the third school year that pupils and university students will miss.\nIran launches naval exercises\nIran launched its first military drills since its 12-day war with Israel earlier this year, state media reported on Thursday.\nThe television report said that navy vessels were active in the Indian Ocean, launching missiles towards targets in the Gulf of Oman.\nSuch exercises are routine, but this most recent display is seen as a show of strength after Israel bombed a number of targets in the country, including nuclear sites.\nIranian naval vessels are also known to seize Western ships that stray into its waters following the breakdown of a 2015 nuclear deal that temporarily reduced tensions.\nGaza City offensive underway\nHundreds of thousands of civilians who had sheltered in Gaza City were ordered to evacuate and seek refuge in southern Gaza on Thursday morning as Israel began its ground operations in Gaza City.\nFor many, it is not the first time they have been displaced in recent months.\nThe military confirmed media reports that the offensive had begun, calling it the \"preliminary\" stage of a plan to control the entire city.\n\"We have begun the preliminary operations and the first stages of the attack on Gaza City, and already now IDF forces are holding the outskirts of Gaza City,\" Brigadier General Effie Defrin, Israel's military spokesperson, said.\nIn January, international bodies estimated that aerial attacks had destroyed 70-80% of Gaza City.\nDefrin said that the city was still a \"stronghold\" for Hamas, the militant group whose October 7, 2023 terror attacks on Israeli civilians sparked the current conflict.\nHamas, in a statement on Telegram, accused Israeli Prime Minister Benjamin Netanyahu of obstructing a ceasefire deal in favor of continuing a \"brutal war against innocent civilians in Gaza City.\"\nInternational bodies call for ceasefire to avoid further civilian deaths\nAhead of the Gaza City ground operation, United Nations Secretary-General Antonio Guterres called for an immediate halt of hostilities in light of the multiple humanitarian crises already affecting civilians there.\n\"It is vital to reach immediately a ceasefire in Gaza,\" to avoid the death and destruction that such an operation will cause, Guterres said from a conference in Japan.\nHe also slammed the \"illegal\" plan to expand the construction of settlements in the occupied West Bank.\nThe International Committee of the Red Cross said that another forced displacement of civilians would \"risk worsening an already catastrophic situation.\"\n60,000 reservists to be called up\nThe IDF said late Wednesday that it would call up 60,000 reservists in light of the expanded operation in Gaza City. The plan also includes extending the period of service for the 20,000 reservists who have already been called up to active duty.\nThis is the largest call-up of reservists in months, and is seen as a sign that Israel will not give in to an international outcry to end the conflict that has killed tens of thousands of civilians, including what international organizations estimate to be 19,000 children.\nThe move, which is expected to receive the chief of staff's final approval soon, comes on the heels of mass rallies in Israel calling for a ceasefire and for the government to prioritize the release of hostages held by Hamas.\nWelcome to our coverage\nThe UN Security Council is scheduled to discuss the Israeli military operation and the humanitarian situation in Gaza this afternoon.\nOn Thursday, the Israel Defense Forces (IDF) confirmed it had begun its ground assault on Gaza City, aiming to control the entire area. To that end, around 60,000 Israeli reservists will soon be called up.\nThe UN had called on Israel to implement a ceasefire, citing the danger posed to civilians who have already lived under near-constant bombardment for almost two years.\nDW will bring you the latest headlines and analysis from across the Middle East."
    },
    {
      "news_title": "Israel's assault on Gaza City has begun — here's what you need to know",
      "news_link": "https://www.abc.net.au/news/2025-08-21/israel-gaza-city-takeover/105679796",
      "bias": "Lean Left",
      "text": "Israel's assault on Gaza City has begun — here's what you need to know\nIsrael is calling up tens of thousands of extra reservists as it prepares to send troops to occupy Gaza City.\nThe Israeli military said the first stage of its planned assault was already underway, with IDF troops moving into the outskirts of the city, which is currently home to more than 1 million people.\nIsrael describes the city as a Hamas stronghold, but it is also one of the last places of refuge of hundreds of thousands of Palestinians already displaced in almost two years of war.\nWhat's happened?\nIsrael's military announced the first steps of its operation to take over Gaza City on Wednesday and called up tens of thousands of reservists.\n\"We have begun the preliminary operations and the first stages of the attack on Gaza City, and already now IDF forces are holding the outskirts of Gaza City,\"Israeli military spokesperson Brigadier General Effie Defrin said.\nInitially, a military official briefing reporters earlier on Wednesday said reserve soldiers would not report for duty until September.\nBut after Israeli troops clashed with Hamas fighters in Gaza that same day, Prime Minister Benjamin Netanyahu's office said the Israeli leader sped up the timeline for taking control of Hamas \"strongholds\".\n\"We will deepen the attack on Hamas in Gaza City, a stronghold of governmental and military terror for the terrorist organisation,\" the spokesperson said.\nThe IDF said troops had already begun circling the outskirts of Gaza City and Hamas was now a \"battered and bruised\" guerilla force.\nHamas was quick to react to the latest fighting in Gaza City.\n\"Today's announcement by the terrorist occupation army of the start of an operation against Gaza City and its nearly 1 million residents and displaced persons … demonstrates … a blatant disregard for the efforts made by the mediators,\" it said in a statement.\nWhat is Operation Gideon's Chariots?\nOperation Gideon's Chariots is the name the IDF has given to its plans to occupy Gaza City.\nIt could potentially see thousands of Israeli troops, some of them reservists, being sent into built-up areas where they have not previously operated.\nThe move into the city is the first step of a larger Israeli operation that aims to eventually expand to built-up refugee camps in central Gaza, as well as to Muwasi, a sprawling displacement camp along the coast.\nThose areas, along with the central city of Deir al-Balah, are the only parts of Gaza that have not been almost completely destroyed in previous Israeli operations.\nThe takeover plans in Gaza also include areas where Hamas may be holding hostages in tunnels or other secret locations, Israel says.\nWhere is Gaza City?\nGaza City is located on the Mediterranean coast, just over 75 kilometres south-west of Jerusalem, and is the largest city in the Gaza Strip.\nBefore the war, Gaza City was home to around 700,000 people.\nBut now, Israeli media reports the number of people there has swelled to about 1.2 million.\nThe majority of people who live in Gaza City are Palestinian refugees or descendants of refugees.\nThe serious escalation into Gaza City could displace hundreds of thousands of people, many of whom have been uprooted multiple times during the war.\nFearing an imminent Israeli ground offensive, thousands of Palestinians have left their homes in eastern areas of Gaza City, now under constant Israeli bombardment, for points to the west and south in the shattered territory.\nIsrael currently holds about 75 per cent of the Gaza Strip.\nWhat are other countries saying about Israel’s actions?\nThe Israeli statements on Wednesday signalled Israel was pressing ahead with its plan to seize Gaza's biggest urban centre despite international criticism.\nIsrael's actions in Gaza have been condemned by the UN and more than 28 Western-aligned nations.\n\"It's pretty obvious that it will just create another mass displacement of people who have been displaced repeatedly since this phase of the conflict started,\" United Nations spokesperson Stephane Dujarric said.\nLast month Western-aligned nations including Australia, Britain and Canada issued a joint statement condemning Israel's actions and saying the war \"must end now\".\nThe statement said \"the suffering of civilians in Gaza has reached new depths\" and added that \"the Israeli government's denial of essential humanitarian assistance to the civilian population is unacceptable\".\nUS President Donald Trump restated his support for Israel in a post on his Truth Social website earlier this week.\n\"We will only see the return of the remaining hostages when Hamas is confronted and destroyed!!! The sooner this takes place, the better the chances of success will be,\" he wrote. \"Play to WIN, or don't play at all!\" Mr Trump said.\nWhere are ceasefire talks at?\nOn Monday, Hamas agreed to a ceasefire proposed by Qatar and Egypt.\nWhilst Israel has not yet responded, it continues to say it is committed to fully defeating Hamas.\nThe most recent proposals make slight modifications to an earlier ceasefire proposal advanced by the US and accepted by Israel.\nThe specific details of the latest proposal have not been made public, but Egyptian and Hamas officials have described the broad outlines:\n- A 60-day ceasefire in which Israeli forces would pull back to a buffer zone extending 800 metres into Gaza.\n- Hamas to release 10 living hostages and the remains of 18 others in phases.\n- Israel to release around 1,700 Palestinian prisoners, including 200 serving life sentences after being convicted of deadly attacks.\n- Israel to allow 600 trucks of humanitarian aid into Gaza each day, a major increase that could help arrest what experts have described as the territory's slide toward famine.\n- During the temporary ceasefire, the sides would negotiate a lasting truce, the release of the remaining hostages and the further withdrawal of Israeli forces.\nIsraeli Prime Minister Benjamin Netanyahu said that while he will halt the fighting temporarily to facilitate the release of hostages, he will not end the war until Hamas has been defeated and disarmed.\nEven then, he says Israel will maintain security control over Gaza and facilitate the relocation of much of its population to other countries through what he describes as voluntary emigration.\nABC/wires"
    },
    {
      "news_title": "IDF says next stage of operation to take control of Gaza City underway",
      "news_link": "https://www.haaretz.com/israel-news/2025-08-21/ty-article-live/idf-says-next-stage-of-operation-to-take-control-of-gaza-city-underway/00000198-ca4d-d1e9-abf9-db7f1bbd0000",
      "bias": "Lean Left",
      "text": "Israel at War Day 685 | UN: Israeli Strikes Cause Widespread Destruction and Casualties in and Around Gaza City\n- RECAP: Netanyahu orders talks to release hostages and end war, as IDF presents Gaza takeover plans\n- Lebanon returns Israeli citizen to Israel after year-long imprisonment\n- U.K. summons Israeli ambassador over E1 West Bank settlement construction plan\n- UN: Israeli strikes cause widespread destruction and casualties in and around Gaza City\n- RECAP: Netanyahu orders talks to release hostages and end war, as IDF presents Gaza takeover plans\n- Lebanon returns Israeli citizen to Israel after year-long imprisonment\n- U.K. summons Israeli ambassador over E1 West Bank settlement construction plan\n- UN: Israeli strikes cause widespread destruction and casualties in and around Gaza City\nRECAP: Netanyahu orders talks to release hostages and end war, as IDF presents Gaza takeover plans\nThese are the latest updates on day 685 of the war:\n■ Israel's prime minister said he is approving the plans to take over Gaza and has instructed to begin immediate talks for the release of the hostages and an end to the war.\n■ Various protests erupted across Israel calling for a hostage release deal, against the war and against the IDF's plans to retake Gaza.\n■ The Hamas-run Health Ministry in Gaza reported 70 people were killed in Israeli strikes over 24 hours.\n■ Britain summoned Israel's ambassador in London following the approval of construction plans that would divide the West Bank. 21 countries co-signed a statement urging Israel to backtrack its approval.\n■ In response to the E1 plans, U.S. Ambassador Mike Huckabee said that Israelis living in the West Bank are not violating international law, and accused Europe of encouraging settlements by planning to recognize a Palestinian state.\n■ Israel's High Court ruled that several factual changes that have occurred may justify the rejection of the petition to increase the scope of humanitarian aid to the Gaza Strip.\n■ Palestinian factions started handing over some of the weapons held in refugee camps, in the first step of an agreement between the Palestinian Authority and Lebanon.\n■ Israeli soldiers shot and wounded a man in the West Bank city of Hebron after he approached a checkpoint holding what was later revealed to be a handgun, the military said.\n■ Lebanon returned an Israeli citizen to Israel on Thursday after he had been held in the country for a year, the Israeli Prime Minister's Office announced.\nHostage mother Einav Zangauker to Netanyahu: Don't order negotiations, sign a deal\nEinav Zangauker, mother of hostage Matan Zangauker who is being held in the Gaza Strip, wrote on X, \"My son has been in Gaza for 685 days, and just now Netanyahu 'orders' to start negotiations for him. Don't order – sign.\"\nZangauker also called on Netanyahu to \"give up on the obstacles you set up for the talks, stop getting whipped by [Finance Minister Bezalel] Smotrich and [National Security Minister Itamar] Ben-Gvir. For once, do the right thing.\"\nIn her remarks, Zangauker responded to Netanyahu's directive released on Thursday night for an Israeli delegation to start negotiations for a complete hostage deal and an end to the war on Israel's conditions, as he approves the military's plan for taking over Gaza.\nUN: Israeli strikes cause widespread destruction and casualties in and around Gaza City\nThe United Nations' Office for the Coordination of Humanitarian Affairs warned that Israel's strikes in eastern and southern Gaza City are causing high numbers of civilian casualties and large-scale destruction.\nThe office added that Israel has struck a makeshift site for displaced Palestinians in Deir al Balah, which it has been using as an office and guesthouse, and damaged it.\nThe statement also noted that the hunger and malnutrition suffered by Palestinian children in Gaza are worsening, and that 16,800 people have been displaced across the strip between August 12 and August 20.\nNetanyahu says he ordered immediate start of talks to release hostages and end Gaza war\nPrime Minister Benjamin Netanyahu said in a video statement issued Thursday night that he has arrived at the Gaza Division to approve the military plans to \"take over Gaza City to defeat Hamas.\"\n\"At the same time,\" he continued, \"I have instructed to begin immediate negotiations for the release of all our hostages and an end to the war, on terms acceptable to Israel.\"\n\"These two things, defeating Hamas and releasing all our hostages, go hand in hand,\" he said.\nThe statement was given at a meeting attended by the heads of the defense establishment and members of the security cabinet, intended to approve the operational plans.\nNetanyahu added that \"he appreciated the presence of the reserve soldiers and the regular army for this vital goal.\"\nHostage families protest in Tel Aviv for hostage release, at least eight anti-war protesters arrested in Haifa\nProtesters calling for the release of the hostages demonstrated in Tel Aviv against the government's delay in responding to the proposal made by mediators for a limited hostage deal, which Hamas has responded in favor of.\nFamily members of hostages and supporters are marched around the IDF headquarters in Tel Aviv, as the family of Gali and Ziv Berman, siblings who are being held hostage in the Gaza Strip, marched from Dizengoff Square to Hostage Square simultaneously.\nYehuda Cohen, father of Nimrod, who is being held captive in the Gaza Strip, called on Chief of Staff Eyal Zamir and all reservists who have been called up for reserve duty to disobey orders. \"Only with force will we be able to pressure Prime Minister Benjamin Netanyahu, the benefactor of Hamas, to stop this unnecessary war,\" he said.\nMeanwhile, at least 40 people protested in Paris Square in Haifa against the war in Gaza. Demonstrators played drone sounds, held up posters bearing anti-war slogans and displayed art depicting children killed in the Gaza Strip. After an hour of protests, police officers called to the scene ordered them to disperse, and at least eight were arrested. The organizers of the protest said in a statement they were protesting against the \"destruction, starvation, murder of journalists and the invasion of Gaza City.\"\nAlso on Thursday, mothers of soldiers serving in the military protested outside the home of Chief of Staff Eyal Zamir in central Israel, calling for an end to the war. \"We will not allow the sacrifice of our children in a politically motivated war. Eyal Zamir is responsible for every soldier who is killed, and the blood of the hostages will be on his hands,\" they said.\nIsrael's communications minister says West Bank construction plans are 'historic,' signal start of sovereignty\nIsrael's Communications Minister Shlomo Karhi said on Thursday that \"the decision to build in the E1 area is historic and absolutely correct. Prime Minister Benjamin Netanyahu has waited decades for this moment, and no one will be able to stop the realization of our right. This is the start of sovereignty,' he said.\nThe minister said in the statement that \"God willing, we will inaugurate thousands of housing units here and continue to strengthen settlements throughout the country. Two banks of the Jordan River: This one is ours, the other is also ours, and the West Bank first.\"\n\"A Palestinian state will never be established from the Jordan River to the sea,\" he added.\nThousands attend prayer rally against draft exemption bill in southern Israel city\nThousands are in attendance of a prayer rally in the southern-Israel city of Arad against the draft exemption law, which was organized by the ultra-Orthodox Ger Hasidic community in the city. A few dozen people are protesting on the sidelines, in support of the proposed bill.\nU.S. Ambassador to Israel: Israelis living in West Bank are not violating international law\nU.S. Ambassador to Israel Mike Huckabee, speaking with Saudi channel Al-Arabiya on Thursday, said that it \"is not a violation of international law for Israelis to live in Judea and Samaria.\"\nAccording to the ambassador, \"one of the reasons we're seeing the more aggressive decision to move into some of these areas, is because it's in reaction to what the Europeans have done, in concert with the Palestinian Authority, pushing for the unilateral recognition of a Palestinian state and pushing for this UN conference, which is supposed to happen next month in New York.\"\nHuckabee said that the conference, which is expected to herald a wide recognition of a Palestinian state, has had a detrimental effect on both tensions in the West Bank and on \"solving things in Gaza.\"\n\"I don't know what the Europeans thought they were going to accomplish,\" Huckabee continued, \"but through their actions, they are accomplishing something they didn't want to: essentially give a green light to the Israelis to take more pieces of Judea and Samaria, either by sovereignty or annexation.\"\nThe ambassador also said that the international push for unilateral recognition of a Palestinian state without the cooperation and participation of Israel is a violation of the Oslo Accords. \"If there's going to be this massive violation of the Oslo agreement, then people have to prepare for the consequences of that – on both sides of the conflict,\" he said.\nIDF Chief of Staff: Military is 'advancing with the efforts toward operations in Gaza City'\nThe Israel Defense Forces' Chief of Staff Eyal Zamir toured the Gaza Strip on Thursday, and told soldiers posted in Khan Yunis that Israel is \"We are advancing with the efforts toward operations in Gaza City. We already have troops operating on the outskirts of the city, and more forces will join them later on.\"\nAccording to Zamir, \"Our missions remain the release of the hostages and the defeat of Hamas; we will not rest and we will not stop until we complete them.\"\nZamir also added that \"tens of thousands of reserve call-up orders for troops\" were issued on Wednesday for the reservists who will join those already stationed in the Gaza Strip.\nThe Chief of Staff also said that the IDF will mobilize reservists \"only when it is necessary, and we trust them. I am confident they will report until the mission is complete.\""
    },
    {
      "news_title": "Israel calls up 60,000 reservists with invasion of Gaza's largest city imminent",
      "news_link": "https://www.walesonline.co.uk/news/world-news/israel-calls-up-60000-reservists-32318037",
      "bias": "Lean Left",
      "text": "Israel calls up 60,000 reservists with invasion of Gaza's largest city imminent\nPrime Minister Benjamin Netanyahu has ordered the Israeli military to prepare for a major ground assault on Gaza City, where almost half of the territory's displaced residents are now sheltering\nIsrael's military is preparing to launch a major ground offensive on Gaza City, with thousands of troops being positioned as part of \"preliminary actions\" to seize the densely populated civilian zone. 60,000 Israeli citizens have been mobilised for active service ahead of the substantial assault on Gaza's largest city, where nearly half of the territory's displaced population is currently taking refuge.\nPrime Minister Benjamin Netanyahu will convene a security cabinet meeting this week (August 21) to secure approval for the military operation on Gaza City, where 70 per cent of all structures have sustained damage following repeated air strikes and a catastrophic siege in 2024.\nThis cabinet session will not address the ceasefire agreement accepted by Hamas earlier this week, which Netanyahu has declined to discuss, according to Haaretz reporting. The Prime Minister's office stated instead: \"Netanyahu has ordered the timetable for taking over the last terrorist strongholds and defeating Hamas.\"\nThe estimated death toll in the territory now exceeds 62,000 during the 21 months of Israel's response to the October 7 terror attacks, when militant groups from Gaza killed 1200 Israeli soldiers and civilians, whilst taking 240 hostage. After months of food aid restrictions and with no conclusion to the conflict in sight, 266 Gazans have now perished from starvation, 122 of those who starved to death have been children according to the Gaza Health Ministry.\nHamas, reacting to Israel's preparations to seize and control Gaza City, declared the offensive \"will fail, just as previous military operations have.\" Their spokesperson further stated that the assault \"aims to destroy the remaining foundations of life in Gaza.\"\nThe banned terror organisation continued: \"Netanyahu's disregard for the mediators' proposal and his failure to respond to it proves that he is the true obstructionist of any agreement, that he does not care about the lives of [Israeli captives], and that he is not serious about their return.\"\nIDF troops are already positioned close to the major city, with forces gathering in Jabalia and Zeitoun, where military spokesperson Brigadier General Effie Defrin cautioned: \"We will deepen the damage to the terror infrastructure above and below the ground and sever the population's dependence on Hamas.\"\nThis proposed ground offensive will unfold in a city that has already been \"reduced to dust,\" according to one local who spoke to Al Jazeera. \"There is no form of life if we wish to return.\n\"We can't find water or homes, we can't even live in tents.\"\nIsrael's armed forces have indicated they will instruct all civilians to leave Gaza City and move to humanitarian areas in the south, where many of the Palestinian territory's two million displaced people are already taking refuge.\nIn this section of Gaza, analysis by BBC Verify and other organisations has revealed Israeli bulldozers and controlled demolitions flattening districts that previously housed tens of thousands of residents.\nNumerous allies of Israel have criticised the proposed occupation of Gaza City, along with Prime Minister Netanyahu's strategy for military control of the entire Gaza Strip, which surfaced following the collapse of ceasefire negotiations last month.\nFrance's President Macron declared on Wednesday that the offensive \"can only lead to disaster for both peoples and risks plunging the entire region into a cycle of permanent war\"."
    },
    {
      "news_title": "Israel begins first stages of Gaza City takeover operation - as UK condemns settlement plan",
      "news_link": "https://news.sky.com/story/israel-begins-first-stages-of-gaza-city-takeover-as-uk-condemns-approval-of-west-bank-settlement-plan-13415376",
      "bias": "Center",
      "text": "Israel begins first stages of Gaza City takeover operation - as UK condemns settlement plan\nAn Israeli military spokesperson said troops currently hold the outskirts of the city. It comes after tens of thousands of reservists were called up to help seize Gaza's biggest urban centre.\nThursday 21 August 2025 03:14, UK\nIsrael has said it has begun the first stages of its takeover of Gaza City - as the UK condemned the approval of plans for a new West Bank settlement.\nBrigadier General Effie Defrin, Israel's military spokesperson, said on Wednesday that \"IDF forces are holding the outskirts of Gaza City\" after preliminary operations to take the entire area.\nAn estimated 60,000 reserve soldiers have also been called up to help seize Gaza's biggest urban centre, but will not report for duty until September, according to a military official.\nIsraeli troops are already operating in the Zeitoun neighbourhood of Gaza City, and the Jabaliya refugee camp in northern Gaza.\nPrime Minister Benjamin Netanyahu's war cabinet approved the plans last month, which include an eventual full security takeover of all of Gaza, despite growing international criticism that it will likely lead to the displacement of many more Palestinians.\nHe is said to have sped up the timeline for taking control of Hamas strongholds after both sides clashed near Khan Younis, south of Gaza City, on Wednesday.\nIsrael claims it will help any civilians evacuate before any assault begins.\nCeasefire proposal being considered\nIsraeli officials said they are also considering a new ceasefire proposal put forward by Qatar and Egypt.\nThe deal, which involves a 60-day ceasefire and the release of some of the remaining Israeli hostages and Palestinian prisoners, has already been accepted by Hamas.\nThousands of Israeli civilians have called for the government to accept a ceasefire and reverse its decision to take over Gaza City, but Mr Netanyahu is thought to be under pressure from some far-right members of his coalition to reject the deal and continue to pursue the annexation of the territory.\nWest Bank settlement plan approved\nOne of those is Bezalel Smotrich, Israel's finance minister, who announced on Wednesday that a controversial plan for a settlement project in the occupied West Bank had been approved after they received the final go-ahead from Israel's higher planning committee.\nMr Smotrich, an ultranationalist in the ruling right-wing coalition, said in a statement that the government was delivering with the settlement what it had promised for years: \"The Palestinian state is being erased from the table, not with slogans but with actions.\"\nHe said last week that the settlement would \"finally bury the idea of a Palestinian state, because there is nothing to recognise and no one to recognise\".\n'A stake through the heart of two-state solution'\nBritish Foreign Secretary David Lammy condemned the plan, saying it \"would divide a Palestinian state in two\".\nIn a post on the X social media platform, Mr Lammy called the settlement in the West Bank \"a flagrant breach of international law\", which \"critically undermines the two-state solution\", and urged the Israeli government to reverse the decision.\nThe UN also condemned the decision, with spokesperson Stephane Dujarric saying that it \"will drive a stake through the heart of the two-state solution\".\nRead more:\nInside the conflict forcing Palestinians from their homes\nThe city where what was law now has no place in reality\nWhere is the settlement?\nThe settlement is set to be built in E1, an open tract of land east of Jerusalem, and includes around 3,500 apartments to expand the existing settlement of Maale Adumim.\nE1 has been eyed for Israeli development for more than two decades, but plans were halted due to pressure from the US during previous administrations.\nA two-state solution to the decades-old Israeli-Palestinian conflict would see a Palestinian state in East Jerusalem, the West Bank and Gaza existing side by side with Israel.\nToday, an estimated 700,000 Israeli settlers live in the West Bank and East Jerusalem. There is also a growing movement of Israelis wanting to build settlements in Gaza.\nSettlers make up around 5% of Israel's population and 15% of the West Bank's population, according to data from Peace Now.\nSettlements are illegal under international law and have been condemned by the UN. They are, however, authorised by the Israeli government."
    },
    {
      "news_title": "Israel Calls Up Reservists Ahead of Gaza City Offensive",
      "news_link": "https://foreignpolicy.com/2025/08/20/israel-reservists-gaza-city-offensive-west-bank-e1-settlement/",
      "bias": "Center",
      "text": "Israel Calls Up Reservists Ahead of Gaza City Offensive\nThe new phase of combat will be “gradual, precise, and targeted,” according to a military official.\nWelcome back to World Brief, where we’re looking at Israel’s preparation to enter Gaza City, NATO’s discussions about security guarantees for Ukraine, and M23 attacks in the Democratic Republic of the Congo.\nPreparing for a New Offensive\nThe Israel Defense Forces (IDF) will call up around 60,000 reservists to supplement its forces as it prepares for an expanded military operation into Gaza City. The city, located in the north of Gaza, is still one of the enclave’s most densely populated areas despite the continued danger of Israeli attacks and a growing humanitarian crisis. The service of 20,000 additional reservists already on active duty will also be extended.\nWelcome back to World Brief, where we’re looking at Israel’s preparation to enter Gaza City, NATO’s discussions about security guarantees for Ukraine, and M23 attacks in the Democratic Republic of the Congo.\nPreparing for a New Offensive\nThe Israel Defense Forces (IDF) will call up around 60,000 reservists to supplement its forces as it prepares for an expanded military operation into Gaza City. The city, located in the north of Gaza, is still one of the enclave’s most densely populated areas despite the continued danger of Israeli attacks and a growing humanitarian crisis. The service of 20,000 additional reservists already on active duty will also be extended.\n“We will be moving into a new phase of combat, a gradual, precise, and targeted operation in and around Gaza City,” a military official said during a briefing with reporters, according to Newsweek.\nThe call-up of reservists, the largest in months, is part of a plan approved by Defense Minister Israel Katz that aims to prevent Hamas from initiating future attacks or regrouping from its stronghold in northern Gaza.\n“I instruct you to use all tools and all power to strike the enemy until it is subdued, and to protect I.D.F. soldiers,” Katz told Israeli troops on Wednesday, according to a statement received by the New York Times. The plan is expected to receive final approval from the military’s chief of staff in the coming days.\nMeanwhile, the initial phase of the operation has begun, with Israel’s military spokesperson telling reporters on Wednesday that “already now IDF forces are holding the outskirts of Gaza City.” The newly called-up reservists will not report for duty until September.\nIsrael is moving ahead with plans even as it faces domestic and international criticism from its allies and risks displacing more Palestinians in Gaza. But Israeli Prime Minister Benjamin Netanyahu is also facing pressure from far-right members of his coalition to continue the war and annex territory.\nOne such member is Finance Minister Bezalel Smotrich, who said Wednesday that Israel had given final approval for the controversial E1 settlement development that would bisect the West Bank. The development essentially quashes optimism for a viable two-state solution or a future Palestinian state.\n“The Palestinian state is being erased from the table not with slogans but with actions,” Smotrich said on Wednesday. “Every settlement, every neighborhood, every housing unit is another nail in the coffin of this dangerous idea.”\nHowever, the impending move into Gaza City could be prevented under the Hamas-approved 60-day cease-fire plan put forth earlier this week. The proposal would see Israel pull back its forces to a buffer zone that extends 800 meters (or 875 yards) into Gaza, allow in 600 trucks of humanitarian aid per day, and free around 1,700 imprisoned Palestinians. In exchange, Hamas would release 10 living hostages and the bodies of 18 deceased hostages. Israel has said that there are still 50 hostages in Gaza, around 20 of whom are believed to still be alive. Israel is expected to respond to the cease-fire proposal by Friday.\nToday’s Most Read\n- Trump Has No Idea How to Do Diplomacy by Stephen M. Walt\n- Russia and Ukraine Are as Far Apart as Ever by Ivo H. Daalder\n- Why Steve Witkoff Is Trump’s Master of Disaster by Christian Caryl\nWhat We’re Following\nCandid discussion. NATO defense chiefs held a discussion on Wednesday about what security guarantees they could offer Ukraine as part of a final deal to end the country’s more than three-year full-scale war with Russia. The gathering followed U.S. President Donald Trump’s meetings with Russian President Vladimir Putin, Ukrainian President Volodymyr Zelensky, and European leaders, none of which resulted in a clear pathway to peace.\nThe meeting of 32 defense chiefs facilitated “great, candid discussion,” according to a post on X written by the chair of NATO’s Military Committee, Italian Adm. Giuseppe Cavo Dragone. He also reaffirmed the group’s strong support for Ukraine.\nUkraine has asked for Western-backed military assurances to prevent any reinvasion from Russia down the line. Yet any such security guarantees would likely face stiff pushback from Russia, which has repeatedly said that having NATO countries’ troops in Ukraine would be unacceptable. Russian Foreign Minister Sergey Lavrov said Wednesday that attempts to resolve Ukrainian security without Russian involvement would not lead to movement toward a peace agreement.\n“We cannot agree with the fact that now it is proposed to resolve questions of security, collective security, without the Russian Federation. This will not work,” Lavrov said at a news conference. He added that any talks not including Moscow are a “road to nowhere.”\nUndermined peace. Rwanda-backed M23 rebels killed scores of civilians in the eastern Democratic Republic of the Congo in mid-July, according to a new report released Wednesday by Human Rights Watch. The report found that the killings took place only a few weeks after the signing of a U.S.-brokered preliminary peace deal between Rwanda and Congo. The investigation included witness accounts from medical staff, United Nations personnel, and attack survivors.\nM23 has denied involvement in the killings, and even with overwhelming evidence from the U.N., Rwanda has continued to deny backing M23.\nThe White House has hailed the peace deal, but these new details undermine Trump’s self-praise for ending the roughly 30-year conflict. Additionally, this report comes after M23 rebels suspended Qatari-brokered talks on Monday that were aimed at securing permanent peace and accused the Congolese government of attacking the group’s seized territories.\nDangerous return. More than 70 Afghans returning from Iran died in a bus crash in Afghanistan’s Herat province near the Iranian border on Tuesday night. The accident occurred on one of the country’s most dangerous highways when the bus collided with a truck and a motorbike. The bus was just one of the hundreds that have been carrying Afghan refugees across the border as Iran escalates expulsions and forced returns. The Herat province crossing is the main point of entry for the thousands of Afghans returning every day.\nMore than 1.9 million Afghan refugees have been returned from Iran and neighboring Pakistan since the start of 2025 as part of a push to remove undocumented nationals. The removals were particularly ramped up following the Israel-Iran war in June after Iran accused some refugees of spying for Israel. However, Afghanistan is not positioned to handle the massive population influx, and many returnees arrive with no jobs or places to live. The U.N. and humanitarian organizations have strongly condemned the deportations and warned that returnees face the threat of persecution and violence under Afghanistan’s Taliban government.\nOdds and Ends\nThe annual Air Guitar World Championships kicked off on Wednesday in Oulu, Finland, with competitors from 13 countries ready to face off to see who can rock the best air guitar solo. Since 1996, the competition has encouraged participants to “make air, not war,” believing that “climate change, wars, and all bad things will disappear when all people play air guitar.” It’s also a way to build connections with other air guitar aficionados and music. “A lot of the airheads in real life actually do play instruments,” U.K. contestant Piers Burnell told the BBC, “so it’s their way of kind of letting loose, and it doesn’t matter if they play a bum note because no one can hear it.”\nClaire Schnatterbeck is an editorial fellow at Foreign Policy. X: @claire_e_beck\nJoin the Conversation\nCommenting is a benefit of a Foreign Policy subscription.\nSubscribe Subscribe\nAlready a subscriber?\n.View Comments\nJoin the Conversation\nJoin the conversation on this and other recent Foreign Policy articles when you subscribe now.\nSubscribe Subscribe\nNot your account?\nView Comments\nJoin the Conversation\nPlease follow our comment guidelines, stay on topic, and be civil, courteous, and respectful of others’ beliefs.\nView Comments"
    },
    {
      "news_title": "Israeli forces begin Gaza City invasion",
      "news_link": "https://www.afr.com/world/middle-east/israeli-forces-begin-gaza-city-invasion-20250821-p5mols",
      "bias": "Lean Right",
      "text": "Tel Aviv | Jerusalem | Israel’s military announced the first steps of an operation to take over Gaza City on Wednesday (Thursday AEST) and called up tens of thousands of reservists while the government considers a new ceasefire proposal to pause almost two years of war.\n“We have begun the preliminary operations and the first stages of the attack on Gaza City, and already now IDF forces are holding the outskirts of Gaza City,” Brigadier General Effie Defrin, Israel’s military spokesperson, told reporters.\nLoading...\nReuters"
    },
    {
      "news_title": "Israel says it has taken first steps of military operation in Gaza city",
      "news_link": "https://www.irishexaminer.com/news/arid-41691045.html",
      "bias": "Lean Left",
      "text": "Israel says it has taken first steps of military operation in Gaza city\nIsrael’s military announced the first steps of an operation to take over Gaza City on Wednesday and called up tens of thousands of reservists while the government considered a new ceasefire proposal to pause nearly two years of war.\n\"We have begun the preliminary operations and the first stages of the attack on Gaza City, and already now IDF forces are holding the outskirts of Gaza City,\" Brigadier General Effie Defrin, Israel's military spokesperson, told reporters.\nA military official briefing reporters earlier on Wednesday said reserve soldiers would not report for duty until September, an interval that gives mediators some time to bridge gaps between Hamas and Israel over truce terms.\nBut after Israeli troops clashed with Hamas fighters in the Palestinian enclave on Wednesday, Prime Minister Benjamin Netanyahu's office said the Israeli leader sped up the timeline for taking control of Hamas strongholds and defeating the militant group that triggered the conflict with an attack on Israel in October 2023.\nThe Israeli statements signaled Israel was pressing ahead with its plan to seize Gaza's biggest urban centre despite international criticism of an operation likely to force the displacement of many more Palestinians.\nDefrin said troops were already operating on the outskirts of Gaza City, and Hamas was now a \"battered and bruised\" guerrilla force. \"We will deepen the attack on Hamas in Gaza City, a stronghold of governmental and military terror for the terrorist organization,\" the spokesman said.\nIsrael's military called up tens of thousands of reservists on Wednesday in preparation for the expected assault on Gaza City, as the Israeli government considered a new truce proposal.\nHamas, in a statement on Telegram, accused Netanyahu of obstructing the ceasefire deal in favour of continuing a \"brutal war against innocent civilians in Gaza City.\"\n\"Netanyahu's disregard for the mediators' proposal ... proves that he is the real obstructionist of any agreement.\"\nIsrael’s security cabinet, chaired by Netanyahu, approved a plan this month to expand the campaign in Gaza with the aim of taking Gaza City, where Israeli forces waged fierce urban warfare with Hamas in the early stages of the war. Israel currently holds about 75% of the Gaza Strip.\nMany of Israel’s closest allies have urged the government to reconsider, but Netanyahu is under pressure from some far-right members of his coalition to reject a temporary ceasefire, continue the war and pursue the annexation of the territory.\nOne far-right member, Finance Minister Bezalel Smotrich, announced final approval on Wednesday of a widely condemned Israeli plan for a settlement project in the occupied West Bank that he said would erase any prospect of a Palestinian state.\nThe war in Gaza began on October 7, 2023, when gunmen led by Hamas attacked southern Israeli communities near the border, killing some 1,200 people, mainly civilians, and taking 251 hostages including children into Gaza, according to Israeli figures.\nOver 62,000 Palestinians have been killed in Israel's air and ground war in Gaza since then, according to Gaza health officials, who do not say how many were militants but have said most of those killed have been women and children.\nHamas has accepted a proposal put forward by Arab mediators for a 60-day ceasefire that would involve releasing some of the remaining hostages and freeing Palestinian prisoners in Israel.\nThe Israeli government, which has said all the 50 remaining hostages must be released at once, is studying the proposal. Israeli authorities believe that 20 hostages are still alive.\nMany Gazans and foreign leaders fear a storming of Gaza City would cause significant casualties. Israel says it will help civilians leave battle zones before any assault begins.\nIsraeli troops clashed on Wednesday with more than 15 Hamas militants who emerged from tunnel shafts and attacked with gunfire and anti-tank missiles near Khan Younis, south of Gaza City, severely wounding one soldier and lightly wounding two others, an Israeli military official said.\nIn a statement, Hamas' Al-Qassam Brigades confirmed carrying out a raid on Israeli troops southeast of Khan Younis and engaging Israeli troops at point-blank range.\nIt said one fighter blew himself up among the soldiers, causing casualties, during an attack that lasted several hours.\nIsrael's military campaign has caused widespread devastation across the Gaza Strip, which before the war was home to about 2.3 million Palestinians.\nMany buildings including homes, schools and mosques have been destroyed, while the military has accused Hamas of operating from within civilian infrastructure, which Hamas denies.\nIsraeli officials have said evacuation orders would be issued to Gaza City residents before any force moves in.\nThe Latin Patriarchate of Jerusalem, which oversees Gaza's only Catholic Church, located in Gaza City, said it received reports that neighbourhoods near the small parish had started to receive evacuation notices.\nHamas, an Islamist movement that has ruled Gaza for almost two decades, has been severely weakened by the war.\nHamas has said it would release all remaining hostages in exchange for an end to war. Israel says it will not end the war before Hamas disarms.\nOpinion polls show strong Israeli public support for ending the war if it ensures the release of the hostages, and a rally in Tel Aviv urging the government to pursue such a deal drew a huge crowd on Saturday.\nA new\npoll of Americans showed a 58% majority believe that every country in the United Nations should recognise Palestine as a nation."
    },
    {
      "news_title": "Israeli begins the first stages of its assault on Gaza City | Morning News Bulletin 21 August 2025",
      "news_link": "https://www.sbs.com.au/news/podcast-episode/morning-news-bulletin-21-august-2025/x58evrsk2",
      "bias": "Lean Left",
      "text": "TRANSCRIPT:\n- Israeli begins the first stages of its assault on Gaza City..\n- The final day of the productivity roundtable set to begin, with a focus on budget sustainability and tax reform.\n- Dylan Shiel is set to play one last game for Essendon tonight against Carlton at the MCG.\nAn Israeli military spokesman says Israel has begun the first stages of its planned assault on Gaza City.\nIsrael's military said on Wednesday that it will call up tens of thousands of reservists and extend the service of others ahead of an expanded military operation it will carry out in Gaza City.\nDefence Minister Israel Katz approved plans to begin a new phase of operations in some of Gaza’s most densely populated areas.\nThe plan, which is expected to receive the chief of staff's final approval in the coming days, includes calling up 60,000 reservists and extending the service of 20,000 others who are currently serving.\nIDF spokesperson Brigadier General Effie Defrin said Israeli forces were already holding the outskirts of Gaza City.\n\"We will deepen the damage to Hamas and Gaza city. A stronghold of governmental and military terror and the terrorist organisation. We will deepen the damage to the terror infrastructure above and below the ground and sever the population's dependence on Hamas.\"\nThe conflict escalated when Hamas-led militants attacked Israel on Oct. 7, 2023, killing roughly 1,200 people, mostly civilians, and abducting 251.\nMore than 62,122 Palestinians have been killed during Israel's offensive, Gaza’s Health Ministry said Monday.\nRussia says it must be part of any discussion on security guarantees for Ukraine, and has downplayed the likelihood of an imminent summit with President Volodymyr Zelenskyy, tempering hopes for a quick peace deal.\nNATO military chiefs held a virtual summit on security guarantees for Ukraine overnight its chair Admiral Giuseppe Cavo Dragone saying it was a great, candid discussion.\nBut Russia's Foreign Minister Sergei Lavrov earlier warned that seriously discussing security guarantees without its involvement was, in his words, a utopia and a road to nowhere.\nHe also cast doubt on an imminent meeting between Russian President Vladimir Putin and his Ukrainian counterpart, saying that any summit between them must be prepared in the most meticulous way so it doesn't deteriorate the situation surrounding the conflict.\nFederal Treasurer Jim Chalmers says participants at the economic roundtable hope to come up with better regulation around home construction, in the final day of the forum in Canberra.\nThe productivity roundtable will today focus on the issues of budget sustainability and tax reform.\nAccording to the Productivity Commission, one key issue affecting Australia's productivity is the regulatory burden in the National Construction Code.\nDr Chalmers says regulation around building has to become more efficient without compromising standards.\n\"Better regulation, making sure regulation is serving a useful purpose. Making sure approvals can be quicker without ignoring our responsibility to our communities or to the environment, how can we quicken the pace of the approval so that we can build more of the stuff that we want to see in the economy.\"\nIndependent M-P Allegra Spender says Australia has around 60 per cent of migrants who are not working to their full capacity, and those are in critical areas, such as construction.\nThe Victorian government has announced a child safety overhaul following an independent review that revealed systemic failings, underfunding and outdated practices within the early education sector.\nJacinta Allan's government had commissioned the Rapid Child Safety Review after serious allegations of child sexual abuse by former childcare worker Joshua Dale Brown.\n\"This review will reform childcare safety practices, it goes to the hiring of staff, the safety of children reform of the sector. It also builds on the work that we have already taken, to ban personal devices in childcare centres and also to establish a Victorian register (of childcare work).\"\nThe report was delivered to the government last week - with 22 recommendations, including strengthening Work with Children Checks, which the report found were not fit for purpose.\nVictorian Greens spokesperson for Early Childhood Anasina Gray-Barberio says the real test is whether Labor gives a new regulator the independence and funding to hold responsible corporations to account - as that’s what Victorian families deserve.\nAnd in AFL,\nDylan Shiel is set to play one last game for Essendon tonight with the veteran named to face Carlton at the M-C-G.\nThe AFL's Gettable reported that Shiel will not be at the Bombers next season, in what has been a mutual decision between the player and the club to part ways.\nThe 32-year-old may play on next season if he can find another suitor.\nShiel, who missed last week's loss to St Kilda due to suspension, has been recalled to face the Blues alongside skipper Zach Merrett, who will celebrate his 250th AFL game."
    },
    {
      "news_title": "Israeli military to call up 60,000 reservists as it plans new phase of Gaza war",
      "news_link": "https://www.theoldhamtimes.co.uk/news/national/25403291.israeli-military-call-60-000-reservists-plans-new-phase-gaza-war/",
      "bias": "Center",
      "text": "Israel’s military has said it will call up 60,000 reservists ahead of an expanded military operation in Gaza City.\nMany Palestinians have chosen to stay in the area despite the danger as seeking safety seems increasingly futile amid the growing humanitarian crisis.\nCalling up extra military reservists is part of a plan defence minister Israel Katz approved to begin a new phase of operations in some of Gaza’s most densely populated areas, the military said.\nThe plan, which is expected to receive the chief of staff’s final approval in the coming days, also includes extending the service of 20,000 additional reservists who are already on active duty.\nIn a country of fewer than 10 million people, the call-up of reservists is the largest in months and carries economic and political weight.\nIt comes days after hundreds of thousands of Israelis rallied for a ceasefire, as negotiators scramble to get Israel and Hamas to agree to end their 22 months of fighting.\nMeanwhile, rights groups have warned that an expanded assault could deepen the crisis in the Gaza Strip, where most of the roughly two million inhabitants have been displaced, many areas have been reduced to rubble and the population faces the threat of famine.\nAn Israeli military official, speaking on the condition of anonymity in line with military regulations, said troops will operate in parts of Gaza City where they have not been deployed yet and where Israel believes Hamas is still active.\nIsraeli troops in the Zeitoun neighbourhood of Gaza City and Jabaliya, a refugee camp in the northern Gaza Strip, are already preparing the groundwork for the expanded operation, which could begin within days.\nThough the timeline was not clear, Prime Minister Benjamin Netanyahu’s office said on Wednesday that Mr Netanyahu “has directed that the timetables… be shortened” for launching the new offensive.\nGaza City is Hamas’ military and governing stronghold, and one of the last places of refuge in the northern Strip, where hundreds of thousands are sheltering.\nIsraeli troops will be targeting Hamas’s vast underground tunnel network there, the official added.\nAlthough Israel has targeted and killed much of Hamas’s senior leadership, parts of Hamas are actively regrouping and carrying out attacks, including launching rockets towards Israel, the official said.\nMr Netanyahu has said the war’s objectives are to secure the release of remaining hostages and ensure that Hamas and other militants can never again threaten Israel.\nThe planned offensive, which was announced earlier this month, comes amid heightened international condemnation of Israel’s restrictions on food and medicine reaching Gaza and fears that many Palestinians will be forced to flee.\n“It’s pretty obvious that it will just create another mass displacement of people who have been displaced repeatedly since this phase of the conflict started,” United Nations spokesman Stephane Dujarric told reporters.\nAssociated Press journalists saw small groups heading south from the city this week, but it is unclear how many others will voluntarily flee.\nSome said they would wait to see how events unfold before moving yet again, with many insisting that nowhere is safe from airstrikes.\n“What we’re seeing in Gaza is nothing short of apocalyptic reality for children, for their families, and for this generation,” Ahmed Alhendawi, regional director of Save the Children, said in an interview.\n“The plight and the struggle of this generation of Gaza is beyond being described in words.”"
    },
    {
      "news_title": "Israel says it has taken first steps of military operation in Gaza City, ‘IDF holding positions on the outskirts’",
      "news_link": "https://indianexpress.com/article/world/israel-says-it-has-taken-first-steps-of-military-operation-in-gaza-city-10201646/",
      "bias": "Lean Left",
      "text": null
    },
    {
      "news_title": "Israel begins invasion of Gaza City",
      "news_link": "https://www.stuff.co.nz/world-news/360798248/israel-begins-invasion-gaza-city",
      "bias": "Lean Left",
      "text": null
    },
    {
      "news_title": "What to know about Israel's plan to call up 60,000 reservists",
      "news_link": "https://www.theglobeandmail.com/world/video-what-to-know-about-israels-plan-to-call-up-60000-reservists/",
      "bias": "Center",
      "text": "What to know about Israel's plan to call up 60,000 reservists\nThe Associated Press\nThe Israeli military said Wednesday that the country’s defence minister approved plans to begin a new phase of operations in some of Gaza’s most densely populated areas, and that it would call up 60,000 reservists and lengthen the service of an additional 20,000 reservists currently serving.\nThe Associated Press"
    },
    {
      "news_title": "Netanyahu orders faster timetable for Gaza City offensive against Hamas",
      "news_link": "https://bnonews.com/index.php/2025/08/netanyahu-orders-faster-timetable-for-gaza-city-offensive-against-hamas/",
      "bias": "Center",
      "text": "World\nNetanyahu orders faster timetable for Gaza City offensive against Hamas\nIsraeli Prime Minister Benjamin Netanyahu has ordered military commanders to shorten their timetables for seizing control of Gaza City and defeating Hamas, according to his office.\n“Ahead of approval of the plans for the operation in Gaza City, Prime Minister Benjamin Netanyahu has directed that the timetables – for seizing control of the last terrorist strongholds and the defeat of Hamas – be shortened,” Netanyahu’s office announced on Wednesday.\nThe IDF said around 60,000 reserve orders were issued Tuesday morning, with service extended for 20,000 reservists, as part of the next phase of Operation “Gideon’s Chariots.”\nIsrael announced its plan to conquer the entire Gaza Strip after indirect talks with Hamas over a ceasefire and hostage release broke down last month.\nAccording to the BBC, hundreds of thousands of Palestinians in Gaza City are expected to be told to evacuate to shelters in southern Gaza ahead of the offensive.\nQatar and Egypt have proposed a 60-day truce that would include the release of about half of the 50 hostages still held in Gaza, a plan Hamas said it accepted on Monday.\nIsraeli officials have said they will not accept a partial deal and are insisting on the release of all hostages, of whom only 20 are believed to be alive.\n-\nWorld1 week ago\n5.6-magnitude earthquake hits Queensland, felt in Brisbane\n-\nUS News7 days ago\nExplosion reported as cargo ship catches fire in Baltimore Harbor\n-\nLegal4 days ago\nCalifornia Amber Alert: 2 boys abducted from foster care in Los Angeles\n-\nPolitics6 days ago\nJustice Department eases enforcement of D.C. rifle and shotgun ban\n-\nBusiness19 hours ago\nBitcoin goes below $113,000 in sudden market drop\n-\nPolitics1 week ago\nTrump says Zelenskyy can end war by giving up NATO bid and Crimea\n-\nWorld4 days ago\nColombian police helicopter shot down during anti-narcotics mission; 10 killed\n-\nUS News1 week ago\nMandatory evacuation issued for Hatteras Island, NC ahead of Hurricane Erin impacts"
    },
    {
      "news_title": "IDF launches invasion of Gaza City, repels massive Hamas attack",
      "news_link": "https://worldisraelnews.com/idf-launches-invasion-of-gaza-city-repels-massive-hamas-attack/",
      "bias": "Right",
      "text": "IDF launches invasion of Gaza City, repels massive Hamas attack August 20, 2025IDF troops operating in Khan Yunis. (Twitter Screenshot)(Twitter Screenshot)IDF launches invasion of Gaza City, repels massive Hamas attack Tweet Join Group Join WhatsApp Group Email https://worldisraelnews.com/idf-launches-invasion-of-gaza-city-repels-massive-hamas-attack/ Email Print Ten terrorists were killed in exchanges of fire and in airstrikes; Three IDF soldiers were wounded, one seriously.By Vered Weiss, World Israel NewsThe IDF has launched the first phase of its invasion of Gaza City, with forces now holding positions on the outskirts of the city, IDF Spokesman Brig.-Gen. Effie Defrin confirmed on Wednesday.He said 60,000 conscription letters will be issued this week, with another 20,000 later this month, as Israel intensifies operations to dismantle Hamas strongholds.Defrin added that the army is working to secure evacuation routes and designated areas for civilians, allowing Gazans access to humanitarian aid and medical treatment.The announcement came hours after IDF soldiers repelled one of the largest Hamas raids in months.At least 18 terrorists emerged from a tunnel near Khan Yunis and opened fire with machine guns and RPGs, attempting to storm an IDF encampment.Ten of the attackers were killed in exchanges of fire and in airstrikes, while others fled back into the tunnel.Three Israeli soldiers from the Kfir Brigade were wounded in the battle, one seriously.Footage released by the IDF showed airstrikes and tanks targeting the attackers, including a scene in which a Hamas terrorist was neutralized at close range.Read WATCH: 'Israel will do to Gaza what the US did to Tokyo and Berlin during WWII,' says Lindsey GrahamPrime Minister Benjamin Netanyahu and Defense Minister Israel Katz are expected Thursday to approve the military’s plan for the conquest of Gaza City.The meeting takes place amid a Hamas-backed proposal, mediated by Egypt and Qatar, for a partial deal that would involve a 60-day ceasefire and the release of 10 living hostages.Netanyahu has ordered the timeline for operations to be accelerated.“Shorten the timeline for taking control of the last terrorist strongholds and defeating Hamas,” he said.Mediating officials told The Jerusalem Post the outline is close to an earlier framework accepted by Israel, with remaining gaps that “can be bridged within days.” Gaza CityIDFkhan yunis"
    },
    {
      "news_title": "As IDF calls up 60,000 reservists, Israel wrestles with motivation, service, sacrifice",
      "news_link": "https://www.jpost.com/israel-news/defense-news/article-864829",
      "bias": "Center",
      "text": "As IDF calls up 60,000 reservists, Israel wrestles with motivation, service, sacrifice - analysis\nIsrael has always wrestled with questions of motivation, service, and sacrifice. Yet when tested, the country has rediscovered its resolve.\nIsraeli soldiers stand atop military vehicles as seen from the Israeli side of the Gaza border, August 18, 2025(photo credit: REUTERS/AMIR COHEN)ByHERB KEINONUpdated:"
    },
    {
      "news_title": "Israeli military begins new offensive targeting Gaza City",
      "news_link": "https://www.longwarjournal.org/archives/2025/08/israeli-military-begins-new-offensive-targeting-gaza-city.php",
      "bias": "Lean Right",
      "text": "On August 19, the Israeli Defense Forces (IDF) began the opening maneuvers of a new offensive aimed at uprooting Hamas from Gaza City. The first moves, with tanks and infantry, began after the Israeli security cabinet approved plans in mid-August for a new operation in Gaza. The goal is to expand on IDF gains that took place between May and July 2025 and move forces into Gaza City and possibly also the Central Camps area of the territory. The IDF has not controlled all of Gaza City nor the Central Camps during the war.\nThe Israeli offensive comes as hostage and ceasefire talks are ongoing. Although the new offensive in Gaza City has been critiqued abroad, Israeli Prime Minister Benjamin Netanyahu has said it is necessary to defeat Hamas. Israel’s Ynet reported on August 19 that Israeli tanks had advanced into the Sabra neighborhood of Gaza City. The IDF was also reportedly operating in Zeitoun, a suburb of Gaza City that the IDF operated in several times in 2024.\nIsrael is calling up 60,000 reservists for the new operation in Gaza. Israeli Defense Minister Israel Katz approved plans for the occupation of Gaza City on August 19. The plan is dubbed Gideon’s Chariot II, an indicator of its intent to build on Gideon’s Chariots, the operation that began in May and seized around 75 percent of Gaza from Hamas. That effort primarily retook areas the IDF had already cleared and operated in during late 2023 and 2024. In many cases, the IDF had maneuvered into neighborhoods such as Beit Hanoun and then left them. Gideon’s Chariots aimed to secure and hold these areas.\nIDF Spokesperson Brigadier General Effie Defrin said on August 20 that “from a military terrorist organization, [Hamas] has become a battered and bruised guerrilla organization.” Israel’s Prime Minister’s Office put out a statement the same day that noted, “Ahead of approval of the plans for the operation in Gaza City, Prime Minister Benjamin Netanyahu has directed that the timetables—for seizing control of the last terrorist strongholds and the defeat of Hamas—be shortened.”\nGaza City is a large urban area comprising numerous neighborhoods and a ring of suburbs that extend around northern Gaza. Around five IDF divisions are expected to take part in the new campaign. A similar number of divisions took part in Gideon’s Chariots and during intense periods of fighting in Gaza earlier in the war.\nHamas continues to try to carry out attacks. The IDF said on August 20 that 15 “terrorists fired both gunfire and anti-tank missiles and attempted to infiltrate a fortified position of the 90th battalion, Kfir Brigade, in the area of Khan Yunis. During the incident, the troops were able to eliminate ten armed terrorists in close-quarters combat, supported by Israel Air Force airstrikes.”\nIn Jabalia in northern Gaza, the IDF’s 162nd Division also continued operations. “As part of their activity, the troops are dismantling military infrastructures above and below ground, eliminating terrorists, and consolidating operational control in the area. This enables the expansion of the operation to additional locations and prevents terrorist organizations from returning to their positions,” the IDF stated.\nAs part of the prelude to the beginning of Gideon’s Chariots II, IDF Chief of the General Staff Eyal Zamir went to Gaza and met with the 36th Division. “You have been fighting for nearly two consecutive years, achieving unprecedented accomplishments that bring security to the communities near the Gaza Strip and to all the civilians of Israel. I am proud of you. The IDF bears the moral duty to bring the hostages home, both alive and fallen,” Zamir said."
    },
    {
      "news_title": "Israel enters first stages of its assault on Gaza City",
      "news_link": "https://www.msnbc.com/katy-tur/watch/israel-enters-first-stages-of-its-assault-on-gaza-city-245371461966",
      "bias": "Left",
      "text": "Israel enters first stages of its assault on Gaza City\n02:20\nShare this -\nCopied\nIsrael just began the first stages of its assault on Gaza City. Israel says the takeover is intended to prevent Hamas from planning future attacks. However, it is expected to displace thousands of Palestinians. NBC News International Correspondent Daniele Hamamdjian joins Katy Tur to report the latest updates.Aug. 20, 2025\nUP NEXT\nGhislaine Maxwell: 'There's no list'\n02:49\nFBI's search of Bolton will have 'extraordinary chilling effect': Rep. Quigley\n04:43\nFBI and DOJ being 'politicized' in way 'we've never seen in modern history': Dilanian\n11:06\nFirst Listen of DOJ's interview with Ghislaine Maxwell\n08:59\nDOJ releases Ghislaine Maxwell audio and transcripts from Blanche interview\n11:33\nWhite House and GOP reassure Americans Trump's economy is strong, no concerns"
    },
    {
      "news_title": "Israeli plan that could end the two state solution explained",
      "news_link": "https://www.channel4.com/news/israeli-plan-that-could-end-the-two-state-solution-explained",
      "bias": "Lean Left",
      "text": "Israel’s government also gave approval to a major settlement plan in the occupied West Bank that would effectively cut the Palestinian territory in two.\nThe Israeli military also says it has begun the first stages of its offensive on Gaza City and claims it has a hold on some of the city’s outskirts. It’s begun calling up 60,000 army reservists, while it has yet to respond to a ceasefire and partial hostage release deal already agreed to by Hamas."
    },
    {
      "news_title": "Israel says it’s in control of area in outskirts of Gaza City, ready to call up 60K more troops",
      "news_link": "https://globalnews.ca/video/11343094/israel-says-its-in-control-of-area-in-outskirts-of-gaza-city-ready-to-call-up-60k-more-troops",
      "bias": "Lean Left",
      "text": "Israel says it’s in control of area in outskirts of Gaza City, ready to call up 60K more troops\nVideos\n-\nIsrael says it’s in control of area in outskirts of Gaza City, ready to call up 60K more troops\n02:11 | August 20, 2025\n-\nGaza City braces for Israeli assault\n02:10 | August 24, 2025\n-\nCarney won’t rule out Canadian troops in Ukraine as part of security guarantees\n02:22 | August 24, 2025\n-\n‘Canada will always stand in solidarity with Ukraine,’ says Carney on Ukraine Independence day\n02:35 | August 24, 2025\n-\nUkrainians around the world mark 34th Independence Day from Soviet Union\n02:08 | August 23, 2025\n-\nIsraeli airstrikes kill at least 25 more Palestinians in Gaza seeking aid and shelter\n01:52 | August 23, 2025\n-\nUN-backed monitor declares famine in Gaza City\n02:49 | August 22, 2025\n-\nFamine declared in Gaza City, UN calls situation ‘unmistakable’\n03:01 | August 22, 2025\n-\nAttack on police helicopter leaves 12 dead in Colombia\n01:34 | August 22, 2025\n-\nNetanyahu approves Gaza City takeover plan\n02:13 | August 21, 2025\n-\nRussia unleashes large bombardment on Ukraine, brushes off Western efforts for peace\n02:12 | August 21, 2025\n-\nIsrael pushes ahead with Gaza City takeover amid renewed ceasefire talks\n02:12 | August 21, 2025\n-\nMaduro says Trump ordered U.S. anti-drug mission in Venezuela as pretext for intervention\n01:48 | August 21, 2025\n-\nRussia hits Ukraine with 550+ drones, missiles in overnight attack\n01:27 | August 21, 2025\n-\nIsrael begins ‘preliminary actions’ on Gaza City offensive\n02:25 | August 20, 2025\n-\nRussia says it must be included in talks on Ukraine’s security\n02:16 | August 20, 2025\n-\nAustralia’s Albanese responds to ‘weak politician’ remark from Netanyahu amid diplomatic spat\n01:39 | August 20, 2025\n-\nAfghanistan bus crash kills nearly 80, including children expelled from Iran\n01:31 | August 20, 2025\n-\nWhy a Swedish town is moving its historic church to new site\n02:08 | August 19, 2025\n-\nIsrael mulling Gaza ceasefire proposal accepted by Hamas\n02:01 | August 19, 2025\n-\nTrump seeks trilateral talks with Putin, Zelenskyy over Russia’s war on Ukraine\n02:10 | August 19, 2025\n-\nTrump says China won’t attack Taiwan on his watch, island maintains it must rely on its own security\n01:16 | August 19, 2025\n-\nMore floods sweep through Northern Pakistan\n02:03 | August 19, 2025\n-\n‘No tennis for genocide!’ Activists call for boycott of Davis Cup against Israel\n08:37 | August 19, 2025\n-\nHumanoid robots compete and crash at China’s first ‘robot Olympics’\n02:09 | August 18, 2025\n-\nUkrainians skeptical about Russia peace deal\n02:00 | August 18, 2025\n-\nTrump, Zelenskyy, European leaders meet for talks to end Ukraine war\n02:20 | August 18, 2025\n-\nPutin-Zelenskyy meeting to take place within 2 weeks, trilateral summit with Trump to follow: Merz\n01:09 | August 18, 2025\n-\nSon of Norway’s crown princess charged with rape and assault\n01:06 | August 18, 2025\n-\nZelenskyy, European leaders strategize ahead of Trump meeting in Washington\n02:13 | August 17, 2025\n-\nSouth Asia flooding: Why the Kashmir region is increasingly susceptible to climate change\n01:54 | August 16, 2025\n-\nIsrael says it’s in control of area in outskirts of Gaza City, ready to call up 60K more troops\n02:11 | August 20, 2025\n-\nGaza City braces for Israeli assault\n02:10 | August 24, 2025\n-\nCarney won’t rule out Canadian troops in Ukraine as part of security guarantees\n02:22 | August 24, 2025\n-\n‘Canada will always stand in solidarity with Ukraine,’ says Carney on Ukraine Independence day\n02:35 | August 24, 2025\n-\nUkrainians around the world mark 34th Independence Day from Soviet Union\n02:08 | August 23, 2025\n-\nIsraeli airstrikes kill at least 25 more Palestinians in Gaza seeking aid and shelter\n01:52 | August 23, 2025\n-\nUN-backed monitor declares famine in Gaza City\n02:49 | August 22, 2025\n-\nFamine declared in Gaza City, UN calls situation ‘unmistakable’\n03:01 | August 22, 2025\n-\nAttack on police helicopter leaves 12 dead in Colombia\n01:34 | August 22, 2025\n-\nNetanyahu approves Gaza City takeover plan\n02:13 | August 21, 2025\n-\nRussia unleashes large bombardment on Ukraine, brushes off Western efforts for peace\n02:12 | August 21, 2025\n-\nIsrael pushes ahead with Gaza City takeover amid renewed ceasefire talks\n02:12 | August 21, 2025\n-\nMaduro says Trump ordered U.S. anti-drug mission in Venezuela as pretext for intervention\n01:48 | August 21, 2025\n-\nRussia hits Ukraine with 550+ drones, missiles in overnight attack\n01:27 | August 21, 2025\n-\nIsrael begins ‘preliminary actions’ on Gaza City offensive\n02:25 | August 20, 2025\n-\nRussia says it must be included in talks on Ukraine’s security\n02:16 | August 20, 2025\n-\nAustralia’s Albanese responds to ‘weak politician’ remark from Netanyahu amid diplomatic spat\n01:39 | August 20, 2025\n-\nAfghanistan bus crash kills nearly 80, including children expelled from Iran\n01:31 | August 20, 2025\n-\nWhy a Swedish town is moving its historic church to new site\n02:08 | August 19, 2025\n-\nIsrael mulling Gaza ceasefire proposal accepted by Hamas\n02:01 | August 19, 2025\n-\nTrump seeks trilateral talks with Putin, Zelenskyy over Russia’s war on Ukraine\n02:10 | August 19, 2025\n-\nTrump says China won’t attack Taiwan on his watch, island maintains it must rely on its own security\n01:16 | August 19, 2025\n-\nMore floods sweep through Northern Pakistan\n02:03 | August 19, 2025\n-\n‘No tennis for genocide!’ Activists call for boycott of Davis Cup against Israel\n08:37 | August 19, 2025\n-\nHumanoid robots compete and crash at China’s first ‘robot Olympics’\n02:09 | August 18, 2025\n-\nUkrainians skeptical about Russia peace deal\n02:00 | August 18, 2025\n-\nTrump, Zelenskyy, European leaders meet for talks to end Ukraine war\n02:20 | August 18, 2025\n-\nPutin-Zelenskyy meeting to take place within 2 weeks, trilateral summit with Trump to follow: Merz\n01:09 | August 18, 2025\n-\nSon of Norway’s crown princess charged with rape and assault\n01:06 | August 18, 2025\n-\nZelenskyy, European leaders strategize ahead of Trump meeting in Washington\n02:13 | August 17, 2025\n-\nSouth Asia flooding: Why the Kashmir region is increasingly susceptible to climate change\n01:54 | August 16, 2025\nIsrael says it’s in control of area in outskirts of Gaza City, ready to call up 60K more troops\nDescription\nAugust 20, 2025\nHamas has agreed to one version of a ceasefire saying it will release half of its Israeli hostages. Israel, though, wants all of them free and looks set to continue its campaign, with a military official saying it will call up 60,000 reservists. Another Israeli spokesperson says the offensive has already begun with troops controlling an area in the outskirts of Gaza City. Global’s Nathaniel Dove reports.\n-\nIsrael says it’s in control of area in outskirts of Gaza City, ready to call up 60K more troops02:11 | August 20, 2025\n-\nGaza City braces for Israeli assault02:10 | August 24, 2025\n-\nCarney won’t rule out Canadian troops in Ukraine as part of security guarantees02:22 | August 24, 2025\n-\n‘Canada will always stand in solidarity with Ukraine,’ says Carney on Ukraine Independence day02:35 | August 24, 2025\n-\nUkrainians around the world mark 34th Independence Day from Soviet Union02:08 | August 23, 2025\n-\nIsraeli airstrikes kill at least 25 more Palestinians in Gaza seeking aid and shelter01:52 | August 23, 2025\n-\nUN-backed monitor declares famine in Gaza City02:49 | August 22, 2025\n-\nFamine declared in Gaza City, UN calls situation ‘unmistakable’03:01 | August 22, 2025\n-\nAttack on police helicopter leaves 12 dead in Colombia01:34 | August 22, 2025\n-\nNetanyahu approves Gaza City takeover plan02:13 | August 21, 2025\n-\nRussia unleashes large bombardment on Ukraine, brushes off Western efforts for peace02:12 | August 21, 2025\n-\nIsrael pushes ahead with Gaza City takeover amid renewed ceasefire talks02:12 | August 21, 2025\n-\nMaduro says Trump ordered U.S. anti-drug mission in Venezuela as pretext for intervention01:48 | August 21, 2025\n-\nRussia hits Ukraine with 550+ drones, missiles in overnight attack01:27 | August 21, 2025\n-\nIsrael begins ‘preliminary actions’ on Gaza City offensive02:25 | August 20, 2025\n-\nRussia says it must be included in talks on Ukraine’s security02:16 | August 20, 2025\n-\nAustralia’s Albanese responds to ‘weak politician’ remark from Netanyahu amid diplomatic spat01:39 | August 20, 2025\n-\nAfghanistan bus crash kills nearly 80, including children expelled from Iran01:31 | August 20, 2025\n-\nWhy a Swedish town is moving its historic church to new site02:08 | August 19, 2025\n-\nIsrael mulling Gaza ceasefire proposal accepted by Hamas02:01 | August 19, 2025\n-\nTrump seeks trilateral talks with Putin, Zelenskyy over Russia’s war on Ukraine02:10 | August 19, 2025\n-\nTrump says China won’t attack Taiwan on his watch, island maintains it must rely on its own security01:16 | August 19, 2025\n-\nMore floods sweep through Northern Pakistan02:03 | August 19, 2025\n-\n‘No tennis for genocide!’ Activists call for boycott of Davis Cup against Israel08:37 | August 19, 2025\n-\nHumanoid robots compete and crash at China’s first ‘robot Olympics’02:09 | August 18, 2025\n-\nUkrainians skeptical about Russia peace deal02:00 | August 18, 2025\n-\nTrump, Zelenskyy, European leaders meet for talks to end Ukraine war02:20 | August 18, 2025\n-\nPutin-Zelenskyy meeting to take place within 2 weeks, trilateral summit with Trump to follow: Merz01:09 | August 18, 2025\n-\nSon of Norway’s crown princess charged with rape and assault01:06 | August 18, 2025\n-\nZelenskyy, European leaders strategize ahead of Trump meeting in Washington02:13 | August 17, 2025\n-\nSouth Asia flooding: Why the Kashmir region is increasingly susceptible to climate change01:54 | August 16, 2025\n-\nIsrael says it’s in control of area in outskirts of Gaza City, ready to call up 60K more troops02:11 | August 20, 2025\n-\nGaza City braces for Israeli assault02:10 | August 24, 2025\n-\nCarney won’t rule out Canadian troops in Ukraine as part of security guarantees02:22 | August 24, 2025\n-\n‘Canada will always stand in solidarity with Ukraine,’ says Carney on Ukraine Independence day02:35 | August 24, 2025\n-\nUkrainians around the world mark 34th Independence Day from Soviet Union02:08 | August 23, 2025\n-\nIsraeli airstrikes kill at least 25 more Palestinians in Gaza seeking aid and shelter01:52 | August 23, 2025\n-\nUN-backed monitor declares famine in Gaza City02:49 | August 22, 2025\n-\nFamine declared in Gaza City, UN calls situation ‘unmistakable’03:01 | August 22, 2025\n-\nAttack on police helicopter leaves 12 dead in Colombia01:34 | August 22, 2025\n-\nNetanyahu approves Gaza City takeover plan02:13 | August 21, 2025\n-\nRussia unleashes large bombardment on Ukraine, brushes off Western efforts for peace02:12 | August 21, 2025\n-\nIsrael pushes ahead with Gaza City takeover amid renewed ceasefire talks02:12 | August 21, 2025\n-\nMaduro says Trump ordered U.S. anti-drug mission in Venezuela as pretext for intervention01:48 | August 21, 2025\n-\nRussia hits Ukraine with 550+ drones, missiles in overnight attack01:27 | August 21, 2025\n-\nIsrael begins ‘preliminary actions’ on Gaza City offensive02:25 | August 20, 2025\n-\nRussia says it must be included in talks on Ukraine’s security02:16 | August 20, 2025\n-\nAustralia’s Albanese responds to ‘weak politician’ remark from Netanyahu amid diplomatic spat01:39 | August 20, 2025\n-\nAfghanistan bus crash kills nearly 80, including children expelled from Iran01:31 | August 20, 2025\n-\nWhy a Swedish town is moving its historic church to new site02:08 | August 19, 2025\n-\nIsrael mulling Gaza ceasefire proposal accepted by Hamas02:01 | August 19, 2025\n-\nTrump seeks trilateral talks with Putin, Zelenskyy over Russia’s war on Ukraine02:10 | August 19, 2025\n-\nTrump says China won’t attack Taiwan on his watch, island maintains it must rely on its own security01:16 | August 19, 2025\n-\nMore floods sweep through Northern Pakistan02:03 | August 19, 2025\n-\n‘No tennis for genocide!’ Activists call for boycott of Davis Cup against Israel08:37 | August 19, 2025\n-\nHumanoid robots compete and crash at China’s first ‘robot Olympics’02:09 | August 18, 2025\n-\nUkrainians skeptical about Russia peace deal02:00 | August 18, 2025\n-\nTrump, Zelenskyy, European leaders meet for talks to end Ukraine war02:20 | August 18, 2025\n-\nPutin-Zelenskyy meeting to take place within 2 weeks, trilateral summit with Trump to follow: Merz01:09 | August 18, 2025\n-\nSon of Norway’s crown princess charged with rape and assault01:06 | August 18, 2025\n-\nZelenskyy, European leaders strategize ahead of Trump meeting in Washington02:13 | August 17, 2025\n-\nSouth Asia flooding: Why the Kashmir region is increasingly susceptible to climate change01:54 | August 16, 2025\nIsrael says it’s in control of area in outskirts of Gaza City, ready to call up 60K more troops\nDescription\nAugust 20, 2025\nHamas has agreed to one version of a ceasefire saying it will release half of its Israeli hostages. Israel, though, wants all of them free and looks set to continue its campaign, with a military official saying it will call up 60,000 reservists. Another Israeli spokesperson says the offensive has already begun with troops controlling an area in the outskirts of Gaza City. Global’s Nathaniel Dove reports.\nNational News\n-\nU.S. National Guard troops carry weapons while patrolling D.C. streets2:026 hours ago\n-\nCanada to quadruple Canada’s defence spending by 2030: Carney2:335 hours ago\n-\nOutrage after Florida officials paint over rainbow crosswalk memorial for Pulse nightclub shooting2:1617 hours ago\n-\nTrump plans to send National Guard to Chicago2:1117 hours ago\n-\nGaza City braces for Israeli assault2:106 hours ago\n-\nCarney details spending in Ukraine, won’t rule out Canadian troops2:576 hours ago\n-\nCalifornia wildfires: Firefighters ‘confident’ despite growth of Pickett Fire1:5218 hours ago\n-\nCarney won’t rule out Canadian troops in Ukraine as part of security guarantees2:221 day ago\n-\nWhy are U.S. states racing to redraw voting maps ahead of 2026 mid-term elections?8:271 day ago\n-\n‘Canada will always stand in solidarity with Ukraine,’ says Carney on Ukraine Independence day2:351 day ago\nAdvertisement\nTop News\n-\nCanada to quadruple Canada’s defence spending by 2030: Carney2:335 hours ago\n-\nCarney details spending in Ukraine, won’t rule out Canadian troops2:576 hours ago\n-\n‘Canada will always stand in solidarity with Ukraine,’ says Carney on Ukraine Independence day2:351 day ago\n-\nCarney dropping US tariffs under CUSMA, a one-sided bargain?3:163 days ago\n-\nCarney’s elbows ‘mysteriously gone missing’ as he removes retaliatory tariffs on U.S.: Poilievre2:513 days ago\n-\nCarney holds ‘substantive and lengthy’ call with Trump as U.S. trade war stretches on2:014 days ago\n-\n‘Inhumanity’: France probes death of man on livestream after violence, humiliation1:324 days ago\n-\n‘The ocean is speaking’ : Hurricane Erin stirs powerful flooding along North Carolina’s Outer Banks1:454 days ago\n-\nAustralia’s Albanese responds to ‘weak politician’ remark from Netanyahu amid diplomatic spat1:395 days ago\n-\nAfghanistan bus crash kills nearly 80, including children expelled from Iran1:314 days ago\nSponsored Content\nTrending\n-\nLong Lake fire keeps grows as province issues update on wildfire situation2:017 days ago\n-\nCourt documents offer new details about missing N.S. siblings, Lilly and Jack Sullivan0:292 days ago\n-\nSearch continues for missing Norwegian hiker4:334 days ago\n-\nA look at tipping culture and whether people can afford it2:0412 months ago\n-\nNew chapter in trade dispute with U.S. as Canada drops retaliatory tariffs3:486 hours ago\nCanada\n-\nAtlantic Canada wild blueberry farmers warn of steep losses amid drought1:586 hours ago\n-\n‘Canada will always stand in solidarity with Ukraine,’ says Carney on Ukraine Independence day2:351 day ago\n-\nCarney in Europe seeking economic alliances, peace for Ukraine2:162 days ago\n-\nCanadian industries split after Carney drops tariffs against US products under CUSMA2:033 days ago\n-\n‘Unanimous no’: End of road for Universal Ostrich Farm as it loses final appeal2:063 days ago\n-\nCalls for action after 8-year-old boy shot and killed2:063 days ago\n-\nCanada’s 1st dinosaur-era dragonfly fossil unearthed2:055 days ago\n-\n60 trapped hikers rescued from flash flood in Bugaboo Provincial Park1:434 days ago\n-\nCanadians divided on Indigenous issues, poll finds2:054 days ago\n-\nCarney gets red carpet treatment in Montreal1:555 days ago\nU.S. News\n-\nCalifornia wildfires: Firefighters ‘confident’ despite growth of Pickett Fire1:5218 hours ago\n-\nFBI raids Trump’s ex-national security adviser John Bolton’s home2:013 days ago\n-\nCalifornia lawmakers pass Democrat redistricting plan ahead of vote on congressional map2:513 days ago\n-\nFirefighters rescue 40-year-old man stuck in slide at children’s playground in Connecticut0:323 days ago\n-\nFrank Caprio, ‘nicest judge in the world,’ dead at 882:114 days ago\n-\n‘It’s about control’: Locals slam Trump’s D.C. takeover2:084 days ago\n-\n‘Scary’: California resident tests positive for bubonic plague after camping near Lake Tahoe1:294 days ago\n-\nCalifornia democrats to counter Texas with vote on new congressional map1:474 days ago\n-\nBoxer Julio César Chávez Jr. deported from U.S., jailed in Mexico0:295 days ago\n-\n2 U.S. tourists drown in separate incidents on Carnival Cruises resort1:171 week ago\nAdvertisement\nWorld\n-\nGaza City braces for Israeli assault2:106 hours ago\n-\nCarney won’t rule out Canadian troops in Ukraine as part of security guarantees2:221 day ago\n-\n‘Canada will always stand in solidarity with Ukraine,’ says Carney on Ukraine Independence day2:351 day ago\n-\nUkrainians around the world mark 34th Independence Day from Soviet Union2:082 days ago\n-\nB.C. Ukrainians getting ready to mark their homeland’s independence day2:152 days ago\n-\nIsraeli airstrikes kill at least 25 more Palestinians in Gaza seeking aid and shelter1:522 days ago\n-\nCountdown to 2026 FIFA World Cup6:062 days ago\n-\nSmart strategy or giving in? Canada drops some retaliatory tariffs against the U.S.4:392 days ago\n-\nUN-backed monitor declares famine in Gaza City2:493 days ago\n-\nFamine declared in Gaza City, UN calls situation ‘unmistakable’3:013 days ago\nPolitics\n-\nB.C.’s Jobs Minister weighs in on Ottawa’s decision to drop some retaliatory U.S tariffs5:135 hours ago\n-\nYWCA, Elizabeth Fry Society and Adsum for Women and Children partner on call-to-action for sustained WAGE funding at federal level5:567 hours ago\n-\nOutrage after Florida officials paint over rainbow crosswalk memorial for Pulse nightclub shooting2:1617 hours ago\n-\nTrump plans to send National Guard to Chicago2:1117 hours ago\n-\nCarney details spending in Ukraine, won’t rule out Canadian troops2:576 hours ago\n-\nHalifax joins Ukraine Independence celebrations2:0722 hours ago\n-\nNew chapter in trade dispute with U.S. as Canada drops retaliatory tariffs3:486 hours ago\n-\nPetition to amalgamate White Rock and Surrey3:341 day ago\n-\nRemoving US retaliatory tariffs garners mixed reaction for Carney3:112 days ago\n-\nCarney in Europe seeking economic alliances, peace for Ukraine2:162 days ago\nHealth and Wellness\n-\nAlberta government reveals cost to get COVID-19 vaccine for most citizens1:483 days ago\n-\nBed shortage leaves N.B. seniors stuck in hospitals1:483 days ago\n-\nHealth Matters: Safety risks linked to baby nests and loungers2:414 days ago\n-\nHealth Matters: Burgers to Beat MS Campaign4:524 days ago\n-\nLake Country woman urges self-advocacy after early cancer diagnosis1:424 days ago\n-\nLung cancer a growing concern for non-smokers2:045 days ago\n-\nBack to school bus experience helps children with diverse needs prepare to head back to classes1:124 days ago\n-\nInconsistent home care leaves families hurting1:436 days ago\n-\nEmpowering potential: How Resilient Hearts is changing lives in Calgary4:286 days ago\n-\nHealth Checkup: Family planning choices5:134 days ago\nAdvertisement\nInvestigative News\n-\nCourt docs reveal CSIS told RCMP about alleged Quebec militia members2:053 days ago\n-\nPotential hate crime suspect photos released by Kelowna RCMP2:194 days ago\n-\nClear-cutting and what role it may have played in wildfire situation2:037 days ago\n-\nB.C. woman wrongly declared ‘deceased’ by federal Vaccine Injury Support Program2:591 week ago\n-\nHow did a Chinese company win a contract with BC Ferries?2:062 weeks ago\n-\nCBS News investigation claims to find discrepancies in FBI Epstein jail video9:463 weeks ago\n-\nOttawa will ‘try’ to improve Vaccine Injury Support Program: health minister1:121 month ago\n-\n‘Slap in the face’: Calls for investigation into Vaccine Injury Support Program2:411 month ago\n-\nFederal Vaccine Injury Support Program leaving some injured people waiting for years3:012 months ago\n-\n‘Chaos’ inside Federal Vaccine Injury Support Program4:032 months ago\nNews Bloopers\n-\n‘Can’t use that on TV’: Watch a Global News reporter jump from the highest bungee jump in Canada0:364 months ago\n-\nBlack bear in tree has rough landing after being tranquilized at Halifax-area park0:4811 months ago\n-\nEdmonton, B.C. morning show hosts settle NHL playoff bet3:0515 months ago\n-\n‘You can’t make this stuff up:’ Loud clap of thunder interrupts live TV segment at pivotal moment0:2423 months ago\n-\nGlobal Calgary weather anchor startled by surprise guest appearance0:2127 months ago\n-\nFun times? Global News personalities help clear snow in search of ‘fun’ story2:0034 months ago\n-\n‘Buzzworthy moment’: Colin D’Mello recaps Doug Ford accidentally swallowing a bee1:5736 months ago\n-\n‘Did you just call me daddy?’: Morning show hosts can’t hold back laughter after on-air mixup1:1437 months ago\n-\nB.C. dad hoping to see his cloud photo on TV get his wish following viral TikTok campaign2:1140 months ago\n-\nBloopers: Phil Darlington slips, slides and falls in these Our Winter City outtakes1:3834 months ago"
    },
    {
      "news_title": "Israel enters first stage of planned assault on Gaza City",
      "news_link": "https://www.cnbc.com/2025/08/20/israel-enters-first-stage-of-planned-assault-on-gaza-city.html",
      "bias": "Center",
      "text": "Israel on Wednesday entered the first stages of its planned assault on Gaza City after approving a plan to take over the city that includes calling up 60,000 reservists for its expanded military operation in the besieged Palestinian enclave.\n\"We have begun the preliminary actions and the initial stages of the offensive on Gaza City, and already now IDF forces are holding positions on the outskirts of Gaza City,\" Israeli military spokesman Effie Defrin told reporters on Wednesday.\nHe added: \"We will intensify the strikes on Hamas in Gaza City, the political and military stronghold of the terror organization.\"\nDefrin also said that to \"minimize harm to civilians,\" the IDF will be warning citizens to allow them to evacuate.\n\"We are continuing to allow humanitarian aid for the residents of the Strip and are even expanding it — with additional central aid distribution points,\" he said.\nThe U.S. ally appeared to be pushing ahead Wednesday with a new phase of its war despite international opposition — and in the face of a renewed push for a ceasefire with Hamas.\nDefense Minister Israel Katz has authorized the plans for the major new operation, a spokesperson for the ministry confirmed to NBC News. It will also see an additional 20,000 reservists have their service extended, the Israeli military said.\nRead more on NBC News\nHundreds of thousands protest Gaza war as frustration grows in Israel about new offensive\nHamas accepts an Arab ceasefire proposal on Gaza as Palestinian death toll passes 62,000\nIsrael announces West Bank settlement that rights groups say could imperil Palestinian state\nThe assault is expected to force thousands of Palestinians in northern Gaza to the south of the strip, which is suffering an intensifying hunger crisis under Israel's military offensive and aid restrictions.\nIn a Wednesday night statement, the Prime Minister's office said that \"ahead of approval of the plans for the operation in Gaza City, Prime Minister Benjamin Netanyahu has directed that the timetables — for seizing control of the last terrorist strongholds and the defeat of Hamas — be shortened.\"\n\"The Prime Minister expresses his great appreciation for the reservist fighters who have been mobilized and their families, and all IDF soldiers,\" the statement added. \"Together we will win.\"\nHamas did not issue an immediate response to the announcement about Israeli troops taking up positions outside Gaza City.\nScores of people have been killed by starvation in recent weeks, including dozens of children, according to the Palestinian health ministry in the enclave.\nIn addition to mounting global outrage, sweeping protests have increasingly dominated its own streets, with growing numbers of Israelis demanding an end to its offensive in the enclave.\nHundreds of thousands staged furious demonstrations last weekend alongside a general strike, fueled in part by fears that the planned Gaza City assault could endanger the lives of remaining hostages.\nMeanwhile, Israel also gave final approval for a widely contested settlement project in the occupied West Bank that would effectively split the territory in two. Palestinians and rights groups have warned the move could destroy plans for a future Palestinian state.\nCeasefire talks uncertain\nKatz, who replaced Yoav Gallant as defense minister last year, was on Tuesday holding a discussion to approve \"strike plans in Gaza\" with Israel Defense Forces Chief of Staff, Lt. Gen. Eyal Zamir and other senior defense officials, the defense ministry had said.\nThe announcement of the expanded military operation comes after Israel appeared to shrug off Hamas' agreement to the latest proposal from Arab mediators for a ceasefire deal in Gaza that would free hostages who remain held in the enclave.\nEgyptian Foreign Minister Badr Abdelatty told NBC News on Tuesday that the deal was based on a proposal by President Donald Trump's Middle East envoy, Steve Witkoff, for a 60-day ceasefire, during which some of the remaining 50 hostages, both alive and dead, would be released with plans to negotiate a lasting ceasefire and the return of the rest.\n\"The ball is now in Israel's court,\" he said, adding: \"We would like a positive response from them as soon as possible in order to deal with the disastrous situation in Gaza, especially the starvation and the killing of civilians.\"\nAsked about the development, a spokesperson for Israeli Prime Minister Benjamin Netanyahu's office referred NBC News to a statement the Israeli leader made Monday suggesting he was determined to push ahead with the plan to assume full control of Gaza City and noting that Hamas appeared to be \"under immense pressure.\"\nAsked if they could confirm reports that Israel would provide a response to international mediators on the proposal by Friday, the spokesperson said \"no\" and did not provide further clarification.\n'There is no safe place'\nNew satellite imagery suggests that a number of people have already begun to flee the area of Gaza City in recent days ahead of Israel's advance, with the country's plan to push civilians living in the area into the enclave's south condemned by rights groups.\nImagery captured on August 16 shows sites just south of Gaza City are seemingly barren, having been packed with what appear to be tent camps just days before, on August 9.Mohammed Abu Sharia, a father of three, said he and his family had been forced to leave their home in Gaza City again — just months after returning from another round of displacement due to Israel's offensive.\n\"Thank God, we found our house almost intact and habitable, despite the theft of all its contents and the lack of doors or windows,\" Abu Sharia, 48, who ran an internet distribution company before Israel's assault began, told NBC News on Wednesday.\nThe family was able to live in their home for the past six months — but in the midst of Israel's plan to take over Gaza City they were now seeking some semblance of refuge in western Gaza in an enclave where nowhere is considered safe.\n\"There is no safe place, neither in the north nor the south,\" Abu Sharia said. \"My concern is to save the family's life, as we are suffering from food shortages and the lack of any belongings with us.\"\n\"Further displacement and an intensification in hostilities risk worsening an already catastrophic situation,\" the International Committee of the Red Cross said in a statement.\n\"With more than 80 percent of Gaza already impacted by evacuation orders, it is unimaginable that civilians could be compelled to move to an even smaller area,\" it said.\nIsrael launched its offensive in Gaza following the Hamas-led attacks on Oct. 7, 2023, in which some 1,200 people were killed and around 250 taken hostage, marking a major escalation in a decadeslong conflict.\nSince then, more than 62,000 people have been killed in Gaza, including thousands of children, according to the Palestinian health ministry in the enclave, with much of the territory destroyed."
    },
    {
      "news_title": "Tensions Rise as Israeli Military Pushes into Gaza City",
      "news_link": "https://www.devdiscourse.com/article/law-order/3548409-tensions-rise-as-israeli-military-pushes-into-gaza-city",
      "bias": "Center",
      "text": "Tensions Rise as Israeli Military Pushes into Gaza City\nIsrael's military initiates operations to seize Gaza City, confronting Hamas and facing international critique. Reservists are called up amid proposals for a ceasefire. Clashes have intensified near Khan Younis, with reports of casualties from both sides. The situation remains tense as mediators attempt to negotiate peace.\nIsrael has embarked on a controversial military operation aimed at taking control of Gaza City, a crucial urban center. According to Brigadier General Effie Defrin, preliminary stages of the attack have commenced, with troops already positioned around the city's outskirts.\nThe objective is to dismantle the terrorist infrastructure maintained by Hamas in the area. Following fierce clashes south of Khan Younis, Hamas fighters reportedly utilized tunnel networks to launch a surprise assault, significantly wounding several Israeli soldiers.\nDespite international scrutiny, Israel remains determined to proceed with its plans. Tens of thousands of reservists have been summoned, indicating a prolonged military endeavor. Meanwhile, efforts to broker a ceasefire continue as both Israeli and Palestinian representatives explore possible truce terms.\n(With inputs from agencies.)"
    },
    {
      "news_title": "Israel Calls Up Tens of Thousands of Reservists Ahead of Gaza Operation’s Next Phase",
      "news_link": "https://www.theepochtimes.com/world/israel-calls-up-tens-of-thousands-of-reservists-ahead-of-gaza-operations-next-phase-5903585",
      "bias": "Lean Right",
      "text": "Israel has called up about 60,000 reservists ahead of an expansion of its operation in the Gaza Strip, the Israel Defense Forces (IDF) announced on Aug. 20.\nIn a post on X, the IDF stated that the new reserve orders were issued on the morning of Aug. 20, while another 20,000 reservists had their service extended as part of the next phase of Operation Gideon’s Chariots."
    },
    {
      "news_title": "BREAKING: Israel Commences Assault on Gaza City.",
      "news_link": "https://thenationalpulse.com/2025/08/20/breaking-israel-commences-assault-on-gaza-city/",
      "bias": "Right",
      "text": "❓WHAT HAPPENED: The Israeli military has begun the initial phase of a final assault on Gaza City after a clash with Hamas.\n👤WHO WAS INVOLVED: Israel Defense Forces (IDF), IDF spokesman Effie Defrin, Hamas, and the Israeli government.\n📍WHEN & WHERE: Gaza City, offensive announced in a Wednesday briefing.\n💬KEY QUOTE: “Most of the troops that will be mobilised in this new stage will be active duty and not reservists.” – Israel Defense Forces\n🎯IMPACT: The campaign expands Israeli operations in Gaza, with a planned call-up of approximately 60,000 reservists as the government moves to complete the offensive.\nThe Israeli military has begun the initial phase of a planned assault on Gaza City following a clash with Hamas. Israeli military spokesman Effie Defrin said the Israel Defense Forces had already seized control of the city outskirts during a Wednesday briefing.\nThe Israeli government intends to call up approximately 60,000 reservists to finish the offensive against Gaza’s largest urban center. However, an IDF spokesman stressed, “Most of the troops that will be mobilised in this new stage will be active duty and not reservists.”\nThis story is developing…\nImage by Michael Shvadron, IDF.\nJoin Pulse+ to comment below, and receive exclusive e-mail analyses."
    },
    {
      "news_title": "Israel Has Begun First Stages of Its Planned Assault on Gaza City, Says Israeli Military Spokesman",
      "news_link": "https://www.usnews.com/news/world/articles/2025-08-20/israel-has-begun-first-stages-of-its-planned-assault-on-gaza-city-says-israeli-military-spokesman",
      "bias": "Lean Left",
      "text": null
    },
    {
      "news_title": "Israel Says It Has Taken First Steps of Military Operation in Gaza City",
      "news_link": "https://www.algemeiner.com/2025/08/20/israel-begins-first-stages-planned-gaza-city-offensive-says-military-spokesman/",
      "bias": "Lean Right",
      "text": "Israel Says It Has Taken First Steps of Military Operation in Gaza City\nError: Contact form not found.\nby Reuters and Algemeiner Staff\nIsrael’s military announced the first steps of an operation to take over Gaza City on Wednesday and called up tens of thousands of reservists while the government considered a new ceasefire proposal to pause nearly two years of war.\n“We have begun the preliminary operations and the first stages of the attack on Gaza City, and already now IDF forces are holding the outskirts of Gaza City,” Brigadier General Effie Defrin, Israel‘s military spokesperson, told reporters.\nA military official briefing reporters earlier on Wednesday said reserve soldiers would not report for duty until September, an interval that gives mediators some time to bridge gaps between the Palestinian terrorist group Hamas and Israel over truce terms.\nBut after Israeli troops clashed with Hamas fighters in the Palestinian enclave on Wednesday, Prime Minister Benjamin Netanyahu’s office said the Israeli leader sped up the timeline for taking control of Hamas strongholds and defeating the Islamist group that triggered the conflict with an attack on Israel in October 2023.\nThe Israeli statements signaled Israel was pressing ahead with its plan to seize Gaza’s biggest urban center despite international criticism of an operation likely to force the displacement of many more Palestinians.\nDefrin said troops were already operating on the outskirts of Gaza City, and Hamas was now a “battered and bruised” guerrilla force. “We will deepen the attack on Hamas in Gaza City, a stronghold of governmental and military terror for the terrorist organization,” the spokesman said.\nIsrael‘s military called up tens of thousands of reservists on Wednesday in preparation for the expected assault on Gaza City, as the Israeli government considered a new truce proposal.\nHamas, in a statement on Telegram, accused Netanyahu of obstructing the ceasefire deal in favor of continuing a “brutal war against innocent civilians in Gaza City.”\n“Netanyahu’s disregard for the mediators’ proposal … proves that he is the real obstructionist of any agreement.”\nIsrael’s security cabinet, chaired by Netanyahu, approved a plan this month to expand the campaign in Gaza with the aim of taking Gaza City, where Israeli forces waged fierce urban warfare with Hamas in the early stages of the war. Israel currently holds about 75 percent of the Gaza Strip.\nMany of Israel’s closest allies have urged the government to reconsider the operation.\nThe war in Gaza began on Oct. 7, 2023, when Palestinian terrorists led by Hamas attacked southern Israeli communities near the border, killing some 1,200 people, mainly civilians, and taking 251 hostages including children into Gaza.\nIsrael responded with a military campaign aimed at freeing the hostages and dismantling Hamas’s military and governing capabilities in Gaza.\nHamas has accepted a proposal put forward by Arab mediators for a 60-day ceasefire that would involve releasing some of the remaining hostages and freeing Palestinian prisoners in Israel.\nThe Israeli government, which has said all the 50 remaining hostages must be released at once, is studying the proposal. Israeli authorities believe that 20 hostages are still alive.\nMany Gazans and foreign leaders fear a storming of Gaza City would cause significant casualties. Israel says it will help civilians leave battle zones before any assault begins.\nISRAELI TROOPS, HAMAS FIGHTERS CLASH\nIsraeli troops clashed on Wednesday with more than 15 Hamas terrorists who emerged from tunnel shafts and attacked with gunfire and anti-tank missiles near Khan Younis, south of Gaza City, severely wounding one soldier and lightly wounding two others, an Israeli military official said.\nIn a statement, Hamas’s Al-Qassam Brigades confirmed carrying out a raid on Israeli troops southeast of Khan Younis and engaging Israeli troops at point-blank range. It said one fighter blew himself up among the soldiers, causing casualties, during an attack that lasted several hours.\nIsraeli officials have said evacuation orders would be issued to Gaza City residents before any force moves in.\nThe Latin Patriarchate of Jerusalem, which oversees Gaza’s only Catholic Church, located in Gaza City, said it received reports that neighborhoods near the small parish had started to receive evacuation notices.\nHamas, an Islamist movement that has ruled Gaza for almost two decades, has been severely weakened by the war.\nHamas has said it would release all remaining hostages in exchange for an end to war. Israel says it will not end the war before Hamas disarms.\nOpinion polls show strong Israeli public support for ending the war if it ensures the release of the hostages, and a rally in Tel Aviv urging the government to pursue such a deal drew a huge crowd on Saturday."
    },
    {
      "news_title": "Israel begins planned assault on Gaza City as plan approved to 'erase' prospect of Palestinian state",
      "news_link": "https://www.independent.ie/world-news/middle-east/israel-begins-planned-assault-on-gaza-city-as-plan-approved-to-erase-prospect-of-palestinian-state/a496926015.html",
      "bias": "Lean Right",
      "text": "Israel begins planned assault on Gaza City as plan approved to 'erase' prospect of Palestinian state\nIsrael has entered the first stages of its planned assault on Gaza City after a clash with Hamas and already has a hold on the outskirts of the city, Israeli military spokesman Effie Defrin told reporters on Wednesday.\nIsrael's military called up tens of thousands of reservists on Wednesday in preparation for the assault on Gaza City, as the Israeli government supposedly considered a new proposal for a ceasefire after nearly two years of war.\nThe call-up signals Israel is pressing ahead with its plan to seize Gaza's biggest urban centre despite international criticism of an operation likely to force the displacement of many more Palestinians.\nBut a military official briefing reporters said reserve soldiers would not report for duty until September, an interval that gives mediators some time to bridge gaps between Palestinian militant group Hamas and Israel over truce terms.\nThe official said that as part of planning for a new offensive in the Gaza Strip, there would be five divisions operating in the enclave, but most reservists were not expected to serve in combat in Gaza City.\n\"We will be moving into a new phase of combat, a gradual, precise and targeted operation in and around Gaza City, which currently serves as Hamas' main military and governing stronghold,\" the official said.\nIsrael’s security cabinet, chaired by Prime Minister Benjamin Netanyahu, approved a plan this month to expand the campaign in Gaza with the aim of taking Gaza City, where Israeli forces waged fierce urban warfare with Hamas in the early stages of the war. Israel currently holds about 75pc of the Gaza Strip.\nMany of Israel’s closest allies have urged the government to reconsider but Netanyahu is under pressure from some far-right members of his coalition to reject a temporary ceasefire, continue the war and pursue the annexation of the territory.\nOne far-right member, Finance Minister Bezalel Smotrich, announced final approval on Wednesday of a widely condemned Israeli plan for a settlement project in the occupied West Bank that he said would erase any prospect of a Palestinian state.\nThe war in Gaza began on October 7, 2023, when gunmen led by Hamas attacked southern Israeli communities near the border, killing some 1,200 people, mainly civilians, and taking 251 hostages including children into Gaza.\nOver 62,000 Palestinians have been killed in Israel's air and ground war in Gaza since then, according to Gaza health officials, who do not say how many were militants but have said most of those killed have been women and children.\nHamas has accepted a proposal put forward by Arab mediators for a 60-day ceasefire that would involve releasing some of the remaining hostages and freeing Palestinian prisoners in Israel.\nThe Israeli government, which has said all the 50 remaining hostages must be released at once, is studying the proposal. Israeli authorities believe that 20 hostages are still alive.\nMany Gazans and foreign leaders fear a storming of Gaza City would cause significant casualties. Israel says it will help civilians leave battle zones before any assault begins.\nISRAELI TROOPS, HAMAS FIGHTERS CLASH\nIsraeli troops clashed on Wednesday with more than 15 Hamas militants who emerged from tunnel shafts and attacked with gunfire and anti-tank missiles near Khan Younis, south of Gaza City, severely wounding one soldier and lightly wounding two others, an Israeli military official said.\nIn a statement, Hamas' Al-Qassam Brigades confirmed carrying out a raid on Israeli troops southeast of Khan Younis and engaging Israeli troops at point-blank range. It said one fighter blew himself up among the soldiers, causing casualties, during an attack that lasted several hours.\nIsrael's military campaign has caused widespread devastation across the Gaza Strip, which before the war was home to about 2.3 million Palestinians. Many buildings including homes, schools and mosques have been destroyed, while the military has accused Hamas of operating from within civilian infrastructure.\nMost Gazans have been displaced multiple times and forced into densely packed areas along the Mediterranean coast, including in Gaza City in the enclave's north.\nIsraeli officials have said evacuation orders would be issued to Gaza City residents before any force moves in.\nThe Latin Patriarchate of Jerusalem, which oversees Gaza's only Catholic Church, located in Gaza City, said it had received reports that neighbourhoods near the small parish had started to receive evacuation notices.\nHamas, an Islamist movement that has ruled Gaza for almost two decades, has been severely weakened by the war. The Israeli military says Hamas has been reduced to a guerrilla force.\nThe Israeli military official who briefed reporters on Wednesday said Hamas had been trying to regroup and re-form in Gaza City in a more organised manner, but gave no evidence to support the assertion.\nHamas has said it would release all remaining hostages in exchange for an end to war. Israel says it will not end the war before Hamas disarms.\nOpinion polls show strong Israeli public support for ending the war if it ensures the release of the hostages, and a rally in Tel Aviv urging the government to pursue such a deal drew a huge crowd on Saturday.\nA new Reuters/Ipsos poll of Americans showed a 58pc majority believe that every country in the United Nations should recognise Palestine as a nation.\nJoin the Irish Independent WhatsApp channel\nStay up to date with all the latest news"
    },
    {
      "news_title": "Israel has begun first stages of its planned assault on Gaza City, says Israeli military spokesman",
      "news_link": "https://www.reuters.com/world/middle-east/israel-has-begun-first-stages-its-planned-assault-gaza-city-says-israeli-2025-08-20/",
      "bias": "Center",
      "text": null
    },
    {
      "news_title": "Israel says it has taken first steps of military operation in Gaza City",
      "news_link": "https://denvergazette.com/news/nation-world/israel-says-it-has-taken-first-steps-of-military-operation-in-gaza-city/article_93488beb-ba5b-5664-8a1e-1a3f24a3d599.html",
      "bias": "Center",
      "text": null
    },
    {
      "news_title": "Israeli Military To Call Up 60,000 Reservists as It Prepares for Gaza City Ethnic Cleansing Campaign",
      "news_link": "https://scheerpost.com/2025/08/20/israeli-military-to-call-up-60000-reservists-as-it-prepares-for-gaza-city-ethnic-cleansing-campaign/",
      "bias": "Left",
      "text": "In one of the scariest moments in modern history, we're doing our best at ScheerPost to pierce the fog of lies that conceal it but we need some help to pay our writers and staff. Please consider a tax-deductible donation.\nBy Dave DeCamp / Antiwar.com\nAbout 60,000 Israeli reservists will receive call-up orders that the Israeli military will issue tomorrow as it’s preparing for a major offensive on Gaza City, The Times of Israel reported on Tuesday.\nThe report said that reservists will have two weeks before they need to report for duty and that not all of them will take part in the offensive on Gaza City since some will replace IDF troops deployed in other areas of Gaza.\nThe Israeli military’s plans to take over Gaza City involve the ethnic cleansing of over 1 million Palestinian civilians from the area. Since civilians are expected to remain in the city after evacuation orders, the IDF is prepared to use artillery strikes as its means of forcibly moving them, according to Haaretz.\nWhile the IDF hasn’t yet launched its ground offensive, it has ramped up strikes on Gaza City in recent weeks with a focus on the eastern Zeitoun neighborhood. Thousands of Palestinians have already fled the area, and an investigation from Al Jazeera found that many of the Israeli attacks were hitting displacement shelters.\nOnce the city is taken over, the IDF plans to spend more than a year destroying it, similar to how it made the northern cities of Beit Hanoun, Beit Lahia, and Jabalia uninhabitable. The IDF will demolish homes in Gaza City under the guise of “dismantling Hamas infrastructure,” but Israeli Prime Minister Benjamin Netanyahu has previously told a Knesset committee that the IDF’s destruction of homes would force Palestinians to leave Gaza altogether.\nThe idea of the Gaza City offensive is to force all the Palestinians to the south, and from there, Israel will pressure them to leave Gaza, but it remains unclear where they could go. Israel has reportedly been in talks with several countries on taking in a large number of Palestinian refugees, but so far, none have publicly committed to the idea.\nEditor’s Note: At a moment when the once vaunted model of responsible journalism is overwhelmingly the play thing of self-serving billionaires and their corporate scribes, alternatives of integrity are desperately needed, and ScheerPost is one of them. Please support our independent journalism by contributing to our online donation platform, Network for Good, or send a check to our new PO Box. We can’t thank you enough, and promise to keep bringing you this kind of vital news.\nYou can also make a donation to our PayPal or subscribe to our Patreon.\nDave DeCamp\nDave DeCamp is the news editor of Antiwar.com, follow him on Twitter @decampdave."
    },
    {
      "news_title": "Israel begins first stages of planned assault on Gaza City, says military spokesman",
      "news_link": "https://www.newarab.com/news/israel-says-begun-first-stages-planned-assault-gaza-city",
      "bias": "Lean Left",
      "text": "We're closing this live blog now.\nJoin us back here tomorrow from 0900 for more live coverage of events in Gaza and the wider region.\nThanks for following.\nIsrael has entered the first stages of its planned assault on Gaza City after a clash with Hamas, and already has a hold on the outskirts of the city, Israeli military spokesman Effie Defrin claimed on Wednesday in comments made to reporters.\nIt comes as Israeli Defence Minister Israel Katz approved a plan to occupy Gaza City and authorised the call-up of around 60,000 reservists to carry it out, his ministry confirmed on Wednesday.\nAn Israeli military official said on Wednesday that the country’s top generals had approved plans to begin a new phase of operations in some of Gaza’s most densely populated areas.\nThe Israeli army killed at least 40 Palestinians in the Gaza Strip since early Wednesday, including people waiting for aid.\nAirstrikes targeted tents sheltering displaced families and homes in Al-Shati, Al-Zaytoun, and Al-Sabra, killing entire families and children. Eyewitnesses reported ongoing house demolitions and heavy explosions in Al-Zaytoun and Al-Sabra neighbourhoods.\nWe're closing this live blog now.\nJoin us back here tomorrow from 0900 for more live coverage of events in Gaza and the wider region.\nThanks for following.\nFans of Turkish football club Fenerbahce displayed a giant banner calling for an end to the genocide in Gaza during the club's Champion's League playoff tie with Benfica in Istanbul on Wednesday night.\nThe banner, unfurled ahead of kick-off, read \"Stop the genocide in Gaza! Free Palestine!\".\nSupporters were also seen waving Palestinian flags in the stands.\nWorker-led protests erupted at Microsoft headquarters this week as the tech company promises an “urgent” review of the Israeli military's use of its technology during the ongoing war in Gaza.\nA second day of protests at the Microsoft campus on Wednesday called for the tech giant to immediately cut its business ties with Israel.\nMicrosoft late last week said it was tapping a law firm to investigate allegations reported by British newspaper The Guardian that the Israeli Defense Forces used Microsoft's Azure cloud computing platform to store phone call data obtained through the mass surveillance of Palestinians in Gaza and the West Bank.\n\"Microsoft’s standard terms of service prohibit this type of usage,\" the company said in a statement posted Friday, adding that the report raises \"precise allegations that merit a full and urgent review.\"\n(The Associated Press)\nUS Ambassador to Israel Mike Huckabee sought Wednesday to blame a recent breakdown in Gaza ceasefire talks on the decision by some European leaders to recognise Palestinian statehood.\nThe ambassador, who is himself a longtime opponent of Palestinian statehood and staunch Christian Zionist, told the Associated Press the \"noise that has been made by European leaders recently ... is having the counterproductive effect that they probably think that they want.\"\n\"If they believe that unilaterally calling for a two-state, a Palestinian state recognition, immediately brings them closer, the sad truth is it’s taking them further away,\" he said.\n(The Associated Press)\nPalestinian armed group Hamas said Wednesday that Israeli military plans to conquer Gaza City showed its \"blatant disregard\" for efforts to broker a ceasefire and captive-release deal.\n\"Today's announcement by the terrorist occupation army of the start of an operation against Gaza City and its nearly one million residents and displaced persons... demonstrates... a blatant disregard for the efforts made by the mediators,\" it said in a statement.\n(AFP and TNA staff)\nLebanese state media reported airstrikes by Israeli warplanes and drones in several locations in the south of the country on Wednesday evening.\nThe health ministry said four were wounded in a strike in Tyre district. No deaths have yet been reported.\nThe Israeli military said Wednesday it struck a number of Hezbollah sites in southern Lebanon, including a missile launcher and a weapons storage site.\nBelgium's foreign minister has said he \"strongly rejects\" new sanctions imposed on the International Criminal Court by the US earlier on Wednesday.\n\"Belgium once again strongly regrets the new sanctions imposed by the United States against judges and deputy prosecutors of the International Criminal Court,\" Maxime Prevot wrote in a post on X.\n\"As with previous sanctions, Belgium reaffirms its unwavering support for the ICC, its independence and its staff,\" he wrote.\nItaly's foreign minister has become the latest top Western diplomat to condemn Israel's plan to build the E1 settlement in the occupied West Bank.\n\"The Israeli decision to proceed with new settlements in the West Bank is unacceptable, contrary to international law, and indeed risks definitively compromising the two-state solution, an objective for which the Italian Government continues to work with conviction and the utmost commitment,\" Antonio Tajani wrote in a post on X on Wednesday evening.\nTajani joins Germany, the UK and the Netherlands in condemning the settlement, which - if built - would effectively block the formation of a Palestinian state on contiguous territory in the West Bank.\nAn aid convoy operated by the UN's World Food Programme (WFP) came under attack on Wednesday near the famine-hit Sudanese town of Mellit in North Darfur, the agency's spokesperson told AFP.\nThe incident came as several countries including the United States, Saudi Arabia and neighbouring Egypt voiced alarm at the worsening hunger situation in war-torn Sudan, calling for pauses in fighting to let in more aid.\nThree of the 16 trucks in the convoy -- which was carrying life-saving food assistance for vulnerable communities in Alsayah village -- were damaged and caught fire, said the WFP's Gift Watanasathorn, adding that all members of the convoy were \"safe and accounted for\".\n(AFP)\nMedical sources in Gaza have increased today's death toll, telling Al Jazeera Arabic that 76 Palestinians have now been killed by Israeli attacks since dawn.\nIsrael's extremist finance minister Bezalel Smotrich has threatened to resign from the government if Netanyahu agrees to a temporary truce with Hamas, according to Israel's Channel 12.\n\"If the prime minister goes through with the deal, I will make difficult decisions and resign from the government. I told the prime minister that,\" the news outlet quotes him as saying.\nNetanyahu is yet to officially respond to the Egyptian-Qatari proposal for a 60-day ceasefire and partial captive-release deal, which Hamas agreed to earlier this week.\nResignations by Smotrich and the other Religious Zionism cabinet ministers would likely bring down the government, triggering fresh elections.\nA pre-dawn US military raid in northwestern Syria early on Wednesday targeted and killed a senior member of the Islamic State group, a US official told Reuters.\nIt was the second known raid in northern Syria by US troops since former President Bashar al-Assad was ousted in December. The Islamist-led government that replaced him has pledged to prevent a resurgence of Islamic State and is part of an anti-ISIS alliance that includes the US-led coalition fighting the group.\nThe US official, speaking on the condition of anonymity, said the raid killed a senior ISIS member who was seen as a candidate to be the leader of ISIS in Syria. No US troops were killed or injured in the raid, the official added.\nA Syrian security source and Syria's state-owned Al-Ikhbariya said the target was killed as he tried to escape.\nAnother Syrian source said the target was an Iraqi national and was married to a French national.\nIt was not immediately clear what happened to his wife. The Pentagon did not immediately have any public comment on\nthe reports.\n(Reuters)\nThe Netherlands' foreign minister Caspar Veldkamp has issued a statement condemning Israel's approval of the deeply controversial E1 settlement in the West Bank, writing that the project stands in \"clear violation of international law\".\n\"I condemn Israel's decision to advance its illegal E1 settlement plan, effectively splitting the occupied West Bank in two. Implementation of these plans constitutes a clear violation of international law and would make a future Palestinian state virtually impossible,\" he wrote in a post on X.\nHe continued: \"The Netherlands and the EU have long rejected such plans and the expansion of illegal settlements. We remain firmly committed to a negotiated two-state solution, and call on Israel to not take any steps that would further undermine this.\"\nThe Netherlands and the EU have long rejected such plans and the expansion of illegal settlements. We remain firmly committed to a negotiated two-state solution, and call on Israel to not take any steps that would further undermine this. 2/2\n— Caspar Veldkamp (@ministerBZ) August 20, 2025\nIsraeli strategic affairs minister Ron Dermer has reportedly told Qatari officials that Hamas must release all of the captives if it wants a ceasefire in Gaza, Israel's Channel 12 reported Wednesday evening, citing senior Israeli officials.\nThe Palestinian armed group earlier this week agreed to an Egyptian-Qatari ceasefire proposal that would see it release more than half of the remaining captives in exchange for a 60-day truce.\nIsraeli prime minister Benjamin Netanyahu has not officially responded to the plan but in recent days has signalled opposition to further temporary ceasefires and has continued to press ahead with plans to lay siege to Gaza City.\nAccording to the Israeli broadcaster, Dermer told Qatari officials in Paris that Israel is insisting that Hamas release all of the captives and surrender in order to end the war.\nIsraeli forces have killed 72 Palestinians in Gaza since dawn on Wednesday, medics have told Al Jazeera Arabic.\nThe UN agency for Palestinian refugees (UNRWA) said Wednesday that almost one in three children in Gaza City is now suffering from malnutrition - six times higher than the rate before Israel broke the ceasefire five months ago.\nThe agency also said that malnutrition rates among children has tripled across the strip in less than six months.\n\"This is not a natural disaster. It is a man-made, preventable starvation,” UNRWA chief Philippe Lazzarini wrote on social media.\n\"🚨Alarming new data from UNRWA clinics in #Gaza:\n— UNRWA (@UNRWA) August 20, 2025\nSince March, nearly 100,000 children under the age of 5 screened by UNRWA.\n➡️ In less than 6 months, child malnutrition tripled across the Gaza Strip.\n➡️ In Gaza City, nearly 1 in every 3 children is now malnourished - 6 times… pic.twitter.com/HeefImvfXc\nIsraeli prime minister Benjamin Netanyahu on Wednesday welcomed a decision by the United States to impose sanctions on four additional International Criminal Court (ICC) judges.\n\"I congratulate Marco Rubio, the US Secretary of State, who decided to impose sanctions on the judges of the International Criminal Court,\" Netanyahu's office said in a statement.\n\"This is a decisive act against a smear campaign of lies against the State of Israel and the (Israeli army),\" added the prime minister, who has been the subject of an ICC arrest warrant since November 2024 for war crimes and crimes against humanity in Gaza.\n(AFP)\nFrance on Wednesday expressed dismay at a US decision to impose sanctions on four more International Criminal Court judges or prosecutors, including one from France, over actions against Israeli leaders and US citizens.\nA foreign ministry spokesman said the sanctions, including against French judge Nicolas Guillou, were \"in contradiction to the principle of an independent judiciary\".\n(AFP)\nUK Foreign Secretary David Lammy has condemned Israel's approval of the E1 settlement in the occupied West Bank as a \"flagrant breach of international law\" and told it to reverse its decision.\n\"The UK condemns the decision by Israel’s Higher Planning Committee today to approve the E1 settlement plan,\" Lammy wrote on social media on Wednesday evening.\nHe continued: \"If implemented, it would divide a Palestinian state in two, mark a flagrant breach of international law and critically undermine the two-state solution. The Israeli government must reverse this decision.\"\nIsrael's far-right finance minister Bezalel Smotrich announced plans to move ahead with the long-frozen project last week, proclaiming the settlement would \"bury the idea of a Palestinian state\".\nThe E1 project - which would see 3,400 homes built between East Jerusalem and Ma'ale Emunim - has been on hold for decades due to fierce international opposition. If built, the settlement would cut the West Bank in half, ending the possibility of a contiguous Palestinian territory.\nThe International Criminal Court (ICC) said on Wednesday it deplored the announcement by President Donald Trump's administration of new US sanctions against another four of its staff members - two judges and two deputy prosecutors.\n\"These sanctions are a flagrant attack against the independence of an impartial judicial institution which operates under the mandate from 125 states parties from all regions,\" the ICC said in a statement.\n\"They constitute also an affront against the Court's States Parties, the rules-based international order and, above all, millions of innocent victims across the world,\" the court added.\n\"The ICC will continue fulfilling mandates in strict accordance with its legal framework, without regard to any pressure or threat.\"\n(Reuters)\nIsrael has entered the first stages of its planned assault on Gaza City after a clash with Hamas and already has a hold on the outskirts of the city, Israeli military spokesman Effie Defrin told reporters on Wednesday.\nNorway’s soccer federation says it \"cannot remain indifferent\" to humanitarian suffering in Gaza and will donate any profits from an October 11 World Cup qualifying game against Israel to aid work there.\n\"Neither we nor other organisations can remain indifferent to the humanitarian suffering and disproportionate attacks that the civilian population in Gaza has been subjected to for a long time,\" Norwegian Football Federation President Lise Klaveness said in a statement Tuesday.\n\"We want to donate the proceeds to a humanitarian organization that saves lives in Gaza every day and provides active emergency aid on the ground,\" she said.\nIt wasn't immediately clear how much the Norwegian federation expected to earn through ticket sales for the match, which begin next week.\nThe Israeli military said it killed 10 Hamas fighters in a rare face-to-face battle after repelling a major attack near the Gaza Strip's southern city of Khan Younis on Wednesday.\nOver 15 militants emerged from tunnels and attacked an Israeli army post with gunfire and anti-tank missiles; one Israeli soldier was seriously injured.\nHamas claimed to have killed several Israeli soldiers in house raids and detonated a suicide bomber among rescue forces. Israel denied reports of a suicide attack or abduction attempts during the incident.\nThe assault was described as \"exceptional\" by Israeli media due to its scale and direct combat. Israel's Channel 12 claimed that the attack had been aimed at kidnapping soldiers.\nWhen contacted by AFP, the Israeli military denied \"that there was one or more suicide bombers among the Hamas militants, or that Hamas attempted to abduct IDF soldiers\".\nThe United States on Wednesday imposed sanctions on four more International Criminal Court judges or prosecutors including from allies France and Canada, in a new effort to hobble the tribunal including over actions against Israel.\n\"The Court is a national security threat that has been an instrument for lawfare against the United States and our close ally Israel,\" Secretary of State Marco Rubio said in a statement.\nIsraeli army spokesperson Brigadier General Effie Defrin will deliver statement to the press.\nIt comes after the military says 60,000 reservists will be called up for a new offensive that aims to occupy Gaza City and northern parts of the enclave.\nInternational aid groups say they have not yet been able to deliver shelter materials to Gaza despite Israeli authorities saying they have lifted restrictions on such supplies, and warn that further delays could cause more Palestinian deaths.\nAid organisations say Israel had in effect been blocking the delivery of materials for shelters for nearly six months, with tent poles previously listed among items Israeli authorities considered could have a military as well as civilian use.\n\"The United Nations and our partners have...not been able to bring in shelter materials following the Israeli announcement,\" the U.N. Office for the Coordination of Humanitarian Affairs (OCHA), spokesperson Jens Laerke said.\n\"There's a set of impediments that still needs to be addressed, including Israeli customs clearance.\"\nThe Palestinian Authority on Wednesday slammed Israel's approval of a key settlement project in the occupied West Bank, saying it undermined the chances of a two-state solution.\nThe approval of the project in the area known as E1 \"fragments... geographic and demographic unity, entrenching the division of the occupied West Bank into isolated areas and cantons that are disconnected from one another, turning them into something akin to real prisons,\" the PA's foreign ministry said in a statement.\nU.S. forces took part in a pre-dawn raid in northwestern Syria early on Wednesday that targeted a member of the Islamic State group, a U.S. official and a Syrian security source said.\nA second Syrian security source and Syria's state-owned Al-Ikhbariya said the target was killed as he tried to escape.\nIt was not immediately clear who the Islamic State member targeted on Wednesday was. The U.S. official said he was a suspected high-value target.\nThe first Syrian source said he was an Iraqi national and was married to a French national. It was not immediately clear what happened to his wife.\nThe foreign minister of Germany called for an immediate ceasefire in Gaza and the release of captives held by Hamas after a meeting Wednesday with his counterpart in Indonesia.\nJohann Wadephul and Indonesian Foreign Minister Sugiono said the humanitarian catastrophe resulting from the Israeli war in Gaza is unbearable and a two-state solution is the sole means of ending the conflict.\n\"The goal for all of us is clear: a two-state solution, which must be negotiated,\" Wadephul said.\nFrench President Emmanuel Macron said Wednesday that Israel's \"military offensive\" to conquer Gaza City \"can only lead to a complete disaster for both peoples,\" after Israel's defence minister authorised the call-up of around 60,000 reservists.\nIsrael's plan \"will drag the region into a permanent war,\" the French president posted on social media, reiterating his call for an \"international stabilisation mission\".\nThe Italian Football Coaches’ Association is pushing for Israel to be suspended from international competition over the war in Gaza.\nAhead of Italy’s crucial World Cup qualifiers against Israel in the next two months, the AIAC says \"Israel must stop. Football must also take action.\".\nThe AIAC has written a formal letter to the Italian soccer federation, to be forwarded to European and world soccer’s governing bodies, calling for Israel to be suspended.\n\"The AIAC Board of Directors unanimously believes that, given the daily massacres, which have also resulted in hundreds of deaths among managers, coaches, and athletes … it is legitimate, necessary, indeed a duty, to place at the center of federation talks the request, to be submitted to UEFA and FIFA, for the temporary exclusion of Israel from sporting competitions,\" the letter concludes.\n\"Because the pain of the past cannot cloud anyone’s conscience and humanity.\"\nItaly is set to play Israel on neutral turf in Debrecen, Hungary on 8 September, before hosting the return match in Udine on 14 October.\n\"We could just focus on playing, looking the other way. But we believe that is not right,\" AIAC vice president Giancarlo Camolese said.\nYair Lapid, the Israeli opposition leader, has slammed the Netanyahu government's decision to call up 60,000 reservists for the army planned offensive and takeover of Gaza City.\n\"60,000 reserve orders were issued this morning to realise the delusion of conquering Gaza,\" Lapid wrote on X.\nHis comments came after Israeli Defence Minister Israel Katz approved a plan to conquer Gaza City, an urban area home to hundreds of thousands of people in the north of the Palestinian territory.\nMost of the territory's population has been displaced since the war began, many repeatedly, according to the United Nations.\nAddressing Russian counterpart Sergei Lavrov at a meeting in Moscow, Jordanian Foreign Minister Ayman Safadi said he hoped to discuss \"efforts to end the aggression on Gaza, and the massacres and starvation that it is creating.\"\nThis was in addition to the \"illegal measures that continue to undermine the two-state solution and kill all prospects for peace in the region,\" he added.\n\"We value your clear position against the war and your demand for reaching a permanent ceasefire,\" he told Lavrov.\nIsrael approved a major settlement project on Wednesday in an area of the occupied West Bank that the international community has warned threatens the viability of a future Palestinian state.\n\"I am pleased to announce that just a short while ago, the civil administration approved the planning for the construction of the E1 neighbourhood,\" the mayor of the nearby Israeli settlement of Maale Adumim, Guy Yifrach, said in a statement.\nAt least 62,122 people have been killed and more than 156,700 injured in Gaza since the start of the Israeli offensive on 7 October 2023, Gaza's health ministry said Wednesday.\nThe casualties include 2,018 deaths and 14,947 injuries of people seeking aid since late May.\nHealth officials in Gaza say the majority of casualties are civilians, with thousands more believed to be buried beneath the rubble.\n59 percent of Americans believe Israel's military response in Gaza after Hamas' 7 October 2023 attack has been excessive, a poll by Reuters and Ipsos has found.\nThe poll shows that 65 percent of Americans believe the US should take action in Gaza to help people facing starvation, as a result of Israel's earlier blockade and now restrictions on aid.\nThe German government said Wednesday it \"rejects the escalation\" of Israel's campaign in Gaza after Israel approved a plan to conquer Gaza City and authorised calling up around 60,000 reservists.\nGermany finds it \"increasingly difficult to understand how these actions will lead to the freeing of all the hostages, or to a ceasefire,\" government spokesman Steffen Meyer told reporters.\nPope Leo plans to visit Lebanon, the country's senior Catholic official announced on Wednesday, in what could be the first visit outside Italy by the new leader of the global Church.\nThe pope will travel to Lebanon \"by December\", Cardinal Bechara Rai told the Al Arabiya television channel.\nRai, leader of the 3.5-million-member Maronite Catholic Church, did not give a specific date for the visit but said \"preparations are already underway\".\nA Lebanese official familiar with the matter confirmed that discussions were being held about a visit towards the end of the year, though a date had not yet been finalised.\nPope Leo XIV asked people to fast on Friday to pray for peace and justice in the Middle East and Ukraine, issuing a special appeal as he returned to the Vatican from summer vacation.\nAt the end of his weekly general audience Wednesday, Leo recalled that Friday is a special feast day dedicated to the Virgin Mary. He urged Catholic faithful to spend the day fasting and “praying that the Lord grants peace and justice, and dries the tears of all those who are suffering as a result of the armed conflicts underway.”\nLeo has called for ceasefires in Gaza and Ukraine and for dialogue to achieve peace.\nIran cannot completely cut its ties with the UN nuclear watchdog IAEA, the country's foreign minister Abbas Araghchi said in comments published on Wednesday on the official news agency IRNA.\nThe Israeli military said approximately 60,000 reserve orders were issued this morning ahead of the Gaza City offensive.\nMunition left from Israel's war with Iran earlier this year exploded on Tuesday in the Islamic republic's west, killing one person, state media said.\nOfficial news agency IRNA said that \"unexploded ordnance of the Zionist regime\" detonated near the city of Beyranshahr, in Lorestan province of western Iran.\n\"The incident left one person dead and nine people injured,\" it added, quoting a Revolutionary Guards statement.\nSyria's foreign minister met with an Israeli delegation in Paris to discuss de-escalation and the situation in Druze-majority Suweida province after deadly sectarian violence last month, state media reported Wednesday.\nState news agency SANA said late Tuesday that Syrian Foreign Minister Asaad al-Shaibani and Israeli Strategic Affairs Minister Ron Dermer discussed \"de-escalation and non-interference in Syria's internal affairs\".\nIt said their talks also addressed monitoring the Suweida ceasefire announced by the United States last month.\nSyrian state television reported an unidentified government source as saying Wednesday that Syria's intelligence chief also attended the meeting.\n\"Both sides affirmed their commitment to the unity of Syrian territory... and that Suweida is an integral part of Syria,\" it reported.\nLebanese President Joseph Aoun on Tuesday warned against ending the United Nations peacekeepers' mandate in the country's south, after the UN Security Council began debating extending their mission.\nIsrael and the United States, which wields a veto on the Security Council, have reportedly opposed the renewal, which is expected by the end of this month.\n\"Any timetable for the mandate of UNIFIL that is different from the actual needs will negatively impact the situation in the south, which still suffers from Israeli occupation,\" Aoun told force commander Diodato Abagnara, according to a presidency statement.\nAoun said Beirut \"has begun contacts with Security Council member states, and brotherly and friendly countries, to ensure the extension\" of UNIFIL's mandate. He cited Lebanon's need for the force to help \"maintain security and stability in the south\" and to support the army following the government's decision to increase troop numbers there to 10,000 personnel.\nAustralian Prime Minister Anthony Albanese said on Wednesday that he treats leaders of other countries with respect after his Israeli counterpart Benjamin Netanyahu attacked him over his decision to recognise a Palestinian state.\n\"I don't take these things personally, I engage with people diplomatically. He has had similar things to say about other leaders,\" Albanese said during a media briefing.\nNetanyahu's personal attack on Albanese has further strained relations between the two countries. Ties soured after Australia decided last week to conditionally recognise a Palestinian state at the UN General Assembly in September.\nAlbanese told reporters that he had informed Netanyahu about Australia's decision to support a Palestinian state before his centre-left government formally announced the plan.\nQatar has expressed some optimism for a new ceasefire proposal, noting it was \"almost identical\" to an earlier version agreed to by Israel, reports AFP.\nQatari foreign ministry spokesman Majed al-Ansari said on Tuesday that Hamas had given a \"very positive response.\"\n\"We cannot make any claims that a breakthrough has been made. But we do believe it is a positive point,\" he added.\nAn Israeli military official said on Wednesday that the country’s top generals had approved plans to begin a new phase of operations in some of Gaza’s most densely populated areas.\nSpeaking on the condition of anonymity because he wasn’t authorised to speak publicly, the official said that the military will be operating in parts of Gaza City where the Israeli military has not yet operated and where he claimed Hamas is still active.\nThe official said after receiving approval from military leaders, the plan would now progress toward the final approval stage.\nIt remains unclear when the operation will begin. The official said 50,000 reservists will be called up in the coming month, nearly doubling the number of active reservists to 120,000."
    },
    {
      "news_title": "Gaza’s biggest city is in chaos ahead of an imminent Israeli assault - Egypt Independent",
      "news_link": "https://www.egyptindependent.com/gazas-biggest-city-is-in-chaos-ahead-of-an-imminent-israeli-assault/",
      "bias": "unknown",
      "text": "Two years ago, Gaza’s largest city was sprawling with life. Classrooms brimmed with schoolchildren, markets were full of shoppers and beachside cafes offered respite for those escaping the stresses of a besieged enclave.\nGaza City boasts a rich history, inhabited for thousands of years and shaped by successive takeovers from ancient civilizations. It served as a key landing point for Palestinians displaced during Israel’s founding in 1948 and has hundreds of millennia-old sites documenting its past.\nIt was therefore no surprise that Islamist militant group Hamas chose Gaza City as its de facto capital when it seized control of the strip in 2007.\nYears of conflict, a crippling blockade and Hamas’ autocratic rule made life for Palestinians hard. But the institutions set up by the militants, with help from regional governments like Qatar and a robust United Nations aid system, gave some structure to the strip’s exhausted population.\nAn established underground smuggling system gave Gaza City a taste of the outside world amid the land, air and sea siege imposed by neighbors Israel and Egypt – who both designate Hamas a terror organization. While life was far from easy in Gaza City, with half the population unemployed and Hamas’ police strictly patrolling the streets, you could still get a matcha latte on the way to a yoga studio, or relax in a park.\nToday, what was once the cultural and financial hub of the enclave, lies in lawless ruins, devastated by months of a brutal Israeli assault triggered by Hamas’ deadly attack on Israel almost two years ago. And as Israel’s plans to launch a new offensive on the densely populated area to eliminate Hamas militants hiding underground, Palestinians of the Gaza historic city reckon, once again, with mounting fears of survival.\nLife in Gaza City\nNormal life in the coastal enclave collapsed after Israel’s brutal retaliation to Hamas’ attack.\nHundreds of thousands sheltering in shattered buildings of the city have been left to fend for themselves after the fall of Hamas’ policing apparatus. Unclear about their future, residents of Gaza City listen for news of the next food shipment, or the sudden sound of a trickle of salty water from bathroom pipes – which would give them a rare chance for a shower.\nIsrael does not allow journalists into Gaza. CNN spoke to several of Gaza City’s residents to paint a picture of how the city looks amidst the war.\nTens of thousands of Israeli strikes have left the city’s many towers lying in rubble as garbage and sewage water flood the streets. Black smoke from burning plastic and wood, used by residents for fuel, fill the skies and the sounds of overhead Israeli drones buzz non-stop amid sporadic blasts from airstrikes nearby.\nA chaotic web of wires from street generators supply power to those who can afford to pay. Markets display a random assortment of exorbitantly priced food items, possibly looted by criminal gangs from the few aid trucks Israel allows into the strip.\nHospitals and pharmacies no longer function, and hygiene products remain a scarcity for Palestinians, who say infestations of lice, a lack of vitamins, with no food have left them ill and weak.\nAs night falls, armed thugs roam the streets and families pick up guns to protect themselves. Cash can be transferred to Gaza through an informal banking system – but those seeking to withdraw it are forced to pay up to 50% in commission to individuals and groups controlling the money supply.\nHamas, once so visible on the streets of Gaza City, is now absent. Its political offices, organizational municipalities and police stations are destroyed, and its militants stay hidden.\n“The sons of bitches have no control, it’s not like old times… but sometimes you find them appearing suddenly, you don’t know where from,” said Abu Mohamed, a resident of Gaza City who opposes Hamas.\nThe resident, who didn’t provide his full name out of fear of Hamas’ retaliation, said the group has no forces visibly present, and civilians do not know how the group organizes itself.\n“They don’t have specific places where they gather. They have their own special ways on how they communicate or how they organize… we don’t know how they do that,” Abu Mohamed said of Hamas.\nHamas isn’t a ‘static institution’\nWhen an agreement was reached with Israel for a ceasefire and the release of some hostages in January, armed members of Hamas emerged en masse wearing their full uniform at a public square in Gaza City. It was Hamas’ reminder that the group was still alive months after Israel set out to destroy it.\nIn the weeks that followed, Hamas choreographed ceremonies to parade its strength during scheduled releases of Israeli hostages captured on October 7. The ceremonies were so infuriating to Israel that it threatened to withdraw from the agreement.\nIn one of the most recent videos circulating on social media and geolocated by CNN, an armed group of masked men chanted for Hamas’ armed wing – Al Qassam Brigades – while carrying automatic weapons. The video, released in August, showed masked militants setting fire to a vehicle and threatening “thieves and businessmen” who steal aid.\nSelf-styled as ‘Al Rade’a, or ‘The Deterring,’ the subgroup said in its first statement that it was formed by Hamas’ security apparatus to “deter monopolizing businessmen” and gangs who collaborate with Israel in Gaza.\nAl Rade’a claimed that it executed people who belong to gangs that collaborate with Israel, including six people last month in the southern city of Khan Younis.\n“Let’s not forget Hamas is not a static institution or figure. They started out with a certain number of fighters on October 7, and then given the destruction and deaths inside Gaza, they’ve also gone on a recruiting spree and replaced folks that were there,” Alex Plitsas, a military expert and senior non-resident fellow for the Atlantic Council, told CNN.\nIt is near-impossible to establish an accurate picture of the number of Hamas militants remaining in Gaza City.\n“Hamas is not a uniform force, while their government was elected in Gaza and they have institutions that they’re responsible for, their military wing doesn’t operate like a uniform military… they effectively act like an insurgent force for an elected government that is in the middle of a war, and they don’t play by the rules,” Plitsas said.\n‘They know we’re coming’\nThe takeover and occupation of the largest city in northern Gaza, which Netanyahu said is one of the last Hamas strongholds, will require the Israeli military to bring in 60,000 more reserve troops and extend the service of another 20,000, in addition to those already called up.\nAn Israeli source said this week that the military will give Palestinians approximately two months to evacuate the densely populated area before the assault begins, setting a symbolic deadline of October 7, the two-year mark of the war.\nAnother Israeli military official could not provide a figure on how many Hamas forces are in Gaza City, but the official said the Israel Defense Forces (IDF) has not ventured deep into the area in nearly two years of war.\nThe expectation is that troops will face an enemy that has had time to dig in, using its extensive tunnel network under Gaza City\n“They know we’re coming,” the official said, “so they prepare for that.”\nThe Hamas “metro,” as Israel calls it, is more than just a system of uniform tunnels, the official explained. It’s far more complex than the IDF anticipated, with larger strategic hubs and branches, as well as smaller tactical tunnels for quick movement and surprise attacks.\nOnce Gaza City is evacuated, the IDF will likely strike an expanded set of targets in the dense urban area, the official added, including sites that weren’t struck before because of the density of the civilian population.\nBut Israel’s incoming operation is drawing warning from governments and aid groups, who remain concerned about the Israeli military’s conduct over the past two years amid a high civilian casualty rate, reports of war crimes, human rights abuses and aid blockades.\n“The Israeli military would probably take a couple of months to go into every single building, clear it up and hit all the tunnels. Is it possible? Yes,” Plitsas said, “Is it extremely difficult and will it take a lot of troops to clear and take all the territory? Also yes.”"
    },
    {
      "news_title": "Thousands flee famine-stricken Gaza City",
      "news_link": "https://massive.news/thousands-flee-famine-stricken-gaza-city-dw-news/",
      "bias": "unknown",
      "text": "Israeli strikes killed at least 14 people in southern Gaza, more than half of them women and children, according to local hospitals.\nThe strikes come as thousands flee famine-stricken Gaza City in the north, where an Israeli offensive to occupy it is underway.\nFor more news go to: http://www.dw.com/en/\nFollow DW on social media:\n►Instagram: https://www.instagram.com/dwnews\n►TikTok: https://www.tiktok.com/@dwnews\n►Facebook: https://www.facebook.com/deutschewellenews/\n►Twitter: https://twitter.com/dwnews\nFür Videos in deutscher Sprache besuchen Sie: https://www.youtube.com/dwdeutsch\nSubscribe: https://www.youtube.com/user/deutschewelleenglish?sub_confirmation=1\n#Israel #Gaza #dwnewsshorts"
    },
    {
      "news_title": "Israel keeps pressure on Gaza City before offensive",
      "news_link": "https://theqldr.com.au/international-news/2025/08/21/mideast-420/",
      "bias": "unknown",
      "text": "Israel keeps pressure on Gaza City before offensive\nNidal al-Mughrabi and Lili Bayer |\nThe Israeli military is maintaining its pressure on Gaza City with heavy bombardments, residents say, before a meeting between Prime Minister Benjamin Netanyahu and his ministers on plans to seize the enclave’s largest city.\nThe military a day earlier called up 60,000 reservists in a sign that the government was pressing ahead with the plan, despite international condemnation.\nAlthough one military official said that most reservists would not serve in combat and that the strategy to take Gaza City had not yet been finalised.\nCalling up tens of thousands of reservists is also likely to take weeks, giving time for mediators to attempt to bridge gaps over a new temporary ceasefire proposal that Hamas has accepted, but the Israeli government is yet to officially respond to.\nThe proposal calls for a 60-day ceasefire and the release of 10 living hostages being held in Gaza by Hamas militants and of 18 bodies.\nIn turn, Israel would release about 200 long-serving Palestinian prisoners held by Israel.\nThe Israeli government has restated that all the remaining 50 hostages held by militants in Gaza must be released at once.\nIsraeli officials believe about 20 of them are still alive.\nNetanyahu is scheduled to meet with some cabinet ministers on Thursday to discuss his plan to seize Gaza City, according to Haaretz and other Israeli media, without giving more details.\nThe plan was approved earlier in August by the security cabinet, which he chairs, even though many of Israel’s closest allies have urged the government to reconsider.\nNetanyahu is under pressure from some far-right members of his coalition to reject a temporary ceasefire and instead to continue the war and pursue the annexation of the territory.\nIn Gaza City, thousands of Palestinians have left their homes as Israeli forces have escalated shelling on the Sabra and Tuffah neighbourhoods.\nSome families have left for shelters along the coast, while others have moved to central and southern parts of the enclave, according to residents there.\n“We are facing a bitter-bitter situation, to die at home or leave and die somewhere else, as long as this war continues, survival is uncertain,” said Rabah Abu Elias, 67, a father of seven.\n“In the news, they speak about a possible truce, on the ground, we only hear explosions and see deaths,” he told Reuters by phone.\n“To leave Gaza City or not isn’t an easy decision to make.”\nIsraeli tanks have been edging closer to densely populated Gaza City during the past 10 days.\nOfficials say evacuation notices will be issued to Palestinians there before the military moves in.\nTwo more people had died of starvation and malnutrition in Gaza in the past 24 hours, the territory’s health ministry said on Thursday.\nThe new deaths raised the number of Palestinians who have died from such causes to 271, including 112 children, since the war began.\nIsrael disputes malnutrition and starvation figures posted by the Gaza health ministry.\nReuters"
    },
    {
      "news_title": "Israeli military says first stages of assault on Gaza City have begun",
      "news_link": "https://alkhaleejtoday.co/international/5855394/Israeli-military-says-first-stages-of-assault-on-Gaza-City-have-begun.html",
      "bias": "unknown",
      "text": "We show you our most important and recent visitors news details Israeli military says first stages of assault on Gaza City have begun in the following article\nHind Al Soulia - Riyadh - TEL AVIV — The Israeli military says it has begun the \"preliminary actions\" of a planned ground offensive to capture and occupy all of Gaza City and already has a hold on its outskirts.\nA military spokesman said troops were already operating in the Zeitoun and Jabalia areas to lay the groundwork for the offensive, which Defence Minister Israel Katz approved on Tuesday and which will be put to the security cabinet later this week.\nAbout 60,000 reservists are being called up for the beginning of September to free up active-duty personnel for the operation.\nHamas has accused Israel of obstructing a ceasefire deal in favour of continuing a \"brutal war against innocent civilians\", Reuters news agency reported.\nHundreds of thousands of Palestinians in Gaza City are expected to be ordered to evacuate and head to shelters in southern Gaza as preparations for Israel's takeover plan get under way.\nMany of Israel's allies have condemned its plan, with French President Emmanuel Macron warning on Wednesday that it \"can only lead to disaster for both peoples and risks plunging the entire region into a cycle of permanent war\".\nThe International Committee of the Red Cross (ICRC) meanwhile said further displacement and an intensification of hostilities \"risk worsening an already catastrophic situation\" for Gaza's 2.1 million population.\nIsrael's government announced its intention to conquer the entire Gaza Strip after indirect talks with Hamas on a ceasefire and hostage release deal broke down last month.\nSpeaking at a televised briefing on Wednesday, Israel Defense Forces (IDF) spokesperson Brigadier General Effie Defrin said Hamas was \"battered and bruised\" after 22 months of war.\n\"We will deepen the damage to Hamas in Gaza City, a stronghold of governmental and military terror for the terrorist organisation,\" he added. \"We will deepen the damage to the terror infrastructure above and below the ground and sever the population's dependence on Hamas.\"\nBut Defrin said the IDF was \"not waiting\" to begin the operation.\n\"We have begun the preliminary actions, and already now, IDF troops are holding the outskirts of Gaza City.\"\nTwo brigades were operating on the ground in the Zeitoun neighbourhood, where in recent days they had located an underground tunnel that contained weapons, and a third brigade was operating in the Jabalia area, he added.\nIn order to \"minimise harm to civilians,\" he said, Gaza City's civilian population would be warned to evacuate for their safety.\nA spokesman for Gaza's Hamas-run Civil Defence agency, Mahmoud Bassal, told AFP news agency on Tuesday that the situation was \"very dangerous and unbearable\" in the city's Zeitoun and Sabra neighbourhoods.\nThe agency reported that Israeli strikes and fire had killed 25 people across the territory on Wednesday. They included three children and their parents whose home in the Badr area of Shati refugee camp, west of Gaza City, was bombed, it said.\nDefrin said the IDF was also doing everything possible to prevent harm to the 50 hostages still being held by Hamas in Gaza, 20 of whom are believed to be alive. Their families have expressed fears that those in Gaza City could be endangered by a ground offensive.\nThe ICRC warned of a catastrophic situation for both Palestinian civilians and the hostages if military activity in Gaza intensified.\n\"After months of relentless hostilities and repeated displacement, the people in Gaza are utterly exhausted. What they need is not more pressure, but relief. Not more fear, but a chance to breathe. They must have access to the essentials to live in dignity: food, medical and hygiene supplies, clean water, and safe shelter,\" a statement said.\n\"Any further intensification of military operations will only deepen the suffering, tear more families apart, and threaten an irreversible humanitarian crisis. The lives of hostages may also be put at risk,\" it added.\nIt called for an immediate ceasefire and the rapid and unimpeded passage of humanitarian assistance across Gaza.\nMediators Qatar and Egypt are trying to secure a ceasefire deal and have presented a new proposal for a 60-day truce and the release of around half of the hostages, which Hamas said it had accepted on Monday.\nIsrael has not yet submitted a formal response, but Israeli officials insisted on Tuesday that they would no longer accept a partial deal and demanded a comprehensive one that would see all the hostages released.\nOn Wednesday Hamas accused Israeli Prime Minister Benjamin Netanyahu of disregarding the mediators' ceasefire proposal and said he was the \"real obstructionist of any agreement\", according to a statement cited by Reuters.\nThe Israeli military launched a campaign in Gaza in response to the Hamas-led attack on southern Israel on 7 October 2023, in which about 1,200 people were killed and 251 others were taken hostage.\nAt least 62,122 people have been killed in Gaza since then, according to the territory's health ministry. The ministry's figures are quoted by the UN and others as the most reliable source of statistics available on casualties. — BBC\nThese were the details of the news Israeli military says first stages of assault on Gaza City have begun for this day. We hope that we have succeeded by giving you the full details and information. To follow all our news, you can subscribe to the alerts system or to one of our different systems to provide you with all that is new.\nIt is also worth noting that the original news has been published and is available at Saudi Gazette and the editorial team at AlKhaleej Today has confirmed it and it has been modified, and it may have been completely transferred or quoted from it and you can read and follow this news from its main source."
    },
    {
      "news_title": "Israel Launches Operation To Take Over Gaza City, Hamas Accuses Government Of Sabotaging Ceasefire",
      "news_link": "https://8pmnews.com/israel-launches-operation-to-take-over-gaza-city/",
      "bias": "unknown",
      "text": "GAZA CITY — The Israeli military said on Wednesday it has initiated the first steps of a major military campaign to take over Gaza City. Hamas strongly condemned this decision, and it raised doubts about the future of ceasefire talks that are still going on.\nBrigadier General Effie Defrin, a spokesperson for the Israeli military, said in a statement that forces are already working on the edges of the city, which he called a “stronghold” for the terrorist group. Defrin said that Hamas is now a “battered and bruised” guerilla army. Defense Minister Israel Katz has given the go-ahead for the enlarged operation, which will call up 60,000 reservists and keep 20,000 active-duty soldiers on duty longer.\nHamas said the news showed “a blatant disregard for the efforts made by the mediators” to reach a settlement for a truce and the release of hostages. The militant organization said that Israeli Prime Minister Benjamin Netanyahu was “obstructing” any deal to keep up the “brutal war against innocent civilians in Gaza City.”\nThe fresh attack comes at a very important time for peace talks. Reports say that Hamas agreed to a ceasefire agreement on Monday that would stop the fighting for 60 days and free at least 10 living Israeli detainees and some dead bodies. But Israel hasn’t publicly said anything about the arrangement yet, and some officials are said to be insisting that all remaining hostages be freed.\nOn October 7, 2023, Hamas attacked Israel, killing almost 1,200 people and taking 251 people captive. This started the battle. The Gaza health ministry says that since then, Israel’s military assaults in Gaza have killed more than 62,000 Palestinians. The Israeli military said that 27 of the initial 251 hostages are dead and 49 are still thought to be in Gaza.\nIsrael also given the go-ahead for a controversial settlement project in the occupied West Bank that would practically split the territory in two. Bezalel Smotrich, the far-right finance minister, praised the decision as a measure to “erase” the idea of a future Palestinian state. He said, “Every settlement, every neighborhood, every housing unit is another nail in the coffin of this dangerous idea.”"
    },
    {
      "news_title": "Israel Begins First Stages Of Gaza City Takeover - As UK Condemns Approval Of West Bank Settlement Plan - Great Yorkshire Radio",
      "news_link": "https://greatyorkshireradio.co.uk/world/israel-begins-first-stages-of-gaza-city-takeover-as-uk-condemns-approval-of-west-bank-settlement-plan/",
      "bias": "unknown",
      "text": "Brigadier General Effie Defrin, Israel’s military spokesperson, said on Wednesday that “IDF forces are holding the outskirts of Gaza City” after preliminary operations to take the entire area.\nAn estimated 60,000 reserve soldiers have also been called up to help seize Gaza’s biggest urban centre, but will not report for duty until September, according to a military official.\nIsraeli troops are already operating in the Zeitoun neighbourhood of Gaza City, and the Jabaliya refugee camp in northern Gaza.\nPrime Minister Benjamin Netanyahu’s war cabinet approved the plans last month, which include an eventual full security takeover of all of Gaza, despite growing international criticism that it will likely lead to the displacement of many more Palestinians.\nHe is said to have sped up the timeline for taking control of Hamas strongholds after both sides clashed near Khan Younis, south of Gaza City, on Wednesday.\nIsrael claims it will help any civilians evacuate before any assault begins.\nCeasefire proposal being considered\nIsraeli officials said they are also considering a new ceasefire proposal put forward by Qatar and Egypt.\nThe deal, which involves a 60-day ceasefire and the release of some of the remaining Israeli hostages and Palestinian prisoners, has already been accepted by Hamas.\nThousands of Israeli civilians have called for the government to accept a ceasefire and reverse its decision to take over Gaza City, but Mr Netanyahu is thought to be under pressure from some far-right members of his coalition to reject the deal and continue to pursue the annexation of the territory.\nWest Bank settlement plan approved\nOne of those is Bezalel Smotrich, Israel’s finance minister, who announced on Wednesday that a controversial plan for a settlement project in the occupied West Bank had been approved after they received the final go-ahead from Israel’s higher planning committee.\nMr Smotrich, an ultranationalist in the ruling right-wing coalition, said in a statement that the government was delivering with the settlement what it had promised for years: “The Palestinian state is being erased from the table, not with slogans but with actions.”\nHe said last week that the settlement would “finally bury the idea of a Palestinian state, because there is nothing to recognise and no one to recognise”.\n‘A stake through the heart of two-state solution’\nBritish Foreign Secretary David Lammy condemned the plan, saying it “would divide a Palestinian state in two”.\nIn a post on the X social media platform, Mr Lammy called the settlement in the West Bank “a flagrant breach of international law”, which “critically undermines the two-state solution”, and urged the Israeli government to reverse the decision.\nThe UN also condemned the decision, with spokesperson Stephane Dujarric saying that it “will drive a stake through the heart of the two-state solution”.\nRead more:\nInside the conflict forcing Palestinians from their homes\nThe city where what was law now has no place in reality\nWhere is the settlement?\nThe settlement is set to be built in E1, an open tract of land east of Jerusalem, and includes around 3,500 apartments to expand the existing settlement of Maale Adumim.\nE1 has been eyed for Israeli development for more than two decades, but plans were halted due to pressure from the US during previous administrations.\nA two-state solution to the decades-old Israeli-Palestinian conflict would see a Palestinian state in East Jerusalem, the West Bank and Gaza existing side by side with Israel.\nToday, an estimated 700,000 Israeli settlers live in the West Bank and East Jerusalem. There is also a growing movement of Israelis wanting to build settlements in Gaza.\nSettlers make up around 5% of Israel’s population and 15% of the West Bank’s population, according to data from Peace Now.\nSettlements are illegal under international law and have been condemned by the UN. They are, however, authorised by the Israeli government."
    },
    {
      "news_title": "Israel Reports Initial Progress In Gaza City Military Operation",
      "news_link": "https://stratnewsglobal.com/west-asia/israel-west-asia/israel-reports-initial-progress-in-gaza-city-military-operation/",
      "bias": "unknown",
      "text": "Israel’s military has commenced the initial phase of a planned operation aimed at seizing control of Gaza City, Israeli military spokesman Brigadier General Effie Defrin stated on Wednesday.\nFollowing a clash with Hamas south of Khan Younis in the strip on Wednesday, he said: “We will deepen the attack on Hamas in Gaza City, a stronghold of governmental and military terror for the terrorist organisation.”\nDefrin said troops had already begun circling the outskirts of Gaza City and Hamas was now a “battered and bruised” guerrilla force.\n“We have begun the preliminary operations and the first stages of the attack on Gaza City, and already now IDF forces are holding the outskirts of Gaza City,” he said.\nReservists’ Mobilisation Underway\nIsrael’s military called up tens of thousands of reservists on Wednesday in preparation for the expected assault on Gaza City, as the Israeli government considered a new proposal for a ceasefire after nearly two years of war.\nThe call-up signals Israel is pressing ahead with its plan to seize Gaza’s biggest urban centre despite international criticism of an operation likely to force the displacement of many more Palestinians.\nBut a military official briefing reporters said reserve soldiers would not report for duty until September, an interval that gives mediators some time to bridge gaps between Palestinian militant group Hamas and Israel over truce terms.\nIsraeli troops clashed on Wednesday with more than 15 Hamas militants who emerged from tunnel shafts and attacked with gunfire and anti-tank missiles near Khan Younis, south of Gaza City, severely wounding one soldier and lightly wounding two others, an Israeli military official said.\nIn a statement, Hamas’ Al-Qassam Brigades confirmed carrying out a raid on Israeli troops southeast of Khan Younis and engaging Israeli troops at point-blank range. It said one fighter blew himself up among the soldiers, causing casualties, during an attack that lasted several hours.\n(With inputs from Reuters)"
    },
    {
      "news_title": "Israeli army says first steps of Gaza operation start",
      "news_link": "https://www.perthnow.com.au/news/conflict/israeli-army-says-first-steps-of-gaza-operation-start-c-19751531",
      "bias": "unknown",
      "text": "UN's desperate ceasefire appeal before Gaza operation\nUnited Nations Secretary-General Antonio Guterres has made a last ditch appeal for an immediate ceasefire in Gaza, after Israel announced the first steps of an operation to take over Gaza City.\n\"It is vital to reach immediately a ceasefire in Gaza,\" to avoid the death and destruction that a military operation against Gaza City would cause, Guterres said in Japan where he is attending a conference on African development.\nHe also called on Israel to reverse a decision to expand \"illegal\" settlement construction in the West Bank.\nIsrael has called up tens of thousands of reservists while the government considered a new ceasefire proposal to pause nearly two years of war.\n\"We have begun the preliminary operations and the first stages of the attack on Gaza City, and already now IDF forces are holding the outskirts of Gaza City,\" Brigadier General Effie Defrin, Israel's military spokesman, told reporters.\nA military official briefing reporters earlier on Wednesday said reserve soldiers would not report for duty until September, an interval that gives mediators some time to bridge gaps between Hamas and Israel over truce terms.\nBut after Israeli troops clashed with Hamas fighters in the Gaza Strip on Wednesday, Prime Minister Benjamin Netanyahu's office said the Israeli leader sped up the timeline for taking control of Hamas strongholds and defeating the militant group that triggered the conflict with an attack on Israel in October 2023.\n??Since the renewal of ground operations IDF troops have achieved in Gaza:??Operational control of over ~75% of Gaza, striking Hamas' capabilities and terrorist infrastructure, degrading its chain of command, and allowing the IDF to expand operations.?Elimination of about? pic.twitter.com/2pH3LqjAcz? Israel Defense Forces (@IDF) August 20, 2025\nThe Israeli statements signalled Israel was pressing ahead with its plan to seize the Gaza' Strip's biggest urban centre despite international criticism of an operation likely to force the displacement of many more Palestinians.\nDefrin said troops were already operating on the outskirts of Gaza City, and Hamas was now a \"battered and bruised\" guerrilla force.\n\"We will deepen the attack on Hamas in Gaza City, a stronghold of governmental and military terror for the terrorist organisation,\" the spokesman said.\nIsrael currently holds about 75 per cent of the Gaza Strip.\nMany of Israel's closest allies have urged the government to reconsider but Netanyahu is under pressure from some ultranationalist members of his coalition to reject a temporary ceasefire, continue the war and pursue the annexation of the territory.\nFinance Minister Bezalel Smotrich announced final approval on Wednesday of a widely condemned Israeli plan for a settlement project in the occupied West Bank that he said would erase any prospect of a Palestinian state.\nThe war in the Gaza Strip began on October 7, 2023, when gunmen led by Hamas attacked southern Israeli communities near the border, killing about 1200 people, mainly civilians, and taking 251 hostages including children into the enclave, according to Israeli figures.\nMore than 62,000 Palestinians have been killed in Israel's air and ground war in the Gaza Strip since then, according to Gazan health officials, who do not say how many were militants but have said most of those killed have been women and children.\nHamas has accepted a proposal put forward by Arab mediators for a 60-day ceasefire that would involve releasing some of the remaining hostages and freeing Palestinian prisoners in Israel.\nThe Israeli government, which has said all the 50 remaining hostages must be released at once, is studying the proposal.\nIsraeli authorities believe that 20 hostages are still alive.\nMany Gazans and foreign leaders fear a storming of Gaza City would cause significant casualties.\nIsrael says it will help civilians leave battle zones before any assault begins.\nIsraeli troops clashed on Wednesday with more than 15 Hamas militants who emerged from tunnel shafts and attacked with gunfire and anti-tank missiles near Khan Younis, south of Gaza City, severely wounding one soldier and lightly wounding two others, an Israeli military official said.\nIn a statement, Hamas' al-Qassam Brigades confirmed carrying out a raid on Israeli troops southeast of Khan Younis and engaging Israeli troops at point-blank range.\nIt said one fighter blew himself up among the soldiers, causing casualties, during an attack that lasted several hours."
    },
    {
      "news_title": "IDF Attacks Gaza: First Phase of Offensive Begins - Archyworldys",
      "news_link": "https://www.archyworldys.com/idf-attacks-gaza-first-phase-of-offensive-begins/",
      "bias": "unknown",
      "text": "The Shifting Sands of Conflict: How Israel’s Gaza Offensive Signals a New Era of Regional Instability\nOver 60,000 Israeli reservists are being mobilized as the Israel Defense Forces (IDF) initiates the first phase of a ground operation in Gaza. While immediate attention focuses on the unfolding military actions, a deeper analysis reveals this isn’t simply a continuation of existing conflict, but a potential inflection point with far-reaching consequences for regional security and the future of asymmetric warfare. **Gaza** is becoming a testing ground for new military doctrines and a catalyst for escalating geopolitical tensions.\nBeyond the Immediate Offensive: The Rise of ‘Limited War’ Doctrines\nThe current operation, framed as a phased approach, suggests a deliberate shift away from large-scale, protracted conflicts towards what military strategists are calling “limited war” doctrines. This isn’t about a lack of resolve, but a recognition of the constraints imposed by international pressure, domestic political considerations – including the reported reluctance of some reservists to participate – and the evolving nature of modern warfare. The IDF’s strategy appears to be focused on surgically targeting Hamas infrastructure while attempting to minimize civilian casualties, a difficult balance that will be intensely scrutinized.\nThe Reservist Dilemma: A Cracking Foundation of National Service?\nReports of increasing reluctance among Israeli reservists to participate in prolonged military engagements are particularly noteworthy. This isn’t simply about individual opposition to the conflict; it reflects a growing societal fatigue with continuous mobilization and a questioning of the long-term strategic goals. This trend, if it continues, could fundamentally alter Israel’s security model, which has historically relied heavily on a robust reserve force. The implications extend beyond Israel, potentially signaling a broader global trend of declining public support for prolonged military interventions.\nThe Geopolitical Ripple Effect: Iran, Hezbollah, and the Widening Conflict Zone\nThe Gaza offensive cannot be viewed in isolation. It’s inextricably linked to the broader geopolitical landscape, particularly the escalating tensions with Iran and its proxy forces, such as Hezbollah. A prolonged conflict in Gaza increases the risk of a multi-front war, potentially drawing in other regional actors and destabilizing the entire Middle East. The possibility of coordinated attacks by Iran-backed militias against U.S. interests in the region is also a significant concern.\nThe Role of Emerging Technologies: Drones, AI, and the Future Battlefield\nThis conflict is also likely to be a proving ground for emerging military technologies. We can expect to see increased reliance on drones for surveillance, reconnaissance, and targeted strikes. Artificial intelligence (AI) will play a growing role in analyzing battlefield data, identifying targets, and automating defensive systems. The use of these technologies raises ethical concerns about autonomous weapons systems and the potential for unintended consequences, but their deployment is almost inevitable.\n| Key Metric | Current Status | Projected Impact (Next 6 Months) |\n|---|---|---|\n| Israeli Reservist Mobilization | 60,000+ | Potential increase to 300,000+ depending on escalation |\n| Regional Conflict Risk | High | Increased probability of multi-front war (30-40%) |\n| Use of Drone Technology | Significant | Further integration into offensive and defensive strategies |\nThe Humanitarian Crisis and the Erosion of International Norms\nThe humanitarian situation in Gaza is already dire, and a full-scale ground offensive will undoubtedly exacerbate the crisis. The potential for widespread civilian casualties and displacement raises serious concerns about violations of international humanitarian law. The erosion of these norms not only undermines the principles of a rules-based international order but also creates a breeding ground for radicalization and future conflict.\nFrequently Asked Questions About the Gaza Conflict\nWhat is the likely duration of the IDF’s operation in Gaza?\nPredicting the duration is difficult, but based on previous engagements and the stated objectives of a “phased” approach, the initial phase could last several weeks, with the potential for a prolonged occupation depending on the success of the operation and the response from Hamas.\nHow will this conflict impact the Israeli-Palestinian peace process?\nUnfortunately, the current escalation is likely to further derail any prospects for meaningful peace negotiations. The increased violence and distrust will make it even more difficult to bridge the deep divisions between Israelis and Palestinians.\nWhat role will international diplomacy play in de-escalating the conflict?\nInternational diplomacy will be crucial, but its effectiveness is limited by the complex geopolitical dynamics and the lack of a unified approach among key stakeholders. The United States, Egypt, and Qatar are likely to play key roles in mediating a ceasefire, but success is far from guaranteed.\nThe unfolding events in Gaza represent more than just a localized conflict. They are a harbinger of a new era of regional instability, characterized by limited war doctrines, technological disruption, and a growing humanitarian crisis. Understanding these trends is critical for navigating the complex challenges that lie ahead and preventing further escalation.\nWhat are your predictions for the long-term consequences of this conflict? Share your insights in the comments below!"
    },
    {
      "news_title": "Amid ongoing Israeli attacks, ‘the systematic destruction of Gaza City is already underway’: UN rights office",
      "news_link": "https://news.un.org/en/story/2025/08/1165690",
      "bias": "unknown",
      "text": "Amid ongoing Israeli attacks, ‘the systematic destruction of Gaza City is already underway’: UN rights office\nThe Israeli military has escalated attacks across Gaza City, reportedly deciding to press ahead with plans to take full control which will only lead to further “mass killings of civilians” and displacement, UN human rights officials warned on Wednesday.\nRecent attacks have been particularly devastating in the Az Zaytoun neighbourhood, where airstrikes, artillery shelling and gunfire are continuous and intense, causing a high number of civilian casualties and the large-scale destruction of residential buildings and public facilities, the UN human rights office, OHCHR, in the Occupied Palestinian Territory said in a statement.\nSince 8 August, the office has recorded 54 attacks on residential buildings and entire blocks in Gaza City, killing 87 Palestinians, including at least 25 children and entire families.\nIt also recorded attacks on shelters for internally displaced people, including tents and schools, killing at least 14.\nThese casualty figures “indicate that the systematic destruction of Gaza City is already underway,” the statement said.\nHowever, OHCHR stressed that these devastating figures are only a portion of the actual toll due to underreporting in such dire circumstances.\nImpact of attacks\nAs a result of recent attacks, hundreds of families have been forced to flee, with nowhere safe to go amid dire humanitarian conditions across the Gaza Strip.\nHowever, those who remain trapped are completely cut off from food, water and medical supplies.\nOHCHR emphasised that “Israel’s reported decision to take full control of Gaza City and to forcibly displace its population will lead to mass killings of civilians and destruction of infrastructure vital to the survival of the population.”\nThe office is seeing the Israeli military repeat means of warfare that caused mass killings, serious injuries, forced displacement, arbitrary detention, starvation and extensive destruction in previous operations in North Gaza and Rafah.\nTo reportedly prepare for the offensive, the Israeli military has repeatedly called on Palestinians to move to Al Mawasi, west of Khan Younis.\nHowever, Israel has repeatedly struck tents of the displaced in Al Mawasi, where people are struggling to survive with barely any access to food, water and other necessities.\nViolations of international law\nUnder international law, Israel must not destroy civilian property unless it is rendered necessary by military operations. Yet, the widespread destruction of residential buildings in Gaza City is not seen as an imperative military necessity.\nAdditionally, by forcing the entire population of Gaza City and those remaining in North Gaza into displacement – with no shelter, food or medical provisions and no indication for allowing them to return to their homes in the future – OHCHR is concerned that these are grave breaches of the Fourth Geneva Convention.\nThus, the office is urging States party to the Geneva Conventions to follow their obligation “to exert maximum pressure on Israel to immediately halt this offensive, which risks triggering an unprecedented, life-threatening humanitarian crisis and permanently extinguishing the Palestinian presence in Gaza’s largest urban area.”\nWorst-case famine\nMeanwhile, the World Food Programme (WFP) welcomed Japan’s life-saving contribution of 500 million yen ($3.3 million) to provide emergency food and nutrition assistance to Palestinians as they face severe food insecurity.\nAdding to the assistance, on 4 August, limited commercial truck entries resumed, containing mainly dry food items and a small amount of fresh produce, according to the UN aid coordination office, OCHA.\nHowever, the risk of spoilage and infestation of food supplies has drastically increased due to being stranded for months, heat and impending expiration dates.\nFurthermore, cooking gas has not entered Gaza for over five months, and firewood has become increasingly unaffordable, forcing many to use waste and scrap wood as alternative cooking sources, exacerbating health and environmental risks.\nDue to such limited aid, WFP underscored that the latest Integrated Food Security Phase Classification report finds that the worst-case scenario of famine is currently occurring in the Gaza Strip.\n“I meet families who have lost everything and don’t know where their next meal will come from.” said Antoine Renard, WFP Representative and Country Director in Palestine.\nBut thanks to this support from Japan, he continued, “WFP can continue procuring life-saving food assistance, but we urgently need a ceasefire and sustained access to reach those most at risk and prevent a full-scale famine.”"
    },
    {
      "news_title": "Israel has begun its planned assault on Gaza City amid clashes with Hamas",
      "news_link": "https://www.sundayworld.com/news/world-news/israel-has-begun-its-planned-assault-on-gaza-city-amid-clashes-with-hamas/a1763971915.html",
      "bias": "unknown",
      "text": "- Home >\n- News >\n- World News\nIsrael has begun its planned assault on Gaza City amid clashes with Hamas\nIsrael’s security cabinet, chaired by Prime Minister Benjamin Netanyahu, approved a plan this month to expand the campaign in Gaza with the aim of taking Gaza City\nIsrael has entered the first stages of its planned assault on Gaza City after a clash with Hamas and already has a hold on the outskirts of the city, Israeli military spokesman Effie Defrin told reporters on Wednesday.\nIsrael's military called up tens of thousands of reservists on Wednesday in preparation for the assault on Gaza City, as the Israeli government supposedly considered a new proposal for a ceasefire after nearly two years of war.\nThe call-up signals Israel is pressing ahead with its plan to seize Gaza's biggest urban centre despite international criticism of an operation likely to force the displacement of many more Palestinians.\nBut a military official briefing reporters said reserve soldiers would not report for duty until September, an interval that gives mediators some time to bridge gaps between Palestinian militant group Hamas and Israel over truce terms.\nThe official said that as part of planning for a new offensive in the Gaza Strip, there would be five divisions operating in the enclave, but most reservists were not expected to serve in combat in Gaza City.\n\"We will be moving into a new phase of combat, a gradual, precise and targeted operation in and around Gaza City, which currently serves as Hamas' main military and governing stronghold,\" the official said.\nIsrael’s security cabinet, chaired by Prime Minister Benjamin Netanyahu, approved a plan this month to expand the campaign in Gaza with the aim of taking Gaza City, where Israeli forces waged fierce urban warfare with Hamas in the early stages of the war. Israel currently holds about 75pc of the Gaza Strip.\nMany of Israel’s closest allies have urged the government to reconsider but Netanyahu is under pressure from some far-right members of his coalition to reject a temporary ceasefire, continue the war and pursue the annexation of the territory.\nOne far-right member, Finance Minister Bezalel Smotrich, announced final approval on Wednesday of a widely condemned Israeli plan for a settlement project in the occupied West Bank that he said would erase any prospect of a Palestinian state.\nThe war in Gaza began on October 7, 2023, when gunmen led by Hamas attacked southern Israeli communities near the border, killing some 1,200 people, mainly civilians, and taking 251 hostages including children into Gaza.\nOver 62,000 Palestinians have been killed in Israel's air and ground war in Gaza since then, according to Gaza health officials, who do not say how many were militants but have said most of those killed have been women and children.\nHamas has accepted a proposal put forward by Arab mediators for a 60-day ceasefire that would involve releasing some of the remaining hostages and freeing Palestinian prisoners in Israel.\nThe Israeli government, which has said all the 50 remaining hostages must be released at once, is studying the proposal. Israeli authorities believe that 20 hostages are still alive.\nMany Gazans and foreign leaders fear a storming of Gaza City would cause significant casualties. Israel says it will help civilians leave battle zones before any assault begins.\nIsraeli troops clashed on Wednesday with more than 15 Hamas militants who emerged from tunnel shafts and attacked with gunfire and anti-tank missiles near Khan Younis, south of Gaza City, severely wounding one soldier and lightly wounding two others, an Israeli military official said.\nIn a statement, Hamas' Al-Qassam Brigades confirmed carrying out a raid on Israeli troops southeast of Khan Younis and engaging Israeli troops at point-blank range. It said one fighter blew himself up among the soldiers, causing casualties, during an attack that lasted several hours.\nIsrael's military campaign has caused widespread devastation across the Gaza Strip, which before the war was home to about 2.3 million Palestinians. Many buildings including homes, schools and mosques have been destroyed, while the military has accused Hamas of operating from within civilian infrastructure.\nMost Gazans have been displaced multiple times and forced into densely packed areas along the Mediterranean coast, including in Gaza City in the enclave's north.\nIsraeli officials have said evacuation orders would be issued to Gaza City residents before any force moves in.\nThe Latin Patriarchate of Jerusalem, which oversees Gaza's only Catholic Church, located in Gaza City, said it had received reports that neighbourhoods near the small parish had started to receive evacuation notices.\nHamas, an Islamist movement that has ruled Gaza for almost two decades, has been severely weakened by the war. The Israeli military says Hamas has been reduced to a guerrilla force.\nThe Israeli military official who briefed reporters on Wednesday said Hamas had been trying to regroup and re-form in Gaza City in a more organised manner, but gave no evidence to support the assertion.\nHamas has said it would release all remaining hostages in exchange for an end to war. Israel says it will not end the war before Hamas disarms.\nOpinion polls show strong Israeli public support for ending the war if it ensures the release of the hostages, and a rally in Tel Aviv urging the government to pursue such a deal drew a huge crowd on Saturday.\nA new Reuters/Ipsos poll of Americans showed a 58pc majority believe that every country in the United Nations should recognise Palestine as a nation."
    },
    {
      "news_title": "Israel will mobilize tens of thousands of reservists for expanded Gaza operation",
      "news_link": "https://www.excelsio.net/2025/08/israel-will-mobilize-tens-of-thousands.html",
      "bias": "unknown",
      "text": "The Israeli military said Wednesday that the country’s defense minister has approved plans to begin a new phase of operations in some of Gaza’s most densely populated areas, and that it would call up 60,000 reservists and lengthen the service of an additional 20,000 reservists currently serving.\nSubscribe to:\nPost Comments (Atom)\nComments\nPost a Comment\nLeave a comment. Thanks!\nComentarios de Facebook"
    },
    {
      "news_title": "Israeli Army to Call Up 60,000 Reservist Soldiers for Gaza Occupation Plan, Local Media Reports - Clarion India",
      "news_link": "https://clarionindia.net/israeli-army-to-call-up-60000-reservist-soldiers-for-gaza-occupation-plan-local-media-reports/",
      "bias": "unknown",
      "text": null
    },
    {
      "news_title": "Israel to call 60K reservists to seize Gaza City",
      "news_link": "https://newspakistan.tv/2025/08/20/israel-to-call-60k-reservists-to-seize-gaza-city/",
      "bias": "unknown",
      "text": "JERUSALEM: Defense Minister Israel Katz has given the green light to call up sixty thousand reservists in the coming weeks to seize Gaza City.\nIt is pertinent to mention here that on 8th August, Israeli Prime Minister Benjamin Netanyahu, bewildered by the condemnations of security cabinet’s decision apropos controlling Gaza City, took a U-Turn saying that he did not intend to occupy Gaza: “We are not going to occupy Gaza – we are going to free Gaza from Hamas.”\nEyal Zamir, the chief of Israeli armed forces, himself opposed the plan to occupy Gaza City. Moreover, the Israeli reservist organization had asked the troops to ignore orders. Yotam Vilk, a captain in the reserves said in a Haaretz‘ op-ed that he felt betrayed by the Israeli government: “I can’t stay silent. Not after I saw with my own eyes the human toll of any additional day in Gaza. Not after I saw what neglect and abandonment look like, and how a government willing to sacrifice all of us for the sake of its false promises looks like.”\nFrance, that is set to recognise the state of Palestine at the UN session, has condemned in strongest terms the Israeli’s plan to control Gaza city: “These actions would constitute further serious violations of international law and lead to an absolute stalemate. They would undermine the legitimate aspirations of the Palestinians to live in peace in a viable, sovereign, and contiguous state, and pose a threat to regional stability.” France believes that the future of Gaza should be through a framework of a future Palestinian state led by Palestinian Authority.\nOn 8th of August, EU chief Ursula von der Leyen called on Israel to reconsider its plan to control Gaza. Taking to the Social Media, she stated, state: “The Israeli government’s decision to further extend its military operation in Gaza must be reconsidered. At the same time, there must be the release of all hostages, who are being held in inhumane conditions. And humanitarian aid must be given immediate and unhindered access to Gaza to deliver what is urgently needed on the ground. A ceasefire is needed now.”\nGerman Chancellor Friedrich Merz proclaimed that his country would not approve any exports of military equipment to Israel. Germany, that had supported Jerusalem for a long time, warned in May: “The Israeli government must not do anything that its best friends are no longer prepared to accept.” But now Merz has made it clear that Berlin would not tolerate the worsening condition in Gaza. Belgium disapproved Israel’s plan to control Gaza City and continued colonisation of Palestinian land. Maxime Prevot, Belgium’s Foreign Minister, told that the Israeli Envoy had been informed about Brussels’ stance.\nNewspakistan.tv"
    },
    {
      "news_title": "Israel enters first stage of planned assault on Gaza City – Mnnofa",
      "news_link": "https://www.mnnofa.com/world-news/israel-enters-first-stage-of-planned-assault-on-gaza-city/",
      "bias": "unknown",
      "text": "TEL AVIV — Israelon Wednesday entered the first stages of a planned assault on Gaza City after approving a plan to take it over that includes calling up 60,000 reservists for an expanded military operation in the besieged Palestinian enclave.\n“We have begun the preliminary actions and the initial stages of the offensive on Gaza City, and already now IDF forces are holding positions on the outskirts of Gaza City,” Israeli military spokesman Effie Defrin told reporters on Wednesday.\nHe added: “We will intensify the strikes on Hamas in Gaza City, the political and military stronghold of the terror organization.”\nDefrin also said that to “minimize harm to civilians,” the IDF will be warning citizens to allow them to evacuate.\n“We are continuing to allow humanitarian aid for the residents of the Strip and are even expanding it — with additional central aid distribution points,” he said.\nThe U.S. ally appeared to be pushing ahead Wednesday with a new phase of its war despite international opposition — and in the face of a renewed push for a ceasefire with Hamas.\nDefense Minister Israel Katz has authorized the plans for the major new operation, a spokesperson for the ministry confirmed to NBC News. It will also see an additional 20,000 reservists have their service extended, the Israeli military said.\nThe assault is expected to force thousands of Palestinians in northern Gaza to the south of the strip, which is suffering an intensifying hunger crisis under Israel’s military offensive and aid restrictions.\nIn a statement Wednesday night, the prime minister’s office said that “ahead of approval of the plans for the operation in Gaza City, Prime Minister Benjamin Netanyahu has directed that the timetables — for seizing control of the last terrorist strongholds and the defeat of Hamas — be shortened.”\n“The Prime Minister expresses his great appreciation for the reservist fighters who have been mobilized and their families, and all IDF soldiers,” the statement added. “Together we will win.”\nHamas did not issue an immediate response to the announcement about Israeli troops taking up positions outside Gaza City.\nU.S. President Donald Trump supports Israel’s efforts to disarm Hamas, U.S. Ambassador to Israel Mike Huckabee told the Associated Press on Wednesday.\n“Israel has to make this decision and has to live with whatever decision they make. But President Trump is fully supportive of making sure that Hamas knows that from the U.S. perspective, they have to disarm, they have to give up and let all the hostages go,” he said. “Whether it takes 60 days or 60 minutes, that’s the ultimate end result.”\nScores of people in Gaza have starved to death in recent weeks, including dozens of children, according to the Palestinian health ministry in the enclave.\nIn addition to mounting global outrage, sweeping protests have increasingly dominated Israel’s streets, with growing numbers demanding an end to the offensive in the enclave.\nHundreds of thousands staged furious demonstrations last weekend alongside a general strike, fueled in part by fears that the planned Gaza City assault could endanger the lives of remaining hostages.\nIsrael also gave final approval for a widely contested settlement project in the occupied West Bank that would effectively split the territory in two. Palestinians and rights groups have warned the move could destroy plans for a future Palestinian state.\nHuckabee said that recent announcements by European leaders recognizing a Palestinian state would be “counterproductive.”\n“If they believe that, unilaterally, calling for a two-state a Palestinian state recognition immediately brings them closer, the sad truth is it’s taking them further away,” he said.\nCeasefire talks uncertain\nKatz, who replaced Yoav Gallant as defense minister last year, was holding a discussion Tuesday to approve “strike plans in Gaza” with the Israel Defense Forces chief of staff, Lt. Gen. Eyal Zamir, and other senior defense officials, the defense ministry had said.\nThe announcement of the expanded military operation comes after Israel appeared to shrug off news that Hamas had agreed to the latest proposal from Arab mediators for a ceasefire deal in Gaza that would free the remaining hostages.\nEgyptian Foreign Minister Badr Abdelatty told NBC News on Tuesday that the deal was based on a proposal by Trump’s Middle East envoy, Steve Witkoff, for a 60-day ceasefire, during which some of the remaining 50 hostages, both alive and dead, would be released with plans to negotiate a lasting ceasefire and the return of the rest.\n“The ball is now in Israel’s court,” Abdelatty said, adding: “We would like a positive response from them as soon as possible in order to deal with the disastrous situation in Gaza, especially the starvation and the killing of civilians.”\nAsked about the development, a spokesperson for Israeli Prime Minister Benjamin Netanyahu’s office referred NBC News to a statement the Israeli leader made Monday suggesting he was determined to push ahead with the plan to assume full control of Gaza City and noting that Hamas appeared to be “under immense pressure.”\nAsked if they could confirm reports that Israel would provide a response to international mediators on the proposal by Friday, the spokesperson said “no” and did not provide further clarification.\n‘There is no safe place’\nNew satellite imagery suggests that a number of people have already begun to flee the area of Gaza City in recent days ahead of Israel’s advance, with the country’s plan to push civilians living in the area into the enclave’s south condemned by rights groups.\nImagery captured on Aug. 16 shows that sites just south of Gaza City are seemingly barren, having been packed with what appear to be tent camps just days before, on Aug. 9.\nMohammed Abu Sharia, a father of three, said he and his family had been forced to leave their home in Gaza City again — just months after returning from another round of displacement due to Israel’s offensive.\n“Thank God, we found our house almost intact and habitable, despite the theft of all its contents and the lack of doors or windows,” Abu Sharia, 48, who ran an internet distribution company before Israel’s assault began, told NBC News on Wednesday.\nThe family was able to live in their home for the past six months — but with Israel planning to take over Gaza City, they were now seeking some semblance of refuge in western Gaza.\n“There is no safe place, neither in the north nor the south,” Abu Sharia said. “My concern is to save the family’s life, as we are suffering from food shortages and the lack of any belongings with us.”\n“Further displacement and an intensification in hostilities risk worsening an already catastrophic situation,” the International Committee of the Red Cross said in a statement.\n“With more than 80 percent of Gaza already impacted by evacuation orders, it is unimaginable that civilians could be compelled to move to an even smaller area,” it said.\nIsrael launched its offensive in Gaza following the Hamas-led attacks on Oct. 7, 2023, in which some 1,200 people were killed and around 250 taken hostage, marking a major escalation in a decadeslong conflict.\nSince then, more than 62,000 people have been killed in Gaza, including thousands of children, according to the Palestinian health ministry in the enclave, with much of the territory destroyed.\nRecent Comments"
    },
    {
      "news_title": "Israel prepares major offensive on Gaza City, mobilizing tens of thousands of troops",
      "news_link": "https://www.jwire.com.au/israel-prepares-major-offensive-on-gaza-city-mobilizing-tens-of-thousands-of-troops/",
      "bias": "unknown",
      "text": "Israel prepares major offensive on Gaza City, mobilizing tens of thousands of troops\nThe Israeli military is preparing a major offensive against Hamas in Gaza City, involving five divisions and tens of thousands of troops, the Israel Defence Forces said.\nThe forces include 12 brigade-level teams, each with infantry, armoured units, artillery, combat engineers, and support elements. In addition, the Gaza Division’s northern and southern brigades, normally assigned to the border, will join, bringing the total number of brigade-level teams to 14.\nThe operation, called “Gideon’s Chariots B,” is already entering its preparatory phase, with IDF units advancing on Gaza City’s outskirts. The Nahal Infantry Brigade and the 7th Armoured Brigade have been active in the Zeitoun neighbourhood, while the Givati Infantry Brigade launched a push in Kafr Jabalia in the city’s north.\nAt the same time, the military is establishing humanitarian infrastructure in southern Gaza for an estimated one million civilians expected to be displaced. Field hospitals and additional aid distribution points are planned, and the European Hospital in Khan Yunis, closed after the IDF discovered a Hamas tunnel beneath it, is expected to reopen.\n“As part of the preparations to move the population from Gaza City to the southern Gaza Strip, talks have begun with international organizations to recruit them to establish additional field hospitals in the south, and there is a positive response to this,” a security official said. “There are also plans to expand the existing medical infrastructure in the south in cooperation with the organizations, and, in addition, options are being examined to open access routes to additional medical facilities.”\n“The UN and the organizations have begun formulating a plan to restart the European Hospital as an additional medical response,” the official added.\nThe offensive will unfold in stages. First, civilians will receive evacuation warnings. Then the IDF will encircle Gaza City before advancing into areas previously uncleared of Hamas infrastructure. Defence Minister Israel Katz approved the plan on Tuesday, and it is scheduled for presentation to Prime Minister Benjamin Netanyahu and the Cabinet on Thursday.\nTo support the campaign, Israel is mobilising 60,000 reservists in several waves, with the first 40,000–50,000 expected to report on September 2. A second wave is planned for late 2025, and a third for early 2026. Regular soldiers’ service will be extended by 30 to 40 days to meet operational needs. At the peak of the operation, the military anticipates up to 130,000 reserve soldiers on active duty across Gaza, Judea and Samaria, and northern Israel.\nThe IDF reiterated that the offensive’s political objective is to defeat Hamas. “Two out of five brigades of Hamas’ military wing remain,” an IDF source said. “The Chief of Staff believes in the need to defeat Hamas,” though the military did not define the criteria for this goal.\nCivilian preparations are already underway through the Coordinator of Government Activities in the Territories (COGAT), which is coordinating hospital readiness and field hospital construction in southern Gaza. International organisations will help operate facilities in areas including the Central and Mawasi refugee camps, where displaced Gaza City residents are expected to relocate.\n“This is an evolving plan,” the army said, “and preparations on the outskirts of Gaza City are ongoing as part of a larger effort to expand operations deeper into the city while minimizing civilian casualties.”\nApproximately 1,200 people were killed, and 252 Israelis and foreigners were taken hostage in Hamas’s attacks on Israeli communities near the Gaza border on October 7. Of the 50 remaining hostages, around 30 are believed to be dead."
    }
  ]
}