{
  "story_id": "GN_20250825_221536_9b207e67",
  "metadata": {
    "title": "India Bans Vast Online Gambling Industry",
    "timestamp": "2025-08-25T22:15:36.204797",
    "url": "https://ground.news/article/rajya-sabha-passes-online-gaming-bill-amid-opposition-protests"
  },
  "bias_distribution": {
    "total_sources": "88",
    "leaning_left": "4",
    "center": "5",
    "leaning_right": "13"
  },
  "perspective_summaries": {
    "left": [
      "The Promotion and Regulation of Online Gaming Bill, 2025, was passed by the Rajya Sabha on August 21, 2025, after clearance by the Lok Sabha a day earlier.",
      "This Bill prohibits online money games in India, with penalties including imprisonment for up to three years and fines up to Rs 1 crore.",
      "Union Minister Ashwini Vaishnaw emphasized the Bill's importance, stating it seeks to take strict action against malpractices in society and will not be delayed by ongoing work on other legislation.",
      "The law aims to ban real money games, significantly impacting the online gaming industry and affecting companies like Dream11 and MPL."
    ],
    "center": [
      "India's parliament has passed a bill to ban online games played with money, aiming to reduce financial and psychological harm, as noted by the government.",
      "The online gaming industry, valued at $3.6 billion by 2029, faces severe disruptions as several companies begin shutting down real-money operations.",
      "Dream Sports and Mobile Premier League suspended real-money games following the bill's passage, impacting jobs and services.",
      "Prime Minister Narendra Modi stated that the bill aims to promote creativity in gaming while protecting society from the harmful effects of online money games."
    ],
    "right": [
      "The Rajya Sabha passed 'The Promotion and Regulation of Online Gaming Bill' amid opposition protests and disruptions.",
      "Union Minister Ashwini Vaishnaw highlighted that the bill's third segment, Online Money Gaming, poses a public health risk affecting 45 crore people.",
      "The bill bans online money gaming and establishes a central authority for regulation and oversight.",
      "Minister Vaishnaw stated that financial losses from online money gaming are estimated to exceed Rs 30,000 crore."
    ]
  },
  "sources": [
    {
      "news_title": "India’s government bans fantasy sports games",
      "news_link": "https://www.economist.com/asia/2025/08/24/indias-government-bans-fantasy-sports-games",
      "bias": "Center",
      "text": "India’s government bans fantasy sports games\nHeavy-handed regulation of a flourishing industry could backfire\nHow quickly can you get rich in India? According to fans of fantasy-gaming platforms, such as Dream11, it is possible to do so in a matter of hours. Spend as little as eight rupees (ten cents) ahead of a cricket match and a punter could win hundreds of thousands rupees if their virtual team ends up performing well on the pitch. The prospect, albeit unlikely, of such tantalising returns, combined with glitzy marketing campaigns featuring Bollywood stars, has lured 200m users to Dream11’s platform since it started in 2008—a higher number than Indian stockmarket investors.\nThe world is learning to live with the Taliban\nFour years after the fall of Kabul, governments are quietly recognising the insurgents\nPakistan is critical in the fight against Islamic State terrorism\nIt is helping the West but wants arms and intelligence in return\nHow fair are India’s elections?\nRahul Gandhi, an opposition leader, raises some uncomfortable questions\nTSMC could revolutionise rural Japan\nIts “Silicon Island” is getting a second chance at success\nJapan storms back into the chip wars\nThe country used to be a semiconductor powerhouse. Can it be one again?\nWhat Sara Duterte’s comeback means for the Philippines\nShe could be the front-runner for the election in 2028"
    },
    {
      "news_title": "Time's Up For Real-Money Online Games As Bill Becomes Law",
      "news_link": "https://www.ndtv.com/india-news/online-gaming-bill-gets-presidents-assent-becomes-law-9139729",
      "bias": "Lean Right",
      "text": null
    },
    {
      "news_title": "India’s online betting ban could fuel offshore crypto gambling: Andy Mukherjee",
      "news_link": "https://www.biznews.com/global-citizen/indias-online-betting-ban-andy-mukherjee",
      "bias": "Lean Right",
      "text": "Global Citizen\nIndia’s online betting ban could fuel offshore crypto gambling: Andy Mukherjee\nExperts warn the ban may push players to unregulated international sites.\nKey topics:\nIndia bans real-money online gaming, citing addiction and fraud risks.\nOffshore crypto betting likely to rise, undermining tax and regulation.\nFantasy sports, e-sports, and traditional sports sponsorships affected.\nSign up for your early morning brew of the BizNews Insider to keep you up to speed with the content that matters. The newsletter will land in your inbox at 5:30am weekdays. Register here.\nSupport South Africa’s bastion of independent journalism, offering balanced insights on investments, business, and the political economy, by joining BizNews Premium. Register here.\nIf you prefer WhatsApp for updates, sign up to the BizNews channel here.\nBy Andy Mukherjee"
    },
    {
      "news_title": "India’s parliament bans vast online gambling industry",
      "news_link": "https://www.aljazeera.com/sports/2025/8/22/indias-parliament-bans-vast-online-gambling-industry",
      "bias": "Lean Left",
      "text": "India’s parliament bans vast online gambling industry\nIndia’s new online gambling laws could see offenders face up to five years in prison.\nIndia’s parliament has passed a sweeping bill banning online gambling, after government figures showed companies had stripped $2.3bn annually from 450 million people.\nThe ban affects platforms for card games, poker and fantasy sports, including India’s wildly popular homegrown fantasy cricket apps.\nRecommended Stories\nlist of 4 itemsArgentina and Chile fans trade blame over ‘barbaric’ violence\nItalian football coaches seek suspension of Israel World Cup ties\nGaza bodybuilders fight to preserve muscle amid deliberate starvation\nIt also leaves the fate of the key sponsor for India’s national cricket team in question.\nDream11, India’s biggest fantasy sports gaming platform, was named on July 2023 as the country’s lead sponsor for three years, with its logo splashed on Team India jerseys.\nNo announcement has been made by the Board of Control for Cricket in India (BCCI) regarding that key sponsor.\n“If it’s not permissible, we’ll not do anything,” BCCI secretary Devajit Saikia said Friday. “The BCCI will follow every policy of the country that is framed by the central government.”\nThe Promotion and Regulation of Online Gaming Bill was passed by both houses of parliament late on Thursday, and criminalises the offering, promotion and financing of such games, with offenders facing up to five years in prison.\nDream 11, in a statement posted on its website on Friday, noted that, following the passing of the bill, “cash games and contests have been discontinued”, but urged fans to “stay tuned”.\nOther games remained online on Friday, with the bill still needing to be formally ratified by the president before taking effect.\n“This legislation is designed to curb addiction, financial ruin and social distress caused by predatory gaming platforms that thrive on misleading promises of quick wealth,” a government statement said.\nIndia’s wider gaming industry is one of the largest markets in the world, but the new law carves out exceptions for e-sports and educational games, which the government says will be promoted as part of the digital economy.\nPrime Minister Narendra Modi said the new law will “encourage e-sports and online social games” while “at the same time, it will save our society from the harmful effects of online money games”.\nThe government said roughly a third of the world’s most populous country had lost money gambling online.\nIndustry groups had urged regulation and taxation rather than a blanket ban, warning the move could drive players to illegal offshore platforms.\nBut supporters of the bill argued that the social costs are too high to allow.\nOfficials said the rapid spread of gambling platforms had caused widespread financial distress, addiction and even suicide.\nThe government said it had also been linked to fraud, money laundering and terrorism financing.\nAshwini Vaishnaw, the minister of technology, noted the law differentiates between online “social” games and those played for money.\n“It encourages e-sports, which are organised competitive video games, and promotes safe online social and educational games,” a government briefing note read.\n“It clearly separates constructive digital recreation from betting, gambling and fantasy money games that exploit users with false promises of profit.”"
    },
    {
      "news_title": "India passes sweeping ban on online gambling, targets fantasy sports platforms",
      "news_link": "https://www.malaymail.com/news/world/2025/08/22/india-passes-sweeping-ban-on-online-gambling-targets-fantasy-sports-platforms/188576",
      "bias": "Lean Right",
      "text": "NEW DEHLI, Aug 2 — India’s parliament has passed a sweeping bill banning online gambling, after government figures showed companies had stripped US$2.3 billion annually from 450 million people.\nThe ban impacts platforms for card games, poker and fantasy sports, including India’s wildly popular homegrown fantasy cricket apps.\nIt also leaves the fate of the key sponsor for India’s national cricket team in question.\nDream11, India’s biggest fantasy sports gaming platform, was named on July 2023 as the country’s lead sponsor for three years, with its logo splashed on Team India jerseys.\nNo announcement has been made by the Board of Control for Cricket in India (BCCI) regarding that key sponsor.\n“If it’s not permissible, we’ll not do anything,” BCCI secretary Devajit Saikia said Friday. “The BCCI will follow every policy of the country that is framed by the central government.”\nThe Promotion and Regulation of Online Gaming Bill was passed by both houses of parliament late on Thursday, and criminalises the offering, promotion and financing of such games, with offenders facing up to five years in prison.\nDream 11, in a statement posted on its website on Friday, noted that, following the passing of the bill, “cash games and contests have been discontinued”, but urged fans to “stay tuned”.\nOther games remained online on Friday, with the bill still needing to be formally ratified by the president before taking effect.\nPredatory gaming platforms\n“This legislation is designed to curb addiction, financial ruin and social distress caused by predatory gaming platforms that thrive on misleading promises of quick wealth,” a government statement said.\nIndia’s wider gaming industry is one of the largest markets in the world, but the new law carves out exceptions for e-sports and educational games, which the government says will be promoted as part of the digital economy.\nPrime Minister Narendra Modi said the new law will “encourage e-sports and online social games” while “at the same time, it will save our society from the harmful effects of online money games.”\nThe government said roughly a third of the world’s most populous country had lost money gambling online.\nIndustry groups had urged regulation and taxation rather than a blanket ban, warning the move could drive players to illegal offshore platforms.\nBut supporters of the bill argued that the social costs are too high to allow.\nOfficials said the rapid spread of gambling platforms had caused widespread financial distress, addiction and even suicide.\nThe government said it had also been linked to fraud, money laundering and terrorism financing.\nAshwini Vaishnaw, minister of technology, noted the law differentiates between online “social” games and those played for money.\n“It encourages e-sports, which are organised competitive video games, and promotes safe online social and educational games”, a government briefing note read.\n“It clearly separates constructive digital recreation from betting, gambling and fantasy money games that exploit users with false promises of profit.” — AFP"
    },
    {
      "news_title": "Is Dream11 Banned? Will India Be Without Jersey Sponsor for Asia Cup 2025? All Questions Answered As Government Passes Promotion and Regulation of Online Gaming Bill 2025 | 🏏 LatestLY",
      "news_link": "https://www.latestly.com/sports/cricket/is-dream11-banned-will-india-be-without-jersey-sponsor-for-asia-cup-2025-all-questions-answered-as-government-passes-promotion-and-regulation-of-online-gaming-bill-2025-7071918.html",
      "bias": "Right",
      "text": "Is Dream11 banned? Will the India National Cricket Team be without a jersey sponsor for the Asia Cup 2025? All these questions might arise in the minds of fans after the Government of India passed the Promotion and Regulation of Online Gaming Bill 2025. On August 21, the Parliament of India passed the Promotion and Regulation of Online Gaming Bill 2025, according to which, money-based online games have been banned in a bid to protect the citizens from financial hazards that can be caused by addiction to such games. This sudden crackdown comes across as a massive blow to the online gaming industry, particularly the fantasy gaming industry in India. Mobile Premier League, Zupee and Other Fantasy Apps Suspend Money Games After Indian Government Passes Online Gaming Bill 2025.\nThe Promotion and Regulation of Online Gaming Bill 2025 strictly prohibits 'advertising and promotion of online money-based games' and fans will soon be unable to access the 'unlawful platforms.' However, it is to be made clear that the bill does not ban online gaming as such, with online games focusing on education, culture, or skills being encouraged. After the bill was passed, several fantasy applications suspended online money games, the likes of which include Dream11-run 'Dream Picks', 'Zupee' and also Mobile Premier League (MPL).\nIs Dream11 Banned Now After the Promotion and Regulation of Online Gaming Bill 2025 is Passed?\nDream11 is among the major businesses to take a hit from the passing of the Promotion and Regulation of Online Gaming Bill 2025, as a major portion of its revenue was from online money games. The platform is among the largest in India's online gaming industry and they are preparing to shut down their Real Money Gaming (RMG) operations after the bill was passed. So, will Dream11 be banned now that the Government of India has applied a blanket ban on online gaming involving real money? So no, Dream11 might not be banned, though as the platform can still offer subscription-based service to fans, but not with the expectation of winning monetary rewards, something that involves financial risk and can be addictive at a point. Dream11-Run Dream Picks App Pauses 'Pay To Play' Fantasy Sports Contests After Parliament Passes Online Gaming Bill 2025, Gives Update on Money Withdrawal.\nScreenshot of Dream11 Website\nThe above screenshot is from the Dream11 website, which states that cash games and contests have been discontinued on the platform. As per sources quoted by Entrackr, Dream11 is expected to venture and expand in avenues that do not include real money gaming, for example-FanCode and Sportz Drip.\nWill India Be Without Jersey Sponsor for Asia Cup 2025?\nNow comes another question--with the blanket ban on online money gaming operations on Dream11 and other platforms, will India be without a jersey sponsor for the Asia Cup 2025? Dream11, in 2023, was announced as the Team India lead sponsor for a period of three years and as a result, fans have seen the logos of the famous online gaming and fantasy platform on India's jerseys across formats. Dream11 will take a hit with RMG operations being shut down and in this light, Team India might just be without a jersey sponsor for the Asia Cup 2025. However, this is just a speculation and nothing has been confirmed as yet. And so we can't say with certainty that Team India won't have a jersey sponsor for the Asia Cup 2025. Asia Cup 2025 Full Schedule, Free PDF Download Online: Date, Time in IST and Venue List of All Men's T20I Cricket Matches Including India vs Pakistan Fixture.\nBCCI's Stance on Dream11's Jersey Sponsorship\nThe BCCI clarified its stance on this development. BCCI Secretary Devajit Saikia, while speaking to the Times of India, said, \"Once the act comes into force, we will look into it, examine it and if it’s permissible, then we will take sponsorship (from online betting and gaming companies), if it’s not permissible, we’ll not do anything,\" adding, “Take the example of cigarettes and liquor. Has the BCCI taken any sponsorship from the cigarettes and liquor companies since taking sponsorship from these kinds of companies was banned? So, whatever is permissible in the laws in force in our country, we will do that only. The BCCI will follow every policy of the country which is framed by the central government.\"\n(The above story first appeared on LatestLY on Aug 22, 2025 01:56 PM IST. For more news and updates on politics, world, sports, entertainment and lifestyle, log on to our website latestly.com)."
    },
    {
      "news_title": "Dream11, MPL, Zupee suspend real-money gaming in India following parliamentary ban",
      "news_link": "https://www.indiatvnews.com/technology/news/dream11-mpl-zupee-suspend-real-money-gaming-in-india-following-parliamentary-ban-2025-08-22-1004639",
      "bias": "Lean Right",
      "text": "Online gaming companies such as Dream11, Mobile Premier League (MPL), and Zupee Ludo have suspended all of their real-money gaming offerings in India. This decision comes after Parliament passed a bill to ban all forms of online money games.\nOn Thursday, Parliament passed the Promotion and Regulation of Online Gaming Bill, 2025, with the Rajya Sabha approving it without debate. The bill aims to prohibit all forms of online money games while promoting eSports and online social gaming.\nIn a LinkedIn post, MPL stated that it respects the law and will fully comply with the ban on online money games in India.\n\"Effective immediately, we are suspending all gaming offerings involving money on the MPL platform in India,\" the post said. \"Our foremost priority is our users. While new deposits will no longer be accepted, customers will be able to withdraw their balances seamlessly. However, online money games will not be available on the MPL platform anymore\".\nMPL has more than 120 million registered users across Asia, Europe, and North America.\nDream11, Zupee Ludo stop real money contests\nGaming platform Zupee has also announced that it will discontinue all of its paid games. According to a report on BT, a company spokesperson said, \"Zupee remains fully operational, and our players can continue to enjoy their favorite games on the platform. In line with the new Online Gaming Bill 2025, we are discontinuing paid games, but our hugely popular free titles like Ludo Supreme, Ludo Turbo, Snakes & Ladders, and Trump Card Mania will continue to be available for all users for free\".\nAccording to reports, in an internal note, Dream Sports CEO Harsh Jain informed employees that there is \"no legal pathway\" to continue Dream11's paid contests once the law is enacted. The company has briefed both full-time and contractual staff on a transition plan.\nALSO READ: OpenAI announces its first India office in New Delhi, hiring for new roles"
    },
    {
      "news_title": "India bans vast online gambling industry",
      "news_link": "https://www.rte.ie/news/business/2025/0822/1529635-india-bans-online-gambling-industry/",
      "bias": "Center",
      "text": "India's parliament has passed a sweeping bill banning online gambling, after government figures showed companies had stripped $2.3 billion annually from 450 million people.\nThe ban impacts platforms for card games, poker and fantasy sports, including India's hugely popular homegrown fantasy cricket apps.\nIt also leaves the fate of the key sponsor for India's national cricket team in question.\nDream11, India's biggest fantasy sports gaming platform, was named on July 2023 as the country's lead sponsor for three years, with its logo splashed on Team India jerseys.\nNo announcement has been made by the Board of Control for Cricket in India (BCCI) regarding that key sponsor.\n\"If it's not permissible, we'll not do anything,\" BCCI secretary Devajit Saikia said today. \"The BCCI will follow every policy of the country that is framed by the central government.\"\nThe Promotion and Regulation of Online Gaming Bill was passed by both houses of parliament last night, and criminalises the offering, promotion and financing of such games, with offenders facing up to five years in prison.\nDream 11, in a statement posted on its website today, noted that, following the passing of the bill, \"cash games and contests have been discontinued\", but urged fans to \"stay tuned\".\nOther games remained online today , with the bill still needing to be formally ratified by the president before taking effect.\n\"This legislation is designed to curb addiction, financial ruin and social distress caused by predatory gaming platforms that thrive on misleading promises of quick wealth,\" a government statement said.\nIndia's wider gaming industry is one of the largest markets in the world, but the new law carves out exceptions for e-sports and educational games, which the government says will be promoted as part of the digital economy.\nPrime Minister Narendra Modi said the new law will \"encourage e-sports and online social games\" while \"at the same time, it will save our society from the harmful effects of online money games.\"\nThe government said roughly a third of the world's most populous country had lost money gambling online.\nIndustry groups had urged regulation and taxation rather than a blanket ban, warning the move could drive players to illegal offshore platforms.\nBut supporters of the bill argued that the social costs are too high to allow.\nOfficials said the rapid spread of gambling platforms had caused widespread financial distress, addiction and even suicide.\nThe government said it had also been linked to fraud, money laundering and terrorism financing.\nAshwini Vaishnaw, minister of technology, noted the law differentiates between online \"social\" games and those played for money.\n\"It encourages e-sports, which are organised competitive video games, and promotes safe online social and educational games\", a government briefing note read.\n\"It clearly separates constructive digital recreation from betting, gambling and fantasy money games that exploit users with false promises of profit.\"\nReporting by Reuters"
    },
    {
      "news_title": "As India bans real-money games, Dream Sports, MPL start pulling the plug",
      "news_link": "https://techcrunch.com/2025/08/21/as-india-bans-real-money-games-dream-sports-mpl-start-pulling-the-plug/",
      "bias": "Center",
      "text": "Top Indian startups in the real-money gaming space have begun shutting down operations after New Delhi effectively banned the sector through new legislation that’s now on the verge of becoming law.\nOn Thursday, the upper house of the Indian Parliament passed the Promotion and Regulation of Online Gaming Bill, 2025 — proposing to completely ban real-money gaming while aiming to promote casual online games and esports. The vote came just a day after the bill cleared the lower house, leaving only presidential assent before it becomes law — a formality expected to happen soon.\nShortly after the bill passed in Parliament, Indian unicorns Dream Sports and Mobile Premier League (MPL) — along with other startups like Gameskraft, Probo, and Zupee — began shutting down their real-money gaming operations. Some of these companies informed employees of their decision following the bill’s passage in the lower house on Wednesday, while others began notifying users directly through their apps.\nDream Sports, which counts investors including Tiger Global, Multiples, Alpha Wave Global, and TCV, has shut down its recently launched quick-play fantasy gaming app, Dream Picks. Its other apps involving real-money transactions, including the widely-popular Dream11 and Dream Play, were still operational at the time of filing. However, TechCrunch has learned that the Mumbai-based startup plans to shut down its real-money gaming business entirely once the legislation comes into effect.\nAt its town hall meeting on Wednesday, the startup informed its employees about the implications of the law, a person familiar with the matter told TechCrunch, requesting anonymity as the meeting was internal. Indian site Entrackr reported some details about the meeting earlier.\nDream Sports was planning to expand outside India, two people privy to the information informed TechCrunch, on condition of sharing it anonymously, as the plan was not public.\nThe startup also had some partnership talks for its Indian real-money business earlier this week that were about to be finalized, an investor source told TechCrunch.\nTech and VC heavyweights join the Disrupt 2025 agenda\nNetflix, ElevenLabs, Wayve, Sequoia Capital, Elad Gil — just a few of the heavy hitters joining the Disrupt 2025 agenda. They’re here to deliver the insights that fuel startup growth and sharpen your edge. Don’t miss the 20th anniversary of TechCrunch Disrupt, and a chance to learn from the top voices in tech — grab your ticket now and save up to $600+ before prices rise.\nTech and VC heavyweights join the Disrupt 2025 agenda\nNetflix, ElevenLabs, Wayve, Sequoia Capital — just a few of the heavy hitters joining the Disrupt 2025 agenda. They’re here to deliver the insights that fuel startup growth and sharpen your edge. Don’t miss the 20th anniversary of TechCrunch Disrupt, and a chance to learn from the top voices in tech — grab your ticket now and save up to $675 before prices rise.\nA Dream Sports spokesperson declined to comment.\nSimilar to Dream Sports, MPL, backed by investors including Peak XV, Times Internet, MSA Novo, and Crown Capital, has suspended all real-money games and is no longer taking deposits.\n“Deposit cash (minus GST) will be available for withdrawal from 22 Aug. 2025,” a notification on the MPL app reads.\nZupee, backed by investors including WestCap Group, Tomales Bay Capital, Nepean Capital, AJ Capital, and Z47 (formerly Matrix Partners India), has also shut down real-money games with immediate effect.\n“In line with the new Online Gaming Bill 2025, we are discontinuing paid games, but our hugely popular free titles like Ludo Supreme, Ludo Turbo, Snakes & Ladders, and Trump Card Mania will continue to be available for all users for free,” a Zupee spokesperson said in a statement.\nProbo, another Peak XV-backed startup, which also counts Elevation Capital and The Fundamentum Partnership among its key investors, stopped its real-money gaming operations after Parliament greenlit the legislation.\n“As unfortunate as it is, we respect the government of India’s latest Online Gaming bill. In light of this development, Probo has decided to discontinue its real-money gaming (RMG) operations with immediate effect until further notice,” the Gurugram-based startup said.\nBootstrapped startup Gameskraft has also stopped accepting money on its rummy apps as a result of the legislation. Similarly, Times Internet-owned fantasy cricket game Cricbuzz11 has discontinued its operations.\n“Deposits (net of GST) will be refunded to bank account within 30 days,” the app says on a notice to users.\nIn addition to the shutdown of real-money gaming operations, many employees at these startups have begun searching for new jobs, with hundreds posting about their job hunt on social media.\n“We no longer have a secure job, as these companies are expected to cut some roles in the coming days to sustain their business and satisfy investors,” one employee, who requested anonymity for fear of jeopardizing future opportunities, told TechCrunch.\nEven though these startups could challenge the law in the Indian Supreme Court once it comes into effect, most have chosen not to pursue that route.\n“This assessment is accurate — they will have a tough fight in the Supreme Court,” a public policy expert working with some of these real-money gaming startups told TechCrunch, requesting anonymity for fear of losing clients.\nReal-money gaming startups in India have a combined enterprise valuation of ₹2 trillion (approximately $23 billion), generate cumulative revenues of ₹310 billion (around $3.6 billion), and contribute ₹200 billion (roughly $2.29 billion) annually in direct and indirect taxes, per estimates cited by industry bodies in their letters to the Indian Prime Minister and Home Minister earlier this week. They also project a 28% compound annual growth rate that would double the industry’s size by 2028.\nWe’re always looking to evolve, and by providing some insight into your perspective and feedback into TechCrunch and our coverage and events, you can help us! Fill out this survey to let us know how we’re doing and get the chance to win a prize in return!"
    },
    {
      "news_title": "Rajya Sabha passes Online Gaming Bill amid opposition protests",
      "news_link": "https://www.aninews.in/news/national/politics/rajya-sabha-passes-online-gaming-bill-amid-opposition-protests20250821145157",
      "bias": "Lean Right",
      "text": null
    },
    {
      "news_title": "India passes bill banning money-based online games, app shutdowns loom",
      "news_link": "https://www.dawn.com/news/1932467",
      "bias": "Lean Left",
      "text": "India’s parliament on Thursday passed a bill to ban online games played with money in a move that threatens the survival of the popular fantasy gaming sector, after Prime Minister Narendra Modi’s government flagged the high risk of financial harm.\nThe sudden ban has shocked an industry backed by venture capital firms like Tiger Global and Peak XV Partners and which was set to be worth $3.6 billion in India by 2029.\nExecutives fear imminent job losses and a complete shutdown of many app-based businesses which attracted billions from foreign investors.\nThe bill prohibits “harmful” online money gaming services, advertisements and financial transactions related to them, with the government also citing the psychological harm they can cause.\n“It is the duty of the government and the parliament to take strict action against social evils, which keep erupting time and again,” federal IT minister Ashwini Vaishnaw said in parliament on Thursday.\nIndia’s upper house of parliament passed the Promotion and Regulation of Online Gaming Bill 2025 after the lower house cleared it earlier this week. The president must sign the bill into law which, although there is no set date, is considered a formality.\nIndian gaming groups are holding discussions with lawyers about approaching the Supreme Court to challenge the ban by citing a lack of consultation, the impact on the thriving industry and how some games being banned such as poker are skill-based and should be exempted, two gaming industry sources with direct knowledge of the matter said.\nEndorsements by top Indian cricketers and other marketing efforts have boosted the appeal of apps such as Dream11 and Mobile Premier League, where virtual cricket teams are created based on real players, earning points based on the runs, wickets and catches of an actual match.\nDream11’s app on Thursday showed it cost as little as 29 Indian rupees (33 cents) to create a team and join a “prize pool” which is then split among thousands of winners with a top payout of 300,000 rupees ($3,438).\nDream11 commands a valuation of $8bn while Mobile Premier League is valued at $2.3bn, PitchBook data shows. Other popular gaming apps in India include Games24X7, which offers card games like rummy and poker, Zupee and WinZO.\nThe new bill states that anyone who offers money games after the law comes in force could face a jail term of up to three years and a fine."
    },
    {
      "news_title": "Parliament passes online gaming Bill, Monsoon Session ends with ruling and Opposition legislators trading charges over disruptions",
      "news_link": "https://indianexpress.com/article/india/parliament-passes-online-gaming-bill-monsoon-session-ends-ruling-opposition-legislators-10202887/",
      "bias": "Lean Left",
      "text": null
    },
    {
      "news_title": "India passes bill banning money-based online games",
      "news_link": "https://www.theglobeandmail.com/business/article-india-passes-bill-banning-money-based-online-games/",
      "bias": "Center",
      "text": "India’s parliament on Thursday passed a bill to ban online games played with money in a move that threatens the survival of the popular fantasy gaming sector, after the government flagged the high risk of financial and psychological harm.\nThe sudden ban has shocked the industry, which was set to be worth $3.6 billion in India by 2029, with executives fearing job losses and the complete shutdown of their apps the moment the president signs the bill, which, although there is no set date, is considered a formality.\nIndia’s upper house of parliament passed the Promotion and Regulation of Online Gaming Bill 2025 after the lower house cleared it earlier this week with the support of lawmakers.\nThe bill prohibits “harmful” online money gaming services, advertisements and financial transactions related to them, with the government citing the psychological and financial harm they can cause.\nCanadian teens are getting hooked on this gateway to gambling in online games\nGaming industry executives have said they fear the loss of billions of dollars of foreign investment, from venture capital firms like Tiger Global and Peak XV Partners.\nEndorsements by top Indian cricketers and other marketing efforts have boosted the appeal of, and investor interest in, gaming apps such as the popular fantasy cricket games operated by startups Dream11 and Mobile Premier League.\nDream11 commands a valuation of $8-billion while Mobile Premier League is valued at $2.5-billion, PitchBook data shows. Other popular gaming apps in India include Zupee and Games 24X7."
    },
    {
      "news_title": "Online gaming bill passed in Rajya Sabha amid massive ruckus by Opposition",
      "news_link": "https://www.indiatoday.in/india/video/online-gaming-bill-passed-in-rajya-sabha-amid-massive-ruckus-by-opposition-2774699-2025-08-21",
      "bias": "Lean Right",
      "text": "Greater Noida dowry murder: Nikki Bhati killed over parlour & Instagram Reels\nNikki Bhati was killed after a dispute over reopening her beauty parlour and posting reels.\nThe Online Gaming Bill has been passed in the Rajya Sabha by a voice vote amidst ruckus from opposition parties. The bill underwent a clause-by-clause consideration, during which multiple amendments proposed by Dr V Sivadasan and Dr John Brittas were not moved. Dr. Sivadasan was heard saying, \"Sir, you protect the nation, so you should discuss openly the amendment.\" The repeated ruling of \"the ayes have it\" signified the passage of each clause despite the protests.\nNikki Bhati was killed after a dispute over reopening her beauty parlour and posting reels.\nPrime Minister Narendra Modi has expressed his condolences over the loss of lives due to recent cloudbursts and heavy rains, calling nature's fury a challenge for humanity.\nA massive political controversy has erupted over the Kerala government's invitation to Tamil Nadu Chief Minister MK Stalin for the inaugural global Lord Ayyappa event.\nThis hard-hitting documentary investigates India’s darkest reality—dogs beaten in boarding facilities, strays thrown off buildings, pets blinded and tortured, and shocking cases of sexual assault against animals."
    },
    {
      "news_title": "Online gaming Bill passed amid Opposition protests",
      "news_link": "https://gulfnews.com/world/asia/india/online-gaming-bill-passed-amid-opposition-protests-1.500240499",
      "bias": "Lean Right",
      "text": "Legislation seeks to establish framework for regulating sector, including e-sports\nNew Delhi: In a session marked by loud protests and persistent sloganeering, the Rajya Sabha adjourned sine die on Thursday after the passage of 'The Promotion and Regulation of Online Gaming Bill, 2025' introduced by Union Minister Ashwini Vaishnaw.\nThe Bill, which had already cleared the Lok Sabha, was passed by voice vote despite a noisy standoff over the Special Intensive Revision (SIR) of voter lists in Bihar.\nThe legislation seeks to establish a national framework for regulating the online gaming sector, including e-sports, educational games, and social gaming. It also imposes a strict ban on online money games involving betting or gambling, especially those operating across state borders or from foreign jurisdictions.\nThe Bill proposes the creation of a central authority to oversee policy coordination, strategic development, and regulatory enforcement in the sector.\nSpeaking in support of the Bill, Minister Vaishnaw emphasised the government’s decision to prioritise the welfare of the middle class and youth over potential revenue gains.\n“There are social evils in every era,” he said, “but under the visionary leadership of Prime Minister Modi, we have chosen to act decisively.”\nHe cited alarming figures, noting that nearly 45 crore people are affected by online money gaming, with estimated financial losses exceeding Rs 30,000 crore.\nThe World Health Organisation has classified online money gaming addiction as a psychological disorder, and the minister warned that the issue has escalated into a public health crisis, with families losing breadwinners and key members to addiction.\nThe minister also raised concerns about the misuse of online gambling platforms for terror funding and drug trafficking, calling them “safe havens” for illicit activities. “This problem has grown like the drug menace,” he said, warning that powerful interests may attempt to challenge the Bill in court or sway public opinion through social media.\n“But our Prime Minister stands firmly with the youth and middle class,” he added.\nDespite the Bill’s significance, the session was repeatedly disrupted by Opposition members demanding a discussion on the voter list revision in Bihar.\nLeader of Opposition Mallikarjun Kharge attempted to speak but was denied by the Deputy Chairman. Other members, including John Brittas and Dr R. Sivadasan, tried to raise amendments but were denied as they raised the issue of SIR; their voice drowned out by the commotion.\nBJP MP Kiren Rijiju criticised the Opposition for not engaging with the Bill’s content, questioning their commitment to public welfare.\nFollowing the passage of the Online Gaming Regulation Bill, Deputy Chairman Harivansh adjourned the Rajya Sabha for ten minutes, bringing a brief pause to a session already marred by repeated disruptions.\nWhen the House reconvened, he addressed the members with a candid reflection on the productivity and conduct of the 268th session. He noted that despite the Chair’s persistent efforts to maintain decorum, the session was plagued by disorder and resulted in a significant loss of valuable parliamentary time.\nThe House functioned for only 41 hours and 15 minutes, yielding a disappointing productivity rate of just 38.88 per cent -- an outcome he described as a matter warranting serious introspection.\nThe Deputy Chairman highlighted that members had the opportunity to raise 255 starred questions, submit 285 Zero Hour notices, and make 285 Special Mentions. However, only 14 questions were actually answered, with just seven Zero Hour submissions and 61 Special Mentions taken up during proceedings.\nDespite the disruptions, the House managed to pass or return 14 government Bills, including the one regulating online gaming.\nIt also held a discussion on Operation Sindoor, launched in response to the recent terror attack in Pahalgam, and bid farewell to six retiring members.\nIn light of Vice President Jagdeep Dhankhar’s resignation on July 21, Deputy Chairman Harivansh also acknowledged the constitutional responsibility now resting on his shoulders. His remarks underscored the gravity of the moment, both in terms of legislative accountability and the constitutional transition underway. Then he adjourned the House sine die.\nSign up for the Daily Briefing\nGet the latest news and updates straight to your inbox"
    },
    {
      "news_title": "Online Gaming Bill 2025: Lok Sabha passes Bill banning money games, promoting eSports and social gaming",
      "news_link": "https://www.thehindu.com/business/Industry/parliament-passes-online-gaming-bill-to-ban-all-forms-of-money-games/article69959634.ece",
      "bias": "Lean Left",
      "text": "The Promotion and Regulation of Online Gaming Bill, 2025, passed the Rajya Sabha on Thursday (August 21 2025), clearing the Union Cabinet and both Houses of Parliament within 72 hours, as the government moves to quickly ban real money games (RMGs). The law is now headed to President Droupadi Murmu’s desk for her signature, after which it will become an Act. The move could render firms like Dream11, MPL and PokerBaazi’s main revenue-generating activity — pay-to-play stakes-based gaming — crushed overnight.\n“It is the responsibility of the government and Parliament to take strict action against malpractices in society, like chit funds,” Union Minister for Electronics and Information Technology Ashwini Vaishnaw said in the Upper House of Parliament, urging MPs across party lines to support the law. “Problems [due to online money games] have led to several families being destroyed.”\nThe Bill was passed in the Upper House clause-by-clause, even as Opposition legislators loudly chanted slogans on allegations of “vote theft,” and two MPs, CPI(M)’s John Brittas and V. Sivadasan, moved proposals purportedly to amend the Bill or amend certain clauses, but took the floor to repeat the allegations. Deputy chairman Harivansh said these remarks wouldn’t be taken on record.\nQuick enforcement\nMr. Vaishnaw said that the law would not be subject to the prolonged timelines of the other key laws worked on by the IT Ministry, namely the Digital Personal Data Protection Act, 2023 — the rules are not yet notified for this law, meaning it is not in force yet — and the Information Technology (Intermediary Guidelines and Digital Media Ethics Code) Rules, 2021.\nThose regulations were worked out with months of consultations with the industry and other stakeholders. But those were regulations, and this is a prohibition. “With a prohibition, you can’t do consultations,” Mr. Vaishnaw said. “This Bill will be enforced as soon as possible.”\nThe Bill upends the entire RMG industry, referred to as “online money games” in its text. The industry has yet to comment publicly, but has appealed in a letter to Home Minister Amit Shah for reprieve from the ban. Probo, an “opinon trading” firm permitting wagers on outcomes of a variety of events, decried the Bill as “unfortunate,” and announced that it would suspend its real money gaming product.\nA “short” notification would be issued shortly after the Bill’s enactment, Mr. Vaishnaw said, bringing it into force immediately. The Ministries of Youth Affairs and Sports and the Ministry of Information and Broadcasting would take steps to promote e-sports, the government said in a statement.\nNazara Technologies Ltd., which has invested US$122 million (over ₹800 crore) in PokerBaazi, saw its shares dip 2% on Thursday (August 21) and has fallen about 15% since the Bill was introduced in the Lok Sabha. “Nazara has no direct exposure to real money gaming (RMG) businesses,” the firm said in a filing with bourses.\n“The Company’s only indirect exposure to RMG is through its 46.07% stake in Moonshine Technologies Private Limited (PokerBaazi). As Nazara does not hold a majority stake or exercise control, Moonshine’s revenue is not consolidated in the Company’s financial statements and has no impact on the Company’s reported Revenue or EBITDA.”\nDelta Corp Ltd, a casino and gaming firm which has owned poker platform Adda52, also recorded a dip of 3.14% on Thursday.\nPublished - August 21, 2025 03:28 pm IST"
    },
    {
      "news_title": "Rajya Sabha passes online gaming bill amid protests from Opposition",
      "news_link": "https://theprint.in/india/rajya-sabha-passes-online-gaming-bill-amid-protests-from-opposition/2725859/",
      "bias": "Lean Right",
      "text": "New Delhi: Rajya Sabha on Thursday passed ‘The Promotion and Regulation of Online Gaming Bill’ amid protests and sloganeering by the Opposition.\nUnion Minister Ashwini Vaishnaw had moved ‘The Promotion and Regulation of Online Gaming Bill’ as passed by Lok Sabha for consideration and passing in Rajya Sabha.\nHighlighting the aspects of the bill, the Union Minister explained that there are three aspects of the bill – “E-sports, Online Social Gaming and Online Money Gaming” out of which 2/3rd segment (E-sports and Online Social Gaming) will be promoted and encouraged.\nSpeaking in the Rajya Sabha, Vaishnaw said, “Online gaming is an important subject which has emerged as an important sector in the digital world. It has 3 segments – the first segment is e-sports, in which people form a team and play, learn coordination, have strategic thinking. Our players have also won many medals. In this bill, e-sports will be promoted, an authority will be created for it and it will get legal recognition. The second is Online Social Games which includes solitaire, chess, soduku, etc. In this bill, online social games will be promoted, encouraged and an authority will be created.”\nThe Union Minister stated the third segment – ‘Online Money Game’ as has become “Public Health Risk.”\nHe further said, “2/3rd segment of the entire world of online gaming is being promoted, but there is one such segment, 3rd – online money games, due to which a big problem has arisen in the society, especially in the middle class youth. It gets addicted and the family’s savings are spent. It is estimated that 45 crore people are affected by it and more than Rs 20,000 crore has been destroyed in it. WHO has declared it a gaming disorder. Online money gaming has become a public health risk. Problems like psychological disorder, compulsive behaviour, violent behaviour are arising from it. Many families have been destroyed due to it. This has become a huge problem. Its major aspect is money laundering and its effect have also been seen in terror activities. There were efforts to stop this problem but this problem kept on increasing.”\nUnion Minister Vaishnaw also hit out at the opposition for creating ruckus in the House while the Minister was moving the bill for passing.\nHe said, “From time to time many irregularities arise in the society, at such times it is the responsibility of the Government and the Parliament to take action against the irregularities and bring solutions which can stop these irregularities in the society. We all know that earlier many families were getting destroyed due to chit funds, Modi government dealt with the problem by bringing a law on it. Whenever the interest of middle class and youth is discussed, PM Modi ji has always talked about the interest of middle class and youth by keeping revenue and economy on one side and rising it above that. The same subject is before the Parliament today. If Opposition works on this subject today, we also understand that they also talk about the interests of the middle class and the youth, but they are not concerned about this at all, they work only and only for their political objectives.” (ANI)\nThis report is auto-generated from ANI news service. ThePrint holds no responsibility for its content.\nAlso read: Blanket ban on online money games to e-sports push, how new Bill proposes to alter gaming space"
    },
    {
      "news_title": "Online Gaming Bill passed in Rajya Sabha amid sloganeering",
      "news_link": "https://www.financialexpress.com/india-news/ashwini-vaishnaw-tables-online-gaming-bill-in-rajya-sabha-amid-sloganeering/3953325/",
      "bias": "Lean Right",
      "text": "Rajya Sabha has passed the Online Gaming Bill, which is called the Promotion and Regulation of Online Gaming Bill, 2025, by voice vote. It was tabled in the Upper House by the Union Minister Ashwini Vaishnaw amid sloganeering by opposition MPs. It was passed in the Lok Sabha on Wednesday, August 20. The Monsoon session has ended as both the Houses have been adjourned sine die amid ruckus in the Parliament.\nDeputy Chairman Harivansh Narayan Singh read out the Online Gaming Bill in the House and put it to a voice vote, asking members in favour to say “aye” and those opposed to say “no”.\nThis comes after a Congress leader said that the Chair must listen to what he has to say, and Parliamentary Affairs Minister Kiren Rijiju requested the Chair to take up the Bill for voting.\nOne of the opposition MPs can be heard saying that they have been stripped of their democratic rights, to which the Deputy Chairperson said that “none of this is going on record”.\nOnline Gaming Bill\nThe Bill, introduced by Union Minister Ashwini Vaishnaw, aims to impose a blanket ban on online money-based games while encouraging eSports and social gaming. It also seeks to block advertisements for such games and prevent banks and financial institutions from processing related transactions.\nDescribing online money games as those requiring players to deposit funds in the hope of winning cash or other rewards, the legislation labels them “harmful” and prohibits both their services and financial dealings connected to them. Amendments proposed by the Opposition were rejected.\nOnce this Bill becomes an Act, online money gaming will be punishable by imprisonment of up to 3 years and/or a fine of up to Rs 1 crore."
    },
    {
      "news_title": "45 crore Indians lost Rs 20,000 crore yearly to money games, new Gaming Bill to guide youth - tennews.in: National News Portal",
      "news_link": "https://tennews.in/45-crore-indians-lost-rs-20000-crore-yearly-to-money-games-new-gaming-bill-to-guide-youth/",
      "bias": "unknown",
      "text": "45 crore Indians lost Rs 20,000 crore yearly to money games, new Gaming Bill to guide youth\nNew Delhi, Aug 24 (IANS) Nearly 45 crore Indians are losing close to Rs 20,000 crore every year to real-money online games, according to government estimates.\nThe huge losses and the tragedies linked to them have pushed the government to act. The Promotion and Regulation of Online Gaming Bill, 2025, has now become law after being passed by both houses of Parliament and receiving the President’s assent.\nThe new framework bans harmful real-money games while promoting e-sports and educational gaming platforms.\nThe aim is to protect families from financial ruin and addiction, while still supporting the industry’s potential to create jobs, attract investment and put India on the global e-sports map.\nThe scale of the crisis has been alarming. Reports from different states reveal heartbreaking stories: young people trapped in debt, families destroyed, and even suicides linked to gaming losses.\nIn Karnataka alone, 18 suicides in the past three years were connected to online money games. In Mysuru, a family of three died by suicide after losing Rs 80 lakh.\nSimilar cases have been reported from Madhya Pradesh, Rajasthan, Mumbai and Hyderabad, showing how widespread the problem has become.\nAt the same time, the growth of e-sports presents a very different picture. The industry already provides 1.5 lakh direct jobs, a number expected to double by 2030.\nFor every direct role, two to three more are created in logistics, content and analytics. Importantly, nearly 40 per cent of gamers come from Tier-2 and Tier-3 cities, showing how gaming is spreading opportunities beyond metros.\nIndian-developed games like FAU-G have also earned millions of dollars overseas, while the country is positioning itself for international e-sports tournaments.\nThe government says the bill was drafted after extensive consultations with ministries, enforcement agencies, banks, parents, and the gaming industry.\nOfficials argue that the law strikes a balance by drawing a clear line between gambling-style money games and genuine skill-based e-sports.\nPrime Minister Narendra Modi himself signalled the importance of this sector earlier this year when he met India’s top gamers.\nIn a lighter moment, he even used the gamer slang “noob,” but behind the humour lay a serious message.\nThat message has now become policy, and with the new law, India has drawn its own battle lines in the gaming world — separating predators from genuine players.\n–IANS\npk\nComments are closed."
    },
    {
      "news_title": "India Bans Money-based Online Games, Sparking Industry Crisis",
      "news_link": "https://laffaz.com/india-ban-money-online-games-bill-2025/",
      "bias": "unknown",
      "text": "- Indian parliament passes bill banning money-based online games, citing financial and psychological harm.\n- The $20B+ industry, backed by Tiger Global and Peak XV, faces shutdowns and mass job losses.\n- Popular fantasy gaming platforms like Dream11 and MPL could cease operations overnight.\n- Gaming firms plan to challenge the law in Supreme Court, arguing skill-based games should be exempt.\nThe Parliament of India on Thursday passed the ‘Promotion and Regulation of Online Gaming Bill 2025’, banning all money-based online games, advertisements, and financial transactions tied to them. The move, framed as consumer protection, could shutter billion-dollar startups like Dream11 and Mobile Premier League (MPL), disrupt foreign investment, and cause widespread job losses.\nThe sudden passage of the bill marks one of the strictest government crackdowns on India’s booming gaming industry. Valued at over $2 billion today and projected to hit $3.6 billion by 2029, the fantasy gaming sector attracted heavy bets from global investors like Tiger Global and Peak XV Partners. Industry leaders warn that the ban risks wiping out years of growth and investor confidence in India’s digital economy.\nFunding & Industry Value\n- Projected industry size: $3.6 billion by 2029 (pre-ban estimate).\n- Major investors: Tiger Global, Peak XV Partners, and other foreign VCs.\n- Top platforms impacted: Dream11 ($8B valuation), Mobile Premier League ($2.3B), Games24X7, Zupee, WinZO.\nGovernment Rationale\nThe government said the ban aims to curb financial losses and psychological harm linked to money-based gaming. Federal IT minister Ashwini Vaishnaw told parliament:\nJOIN US TO STAY UPDATED ON YOUR FAVORITE MESSENGER APP!\n“It is the duty of the government and the parliament to take strict action against social evils, which keep erupting time and again.”\nLegal & Enforcement\n- Bill name: Promotion and Regulation of Online Gaming Bill 2025.\n- Penalties: Up to 3 years in jail and monetary fines for operators.\n- Next step: Presidential assent (largely procedural).\nIndustry Pushback\n- Gaming groups are consulting lawyers about filing challenges in the Supreme Court.\n- Arguments include lack of industry consultation and the claim that skill-based games like poker and fantasy cricket should be exempt.\nConsumer Impact\nApps like Dream11 and MPL allow users to form fantasy cricket teams for as little as ₹29 ($0.33), competing for prize pools with top rewards reaching ₹3,00,000 ($3,438). Such platforms have relied heavily on endorsements from top cricketers to fuel popularity.\nⓘ Interesting Read: Startup Glossary – 40+ Startup Terms Every Startup Founder & Entrepreneur Should Know\nWhat’s Next?\nLegal battles are expected in India’s Supreme Court in the coming weeks. If upheld, the law may set a global precedent for regulating online gaming, while sparking fears of capital flight from India’s startup ecosystem.\nQuick Facts\n- Bill: Promotion and Regulation of Online Gaming Bill 2025\n- Ban: All money-based online games, ads, financial transactions\n- Penalties: Up to 3 years in jail, fines\n- Industry value (pre-ban projection): $3.6B by 2029\n- Top companies impacted: Dream11, MPL, Games24x7, Zupee, WinZO\n- Major investors: Tiger Global, Peak XV Partners\nEditor’s Note\nIndia’s blanket ban on money-based online gaming puts it at odds with global regulatory approaches, where many countries distinguish between gambling and skill-based games. How the Supreme Court responds to industry challenges will determine whether this move reshapes or dismantles India’s online gaming sector.\nⓘ LAFFAZ Media is not responsible for the content of external websites linked in the articles. All users are required to read and abide by our Terms of Service."
    },
    {
      "news_title": "India Bans Online Gambling Apps",
      "news_link": "https://www.metafilter.com/210075/India-Bans-Online-Gambling-Apps",
      "bias": "unknown",
      "text": "India Bans Online Gambling Apps\nAugust 23, 2025 11:45 AM Subscribe\nThe indian government has passed a law banning online gambling apps that involve real money, citing gaming addiction, financial losses, terror-financing and suicides as the reason for banning them. Online gambling in India is estimated to be a $23 billion dollar industry with several billions of dollars of investments flowing into these companies that may be shutdown overnight.\nMod note: Typo correction to post at poster's request.\nposted by Brandon Blatcher (staff) at 12:24 PM on August 23\nposted by Brandon Blatcher (staff) at 12:24 PM on August 23\nThat’s wonderful news! I love hearing about government making decisions that help its citizenry - thank you for posting! I might not otherwise have heard of this.\nposted by hilaryjade at 12:44 PM on August 23 [3 favorites]\nposted by hilaryjade at 12:44 PM on August 23 [3 favorites]\nMod note: Another comment removed, this time for adding for bringing up the USA in a thread about India.\nposted by Brandon Blatcher (staff) at 1:11 PM on August 23\nposted by Brandon Blatcher (staff) at 1:11 PM on August 23\nCongrats to India!\nposted by eustatic at 1:47 PM on August 23 [1 favorite]\nposted by eustatic at 1:47 PM on August 23 [1 favorite]\nMod note: Another comment removed for trying to argue when it's ok to bring up the USA in threads that are not about the USA.\nThere's a long history on MeFi about the USA being injected or brought up in threads where it's not mentioned or the subject of the thread.\nYou'd like to comment in this thread, please make it about India and its ban of online gambling apps. Folks are welcome to agree or disagree about this new law, but please make it India related.\nposted by Brandon Blatcher (staff) at 1:49 PM on August 23 [4 favorites]\nThere's a long history on MeFi about the USA being injected or brought up in threads where it's not mentioned or the subject of the thread.\nYou'd like to comment in this thread, please make it about India and its ban of online gambling apps. Folks are welcome to agree or disagree about this new law, but please make it India related.\nposted by Brandon Blatcher (staff) at 1:49 PM on August 23 [4 favorites]\nI am glad that India has banned these apps. Now if only the results could be a beacon to the rest of the world, excluding a certain country in North America that I cannot mention. We will watch for the results, and how much pushback they get from their own parasitic gambling industry.\nposted by Vegiemon at 1:58 PM on August 23 [3 favorites]\nposted by Vegiemon at 1:58 PM on August 23 [3 favorites]\nI feel like going up against any major gambling operation anywhere in the world is personally dangerous for anyone, and I fear that being in parliament doesn’t necessarily protect these brave policy makers. Blocking one of the best avenues for money laundering puts you on the wrong side of all sorts of organized criminals and shady financiers. I hope everyone stays safe, and I salute their courage.\nposted by Ice Cream Socialist at 2:18 PM on August 23 [4 favorites]\nposted by Ice Cream Socialist at 2:18 PM on August 23 [4 favorites]\nBrandon, I don’t think it’s unreasonable to note that it would be nice if other countries were also to take such steps.\nBut to avoid doing so: This sounds great! I hope it does good things for the nation of India and I also express a desire that political regions with subdivisions containing the word “India” and whose native inhabitants were once erroneously called “Indians” because they were thought to be, well, Indian — I think those regions would also be well-served to follow India’s lead on this. India.\nposted by chasing at 3:30 PM on August 23 [2 favorites]\nBut to avoid doing so: This sounds great! I hope it does good things for the nation of India and I also express a desire that political regions with subdivisions containing the word “India” and whose native inhabitants were once erroneously called “Indians” because they were thought to be, well, Indian — I think those regions would also be well-served to follow India’s lead on this. India.\nposted by chasing at 3:30 PM on August 23 [2 favorites]\nIt would be a wonderful thing, to see the same done here. I agree that it's a courageous move on policymakers part.\nAs far as I can tell, all addiction is about the same statistical shape; most people who try whatever it is can pick whatever it is up and put it down whenever, about a third of people become regular consumers of whatever their addiction is without it redefining their lives, and about one person in twenty just gets their whole life turned into a juicebox for vampires.\nIn Ontario, at least, the LCBO - our provincially owned alcohol vendor - makes eighty-five percent of their profits from five percent of their customers, and ... that's just physical goods. Software can microtarget people like nothing else out there, can absolutely pinpoint your precise degree of vulnerability to maximize profit extraction, and we really don't have effective remedies for that beyond making accessing them as difficult to obtain, legislatively, as possible.\nposted by mhoye at 4:31 PM on August 23 [3 favorites]\nAs far as I can tell, all addiction is about the same statistical shape; most people who try whatever it is can pick whatever it is up and put it down whenever, about a third of people become regular consumers of whatever their addiction is without it redefining their lives, and about one person in twenty just gets their whole life turned into a juicebox for vampires.\nIn Ontario, at least, the LCBO - our provincially owned alcohol vendor - makes eighty-five percent of their profits from five percent of their customers, and ... that's just physical goods. Software can microtarget people like nothing else out there, can absolutely pinpoint your precise degree of vulnerability to maximize profit extraction, and we really don't have effective remedies for that beyond making accessing them as difficult to obtain, legislatively, as possible.\nposted by mhoye at 4:31 PM on August 23 [3 favorites]\nplease make it India related\nDid OP intend this post to be exclusively India related? “Don’t make an Indian politics post about American politics” is a good policy in many instances but it’s not obvious to me that it’s so straightforward for something like this where it concerns a hot topic in many countries.\nposted by atoxyl at 6:43 PM on August 23 [1 favorite]\nDid OP intend this post to be exclusively India related? “Don’t make an Indian politics post about American politics” is a good policy in many instances but it’s not obvious to me that it’s so straightforward for something like this where it concerns a hot topic in many countries.\nposted by atoxyl at 6:43 PM on August 23 [1 favorite]\nAnyway, I think the structure of this issue is pretty different between India and the US? From what I can find, online gambling is something of a grey market in India, but one that has grown large in recent years, so now the government is cracking down (if my understanding is incorrect, please let me know!)\nIn the US there have been past booms and crackdowns but the current boom is at least partly the result of court decisions and new state laws (often approved by voter referendum) explicitly legalizing forms of online gambling. So saying “I wish they’d do the same thing in the US” is, well, wishful.\nposted by atoxyl at 6:49 PM on August 23 [1 favorite]\nIn the US there have been past booms and crackdowns but the current boom is at least partly the result of court decisions and new state laws (often approved by voter referendum) explicitly legalizing forms of online gambling. So saying “I wish they’d do the same thing in the US” is, well, wishful.\nposted by atoxyl at 6:49 PM on August 23 [1 favorite]\nThe concern I have is that the big players in any sector making $23Bn (annually) can come up with quite sizable bribes to water policies like this down, or wash them away.\nModi today said that there would be \"no exception for him\" in the new anti-corruption bill that allows that allows sacking of ministers facing corruption or serious charges. But today there are so many crypto ways to make bribes untraceable. Deterrence is one thing; enforcement is another.\nposted by Hardcore Poser at 7:33 PM on August 23 [1 favorite]\nModi today said that there would be \"no exception for him\" in the new anti-corruption bill that allows that allows sacking of ministers facing corruption or serious charges. But today there are so many crypto ways to make bribes untraceable. Deterrence is one thing; enforcement is another.\nposted by Hardcore Poser at 7:33 PM on August 23 [1 favorite]\n« Older American buying things from overseas? No you're... | Evolution in action, driven by human activity Newer »\nposted by ambrosen at 12:05 PM on August 23 [8 favorites]"
    },
    {
      "news_title": "TechCrunch: India bans real-money gaming, threatening a $23 billion industry",
      "news_link": "https://rbfirehose.com/2025/08/23/techcrunch-india-bans-real-money-gaming-threatening-a-23-billion-industry/",
      "bias": "unknown",
      "text": "TechCrunch: India bans real-money gaming, threatening a $23 billion industry\nTechCrunch: India bans real-money gaming, threatening a $23 billion industry. “India’s lower house of parliament on Wednesday passed a sweeping online gaming bill that, while promoting esports and casual gaming without monetary stakes, imposes a blanket ban on real-money games — threatening to disrupt billions of dollars in investment and significantly impact the real-money gaming industry, which could see widespread shutdowns.”"
    },
    {
      "news_title": "India's move to ban online real-money games over addiction and money laundering concerns appears valid, but it may push users toward offshore crypto casinos",
      "news_link": "http://www.techmeme.com/250823/p2",
      "bias": "unknown",
      "text": "| Wall Street Journal: |\n| Intel: |\n| Sarah Perez / TechCrunch: |\n| Mark Gurman / Bloomberg: |\n| Andy Mukherjee / Bloomberg: |\n| The Hindu: |\n| Alexandr Wang / @alexandr_wang: |\n| Paige Smith / Bloomberg: |\n| CNBC: |\n| Richard Henderson / Bloomberg: |\n| Alex Heath / The Verge: |\n| Wall Street Journal: |\n| Business Insider: |\n| Dean Seal / Wall Street Journal: |\n| Lisa Wang / Taipei Times: |\n| Newley Purnell / Bloomberg: |\nThis is a Techmeme archive page. It shows how the site appeared at 7:35 AM ET, August 23, 2025.\nThe most current version of the site as always is available at our home page. To view an earlier snapshot click here and then modify the date indicated.\n| Sarah Perez / TechCrunch: |\n| Tanaya Macheel / CNBC: |\n| Arasu Kannagi Basil / Reuters: |\n| Samantha Subin / CNBC: |\n| Financial Times: |"
    },
    {
      "news_title": "PokerBaazi, Winzo and Zupee release statements amid RMG ban",
      "news_link": "https://www.socialsamosa.com/industry-updates/pokerbaazi-winzo-zupee-statements-rmg-ban-9693779",
      "bias": "unknown",
      "text": "On August 21, the Lok Sabha passed the Promotion and Regulation of Online Gaming Bill, 2025, tabled by Information & Technology Minister Ashwini Vaishnaw, which was introduced by the centre on August 20.\nOne part of the bill legitimised esports while the other banned online money games, defined as any digital game where users pay fees, deposits, or stakes with the expectation of winning monetary or material rewards.\nPlatforms and developers like Winzo, Zupee and Nazara Technologies released official statements following the ban.\nWinzo, a social gaming and interactive entertainment platform, stated, “…we have lived through defining challenges…Each time, our philosophy has been the same: adapt, innovate, and emerge stronger. In no uncertain terms, WinZO will abide by the law of the land while continuing to fuel India’s digital journey.”\nIt added, “Every feature we built was driven not by the pursuit of monetisation, but by our innate ethos of responsibility, innovation, and nation-building….In compliance with the new law, we are responsibly withdrawing impacted offerings w.e.f 22nd August 2025.”\nMeanwhile, Zupee has halted its Real-Money Gaming services and continues its free games services. A spokesperson at the company said, “Zupee remains fully operational and our players can continue to enjoy their favourite games on the platform. In line with the new Online Gaming Bill 2025, we are discontinuing paid games, but our hugely popular free titles like Ludo Supreme, Ludo Turbo, Snakes & Ladders, and Trump Card Mania will continue to be available for all users for free.”\nNazara Technologies Limited, according to the media reports, released an official statement on August 22 stating that its associate firm, Moonshine Technologies, which operates PokerBaazi and other card-based platforms, has ceased its RMG services.\nThe stock exchange filing of the company quoted, \"We wish to inform that, as a matter of abundant caution and in due respect of the Government’s mandate, Moonshine Technologies Private Limited (“Moonshine/Pokerbaazi”), an associate company in which Nazara Technologies Limited holds a 46.07% stake, has ceased offering real money online gaming operations,” as per the reports.\nAn official release by PokerBaazi stated, “ PokerBaazi has paused real money gaming in compliance with the Promotion and Regulation of Online Gaming Bill, 2025.”\n“Effective immediately, no real money games will be offered on our platform,” it added."
    },
    {
      "news_title": "INDIA’S PARLIAMENT BANS VAST ONLINE GAMBLING INDUSTRY",
      "news_link": "https://independentpress.cc/indias-parliament-bans-vast-online-gambling-industry/2025/08/22/",
      "bias": "unknown",
      "text": "Fri 22 August 2025:\nIndia’s new online gambling laws could see offenders face up to five years in prison.\nIndia’s parliament has passed a sweeping bill banning online gambling, after government figures showed companies had stripped $2.3bn annually from 450 million people.\nThe ban affects platforms for card games, poker and fantasy sports, including India’s wildly popular homegrown fantasy cricket apps.\nIt also leaves the fate of the key sponsor for India’s national cricket team in question.\nDream11, India’s biggest fantasy sports gaming platform, was named on July 2023 as the country’s lead sponsor for three years, with its logo splashed on Team India jerseys.\n__________________________________________________________________________\nhttps://whatsapp.com/channel/0029VaAtNxX8fewmiFmN7N22\n__________________________________________________________________________\nNo announcement has been made by the Board of Control for Cricket in India (BCCI) regarding that key sponsor.\n“If it’s not permissible, we’ll not do anything,” BCCI secretary Devajit Saikia said Friday. “The BCCI will follow every policy of the country that is framed by the central government.”\nThe Promotion and Regulation of Online Gaming Bill was passed by both houses of parliament late on Thursday, and criminalises the offering, promotion and financing of such games, with offenders facing up to five years in prison.\nDream 11, in a statement posted on its website on Friday, noted that, following the passing of the bill, “cash games and contests have been discontinued”, but urged fans to “stay tuned”.\nOther games remained online on Friday, with the bill still needing to be formally ratified by the president before taking effect.\n“This legislation is designed to curb addiction, financial ruin and social distress caused by predatory gaming platforms that thrive on misleading promises of quick wealth,” a government statement said.\nIndia’s wider gaming industry is one of the largest markets in the world, but the new law carves out exceptions for e-sports and educational games, which the government says will be promoted as part of the digital economy.\nPrime Minister Narendra Modi said the new law will “encourage e-sports and online social games” while “at the same time, it will save our society from the harmful effects of online money games”.\nThe government said roughly a third of the world’s most populous country had lost money gambling online.\nIndustry groups had urged regulation and taxation rather than a blanket ban, warning the move could drive players to illegal offshore platforms.\nBut supporters of the bill argued that the social costs are too high to allow.\nOfficials said the rapid spread of gambling platforms had caused widespread financial distress, addiction and even suicide.\nThe government said it had also been linked to fraud, money laundering and terrorism financing.\nAshwini Vaishnaw, the minister of technology, noted the law differentiates between online “social” games and those played for money.\n“It encourages e-sports, which are organised competitive video games, and promotes safe online social and educational games,” a government briefing note read.\n“It clearly separates constructive digital recreation from betting, gambling and fantasy money games that exploit users with false promises of profit.”\n__________________________________________________________________________\nFOLLOW INDEPENDENT PRESS:\nWhatsApp CHANNEL\nhttps://whatsapp.com/channel/0029VaAtNxX8fewmiFmN7N22\nTWITTER (CLICK HERE)\nhttps://twitter.com/IpIndependent\nFACEBOOK (CLICK HERE)\nhttps://web.facebook.com/ipindependent\nYOUTUBE (CLICK HERE)\nhttps://www.youtube.com/@ipindependent\nThink your friends would be interested? Share this story!"
    },
    {
      "news_title": "Online Gaming Bill 2025 Gets Presidential Nod, Becomes Law - Inside Sport India",
      "news_link": "https://www.insidesport.in/gaming/online-gaming-bill-2025-gets-presidential-nod-becomes-law/",
      "bias": "unknown",
      "text": "In a landmark move, President Droupadi Murmu has given her assent to the Promotion and Regulation of Online Gaming Bill, 2025, officially making it law. The legislation marks a major shift in India’s digital and gaming landscape. The Bill bans all forms of online money gaming services while simultaneously promoting e-sports and skill-based social gaming.\nOnline Gaming Bill 2025: What the Law Says\nThe new law imposes strict penalties for violations.\n- Facilitating online money gaming can attract imprisonment of up to three years along with fines reaching ₹1 crore.\n- Advertising or promoting such platforms is also punishable, with penalties of up to two years in jail and fines of ₹50 lakh.\nThe bill was passed swiftly in Parliament earlier this week—clearing the Lok Sabha in just seven minutes and the Rajya Sabha in 26 minutes, despite opposition protests over procedural concerns.\nRead More about BGMI\n- BGMS 2025 Points Table: Check Week 2 Day 1 Live Standings Here\n- BGMS 2025 League Week 2 Day 1: Groups, Teams, Schedule, and Stream\n- BGMI Redeem Codes Today August 25: Grab the Gulping Gull Backpack\n- BGMI A15 Royal Pass: Leaked Rewards of All Tiers\n- BGMI 4.0 Update Release Date (Expected), Mode, and more\nWhy the Ban on Online Money Gaming?\nUnion Minister for Electronics and IT Ashwini Vaishnaw explained the urgency behind the legislation, stating that online money gaming has led to devastating consequences for families:\n“From time to time, society grapples with social evils. In these circumstances, it is the duty of the government and the parliament to probe and make laws to control them,” Vaishnaw told the Rajya Sabha, highlighting cases where individuals lost their life savings on such platforms.\nPM Modi on Online Gaming Bill 2025\nPrime Minister Narendra Modi welcomed the legislation, striking a balance between regulation and growth in the sector.\n“This Bill, passed by both Houses of Parliament, highlights our commitment towards making India a hub for gaming, innovation and creativity. It will encourage e-sports and online social games. At the same time, it will save our society from the harmful effects of online money games,” the PM said in his statement.\nA Double-Edged Sword for the Gaming Industry\nIndustry experts believe the law will reshape India’s gaming ecosystem. While real-money gaming platforms face a complete shutdown, the move could boost the country’s rapidly growing e-sports sector, which has been seeking stronger institutional support.\nE-sports companies welcomed the bill as a sign of recognition by the government, but real money gaming operators expressed concerns over livelihoods and potential job losses.\nEsports Industry Applauds the Online Gaming Bill 2025\nThe enactment of this law signals a clear demarcation between e-sports/social gaming and money-driven gambling apps. Authorities are expected to soon release detailed compliance mechanisms, including monitoring and enforcement strategies, to implement the ban effectively. This Bill will help to grow Esports industry and regulate it.\nRohit N Jagasia, Founder & CEO, Revenant Esports, “With the passing of the Promotion and Regulation of Online Gaming Bill, 2025, the gaming industry stands at a true inflection point. This bill was the need of the hour and is a welcome step toward providing long-awaited clarity. For the first time, the law formally recognises esports as a competitive sport, while also ensuring much-needed uniformity in regulations across states. Until now, the absence of a national framework had led to fragmented state-level laws and confusion. With a clear framework now in place, we can expect it to fuel healthy competition, spur innovation, and attract investments that will strengthen and accelerate the growth of the entire gaming ecosystem.\nTanmay ‘ScoutOP’ Singh, gaming influencer and brand ambassador of Revenant XSpark, “The government has officially recognised esports as a competitive sport. Competitive gaming has always been skill-based, and it is encouraging to see it finally get its due. This bill’s effort to clearly distinguish between esports, social gaming, and chance-based money games is a crucial step toward safeguarding and nurturing the growth of skill-based gaming. With the right balance, this legislation has the potential to position India as a global esports powerhouse.\nFor now, the message from the government is clear: India wants to be a hub for e-sports and innovation—not online betting or gambling."
    },
    {
      "news_title": "Parliament approves Online Gaming Bill 2025, bans real money games",
      "news_link": "https://khelnow.com/other-sports/parliament-approves-online-gaming-bill-202508",
      "bias": "unknown",
      "text": "Parliament approves Online Gaming Bill 2025, bans real money games\nUnder the Online Gaming Bill 2025, offenders risk a jail term of 3-5 years and a fine of up to Rs 2 crore.\nOn Wednesday, August 20, 2025, the Lok Sabha passed the Online Gaming Promotion and Regulation Bill 2025, followed by the Rajya Sabha’s approval on Thursday, August 21, 2025. The law aims to promote e-sports and safe social gaming, while banning harmful money-based gaming to protect Indian youth.\nThe bill was introduced by Electronics and Information Technology Minister Ashwini Vaishnaw, who highlighted the dangers of online money gaming, such as addiction, fraud, financial ruin, and even suicides.\n“E-sports are rapidly gaining prominence and will now receive legal recognition. Online social games like Solitaire, Chess, or Sudoku, played without monetary stakes, will also be promoted for family and friendly interaction,” Vaishnaw said.\nLok Sabha Speaker Om Birla called the legislation important, stressing the need to safeguard people from financial and social harm caused by such games.\nAlso Read: National Sports Governance Bill 2025 becomes law after President gives her assent.\n“They have become a major societal concern due to addiction and financial losses, leading even to suicides. Algorithms are opaque, and families are being devastated. Terror financing and money laundering are also linked,” Vaishnaw added.\nBans all real-money online games\nThe Online Gaming Bill 2025 imposes a blanket ban on real-money online games such as poker, rummy, and fantasy sports, whether based on skill or chance.\nIt introduces heavy penalties: Up to 3 years in jail and ₹1 crore fine for operators, repeat offenses carry 3–5 years jail and fines up to ₹2 crore, celebrities promoting such games are also liable for punishment, most offenses are cognisable and non-bailable, and officials can search and arrest without a warrant.\nBanks and financial entities are barred from processing transactions related to real-money games, with violations potentially triggering enforcement actions, including platform blocking under the IT Act.\nOnline Gaming Bill 2025 promotes E-Sports\nThe Online Gaming Bill 2025 protects against addiction, fraud, money laundering, and terrorist risks. Also, it plans to promote e-sports and safe social gaming.\nE-sports are formally recognised as competitive sports, with support for training academies, research centers, incentives, and integration into national sports policy.\nMeanwhile, games designed for cultural, educational, or skill-based engagement will be encouraged and are categorised, registered, and supported through awareness campaigns.\nWhat is the Online Gaming Bill 2025?\nThe Promotion and Regulation of Online Gaming Bill 2025, passed by the Lok Sabha on August 20, 2025, is a law that bans harmful money-based online games while promoting e-sports and safe social gaming.\nWhy was the Online Gaming Bill 2025 introduced?\nThe bill was introduced to tackle the dangers of money-based online gaming, such as addiction, fraud, financial ruin, money laundering, terror funding, and even suicides.\nWhat kinds of online games are banned?\nAll real-money online games like poker, rummy, fantasy sports, lotteries, and betting apps are banned—whether based on skill or chance.\nFor more updates, follow Khel Now on Facebook, Twitter, and Instagram; download the Khel Now Android App or IOS App and join our community on Whatsapp & Telegram\nUzma Fatima is a passionate sports journalist who believes every match has a story waiting to be told. Whether it's the grace of Olympic champions, the grit of tennis and badminton battles, or the drama of cricket’s highs and heartbreaks — she loves capturing the emotion behind the action. Off the field, she’s a Formula 1 enthusiast who never misses a race weekend.\n- India win 63 medals at World Transplant Games 2025 in Germany\n- Parliament approves Online Gaming Bill 2025, bans real money games\n- Bengaluru to get India's second-largest cricket stadium with 60,000 seats\n- D Gukesh, Paris Olympics medallists nominated for Padma Shri by Sports Ministry: Report\n- National Sports Governance Bill 2025 becomes law after president Droupadi Murmu gives assent\n- Top 10 athletes with the most silver medals in Summer Olympics\n- Top 10 athletes with most bronze medals at Summer Olympics\n- Top 10 countries to have won the most Summer Olympic medals in history\n- Meet the three Wushu athletes from Arunachal Pradesh who were denied visa by China for Asian Games 2023\n- Bhavani Devi clinches India's first ever medal at Asian Fencing Championships, wins bronze in sabre"
    },
    {
      "news_title": "\"You’re All Upset With My Gaming\": Class 12 Student in Lucknow Dies by Suicide Amid Addiction Concerns",
      "news_link": "https://thecsrjournal.in/class-student-in-lucknow-dies-by-suicide-amid-gaming-addiction-concerns/",
      "bias": "unknown",
      "text": "In a shocking incident, an 18-year-old Class 12 student from Lucknow’s Gomtinagar Extension tragically died by suicide on Thursday. The incident shreds light on the growing concerns surrounding online gaming addiction. A suicide note recovered from his room revealed his ongoing struggle to balance academics.\nThe boy also revealed his intense involvement in online gaming. The note mentioned his repeated but unsuccessful efforts to quit gaming. The victim also feared financial losses caused by gambling within these games.\nDetails from Police and Family\nThe teenager was found hanging in his room early Thursday morning by his family members. Upon discovery the family immediately alerted the police. Authorities arrived quickly and sent the body for a post-mortem examination.\nAccording to Senior Police Officer Brij Narayan Singh, the young student had been addicted to online games for a considerable time. Initially, he played paid versions of games, but after exhausting his finances, he switched to free versions. The officer stated that the teen’s addiction deeply affected his academic performance and mental well-being.\nNew Law Banning Online Money Games\nThe tragic incident coincided with the passage of the Promotion and Regulation of Online Gaming Bill, 2025, which bans all forms of online money games in India. The legislation aims to regulate the industry by promoting non-monetary games. These games include eSports and social gaming while protecting vulnerable youth from the risks associated with online gambling.\nThe bill also mandates the formation of a national regulatory authority to oversee online gaming activities. The government emphasized that this law was necessary to prevent exploitation and curb the growing problem of gaming addiction.\nAnother Suicide Reported in Lucknow\nIn a similar but unrelated incident that has intensified concerns over mental health and gaming addiction, a 22-year-old man was found hanging at a friend’s residence in the Bijnor area of Lucknow on the same day. The man had made a distress video call to his mother, expressing his intention to end his life and asking that no one intervene.\nHis brother discovered his body after breaking into the house following multiple unanswered calls. Both cases underscore the urgent need for awareness and support systems addressing the psychological impact of gaming addiction."
    },
    {
      "news_title": "India Passes Gaming Bill As Crypto Faces Strict Scrutiny",
      "news_link": "https://coinfomania.com/india-passes-gaming-bill-as-crypto-faces-strict-scrutiny/",
      "bias": "unknown",
      "text": "India Passes Gaming Bill As Crypto Faces Strict Scrutiny\nIndia’s Gaming Bill halts real money play as Dream11, MPL, Zupee, and others suspend paid features, while crypto faces tighter scrutiny.\nQuick Take\nSummary is AI generated, newsroom reviewed.\nIndia bans real money gaming under Online Gaming Bill August 2025\nMajor gaming platforms like Dream11, MPL suspended paid features and refund user deposits\nCybercrime report links cryptocurrency to scams, laundering, and ransomware attacks\nCommittee calls for crypto forensics labs, tighter monitoring, and stronger enforcement\nIndia prepares comprehensive crypto regulation while testing innovation sandboxes\nIndia’s ban on real money gaming in August 2025 is one of the clearest examples yet of how decisively the government is willing to act. The Online Gaming Bill, passed on August 20-21, shuts down any platform that involves deposits or stakes, which the law now calls “online money gaming.” An Online Gaming Authority is being set up to enforce it, and the penalties are sharp: up to three years in jail and fines of up to ₹1 crore.\nApps Shut Paid Features post Gaming Bill\nDream11, MPL, Gameskraft, Zupee, Probo, My11Circle, RummyCulture, and others all suspended their real money features within hours. Dream11 paused its pay-to-play contests and will disable paid features entirely once the bill gets presidential assent. MPL too has stopped all money-based offerings and promised refunds. Gameskraft froze “Add Cash” on its rummy apps. Zupee & Probo halted operations outright. My11Circle, RummyCulture, WinZO, Nazara, and Head Digital Works took similar steps, keeping free-to-play options open while withdrawals remain available.\nCrypto Flagged in Cybercrime Report\nAt the same time, the Standing Committee’s cybercrime report painted crypto in an equally restrictive light. It mentioned crypto 15 times, almost entirely in connection with cyber threats. The report highlights cryptojacking, where hackers hijack devices to mine coins. It details scam centers and trafficking networks across Southeast Asia funded through crypto payments. Money laundering came up again and again in the report. It pointed out how peer-to-peer transfers and offshore platforms make it simple to shift money across borders almost instantly. Ransomware was another major concern. The report warned that it’s becoming a national security threat, with hospitals, schools, and businesses increasingly hit by crypto-based ransom demands. Finally, it links crypto to the underground “crime as a service” economy, where illicit financial services are built on top of it. After the Gaming Bill, this report is headed towards Crypto regulations.\nCommittee Pushes for Forensics and Stronger Enforcement\nThe Committee describing risks has pushed for stronger enforcement than a blanket ban. It wants advanced crypto-forensics labs in every region. The report suggests better data-sharing agreements with foreign governments and more active monitoring of wallets and exchanges by enforcement agencies. Taken together with the ban on real money gaming, the tone is to have enforcement-first action over gradual, consultative reform.\nCurrently, in India, there is a 30 percent tax on gains and a one percent TDS on trades. Virtual digital assets fall under Section 115BBH of the Income Tax Act. Here, exchanges, custodians, wallets, and even mining pools have had to register with FIU-IND. SEBI now watches crypto that resembles securities. The RBI is setting out a 2025 framework defining operational boundaries. On top of this, regulators are running consultation papers and sandbox schemes, while India prepares for a Financial Stability Board peer review in October.\nBig Crypto Law Expected after Gaming Bill\nLooking ahead, it’s hard to avoid the conclusion that a comprehensive crypto regulation bill is on the way. It will almost certainly spell out what’s allowed and what’s banned. This will continue mandating licenses for exchanges, wallets, custodians, and OTC desks. We can expect tighter KYC and AML norms, stricter transaction monitoring, and full reporting of suspicious transactions to both FIU-IND and CERT-In. The report’s emphasis on digital forensics means new regional labs and more law enforcement training in blockchain analytics.\nThere is also a parallel track where the state supports “safe” digital innovation. Regulatory sandboxes for DeFi, CBDC experiments, and tokenised assets are slowly expanding. NITI Aayog is piloting blockchain in land records, supply chain, and trade finance.\nRisks of Blanket Bans\nThe danger is repeating the pattern we just saw with real money gaming. A blanket ban, like in the Gaming Bill, might look decisive, but it risks driving activity into black markets where oversight is weaker. A more balanced approach, like the RBI’s tiered model for banking access, can give regulators the control they want while letting legitimate businesses operate within clear rules. Right now, India is at a turning point. The crackdown on real money gaming shows how far the state will go to assert control. Meanwhile, the cybercrime report sets the stage for strict crypto regulation centered on money laundering and illicit use.\nFollow us on Google News\nGet the latest crypto insights and updates.\nRelated Posts\nFrom Idle to Value-Added: OpenMiner Builds a Multi-Currency Cloud Mining Ecosystem for Global Users\nCoinfomania News Room\nAuthor\nCanary Files for “American-Made” Crypto ETF in Landmark SEC Submission!\nAshutosh\nWriter\nCardano (ADA) Price Momentum Builds as Futures Open Interest and Stablecoins Surge!\nAshutosh\nWriter\nSolana Outpaces Ethereum and Base with Soaring Daily Transaction Volume!\nAshutosh\nWriter"
    },
    {
      "news_title": "₹23,000 Crore Industry Wiped Out as India Bans Real-Money Gaming",
      "news_link": "https://lagatar24.com/%e2%82%b923000-crore-industry-wiped-out-as-india-bans-real-money-gaming/",
      "bias": "unknown",
      "text": "Lagatar24 Desk\nNew Delhi: India’s Parliament has passed the Promotion and Regulation of Online Gaming Bill, 2025, dealing a massive blow to the ₹23,000 crore real-money gaming industry. The law, which now awaits presidential assent, bans all real-money online games, forcing major companies to suspend operations and leaving thousands of employees facing layoffs.\nIndustry Fallout\nLeading platforms including Dream Sports (Dream11), Mobile Premier League (MPL), Zupee, Gameskraft, and Probo have halted their real-money services. MPL has stopped accepting deposits and will begin processing withdrawals from August 22, while Zupee has suspended all paid games but continues to offer free-to-play titles such as Ludo Supreme. Dream Sports confirmed it will completely shut down real-money operations once the ban is enforced, with reports suggesting layoffs have already begun.\nGovernment’s Rationale\nThe government said the law was necessary to address growing concerns over addiction, financial distress, manipulation, and underage participation in online gaming. The legislation introduces strict penalties, including imprisonment of up to three years and fines of up to ₹1 crore. A new regulatory body will oversee esports and social gaming, while real-money formats are prohibited.\nWider Implications\nFor users, the ban means an immediate end to fantasy sports and cash-based gaming. For employees in affected startups, uncertainty looms as layoffs ripple across the sector. Cricket and other sports, heavily backed by sponsorship deals from real-money gaming firms, are expected to see significant financial downgrades. Industry observers say valuations of gaming companies will take a sharp hit as India pivots from overnight success stories to stringent regulation."
    },
    {
      "news_title": "Online Gaming Bill 2025: Major Platforms Suspend Real-Money Games After Parliament Ban - Goemkarponn",
      "news_link": "https://goemkarponn.com/online-gaming-bill-2025-major-platforms-suspend-real-money-games-after-parliament-ban/",
      "bias": "unknown",
      "text": "New Delhi: India’s real-money gaming industry has been hit hard after Parliament passed the Promotion and Regulation of Online Gaming Bill, 2025, which bans all money-based online games and prescribes penalties of up to ₹1 crore and jail terms for violations.\nSoon after the legislation was cleared, leading platforms including Mobile Premier League (MPL), Zupee, Dream Sports, Gameskraft, and Probo announced the suspension of their real-money offerings.\nMPL, one of India’s largest gaming companies with over 120 million users, said it would immediately halt money-based games. “Effective immediately, we are suspending all gaming offerings involving money on the MPL platform in India. New deposits will no longer be accepted, but customers can withdraw their balances seamlessly,” the company said in a LinkedIn post.\nRival Zupee also confirmed it would discontinue paid games while continuing to offer free titles such as Ludo Supreme, Snakes & Ladders, and Trump Card Mania. “We remain committed to delivering fun, engaging, and responsible gaming experiences to our 150+ million users, for free,” a spokesperson said.\nFantasy sports giant Dream Sports suspended “Pay to Play” contests on its Dream Picks fantasy app and halted real-money services on Dream Play. The company said balances remain safe and can be withdrawn from its flagship Dream11 app.\nGameskraft, which operates popular rummy apps such as RummyCulture, also paused “Add Cash” and gameplay services while assuring users that their funds remain secure. Similarly, Probo announced it was shutting down real-money gaming operations “with immediate effect” in compliance with the new law.\nThe legislation, piloted by Electronics and IT Minister Ashwini Vaishnaw, was passed by Parliament on August 21, with the Rajya Sabha giving approval amid protests. The bill bans all forms of online money games, prohibits related advertisements, and bars banks and financial institutions from processing payments for such games.\nWhile the move is expected to disrupt lakhs of players and trigger layoffs and funding cuts in the gaming industry, the government has emphasized that eSports and non-monetary skill-based games will continue to be encouraged as the sector’s future."
    },
    {
      "news_title": "Parliament Passes Online Gaming Bill 2025 - Gambling Apps Banned, e-Sports Get Legal Boost in India ~ My Mobile India",
      "news_link": "https://www.mymobileindia.com/parliament-passes-online-gaming-bill-2025-gambling-apps-banned-e-sports-get-legal-boost-in-india/",
      "bias": "unknown",
      "text": "Highlights\n- Online Gaming Bill 2025 passed by the Indian Parliament imposes a complete ban on online money games involving financial stakes.\n- E-sports are now legally recognised as formal sports, while casual social games are promoted for education and community engagement.\n- A central Online Gaming Authority will oversee game classification, developer support and enforcement with strict penalties for illegal operators.\nThe Indian Parliament has passed the Promotion and Regulation of Online Gaming Bill 2025, creating the country’s first national legal framework for digital gaming. Cleared by both the Lok Sabha and Rajya Sabha, the legislation bans online gambling apps while giving legal recognition to e-sports and encouraging social gaming platforms.\nThe bill was announced by Ashwini Vaishnaw, Union Minister for Electronics & IT, Railways, and Information & Broadcasting, and later shared on X (formerly Twitter).\nAccording to Vaishnaw, the law is designed to safeguard families and young players from the harmful effects of online money gaming, while supporting the growth of India’s booming digital entertainment industry.\nThe Promotion and Regulation of Online Gaming Bill, 2025 passed by the Parliament.\nThe Bill takes a balanced approach – promoting what’s good, prohibiting what’s harmful for middle-class and youth.\nHere’s a quick explainer 👇🧵 pic.twitter.com/q4Pthsrb2V\n— Ashwini Vaishnaw (@AshwiniVaishnaw) August 21, 2025\nWhy the Bill Was Urgently Needed?\nDuring discussions, Speaker Om Birla called the bill a crucial step in preventing suicides and financial losses linked to online gambling. He urged lawmakers to recognise the serious social damage caused by unregulated money games.\nGovernment sources revealed shocking statistics to NDTV, nearly 45 crore Indians lose around ₹20,000 crore every year due to online gambling and betting apps. Officials said, “people who play these games are victims (and) will not be punished… but there will be action against those who run real money gaming platforms.”\nThe government also cited concerns that illegal betting apps, often disguised as “games of skill”, are fueling a black-market industry worth ₹8.3 lakh crore, growing at 30% annually. These platforms, investigators warn, are not only defrauding players but may also be used for laundering money and financing terrorism.\nKey Objectives of the Bill –\nThe Online Gaming Bill 2025 has four primary goals –\n- Promote e-sports and casual online social games.\n- Impose a complete ban on online money games with financial stakes.\n- Establish a central Online Gaming Authority for regulation, developer support, and grievance redressal.\n- Address risks of addiction, financial fraud, money laundering, and terror financing.\nVaishnaw highlighted the explosive growth of India’s tech sector but also warned that real-money gaming has been devastating for middle-class families.\nGame Classification Under the New Law\nThe bill classifies online games into three categories –\n- E-sports – Recognised as a legitimate sport requiring skills, reflexes, and teamwork, on par with cricket or football.\n- Social Games – Casual and educational games like puzzles, card games, and brain teasers, are supported for their community and learning benefits.\n- Online Money Games – Games involving cash stakes, such as rummy, poker, and fantasy betting apps, are now completely prohibited.\nComplete Ban on Gambling Apps\nThe law bans real-money gaming platforms, citing their role in addiction, mental health issues, financial ruin, and criminal activities. Concerns also include –\n- Misleading endorsements by celebrities.\n- Rising cases of compulsive behaviour linked to gambling apps.\n- Their misuse for laundering money or terror funding.\nAccording to Vaishnaw, “32 suicides over the past 31 months” have been linked to real-money gaming, and complaints from thousands of affected families highlight the scale of the issue.\nGovernment Push for e-Sports\nThe bill ensures multiple initiatives to strengthen India’s e-sports ecosystem –\n- Legal recognition of e-sports as a formal sport.\n- Government-backed training programs, competitions, and infrastructure support.\n- Inclusion of e-sports in national sports development plans.\n- Structured talent development and digital engagement initiatives.\nEncouragement for Safe Social Games\nCasual online games are being promoted for their role in education and community building. Developers of such games will receive recognition as part of India’s expanding software and creator economy, with support for platforms that encourage safe and healthy digital engagement.\nPenalties for Violations\nOperators and enablers of illegal gambling apps face strict punishments –\n- First-time offences – Up to 3 years in prison and fines of up to ₹1 crore.\n- Repeat offences – 3 to 5 years in prison and fines of up to ₹2 crore.\n- Targeted enforcement – Action against service providers, advertisers, and payment platforms.\nImportantly, players themselves will not be penalised as they are considered victims rather than offenders.\nOnline Gaming Authority to Oversee Sector\nA new central Online Gaming Authority will –\n- Classify and register games.\n- Provide support to developers.\n- Handle user complaints.\n- Issue compliance norms.\n- Block harmful platforms using provisions of the IT Act.\nThis body will ensure uniform policy implementation across the industry.\nFAQs\nQ1. What does the Online Gaming Bill 2025 ban in India?\nAnswer. The bill imposes a complete ban on online money games involving financial stakes, such as rummy, poker, and fantasy betting apps, due to their links to addiction and financial harm.\nQ2. How does the bill support e-sports and social gaming?\nAnswer. E-sports are now legally recognised as formal sports, while casual social games like puzzles and card games are promoted for their educational and community-building value.\nQ3. What penalties are imposed for violating the new law?\nAnswer. Operators of illegal gambling apps face up to 3 years in prison and ₹1 crore fine for first-time offences, with harsher penalties for repeat violations. Players themselves will not be punished.\nRelated Links –\nhttps://www.mymobileindia.com/5g-services-will-bolster-education-farming-online-gaming-in-india/\nhttps://www.mymobileindia.com/ordinance-passed-by-tamil-nadu-cabinet-to-ban-online-gaming/"
    },
    {
      "news_title": "3 reasons why the ban on betting apps like Dream11 is a correct move",
      "news_link": "https://crickettimes.com/2025/08/3-reasons-why-the-ban-on-betting-apps-like-dream11-is-a-correct-move/",
      "bias": "unknown",
      "text": "Table of Contents\nIn a sweeping legislative move, the Indian government has introduced the Promotion and Regulation of Online Gaming Bill, 2025, which imposes a blanket ban on all online money games, including fantasy sports platforms like Dream11, My11Circle, and MPL.\nThe Promotion and Regulation of Online Gaming Bill\nThis law, passed by both the Cabinet and Parliament, prohibits any platform that facilitates monetary transactions between users and operators. While the law is a major blow to the online gaming industry, it does make a notable exception for esports, where in-game purchases for cosmetic upgrades are still allowed, as they are considered entertainment rather than betting. This legislation has been introduced to address a host of societal issues associated with the rapid growth of online money gaming. From addiction and financial distress to fraud and national security concerns, the government is taking decisive action to regulate this multi-billion-dollar industry.\nThe Promotion and Regulation of Online Gaming Bill, 2025 is here to boost innovation & protect citizens!\nThe Bill encourages e-sports & online social games while prohibiting harmful online money gaming services, advertisements & financial transactions related to them.… pic.twitter.com/TyMphGFeIt\n— Ministry of Information and Broadcasting (@MIB_India) August 20, 2025\nKey constitutional concerns: The legal challenges ahead\nHowever, the bill also faces constitutional challenges that are likely to be contested in the courts. The Promotion and Regulation of Online Gaming Bill, 2025, has raised concerns regarding its potential violations of certain constitutional provisions:\n- Article 19(1)(g) – The bill imposes an unreasonable restriction on businesses involved in skill-based gaming, which has been upheld by Indian courts in the past.\n- Article 14 – The law arbitrarily and vaguely classifies skill-based games, such as fantasy sports, as gambling, which undermines their legal status as games of skill.\n- Article 301 – The legislation could disrupt interstate trade and commerce, as many of these gaming platforms operate across state boundaries, potentially violating the right to free trade.\n- Seventh Schedule (List II, Entry 34) – The bill could infringe on the powers of individual states to regulate betting and gambling, a power that has traditionally been under state jurisdiction.\nAs per multiple media reports, Legal experts suggest that there are strong grounds for challenging the bill in court, particularly based on these constitutional violations. A writ petition is expected, with a stay on the law being highly probable (70-80%), and the chances of a partial or full quashing of the ban range from moderate (50-60%), depending on judicial interpretation.\n🚨 United We Stand ✊\nDream11, Gameskraft & other RMG companies are preparing to challenge the Govt’s blanket ban in court. ⚖️\n👉 This isn’t just about companies — it’s about millions of players, jobs & a ₹75,000+ crore industry.\n👉 Bans destroy, but regulation builds.\n👉 If… pic.twitter.com/4IITD2PpVh— Haryuksh K Sadhotra (@Harryhs06) August 22, 2025\nAlso READ: Dream11 and other cricket fantasy apps suspend real-money gaming operations\n3 reasons why the ban on betting apps like Dream11 is a correct move\nDespite the constitutional challenges, the government’s decision to impose the ban has been praised for several reasons, each addressing a specific issue that has become increasingly prominent in India.\n1. Curbing widespread social and financial harm\nOne of the most compelling arguments for the ban is its role in curbing the social and psychological consequences associated with online money gaming. Union Minister Ashwini Vaishnaw and other government officials have repeatedly highlighted that addiction, financial ruin, and even suicides have been linked to these platforms. Many of these apps have attracted vulnerable populations, especially youth and economically disadvantaged groups, through aggressive celebrity endorsements and the promise of quick monetary rewards.\nA senior government official stated by the Hindustan Times, “The government has decided to keep the welfare of people above revenue loss from its ban,” The lure of easy money has led to significant financial distress, social problems, and mental health issues. By criminalizing the act of depositing money with the expectation of a return, the government is attempting to shield vulnerable individuals from a growing crisis that is taking a toll on public welfare.\nSo much talk, but what’s actually true about the Promotion and Regulation of Online Gaming Bill, 2025? 🎮\nThis landmark reform is here to:\n✅ Protect players from harmful money gaming\n✅ Boost eSports and innovation\n✅ Create jobs and safeguard societyTime to bust the myths 👇… pic.twitter.com/0NyTeoCpKm\n— MyGovIndia (@mygovindia) August 21, 2025\n2. Combating financial fraud and national security risks\nAnother significant reason for the ban is to combat the potential misuse of these platforms for illegal activities. The government has expressed concerns about money laundering, financial fraud, and even terror financing through these online platforms. The new law aims to block financial transactions related to online gaming, thereby curbing the possibility of these platforms being used for illicit financial flows.\nAs part of the new legal framework, stringent penalties, including imprisonment and fines, are proposed for operators facilitating such activities. This legislation also seeks to address the ‘regulatory grey zone’ that has allowed cross-border and inter-state operations to thrive, sometimes compromising national security. By taking a firm stance on these issues, the government aims to prevent such platforms from becoming a conduit for illegal financial transactions.\n🚫 Myth: The Promotion and Regulation of Online Gaming Bill, 2025 is anti-youth.\n✅ Fact: It empowers youth through skill-based games, protects them from gambling and fraud, and opens new jobs.#PreventSuicideRegulateOnlineGaming#GamingPolicyForPeopleNotProfits… pic.twitter.com/eZzjYwLbXY\n— MyGovIndia (@mygovindia) August 21, 2025\n3. The distinction between skill and chance is gone\nA crucial aspect of the new law is its disregard for the traditional legal distinction between ‘games of skill’ (like fantasy sports) and ‘games of chance’ (like betting). Indian courts had previously ruled that fantasy sports such as Dream11 operated under the category of skill-based games, providing a legal loophole for these platforms. However, the new bill eliminates this distinction, broadly defining online money games as any game where money is deposited with the expectation of winning a monetary reward, regardless of whether the game involves skill or chance.\nThis definition treats all such games as a form of gambling, placing them under the same legal and regulatory framework. The government’s intention is to close the “grey area” that has allowed companies like Dream11 to continue operating under a loophole. By expanding the scope of what constitutes gambling, the law eliminates the ambiguity and ensures that all forms of online money gaming are regulated consistently.\n🚫 Myth: The Promotion and Regulation of Online Gaming Bill, 2025 will kill India’s gaming industry.\n✅ Fact: It generates opportunities in eSports, AR/VR, animation and immersive gaming, while protecting youth from the dangers of money-gaming.… pic.twitter.com/B8kA96mKxN\n— MyGovIndia (@mygovindia) August 21, 2025\nConclusion\nWhile the Promotion and Regulation of Online Gaming Bill, 2025 is a drastic measure, it is a move designed to protect public welfare, prevent illegal activities, and bring clarity to an industry that has operated in a legal grey area for years. The government’s decision to prioritize social and financial well-being over economic revenue represents a decisive step towards curbing the negative effects of online money gaming. Despite the constitutional challenges, the ban addresses key societal risks and sets a precedent for future regulation of the digital gaming landscape in India.\nAlso READ: 3 reasons why Shreyas Iyer succeeding Rohit Sharma as India’s ODI captain could be the right move"
    },
    {
      "news_title": "Real‑Money Games Gone Dark: Dream11, MPL & Zupee Pull The Plug After Gaming Bill Clears",
      "news_link": "https://8pmnews.com/dream11-mpl-zupee-pull-the-plug-after-gaming-bill-clears/",
      "bias": "unknown",
      "text": "Following Parliament’s approval of the Online Gaming Bill, 2025, major real-money gaming (RMG) platforms in India, including Dream11 and Mobile Premier League (MPL), have started suspending contests and paid games. The bill, which passed both the Lok Sabha and Rajya Sabha this week, seeks to ban all forms of online money games. At the same time, it aims to promote eSports and online social gaming.\nIndia’s Top Gaming Platforms Halt Paid Games Amid New Bill\nThe newly passed Promotion and Regulation of Online Gaming Bill, 2025, defines online money games as those where users deposit money with the expectation of winnings. This legislation has prompted the largest players in India’s RMG sector to take immediate action, with companies like Dream11 parent Dream Sports, Gameskraft, MPL, and Zupee reportedly suspending paid offerings on their platforms.\nDream11 Halts ‘Pay to Play’ Contests\nIn a statement on its website, Dream11 announced that “cash games and contests have been discontinued” in response to the new bill. The company has also paused all ‘Pay to Play’ contests on its new fantasy sports app, Dream Picks, and its casual RMG offering, Dream Play. While a notice on the app assured users that their account balances are safe and available for withdrawal, industry sources cited in a Moneycontrol report suggest that the company is preparing to suspend paid contests on its flagship Dream11 app once the law is officially notified.\nPrior to the suspension, a “prize pool” contest on the Dream11 app cost as little as ₹29 (33 cents) to enter, with a top payout of ₹300,000 ($3,438). The government’s move also raises questions about the fate of Dream11’s sponsorship of the Indian national cricket team, a three-year deal that began in July 2023. The Board of Control for Cricket in India (BCCI) has yet to make an announcement, with BCCI secretary Devajit Saikia stating, “The BCCI will follow every policy of the country that is framed by the central government.”\nMPL, Gameskraft, and Zupee Follow Suit\nMPL has also suspended all of its RMG offerings. A company spokesperson confirmed that while new deposits are no longer being accepted, customers can withdraw their existing balances. The spokesperson added that the company will now focus on providing “competitive, free to play, non-money based gaming experiences.”\nSimilarly, Bengaluru-based Gameskraft has paused ‘Add Cash’ and ‘Gameplay services’ on its rummy apps, including RummyCulture, while reassuring users that their funds are safe. Zupee has also discontinued its paid games but will continue to offer free games such as Ludo Supreme, Ludo Turbo, Snakes & Ladders, and Trump Card Mania.\nLegal Challenge Looms for New Law\nAccording to a Reuters report, Indian gaming groups are consulting with lawyers to potentially challenge the ban in the Supreme Court. The industry’s arguments are expected to focus on a lack of consultation, the significant impact on a thriving sector, and the classification of some games like poker as skill-based, which they believe should be exempt from the ban.\nThe bill, piloted by Union electronics and IT minister Ashwini Vaishnaw, also prohibits the advertising of money games and directs banks and financial institutions to block payments to such platforms. Offering banned money games could result in a jail term of up to three years and a fine."
    },
    {
      "news_title": "Rajya Sabha Passes Online Gaming Regulation Bill Amid Opposition Protest",
      "news_link": "https://www.kerala9.com/latest-news/rajya-sabha-passes-online-gaming-regulation-bill-amid-opposition-protest/",
      "bias": "unknown",
      "text": "New Delhi: The Rajya Sabha has passed the Online Gaming Regulation Bill amid opposition protests, through a voice vote. The bill, cleared by the Union Cabinet earlier this week, was passed in the Lok Sabha on Wednesday and in the Rajya Sabha on Thursday. It will become law once the President gives assent.\nThe bill seeks to curb rising addiction, money laundering, and financial fraud linked to online gaming. Once enforced, all money-based gaming transactions will be prohibited. Banks and financial institutions will not be allowed to process payments for such games.\nAdvertisements promoting gaming, including e-sports, will be banned. Strict action will be taken against unregistered or illegal gaming platforms.\nSince October 2023, the government has imposed 28% GST on online gaming platforms, and from FY 2024-25, a 30% tax is levied on gaming winnings. Offshore operators have also been brought under Indian taxation.\nUnder the Bharatiya Nyaya Sanhita, illegal betting has already been classified as a criminal offence, punishable with up to seven years in jail and heavy fines. The Ministry of Electronics and IT will act as the nodal regulator, with powers to block any unregistered or illegal gaming websites in India."
    },
    {
      "news_title": "Taxation of Online Gaming Income in FY 2025: ITR Rules and New Regulations",
      "news_link": "https://studycafe.in/taxation-of-online-gaming-income-in-fy-2025-itr-rules-and-new-regulations-391074.html",
      "bias": "unknown",
      "text": "Everything you need to know about TDS, tax rates, and ITR forms for online gaming income in FY 2025.\nVanshika verma | Aug 22, 2025 |\nTaxation of Online Gaming Income in FY 2025: ITR Rules and New Regulations\nWith both houses of parliament (Rajya Sabha and Lok Sabha) passing the ‘Promotion and Regulation of Online Gaming Bill 2025‘. the government is now moving to ban online money-based games in India. If any income or loss is generated from such games, Financial Year must be adjusted while filing income tax returns.\nWhen filing income tax returns, any income that is generated via online gaming is treated as Income from Other Sources. Sections 115BBJ and 194BA of the Income tax Act apply to income earned on various gaming platforms.\nSection 115BBJ: Income tax on net winnings for the previous fiscal year is imposed at 30%.\nSection 194BA: This deals with tax deducted at source (TDS) on net gains credited to the taxpayer’s gaming account at the end of the financial year.\nTax experts said, If any TDS is deducted, it will appear in Form 26AS through Form 16A, and it should be reflected under the Schedule TDS section in your ITR. Significantly, losses from gaming can be adjusted against the income from online gaming.\nIncome from other sources is a residuary head of income and sweeps in all such income which falls outside the other four heads of income. But certain incomes will always be taxable under the head ‘income from other sources’, like winnings from lotteries, gifts, interest in enhanced compensation, etc.\nFor income from online gaming, you are required to file ITR-2.\nOne of the CAs explained that if you file your return through the prescribed ITR form applicable to you, such as ITR-2 or ITR-3 whichever is suitable to your other income and make sure of the accuracy in your return filing, the income tax department cross-verifies it with the data available with the respective platforms.\nThe Promotion and Regulation of Online Gaming Bill, 2025 seeks to strengthen online gaming regulations by banning the advertising and operation of online money games. This move was taken to address increasing concerns over addiction, money laundering, and financial fraud connected with these applications.\nIn case of any Doubt regarding Membership you can mail us at [email protected]\nJoin Studycafe's WhatsApp Group or Telegram Channel for Latest Updates on Government Job, Sarkari Naukri, Private Jobs, Income Tax, GST, Companies Act, Judgements and CA, CS, ICWA, and MUCH MORE!\""
    },
    {
      "news_title": "Massive Setback as India Passes Sweeping Ban on Real-Money Online Games Nationwide",
      "news_link": "https://pokerindustrypro.com/news/article/222466-massive-setback-india-passes-sweeping-ban-on",
      "bias": "unknown",
      "text": "© 2011-2025 Fuse Media Corp. All rights reserved. This material may not be reproduced, displayed, modified or distributed without the express prior written permission of the copyright holder.\nFlag icons © FamFamFam.\nAny reference to cash game data used in any articles, reports, charts or elsewhere provided by GameIntel, unless specified otherwise."
    },
    {
      "news_title": "Online Gaming Banned: Mass Firing And Layoffs Next?",
      "news_link": "https://www.gulte.com/trends/367827/online-gaming-banned-mass-firing-and-layoffs-next",
      "bias": "unknown",
      "text": "It is already known that the online gaming and fantasy gaming platforms in India have been an exponential rise in the recent years. Several platforms like Dream11, My 11 Circle, MPL and others have been generating massive revenues thanks to the vast increase in the money-paying users demographic.\nHowever, the latest online gaming bill that was passed in the Parliament and subsequently in Rajya Sabha has come as a rude shock to the entire fantasy gaming industry.\nIt is not being reported that several companies primarily, including Dream11 are likely to carry out mass firing and layoff operations in the due course.\nReportedly Dream11 has already stopped the gaming operations related to money, and has started to brief the employees about the transition period. It is likely that the company is going to largely cut down on the workforce due to the constrained operations.\nThe online gaming market in India reached the 30,000 crore mark recently and was oriented to go on upward spiral. But this timely intervention with the introduction of the new online gaming bill by the central government came at a bad time.\nBut from a financial and public standpoint, this is a much needed decision as several lives were being shattered and suicides were being committed due to the severe financial stress these online gaming websites were bringing in many families.\nTags Online Gaming Banned"
    },
    {
      "news_title": "Fantasy apps suspend money games after govt passes Online Gaming Bill",
      "news_link": "https://www.socialnews.xyz/2025/08/22/fantasy-apps-suspend-money-games-after-govt-passes-online-gaming-bill/",
      "bias": "unknown",
      "text": null
    },
    {
      "news_title": "Indian Parliament Bans Online Money Games",
      "news_link": "https://see.news/indian-parliament-bans-online-money-games",
      "bias": "unknown",
      "text": "India’s parliament on Thursday passed a bill banning online games played for money, a move that could upend the country’s fast-growing fantasy sports industry after Prime Minister Narendra Modi’s government warned of severe financial risks tied to such platforms.\nThe legislation, which has already cleared both houses of parliament, now awaits the president’s formal approval, widely seen as a procedural step.\nThe decision has sent shockwaves through a multibillion-dollar industry backed by major venture capital firms such as Tiger Global and Peak XV Partners. Analysts had projected the sector could reach a valuation of $3.6 billion by 2029.\nExecutives now fear sweeping job losses and the closure of many app-based companies that have attracted billions in foreign investment.\nThe law targets what the government calls “harmful” money-based gaming services, including associated advertising and financial transactions, while also citing potential psychological harm. “It is the duty of the government and parliament to take strict action against social evils that continue to emerge from time to time,” IT Minister Ashwini Vaishnaw told lawmakers.\nIndia’s gaming firms are preparing to challenge the ban in the Supreme Court, arguing the government failed to consult industry stakeholders and that certain games, such as poker, rely on skill and should not fall under the prohibition.\nFantasy sports apps like Dream11 and Mobile Premier League have soared in popularity, boosted by aggressive marketing campaigns and endorsements from cricket superstars. These platforms allow users to assemble virtual cricket teams based on real players and earn points tied to actual match performances.\nOn Thursday, Dream11 promoted the option to form a team for just 29 rupees (33 cents), with prizes as high as 300,000 rupees ($3,438).\nDream11 is currently valued at around $8 billion, while Mobile Premier League is worth an estimated $2.3 billion, according to PitchBook data. Other widely used platforms include Games24x7, offering card games such as rummy and poker, as well as Zupee and WinZO.\nUnder the new law, any individual or company offering money-based games once the ban takes effect could face up to three years in prison and heavy fines, a prospect that threatens to reshape one of the country’s most dynamic digital industries."
    },
    {
      "news_title": "Daily Asia Gaming eBrief: India’s parliament passes bill banning real money games",
      "news_link": "https://agbrief.com/news/22/08/2025/daily-asia-gaming-ebrief-indias-parliament-passes-bill-banning-real-money-games/",
      "bias": "unknown",
      "text": null
    },
    {
      "news_title": "Indian parliament bans all real-money online gambling",
      "news_link": "https://asgam.com/2025/08/22/indian-parliament-bans-all-real-money-online-gambling/",
      "bias": "unknown",
      "text": "The Indian parliament has passed a bill that will ban all real-money online gaming, including skill games such as fantasy sports and poker.\nReuters reports that India’s upper house passed the controversial Promotion and Regulation of Online Gaming Bill 2025 after the lower house cleared it earlier this week, with it now considered a formality that the President will imminently sign the bill into law.\nUnder the bill, anyone offering real-money online games would face a jail term of up to three years plus a fine.\nThe sudden and rapid passage of the bill has shocked the industry, which has in recent years enjoyed rapid growth on the backing of venture capital firms and celebrity promotions by high-profile sports stars – particularly members of India’s massively popular cricket team. According to Reuters, the fantasy segment alone was expected to be worth US$3.6 billion by 2029.\nOther skill games like poker and rummy are also popular in India.\nThe bill itself looks to “prohibit the offering, operation, facilitation, advertisement, promotion and participation in online money games” and specifically targets firms that offer fantasy sports and card games where users can deposit and risk money.\nIT Minister Ashwini Vaishnaw told parliament on Thursday, “It is the duty of the government and the parliament to take strict action against social evils, which keep erupting time and again.”\nIt is expected that industry representatives could challenge the ban in the Supreme Court given a lack of consultation and the potential impact on employment."
    },
    {
      "news_title": "Hike’s RMG Platform ‘Rush’ To Exit India",
      "news_link": "https://inc42.com/buzz/hikes-rmg-platform-rush-to-exit-india-founder-slams-policy-reversals/",
      "bias": "unknown",
      "text": "D2CX by Inc42 is a 12-week hands-on program to help you level up your D2C game. Learn from India's top 1% D2C founders and experts through actionable insights, proven strategies and tactics on how to 10X your D2C brand.\nview\nManagementX by Inc42 – India’s first Startup Management Program is a 6-month hands-on program that will take you on an intense journey that shatters the outdated “employee mindset” and equips you with the “leader mindset”.\nview\nD2CX Foundations by Inc42 is a 6 week hands-on program to help you launch your D2C brand successfully and profitably. Learn from India’s top 1% of D2C founders & experts through actionable insights, proven strategies and tactics on how to launch a successful D2C Brand in 6 weeks.\nview"
    },
    {
      "news_title": "Online Gaming Bill Passed in Parliament Amid Opposition Protests – The State",
      "news_link": "https://thestateindia.com/2025/08/21/online-gaming-bill-passed-in-parliament-amid-opposition-protests/",
      "bias": "unknown",
      "text": "Online Gaming Bill Passed in Parliament Amid Opposition Protests\nNew law bans online money games, gambling, and advertising, imposing strict penalties up to 5 years imprisonment and fines up to Rs 2 crore.\nOnline Gaming Bill Clears Parliament Despite Opposition Protests\nThe Promotion and Regulation of Online Gaming Bill was passed in Parliament on Friday, following approval in both the Lok Sabha and Rajya Sabha by voice vote. The legislation aims to ban online games played with real money, criminalize their operation, facilitation, and advertising, and impose strict penalties for violations.\nKey Highlights of the Bill\n- Ban on Online Money Games: All online betting, gambling, and fantasy sports involving real money deposits will be prohibited. This includes popular games such as Poker, Rummy, and online lotteries.\n- Penalties:\n- Up to 3 years imprisonment and/or fine up to Rs 1 crore for facilitating online money gaming.\n- Advertising these games may attract imprisonment of up to 2 years and/or fine up to Rs 50 lakh.\n- Repeat offences can lead to enhanced penalties of 3 to 5 years imprisonment and fines up to Rs 2 crore.\n- Non-bailable and Cognizable Offences: Key sections of the bill make offences cognizable and non-bailable, ensuring stricter enforcement.\n- Financial Restrictions: Banks and financial institutions are barred from processing or facilitating payments related to online money games.\nGovernment’s Standpoint\nMinister of Electronics and Information Technology, Ashwini Vaishnaw, emphasized the dangers of money-game addiction, comparing it to drug addiction. He warned that powerful entities behind these games would likely challenge the law in courts and launch social media campaigns opposing the ban. Vaishnaw also highlighted concerns about the misuse of gaming revenues to support terror activities.\nOpposition’s Concerns and Protests\nOpposition leaders strongly protested the bill’s passage without a proper discussion. Leader of Opposition Mallikarjun Kharge criticized the lack of debate, demanding parliamentary discussion before approval. Meanwhile, Union Minister Kiren Rijiju responded that the Opposition’s continuous protests made it difficult to hold a debate. The Opposition also called for discussion on the Election Commission’s special intensive revision of electoral rolls in Bihar.\nWhat Constitutes an Online Money Game?\nThe bill defines an online money game as any game where users deposit money with the hope of winning monetary or other rewards.\nThe new legislation marks a significant step in regulating online gaming in India by cracking down on illegal money gaming and its advertisement. While the government asserts the bill will protect citizens from gambling-related harms, the opposition remains concerned about the legislative process.\nRelated News : India to Table Online Gaming Regulation Bill Today: Ban on Money-Based Games, Boost for E‑Sports"
    },
    {
      "news_title": "Real Money Gaming ban will create hard-to-fill AdEx gap: Ashwin Padmanabhan",
      "news_link": "https://bestmediainfo.com/mediainfo/mediainfo-digital/real-money-gaming-ban-will-create-hard-to-fill-adex-gap-ashwin-padmanabhan-9684831",
      "bias": "unknown",
      "text": "New Delhi: The impact of the ban on real money gaming in India will create a permanent void in the overall annual advertising spends that cannot be replaced, Ashwin Padmanabhan, Chief Operating Officer, WPP Media (South Asia).\nSpeaking exclusively to BestMediaInfo.com, Padmanabhan said the impact will be concentrated but significant.\nThe advertising and media ecosystem in India is bracing for the ripple effects of the Promotion and Regulation of Online Gaming Bill, 2025, which was passed by both houses of Parliament.\nEven as Padmanabhan avoided coining any specific number, the legislation, aimed at tackling addiction, financial losses, and regulatory loopholes, threatens to drain an estimated Rs 10,000 crore from AdEx.\nA former senior executive at Baazi Games said he would not be surprised if the figure were far higher than Rs 10,000 crore.\nMultiple sources told BestMediaInfo.com that real money gaming platforms rely on all forms of advertising, including influencer marketing, and spend between 25% and 50% of their revenue on customer acquisition.\nThat said, the top five real money gaming platforms spend more than Rs 5,000 crore, while a similar amount is collectively spent by other players, including the long tail.\nWith the category having emerged as one of the largest spenders, especially in performance marketing, and a dominant investor in marquee cricketing properties, the move is expected to leave a lasting dent in the advertising industry.\nEven for large platforms like Google or Meta, the online money gaming industry is one of the biggest categories in the performance marketing space. “There will surely be some impact from a large client aspect,” said Padmanabhan.\nOne of the biggest immediate concerns is the Indian Premier League (IPL), where RMG platforms have historically been among the heaviest advertisers. Padmanabhan estimates that anywhere from Rs 800 crore to Rs 1,000 crore of potential IPL spending could be impacted.\nWith the Bill set to become an Act after presidential assent, the pullback raises difficult questions about whether other categories can step in to fill the void.\nWhile the digital ecosystem has an abundant inventory supply, marquee sporting events like the IPL operate on fixed inventory, making them especially vulnerable. The size of the RMG advertising wallet makes replacement unlikely.\nAccording to Padmanabhan, only a handful of companies were fuelling the majority of spending. “Technically, finding a replacement for this particular expenditure is going to be difficult,” he told BestMediaInfo.com.\nThe Promotion and Regulation of Online Gaming Bill, 2025, has two aspects. While it enforces a blanket ban on RMG platforms, it promotes e-sports and online games that do not involve money as an incentive to play and win.\nAlthough industry observers have suggested e-sports could absorb some of the lost advertising, Padmanabhan dismissed the idea. “From a purely monetary standpoint, e-sports and RMG platforms are not the same. Technically, the amount of money has simply gone out of the category.”\nPadmanabhan drew an insightful comparison between RMG advertising wallets and the startups’ wallets that were in the spotlight before 2023. “It is a permanent void. This cannot be replaced. Just like we could never replace all the money that the startups were spending a few years ago. That just went away,” he said.\nFrom a broader advertising expenditure perspective, RMG’s contribution was highly concentrated in certain areas such as performance-driven digital campaigns and cricket-led sponsorships.\nOutside of these verticals, its role in the media mix was negligible. “RMG’s impact on advertising is limited to a few categories. It’s limited to performance spends on digital and it’s limited to probably spends on cricket. It doesn’t impact the rest of the categories like print, radio, cinema, TV, and most of the branding on digital,” he clarified.\nWhile advertisers across sectors will watch closely how the situation unfolds, Padmanabhan emphasised that the implications of a ban extend beyond ad spends.\n“The impact of RMG is about a very large industry, which employs a lot of people, and which today is under the threat of extinction. That is the larger impact. Job losses will be quite significant. But if there’s a view that it is impacting society in general and at large, and it is good for society, I think the government will always think about that first,” he said.\nHe framed the government’s approach as one rooted in consumer-first thinking. Concluding, he said: “They’re also recognising that maybe, maybe, real money gaming is in some form impacting certain sections of society. So really, the government's thinking is coming from the consumer’s end."
    },
    {
      "news_title": "India’s parliament bans online money gaming",
      "news_link": "https://minutemirror.com.pk/indias-parliament-bans-online-money-gaming-427622/",
      "bias": "unknown",
      "text": "India’s Parliament has passed a new bill to prohibit online games played for money, a move that could dismantle the country’s multi-billion-dollar fantasy gaming sector. The Promotion and Regulation of Online Gaming Bill 2025 was passed by both the lower and upper houses this week, with the government citing concerns over financial and psychological harm. The bill now awaits the President’s signature, which is considered a formality.\nThe new legislation has sent shockwaves through the industry, which was projected to reach a value of $3.6 billion by 2029. The sector is backed by major venture capital firms, including Tiger Global and Peak XV Partners, and features popular platforms like Dream11 and Mobile Premier League. Industry executives have expressed concerns about immediate job losses and the potential for a complete shutdown of many app-based businesses that have attracted billions in foreign investment.\nThe bill specifically bans “harmful” online money games, as well as their advertisements and related financial transactions. During a parliamentary session, federal IT Minister Ashwini Vaishnaw stated, “It is the duty of the government and the parliament to take strict action against social evils, which keep erupting time and again.”\nThe ban targets popular apps like Dream11, which allows users to create virtual cricket teams and win real money based on the performance of actual players. Despite the small entry fees (as low as INR 29), top payouts can be significant, reaching up to INR 300,000.\nThese platforms have been heavily endorsed by top Indian cricketers, boosting their widespread appeal. According to PitchBook data, Dream11 is valued at $8 billion, and Mobile Premier League at $2.3 billion. Other major apps like Games24X7, Zupee, and WinZO are also affected.\nIn response, several Indian gaming groups are reportedly in discussions with lawyers to challenge the ban in the Supreme Court. They plan to argue that the government failed to consult with the industry and that some games, such as poker, are based on skill and should be exempted from the ban. The new law imposes severe penalties, including a potential jail term of up to three years and a fine for anyone who continues to offer online money games.\nWe welcome your contributions! Submit your blogs, opinion pieces, press releases, news story pitches, and news features to opinion@minutemirror.com.pk and minutemirrormail@gmail.com"
    },
    {
      "news_title": "Discontinuing paid games, free titles like Ludo to stay: Zupee",
      "news_link": "https://www.newsdrum.in/business/discontinuing-paid-games-free-titles-like-ludo-to-stay-zupee-9685447",
      "bias": "unknown",
      "text": "New Delhi, Aug 21 (PTI) Gaming platform Zupee on Thursday said it is discontinuing its paid games in view of the Online Gaming Bill that was passed by the Parliament.\nHowever, Zupee's free titles like Ludo Supreme, Ludo Turbo, Snakes & Ladders, and Trump Card Mania will continue to be available for all users, the company said in a statement.\n\"Zupee remains fully operational and our players can continue to enjoy their favourite games on the platform. In line with the new Online Gaming Bill 2025, we are discontinuing paid games,\" a Zupee spokesperson said.\nParliament on Thursday passed a bill to ban all forms of online money games and promote eSports and online social gaming, with the Rajya Sabha approving it without debate amid din.\nPiloting The Promotion and Regulation of Online Gaming Bill, 2025 in the Upper House, Minister of Electronics and IT Ashwini Vaishnaw said the legislation will promote two-thirds of the online gaming segment.\nThe bill, he said, will ban online money games, which have become a big problem for society, especially middle-class youth.\nThe bill also seeks to prohibit advertisements related to online money games, as well as bars banks and financial institutions from facilitating or transferring funds for any of such games. PTI ANK HVA"
    },
    {
      "news_title": "India bans online money games, apps",
      "news_link": "https://ummid.com/news/2025/august/21-08-2025/india-bans-online-money-games-apps.html",
      "bias": "unknown",
      "text": "New Delhi: In an important move, the Parliament Thursday August 21, 2025 passed a bill banning online games and apps involving money and financial transactions.\n“The Promotion and Regulation of Online Gaming Bill, 2025, passed by the Parliament on 21st August 2025, marks a landmark move to shield citizens from the menace of online money games while promoting and regulating other kinds of online games”, the Ministry for Electronics and IT said.\n“This legislation is designed to curb addiction, financial ruin and social distress caused by predatory gaming platforms that thrive on misleading promises of quick wealth”, the Ministry said.\n\"The Promotion and Regulation of Online Gaming Bill, 2025, marks a decisive step in India’s digital journey. It recognises the dangers of unregulated money gaming and responds with firm safeguards to protect citizens\", the Ministry said.\nThe bill however, exempts e-sports and educational games, this comes with a rider.\n\"At the same time, it carves out space for e-sports and educational games that nurture skills and creativity. The Central Government to have the authority to frame rules for the promotion of e-sports and social games, the recognition and registration of online games, and the functioning of the Online Gaming Authority. It may also make rules on any other matter required under this law\", the Ministry said.\nThe Ministry said through the new law, the government intends to set the tone for a safer and healthier digital future.\n\"It also strengthens India’s standing as a nation that can lead in shaping global digital policy. Most importantly, it ensures that technology serves society rather than harms it\", the Ministry said.\nThe Bill, which got Rajya Sabha nod today, was passed by the Lok Sabha earlier this week. Once signed by the President of India, the Bill will become an act.\nIndia's online gaming industry, worth $3.7 billion as of now and projected to touch $9.1 billion by 2029, depends overwhelmingly on real-money games.\nThe popular online games in India are Dream 11, Mobile Premier League, Zupee, WinZO and Games24X7, which offers card games like rummy and poker.\nThe industry is holding discussions with lawyers about approaching the Supreme Court to challenge the ban by citing a lack of consultation, according to Reuters.\nThe market players fear job losses if the ban come into force. The government, however, has an opposite view.\n\"The Bill supports India’s position as a hub for digital creativity. By encouraging e-sports and safe online games, it will expand opportunities for exports, create new jobs and promote innovation in the gaming sector. This will strengthen India’s role in the global digital economy\", the Ministry said.\nFollow ummid.com WhatsApp Channel for all the latest updates.\nSelect Language to Translate in Urdu, Hindi, Marathi or Arabic"
    },
    {
      "news_title": "Dream11, MPL, Rummy apps face uncertain future as Parliament clears Online Gaming Bill",
      "news_link": "https://www.newsroomodisha.com/dream11-mpl-rummy-apps-face-uncertain-future-as-parliament-clears-online-gaming-bill/",
      "bias": "unknown",
      "text": "New Delhi: India’s most popular fantasy and card gaming apps, including Dream11, Mobile Premier League (MPL), My11Circle, PokerBaazi and RummyCircle, are staring at an uncertain future after the Rajya Sabha on Thursday passed the Online Gaming Bill, 2025.\nThe legislation outlaws real-money fantasy contests, poker, rummy and other pay-to-play platforms, dealing a severe blow to India’s $3.8 billion online gaming industry.\nThe bill also prohibits advertisements and financial transactions linked to such games, citing risks of addiction, psychological distress and financial ruin.\nDream11, valued at $8 billion and widely used during the Indian Premier League, along with $2.5 billion-valued MPL, Games24x7 (operator of My11Circle and RummyCircle), Junglee Games, WinZO, Howzat, SG11 Fantasy, GamesKraft (RummyCulture) and PokerBaazi are among the apps expected to be directly affected.\nNazara Technologies, which has an investment in PokerBaazi, may also feel the pinch despite its limited exposure to real-money gaming.\nIndustry groups have warned of large-scale fallout if the ban is enforced. They estimate nearly 200,000 jobs could be lost, alongside Rs 25,000 crore worth of foreign direct investment and Rs 20,000 crore in tax revenues.\nAnalysts also caution that the restrictions may drive nearly 45 crore Indian users toward illegal offshore gaming platforms.\nDefending the move, Union IT and Railways Minister Ashwini Vaishnaw said the bill is designed to protect families and youth while fostering safe segments such as e-sports and casual online games.\n“Online money games are prohibited. Youth and children addicted, families ruined. Massive frauds, credit card debt, even suicides,” he said, adding that the government chose the safety of middle-class households over revenues.\nThe Promotion and Regulation of Online Gaming Bill, 2025, recognises three segments of online play — e-sports, online social games, and money-based gaming.\nWhile e-sports will now get formal recognition and support through government schemes, money-based games have been declared harmful and banned outright.\nThe legislation also proposes the creation of a central authority to coordinate regulation, enforce compliance, and encourage innovation in the non-monetary segments of online gaming.\nWith both Houses of Parliament having cleared the bill, it will now head to the President for assent before becoming law.\n–IANS\nComments are closed, but trackbacks and pingbacks are open."
    },
    {
      "news_title": "Online Gaming Bill 2025 Passed In Parliament",
      "news_link": "https://kiddaan.com/online-gaming-bill-2025-passed-apps-banned/",
      "bias": "unknown",
      "text": "The much-awaited Online Gaming Bill 2025 has officially been passed in the Rajya Sabha, marking a historic move in India’s digital regulation space. The bill, aimed at controlling real-money gaming and curbing gambling-like behavior, will directly impact many of India’s most used gaming apps. With this, lakhs of gamers across the country will have to prepare for a major shift, as several popular apps will soon be banned under the new law. The government stated that the bill was necessary to safeguard youth from addiction and financial losses linked to online betting and gambling. The development has sparked huge conversations among players and industry insiders, with many pointing out its long-term effects on India’s digital economy. This marks the first major regulation of its kind, making the Online Gaming Bill 2025 a landmark step.\nWhy The Online Gaming Bill 2025 Was Passed\nThe central government emphasized that this bill was crucial to control online gambling, protect minors, and regulate gaming platforms that operate in a grey area. With rising addiction cases and financial risks associated with real-money games, this bill aims to bring order to the rapidly growing gaming sector.\nPopular Indian Gaming Apps That Will Be Banned\nHere are the major apps that will be directly impacted under the Online Gaming Bill 2025:\n- Dream11\nOne of the most popular fantasy sports platforms in India. It allows users to make teams and win cash prizes but will now face restrictions.\n- MPL (Mobile Premier League)\nA gaming hub that offers fantasy cricket, rummy, and multiple skill-based games with real cash rewards.\n- RummyCircle\nA well-known app for online rummy that attracts millions of players with real money stakes.\n- A23\nAnother popular rummy and card game app, widely advertised and used across India.\n- PokerBaazi\nFamous for poker tournaments and cash games, which will be restricted under the bill.\nThe government clarified that casual, skill-based, and entertainment-driven free-to-play apps will not be affected. Only apps involving real-money transactions and betting-like features will be banned.\nIndustry Reaction To The Bill\nIndustry leaders have expressed concern about the employment and investment impact of this move. India’s online gaming market was projected to grow into a multibillion-dollar industry, but the Online Gaming Bill 2025 has raised uncertainty over future investments. However, social groups and parents have welcomed the decision, saying it will protect children from harmful online behavior.\nFAQs\nQ: What is the Online Gaming Bill 2025?\nA: The Online Gaming Bill 2025 is a new law regulating online real-money games to curb gambling and betting.\nQ: Which apps will be banned under the Online Gaming Bill 2025?\nA: Popular apps like Dream11, MPL, RummyCircle, A23, and PokerBaazi will be banned.\nQ: Will free-to-play games also be banned?\nA: No, casual games without betting or money-based elements will not be affected.\nQ: Why is the Online Gaming Bill 2025 significant?\nA: It’s India’s first major digital regulation law that directly impacts the country’s online gaming industry."
    },
    {
      "news_title": "'Moral Policing' Dressed Up As Policy: Anupam Mittal Takes Dig At Gaming Bill",
      "news_link": "https://www.ndtvprofit.com/business/moral-policing-dressed-up-as-policy-anupam-mittal-takes-a-dig-at-gaming-bill",
      "bias": "unknown",
      "text": "'Moral Policing' Dressed Up As Policy: Anupam Mittal Takes Dig At Gaming Bill\nThe Shaadi.com founder says real-money gaming sector contributed around Rs 27,000 crore in GST annually, generated over Rs 10,000 crore in ad revenue and provided livelihoods for thousands.\nShaadi.com founder Anupam Mittal has criticised the bill banning the operation, facilitation and advertisement of online games, describing it as \"moral policing dressed up as policy\".\n\"We banned gutka, but have people stopped chewing? India also just banned real-money gaming,\" Mittal wrote on LinkedIn.\nThe Promotion and Regulation of Online Gaming Bill, 2025, was passed in the Rajya Sabha through a voice vote, a day after it was approved by the Lok Sabha. The legislation seeks to make online money gaming punishable with imprisonment of up to three years and/or a fine of up to Rs 1 crore.\nMittal highlighted the possible economic and employment impact of the ban, saying that the real-money gaming sector contributed around Rs 27,000 crore in GST annually, generated over Rs 10,000 crore in advertising revenue, and provided livelihoods for thousands involved in games of skill.\n\"Fair concerns, but do we ban alcohol because some become alcoholics?\" he questioned. \"Do we ban stock trading because some blow up their savings?\"\nMittal warned that bans often have unintended consequences. He said that such measures typically result in government revenue losses, reduced protection for users, and the growth of black-market platforms, which in India are reportedly worth around Rs 8.3 lakh crore.\nIn the short term, he said, the move feels like “we shot ourselves in the foot,” though he acknowledged that it could eventually allow legitimate gaming and esports to grow.\n“Right now, it looks like moral policing dressed up as policy. Hope we’re not trying to out-ban China,\" Mittal concluded.\nOn Thursday, while tabling the bill in the Rajya Sabha, Electronics and IT Minister Ashwini Vaishnaw compared money-gaming addiction to drug addiction. He warned that powerful operators would challenge the law in courts and run campaigns against it and said some online games had been linked to funding illegal activities.\nThe bill prohibits advertisements for money games and bars banks and financial institutions from processing related transactions. Violations of advertising rules can lead to up to two years’ imprisonment or a fine up to Rs 50 lakh.\nFacilitating financial transactions can attract up to three years’ imprisonment or a fine of Rs 1 crore, with repeat offences carrying penalties of three to five years’ imprisonment and fines up to Rs 2 crore. Key offences are to be made cognisable and non-bailable."
    },
    {
      "news_title": "India passes bill to ban money-based online games, app shutdowns loom",
      "news_link": "https://upstract.com/x/dd873c5cebf6437e?ref=rss",
      "bias": "unknown",
      "text": null
    },
    {
      "news_title": "Rajya Sabha passes Online Gaming Bill; Vaishnaw says govt to promote e-sports, ban money-based games",
      "news_link": "https://www.news9live.com/india/rajya-sabha-passes-online-gaming-bill-vaishnaw-says-govt-to-promote-e-sports-ban-money-based-games-2883880",
      "bias": "unknown",
      "text": "Rajya Sabha passes Online Gaming Bill; Vaishnaw says govt to promote e-sports, ban money-based games\nThe legislation seeks to impose a blanket ban on money-based online games while promoting e-sports and social gaming. It also prohibits advertisements of money-gaming platforms and bars banks and financial institutions from processing related transactions. Once enacted, offering online money games will be punishable with up to three years' imprisonment and/or a fine of up to Rs 1 crore.\nNew Delhi: A day after the Lok Sabha passed the Promotion and Regulation of Online Gaming Bill, 2025, the Rajya Sabha on Thursday cleared it by voice vote amid opposition sloganeering. The Bill was tabled by Union IT and railways minister Ashwini Vaishnaw.\nThe legislation seeks to impose a blanket ban on money-based online games while promoting e-sports and social gaming. It also prohibits advertisements of money-gaming platforms and bars banks and financial institutions from processing related transactions. Once enacted, offering online money games will be punishable with up to three years’ imprisonment and/or a fine of up to Rs 1 crore.\nBill terms money-based games harmful\nThe Bill defines money-based games as those requiring players to deposit funds in the hope of winning cash or other rewards. Labelled “harmful”, such games and their associated financial dealings will stand prohibited.\nVaishnaw, in his remarks inside and outside Parliament, underlined the Bill’s “balanced approach” — promoting what is beneficial while banning what is harmful for the youth and middle class. He termed online gaming an important part of “Digital Bharat” and classified it into three categories:\n1. E-sports: training and strategy-based, played between teams like cricket or football. The Bill gives e-sports legal recognition, with government schemes planned to promote them.\n2. Social games: fun, educational and community-based, such as Angry Birds, card games or brain games. Recognised as safe, these will be encouraged as part of India’s creator economy and software growth.\n3. Money-based games: involving financial stakes, addiction and harm. Vaishnaw said such games have ruined families, pushed youth into debt, led to suicides, and enabled money laundering and terror financing. Misleading celebrity endorsements, he added, give them false legitimacy.\nPlayers are victims – won’t be penalised\nThe minister clarified that players will not be penalised, as they are considered victims. Instead, service providers, advertisers and financial intermediaries will face action.\nCiting thousands of complaints from across the country, Vaishnaw said the government had prioritised the safety of families over other considerations. “When it comes to choosing between society’s welfare and government revenue, Prime Minister Modi has always chosen middle-class families. This Bill follows the same principle — protecting society while encouraging e-sports and social game creators as engines of innovation,” he said.\nClick for more latest India news. Also get top headlines and latest news from India and around the world at News9."
    },
    {
      "news_title": "Online Gaming Bill 2025: India Passes Bill to Prohibit Real-Money Gaming Apps, What The Bill Means For Dream11, MPL, My11Circle, and RummyCircle",
      "news_link": "https://www.techlusive.in/news/online-gaming-bill-2025-india-passes-bill-to-prohibit-real-money-gaming-apps-what-the-bill-means-for-dream11-mpl-my11circle-and-rummycircle-1589090/",
      "bias": "unknown",
      "text": "India’s parliament has approved a new bill that bans all online games involving money, regardless of whether they are based on skill or chance. The law prohibits advertising such platforms, stops banks from processing related payments, and sets penalties of up to three years in jail, along with fines for violators. Once signed by the president, a step considered a formality, the bill will become law.\nWhy is it crucial? This online real-money gaming ban comes at a time when the industry in India was projected to reach nearly $9 billion by 2029. Popular real-money gaming platforms such as Dream11, MPL, My11Circle, and RummyCircle get most of their revenues from money-based formats like fantasy cricket, rummy, and poker. With the ban, these apps face the possibility of shutdowns.\nGames that heavily trade on money can excite players to keep spending money beyond their real means. The thrill of a fast payout quickly turns into a darker scenario, which can cause massive losses, accumulating debt, as well as chronic anxiety. By designating the games as “harmful,” the Indian government flags risks that are both economic and emotional for individuals and their close circles.\nUntil now, the government had leaned on taxation and strict monitoring, imposing a 28% GST on gaming revenues and a 30% tax on winnings. More than 1,400 illegal betting sites have been blocked since 2022. But with this new law, the focus has shifted from regulating to completely prohibiting real-money games within the country.\nThis bill has caused tension within the sector, including share prices and the daily jobs of professionals. Industry groups say that the ban will wipe out thousands of jobs and push Indian players toward unregulated offshore platforms that lack consumer protections.\nGet latest Tech and Auto news from Techlusive on our WhatsApp Channel, Facebook, X (Twitter), Instagram and YouTube.Author Name | Divya\nSelect Language"
    },
    {
      "news_title": "Online Gaming Bill Passed Amid Opposition Protests",
      "news_link": "https://indtoday.com/online-gaming-bill-passed-amid-opposition-protests/",
      "bias": "unknown",
      "text": "Online Gaming Bill Passed Amid Opposition Protests\nDelhi/Hyderabad, Aug 21 (Maxim News): The Online Gaming Bill was passed in Parliament amid protests by the opposition parties against the Special Intensive Revision (SIR) of the Voter List undertaken by the Election Commission in Bihar. The Bill, which was passed in the Lok Sabha on Wednesday, was brought before the Rajya Sabha today (August 21). The Online Gaming Promotion Bill was passed by voice vote in the Rajya Sabha. With the approval of this bill, the law came into force to impose a three-year jail term or a fine of Rs. crore for online money gaming.\nOn Thursday (August 21), Minister Ashwini Vaishnaw made key remarks while introducing the Online Gaming Bill in the Rajya Sabha. He said that online money gaming is like drug addiction. The bigwigs behind online gaming will challenge this bill in court. He said that they will also start a social media campaign against the ban on online gaming. He said that they have also seen money generated from online gaming being used to support terrorism.\nThe bill aims to ban real money gaming (poker, fantasy sports) and promote e-Sports, educational games, and social games. The center also aims to make India a global gaming hub. According to the bill, a Central Online Gaming Authority will be established. It will categorize games into four categories: eSports, educational, social, and real money games. Do not offer or support real money games. Advertising is also prohibited. Banks should not transact these. If you run real money games, you will be punished with three years in prison or a fine of Rs. 1 crore. Both can be imposed. If you advertise these, you will be punished with two years in prison and a fine of Rs. 50 lakh. If you do it again, you will be punished with five years in prison and a fine of Rs. 2 crore. These are cognizable, non-bailable offences. Those who play these are considered victims. (Maxim News)\nNow you can get the latest stories from Indtoday on Telegram every day. Click the link to subscribe. Click to follow Indtoday’s Facebook page, Twitter, and Instagram. For all the latest Hyderabad News updates"
    },
    {
      "news_title": "Government Bans Dream11, MPL and All Real-Money Apps - News Leak Centre",
      "news_link": "https://www.newsleakcentre.com/government-bans-dream11-mpl-and-all-real-money-apps/",
      "bias": "unknown",
      "text": "Government Bans Dream11, MPL and All Real-Money Apps\nBy Abhishek Kumar\nThe Indian government has taken a major step by banning all real-money online gaming apps. This includes popular fantasy sports apps like Dream11, MPL, RummyCircle, and online poker. The decision comes under the Online Gaming (Promotion and Regulation) Bill, 2025, which was passed in the Lok Sabha on 20 August 2025.\nAccording to the new law, all real-money gaming apps are now illegal. Players cannot place bets or play for cash prizes anymore. The ban also applies to the promotion and advertisement of such apps. Even celebrities who endorse these platforms could face penalties.\nWhy the Government Took This Step\nThe government said the ban is necessary to protect people from addiction, financial losses, and fraud. Officials mentioned that many families lost their savings due to these apps. The law also aims to prevent misuse of gaming platforms for money laundering and illegal activities.\nImpact on the Industry\nIndia’s real-money gaming industry is valued at around $23 billion (₹2 lakh crore). The ban could cause huge losses for companies like Dream11 and MPL. It may also affect over 4 lakh jobs in the sector. Investors are concerned about the economic impact, but the government says people’s safety is more important\nPositive Steps\nThe bill also promotes e-sports and educational gaming. The government plans to create a National E-sports Authority to ensure safe gaming, support players, and help the sector grow responsibly.\nThe bill will now go to the Rajya Sabha and then to the President for approval. Once it becomes law, anyone violating it could face up to 3 years in prison and fines up to ₹1 crore.\nThis decision has surprised many gaming enthusiasts, but it is a big step toward safe and responsible gaming in India. Fans of fantasy sports and online games will have to find alternatives, but the government believes this move will protect players from addiction and financial risk."
    },
    {
      "news_title": "Parliament Passes Online Gaming Bill to Ban All Forms of Real Money Games",
      "news_link": "https://www.gadgets360.com/games/news/online-gaming-bill-passed-in-parliament-ban-all-real-money-games-9131630",
      "bias": "unknown",
      "text": null
    },
    {
      "news_title": "Online Gaming Bill Clears Rajya Sabha Amid Protests; Money-Gaming Like ‘Drug Addiction’, Says Ashwini Vaishnaw",
      "news_link": "https://odishabytes.com/online-gaming-bill-clears-rajya-sabha-amid-protests-money-gaming-like-drug-addiction-says-ashwini-vaishnaw/",
      "bias": "unknown",
      "text": "New Delhi: The Promotion and Regulation of Online Gaming Bill, which sailed through Lok Sabha a day earlier, cleared Rajya Sabha on Thursday amid huge protests by the Opposition.\nThe bill, which seeks to ban operation, facilitation and advertising of online games played with money, was passed after a voice vote in the Upper House of Parliament as Opposition members alleged that the legislation was pushed through without a discussion.\nOnce it becomes law, online money gaming will be punishable by imprisonment of up to 3 years and/or a fine of up to Rs 1 crore.\nUnion Minister of Electronics & Information Technology Ashwini Vaishnaw, who tabled the bill in Rajya Sabha, said money-gaming addiction is like ‘drug addiction’.\n“The powerful people behind online money games will challenge the decision in courts. They will run social media campaigns against this ban. We have seen the impact of games and how the money is used to support terror,” said Vaishnaw.\nLeader of Opposition Mallikarjun Kharge demanded a discussion on the bill, and also a debate on the special intensive revision (SIR) of electoral rolls in Bihar carried out recently by the Election Commission of India.\nUnion Minister of Parliamentary Affairs Kiren Rijiju questioned the possibility of holding a debate amid the Opposition’s continuous protests. The Online bill was ultimately cleared through a voice vote.\nWhat is online gaming?\nIn an online money game, a user deposits money lured by expectation of winning monetary and other enrichment.\nAll online betting and gambling (satta and jua) activities — online fantasy sports, Poker, Rummy, other Card games and online lotteries – will come under the ambit of the bill and totally outlawed.\nThe legislation seeks to prohibit advertisement related to online money games and also bars banks and financial institutions from transferring funds for such games.\nAdvertising money games will attract imprisonment of up to two years and/or fine up to Rs 50 lakh, while facilitating financial transactions related to money games can lead to imprisonment of up to three years and/or fine up to Rs 1 crore.\nA repeat offence will attract enhanced penalties, including three to five years’ imprisonment and fines up to Rs 2 crore.\nThe bill also proposes that offences under key sections be made cognizable and non-bailable."
    },
    {
      "news_title": "Online Gaming Bill passed in Rajya Sabha by voice vote amid Oppn ruckus",
      "news_link": "https://connectgujarat.com/india/online-gaming-bill-passed-in-rajya-sabha-by-voice-vote-amid-oppn-ruckus-9684109",
      "bias": "unknown",
      "text": "The Rajya Sabha on Thursday passed the Promotion and Regulation of Online Gaming Bill amid protests by opposition leaders in the House. Despite the uproar, the legislation was cleared through a voice vote.\nDeputy Chairman Harivansh announced the approval of the legislation in the Upper House and subsequently adjourned proceedings for ten minutes.\nThe bill, piloted by electronics and information technology minister Ashwini Vaishnaw, aims to ban all forms of online money games while promoting eSports and online social gaming.\nThe Upper House cleared the legislation after rejecting amendments proposed by Opposition members.\nThe Lok Sabha had passed the bill a day earlier.\nThe Online Gaming Bill, also prohibits advertisements of online money games and bars banks and financial institutions from facilitating or transferring funds for such activities.\nOnline money games, defined as those played by depositing money with the expectation of winning monetary or other rewards, will be brought under the proposed ban.\nAs the bill stands clear from both houses, this makes the offering or facilitation of online money gaming punishable with imprisonment of up to three years and/or a fine of up to ₹1 crore.\nDuring the debate, Vaishnaw told MPs, “People lose their life’s savings in online money gaming.”\nThe minister also highlighted that several platforms have been misused for money laundering, terror financing, and even as messaging channels by terrorist organisations.\nPopular gaming platforms likely to be affected under the new law include Dream11, Mobile Premier League (MPL), Howzat, SG11 Fantasy, WinZO, and PokerBaazi."
    },
    {
      "news_title": "Parliament Monsoon Session: Rajya Sabha adjourned sine die",
      "news_link": "https://www.editorji.com/india-news/parliament-monsoon-session-rajya-sabha-adjourned-sine-die-1755769836998",
      "bias": "unknown",
      "text": "Lewis Hamilton Embraces Optimism with Ferrari Debut in F1\nSalvadoran National Faces Deportation Challenges in Maryland\nIndia's Laser-Based Defence Tech Gains Global Attention\nJakarta Protests: Tear Gas Used as Students Storm Parliament\nLibyan Coast Guard Fires on Migrant Rescue Vessel in the Mediterranean\nIsraeli Strike on Gaza Hospital Kills 19, Including Journalists\nKhalid Jamil Praises Sunil Chhetri's Continued Role in Team India.\nIndonesia's Measles Vaccination Drive Amid Deadly Outbreak\nParliament Monsoon Session: Rajya Sabha adjourned sine die\nPunjab adopts AI to revolutionize rural road development\nPunjab boosts children’s future with monthly sponsorship aid\nPunjab launches auctions to recover massive excise arrears\nSC asks social media influencers to display apology on their shows for ridiculing disabled persons\n9 dead, 42 injured as truck hits tractor-trolley carrying pilgrims in UP's Bulandshahr\nSmall industries backbone of economy, key to self-reliant India: CM Mohan Yadav\nMP CM Mohan Yadav announces state-level Keer Samaj Panchayat, praises community’s role in unity\nUttarakhand CM Dhami halts convoy, listens to disaster-hit villagers in Chamoli\nUttarakhand CM Dhami assures financial aid and treatment to disaster-hit families\nAction against officers absent from UP CM Yogi's Gorakhpur review meeting\nSacrifices of Sikh Gurus continue to inspire nation: UP CM Yogi Adityanath\nShubhanshu Shukla gets hero's welcome in Lucknow after historic space mission\nFourth arrest in Noida dowry murder case; brother-in-law, father-in-law held\nISRO validates parachute-based deceleration system for Gaganyaan with IADT-01 near Sriharikota\nUP govt to celebrate Vimukt Jati Diwas, push for inclusion of denotified tribes"
    },
    {
      "news_title": "India Bans Online Money Games, Backs E-Sports in New Bill",
      "news_link": "https://thenewsfacts.com/latest-news/india-bans-online-money-games-backs-e-sports-in-new-bill/",
      "bias": "unknown",
      "text": "New Delhi, August 21, 2025 : In a landmark legislative move, India’s Parliament has passed a bill that bans online money games involving monetary stakes, significantly impacting the booming fantasy gaming and real-money gaming industry.\nThe Promotion and Regulation of Online Gaming Bill, 2025 was approved in the Rajya Sabha on Thursday through a voice vote, a day after securing clearance in the Lok Sabha. Once signed by the President, a step seen largely as procedural, the bill will become law.\nThe legislation prohibits the operation, promotion, facilitation, and advertisement of online games played for money. It also empowers authorities to block related financial transactions and enforces strict penalties for violations, including prison sentences of up to three years and fines reaching ₹1 crore.\nNo More Online Money Games: Parliament Passes Online Ban\nThe bill’s sudden passage has rattled the gaming sector, which was projected to grow to $3.6 billion by 2029, attracting billions in venture capital. Major players like Dream11, Mobile Premier League, Zupee, and Games 24X7 are now staring down the possibility of suspension or shutdown.\nDream11 alone carries a valuation of $8 billion, while MPL is valued at $2.5 billion, according to PitchBook. Backers include major investors like Tiger Global and Peak XV Partners.\nThe move has raised alarm across startups and investors, many of whom expressed concerns about job losses and halted operations.\nGovernment’s Justification\nPresenting the bill in the Rajya Sabha, IT Minister Ashwini Vaishnaw likened money gaming addiction to drug dependence, calling it a public threat.\n“The addiction to money-based online games is as harmful as narcotics. We’ve seen how this money is being channeled to fund illegal activities, even terrorism,” Vaishnaw said.\nHe also acknowledged that powerful industry stakeholders of Online Money Games may challenge the decision legally and attempt to influence public opinion through social media.\nWhat’s Banned?\nThe bill defines “online money games” as those involving deposits made in the hope of monetary returns. This includes:\n- Online fantasy sports\n- Real-money gaming (poker, rummy, and other card games)\n- Online lotteries\n- Any form of online gambling or betting (satta or jua)\nThe bill criminalizes not just gameplay but associated advertisements and transactions. Advertising these games can lead to up to 2 years in jail and/or a ₹50 lakh fine, while facilitating financial transfers for them could attract up to 3 years in jail and/or a ₹1 crore fine.\nRepeat violations carry stricter penalties, including 5-year jail terms and fines up to ₹2 crore.\nHeated Parliament Session\nThe bill passed amid high drama and protests from Opposition members, who argued that the legislation was rushed through without adequate debate.\nOpposition Leader Mallikarjun Kharge criticized the process, while Union Minister Kiren Rijiju countered that a discussion was impossible due to the continuous disruptions in the House.\nGoing forward\nThe President’s assent is awaited, but is largely considered a formality. Once enacted, the ban could come into force almost immediately, sending shockwaves through one of India’s fastest-growing digital industries.\nWhile the government maintains the move is aimed at curbing addiction and financial exploitation, the industry and its investors are bracing for potential legal battles, and a drastically altered future."
    },
    {
      "news_title": "Parliament passes Online Gaming Bill 2025, bans money games",
      "news_link": "https://nenow.in/national/parliament-passes-online-gaming-bill-2025-bans-money-games.html",
      "bias": "unknown",
      "text": "Guwahati: Parliament on Thursday passed The Promotion and Regulation of Online Gaming Bill, 2025, with the Rajya Sabha clearing it amid uproar and without debate.\nThe legislation, introduced by Electronics and IT Minister Ashwini Vaishnaw, seeks to ban all forms of online money games while encouraging eSports and social gaming.\nReady for a challenge? Click here to take our quiz and show off your knowledge!\nThe Upper House approved the bill after rejecting amendments proposed by Opposition members. The Lok Sabha had passed it a day earlier.\nThe bill also prohibits advertisements for online money games and bars banks and financial institutions from facilitating transactions related to them.\nAccording to the government, online money games—where players deposit money in the hope of winning cash or other rewards—pose risks of financial loss and addiction, necessitating regulatory control.\nReady for a challenge? Click here to take our quiz and show off your knowledge!"
    },
    {
      "news_title": "Parliament Adjourned Sine Die Amid Bihar SIR Standoff; Online Gaming Bill Passed - Clarion India",
      "news_link": "https://clarionindia.net/parliament-adjourned-sine-die-amid-bihar-sir-standoff-online-gaming-bill-passed/",
      "bias": "unknown",
      "text": null
    },
    {
      "news_title": "Rajya Sabha Adjourned Sine Die; Online Gaming Regulation Bill Passed Amid Oppn Ruckus",
      "news_link": "https://ommcomnews.com/india-news/rajya-sabha-adjourned-sine-die-online-gaming-regulation-bill-passed-amid-oppn-ruckus/",
      "bias": "unknown",
      "text": "New Delhi: In a session marked by loud protests and persistent sloganeering, the Rajya Sabha adjourned sine die on Thursday after the passage of ‘The Promotion and Regulation of Online Gaming Bill, 2025’ introduced by Union Minister Ashwini Vaishnaw.\nThe Bill, which had already cleared the Lok Sabha, was passed by voice vote despite a noisy standoff over the Special Intensive Revision (SIR) of voter lists in Bihar. The legislation seeks to establish a national framework for regulating the online gaming sector, including e-sports, educational games, and social gaming. It also imposes a strict ban on online money games involving betting or gambling, especially those operating across state borders or from foreign jurisdictions.\nThe Bill proposes the creation of a central authority to oversee policy coordination, strategic development, and regulatory enforcement in the sector.\nSpeaking in support of the Bill, Minister Vaishnaw emphasised the government’s decision to prioritise the welfare of the middle class and youth over potential revenue gains.\n“There are social evils in every era,” he said, “but under the visionary leadership of Prime Minister Modi, we have chosen to act decisively.”\nHe cited alarming figures, noting that nearly 45 crore people are affected by online money gaming, with estimated financial losses exceeding Rs 30,000 crore.\nThe World Health Organisation has classified online money gaming addiction as a psychological disorder, and the minister warned that the issue has escalated into a public health crisis, with families losing breadwinners and key members to addiction.\nThe minister also raised concerns about the misuse of online gambling platforms for terror funding and drug trafficking, calling them “safe havens” for illicit activities. “This problem has grown like the drug menace,” he said, warning that powerful interests may attempt to challenge the Bill in court or sway public opinion through social media.\n“But our Prime Minister stands firmly with the youth and middle class,” he added.\nDespite the Bill’s significance, the session was repeatedly disrupted by Opposition members demanding a discussion on the voter list revision in Bihar.\nLeader of Opposition Mallikarjun Kharge attempted to speak but was denied by the Deputy Chairman. Other members, including John Brittas and Dr R. Sivadasan, tried to raise amendments but were denied as they raised the issue of SIR; their voice drowned out by the commotion.\nBJP MP Kiren Rijiju criticised the Opposition for not engaging with the Bill’s content, questioning their commitment to public welfare.\nFollowing the passage of the Online Gaming Regulation Bill, Deputy Chairman Harivansh adjourned the Rajya Sabha for ten minutes, bringing a brief pause to a session already marred by repeated disruptions.\nWhen the House reconvened, he addressed the members with a candid reflection on the productivity and conduct of the 268th session. He noted that despite the Chair’s persistent efforts to maintain decorum, the session was plagued by disorder and resulted in a significant loss of valuable parliamentary time.\nThe House functioned for only 41 hours and 15 minutes, yielding a disappointing productivity rate of just 38.88 per cent — an outcome he described as a matter warranting serious introspection.\nThe Deputy Chairman highlighted that members had the opportunity to raise 255 starred questions, submit 285 Zero Hour notices, and make 285 Special Mentions. However, only 14 questions were actually answered, with just seven Zero Hour submissions and 61 Special Mentions taken up during proceedings.\nDespite the disruptions, the House managed to pass or return 14 government Bills, including the one regulating online gaming.\nIt also held a discussion on Operation Sindoor, launched in response to the recent terror attack in Pahalgam, and bid farewell to six retiring members.\nIn light of Vice President Jagdeep Dhankhar’s resignation on July 21, Deputy Chairman Harivansh also acknowledged the constitutional responsibility now resting on his shoulders. His remarks underscored the gravity of the moment, both in terms of legislative accountability and the constitutional transition underway. Then he adjourned the House sine die.\n(IANS)"
    },
    {
      "news_title": "Parliament Passes Online Gaming Bill: Betting Apps Face Complete Ban",
      "news_link": "https://legaldesire.com/parliament-passes-online-gaming-bill-betting-apps-face-complete-ban/",
      "bias": "unknown",
      "text": "Parliament has passed a sweeping bill that spells the end for betting apps in India. The Promotion and Regulation of Online Gaming Bill, 2025, was cleared by both houses this week amid fierce opposition protests, delivering a significant blow to the country’s booming real-money gaming sector.\nThe online gaming industry has experienced significant growth in recent years, driven by the increasing affordability of smartphones and the availability of low-cost data. The sector is currently valued at ₹316 billion (approximately $3.7 billion), with major platforms like Dream11, MPL, and Games24x7 commanding massive user bases. Real-money gaming, encompassing fantasy sports, poker, and rummy, accounts for a staggering 86% of the industry’s revenue.\nBut the new legislation takes a sledgehammer approach rather than surgical precision. Instead of establishing regulatory oversight, the bill imposes a complete ban on all real-money gaming platforms, regardless of whether they involve skill or chance. Key provisions include harsh penalties – up to three years’ imprisonment and ₹1 crore in fines for operators, and two years’ jail time plus ₹50 lakh in fines for those who advertise such platforms.\n“An estimated 45 crore people lose around ₹20,000 crore every year playing online games,” stated Union Minister Ashwini Vaishnaw, comparing gaming addiction to “drug addiction.” The government chose consumer protection over the lucrative revenue stream these platforms generate.\nHowever, the industry argues this blanket prohibition goes too far. Critics warn that the complete ban could eliminate thousands of jobs and drive users to unregulated offshore platforms, making oversight even more difficult. “This could wipe out India’s entire real-money gaming ecosystem,” industry leaders have cautioned.\nThe debate highlights the government’s struggle with a complex and rapidly evolving sector. While the bill promotes e-sports and social gaming as legitimate entertainment, it draws a hard line against any form of monetary wagering. Similar regulations in countries like the UK and Singapore offer more nuanced approaches, but India has chosen an absolute prohibition model.\nThe bill’s passage amid opposition protests – though the demonstrators focused on Bihar electoral rolls rather than gaming – signals the government’s determination to crack down on what it sees as digital gambling. The legislation’s fate was never really in doubt, but its impact on India’s tech ecosystem will be profound and immediate."
    },
    {
      "news_title": "Parliament passes Online Gaming Bill to ban all forms of money games",
      "news_link": "https://www.greaterkashmir.com/latest-news/parliament-passes-online-gaming-bill-to-ban-all-forms-of-money-games/",
      "bias": "unknown",
      "text": "New Delhi, Aug 21: Parliament on Thursday passed The Promotion and Regulation of Online Gaming Bill, 2025, with the Rajya Sabha approving it without debate amid din.\nThe bill, piloted by Minister of Electronics and IT Ashwini Vaishnaw, seeks to ban all forms of online money games while promoting eSports and online social gaming.\nIt was approved by the Upper House after rejecting amendments moved by Opposition members.\nThe bill was passed by the Lok Sabha on Wednesday.\nIt also seeks to prohibit advertisements related to online money games and bar banks and financial institutions from facilitating or transferring funds for any of such games.\nOnline money games are played by depositing money in expectation of winning monetary and other rewards."
    },
    {
      "news_title": "Parliament passes Online Gaming Bill amid protests from Opposition",
      "news_link": "https://m.economictimes.com/news/india/parliament-passes-online-gaming-bill-amid-protests-from-opposition/articleshow/123428373.cms",
      "bias": "unknown",
      "text": "The said Bill bans all online games played with money, in a bid to curb addiction, money laundering, suicides and financial fraud linked to such platforms.\nThe legislation, passed by voice vote amid opposition protests, prohibits not just the offering of online money games but also their advertisements. It further bars banks and financial institutions from facilitating or transferring funds for these activities.\nMinister of Electronics and Information Technology Ashwini Vaishnaw made brief remarks before the Bill’s passage.\nThe government has also highlighted that the Bill aims at the 'greater good' for the society. According to a PTI report, the Centre has estimated that around 45 crore people lose close to Rs 20,000 crore every year in online real money gaming. Meanwhile, the online gaming industry has warned that the proposed Bill banning all real money games could kill over two lakh jobs, shut down 400 companies, and hurt India’s digital innovation. Industry bodies said the sector, valued at ₹2 lakh crore with ₹31,000 crore revenue and ₹20,000 crore in taxes, faces a “death knell” if the law is passed.\nAlso Read: Nazara’s ₹800 crore PokerBaazi bet at risk of being written off\nS Krishnan, secretary at the Ministry of Electronics and Information Technology (MeitY), told ET that the government’s approach is to draw a line between innovation and exploitation. “The government is of the view that India has the potential to be the gaming hub of the world with many game developers and creators thriving. For this, the legitimate areas within online gaming need to be delineated, recognised and promoted; that is esports and online social games—both educational and recreational. The other real concern is online money gaming. These games involve staking money with uncertain outcomes, often blurring the line between skill and chance. They carry risks of addiction, money laundering and misuse through cryptocurrency. Regular online gaming, esports and creative gaming are not the problem; we want to encourage those.”\nHe added that the new law aims to separate harmful practices from genuine gaming innovation. “Our position is clear: we are drawing a line between promoting innovation and esports on one side and regulating exploitative money gaming on the other. The aim is to safeguard people while also strengthening India’s gaming ecosystem.”\nAlso Read: Online money gaming has become a bigger issue than drugs: Ashwini Vaishnaw\nKrishnan underlined that esports and other recognised formats will continue to receive support. “Esports, like chess and other globally recognised games, fall under the Ministry of Youth Affairs and Sports. The government has also been actively promoting the animation, visual effects, gaming and comics (AVGC) sector through initiatives like the Indian Institute of Creative Technologies in Mumbai and the Centres of Excellence under Software Technology Parks of India. These will continue. Our restrictions are aimed only at harmful money games.”\nAccording to the Bill, any online money game, where users deposit money in expectation of monetary or material reward, will now be outlawed. This includes fantasy sports, card games such as poker and rummy, online lotteries, and other betting or gambling platforms.\nOnce the law is cleared by both Houses of Parliament, offering or facilitating such games will attract imprisonment of up to three years and/or a fine of up to ₹1 crore.\n(Catch all the Business News, Breaking News, Budget 2025 Events and Latest News Updates on The Economic Times.)\nSubscribe to The Economic Times Prime and read the ET ePaper online.\n(Catch all the Business News, Breaking News, Budget 2025 Events and Latest News Updates on The Economic Times.)\nSubscribe to The Economic Times Prime and read the ET ePaper online."
    },
    {
      "news_title": "India Makes Esports Official: Gaming Bill Passes Lok Sabha, Bans Real Money Games",
      "news_link": "https://www.talkesport.com/news/india-makes-esports-official-gaming-bill-passes-lok-sabha-bans-real-money-games/",
      "bias": "unknown",
      "text": "India just drew a line in the sand for its gaming industry. The Lok Sabha passed the Promotion and Regulation of Online Gaming Bill 2025 on Wednesday, August 20, officially recognizing esports as a legitimate sport while completely banning real money gaming platforms.\nHere’s what this means: if you’re a professional gamer competing in tournaments, you’re now officially an athlete. If you’re running a fantasy sports platform or online poker site, you’re looking at up to three years in prison.\nWhat the Bill Actually Does\nThe legislation splits India’s gaming world into four clear categories: esports, educational games, social gaming, and real money gaming. The first three get government backing and promotion. The fourth gets banned entirely.\nEsports gets the royal treatment. The bill defines esports as competitive, skill-based online games that require “physical dexterity, mental agility, and strategic thinking”. These games will now fall under the Ministry of Youth Affairs and Sports, putting them in the same league as cricket and football.\nThe government plans to create training institutions, set event guidelines, run awareness programs, and coordinate with state governments to build proper infrastructure for esports athletes. Think coaching facilities, research centers, and structured tournaments with the same status as national-level sporting events.\nReal money games face complete shutdown. Any platform requiring entry fees or monetary deposits—whether skill-based or chance-based—is now illegal. This includes popular fantasy sports platforms like Dream11 and poker sites. Banks can’t process their payments, advertisements are banned, and anyone caught facilitating these platforms faces criminal penalties.\nThe Money Behind This Decision\nMinister Ashwini Vaishnaw didn’t mince words when explaining the crackdown. He called online money gaming “a menace worse than drugs” and said it has already claimed young lives. The government estimates that middle-class families have lost life savings to these platforms, with some cases ending in suicide.\nThe industry numbers tell a different story though. India’s online gaming sector was valued at over Rs 2 lakh crores, generating Rs 31,000 crores in annual revenue and Rs 20,000 crores in taxes. Growing at 20% annually, it was set to double by 2028.\nThat growth trajectory just hit a wall. The real money gaming segment—which includes fantasy sports giants like Dream11—faces complete elimination under the new law.\nWhat Happens Next\nThe bill now moves to the Rajya Sabha for final approval before becoming law. Once enacted, a National e-Sports Authority will oversee the competitive gaming sector, setting standards for tournaments, player training, and industry development.\nFor esports athletes, this recognition means potential government funding, structured career paths, and international representation opportunities. India already competed in esports at the 2018 Asian Games, where Tirth Mehta won bronze in HearthStone.\nFor real money gaming platforms, the countdown has begun. They’ll need to either pivot their business models or shut down operations entirely once the law takes effect.\nThe government clearly believes the trade-off is worth it—sacrificing a multi-billion dollar industry to protect consumers from gambling addiction while legitimizing competitive gaming as a professional sport. Whether that calculation proves correct will depend on how successfully India can build its esports infrastructure and compete globally in this rapidly growing sector."
    }
  ]
}