{
  "story_id": "GN_20250825_223101_9abfc1c1",
  "metadata": {
    "title": "Ukrainian War Veterans Complete Bosphorus Swim to Raise Prosthetic Funds",
    "timestamp": "2025-08-25T22:31:01.989205",
    "url": "https://ground.news/article/ukrainian-war-veterans-complete-bosphorus-swim-to-raise-prosthetic-funds"
  },
  "bias_distribution": {
    "total_sources": "28",
    "leaning_left": "10",
    "center": "9",
    "leaning_right": "1"
  },
  "perspective_summaries": {
    "left": [
      "Ukrainian war veteran Oleh Tserkovnyi has inspired two fellow veterans to swim across the Bosphorus Strait.",
      "The swim took place on Ukraine's Independence Day, showcasing patriotism and resilience.",
      "Photos from the swim were curated by Associated Press photo editors.",
      "The event highlights the spirit of Ukrainian veterans and their dedication to their country."
    ],
    "center": [
      "Three Ukrainian war veterans swam across the Bosphorus Strait on Ukraine's Independence Day to raise funds for prosthetics.",
      "The veterans, including two with amputations, trained for months with support from rehabilitation centers and coaches.",
      "The annual Bosphorus Intercontinental Swimming Race, organized by the Turkish Olympic Committee, included 2,800 swimmers from 81 countries."
    ],
    "right": [
      "Three Ukrainian war veterans swam across the Bosphorus Strait on Ukraine's Independence Day to raise funds for prosthetics.",
      "The veterans, including two with amputations, trained for months with support from rehabilitation centers and coaches.",
      "The annual Bosphorus Intercontinental Swimming Race, organized by the Turkish Olympic Committee, included 2,800 swimmers from 81 countries."
    ]
  },
  "sources": [
    {
      "news_title": "‘Not asking for pity’: Ukrainian war veterans find healing in the water",
      "news_link": "https://www.scmp.com/news/world/europe/article/3323029/ukrainian-war-veterans-swim-asia-europe-against-odds",
      "bias": "Center",
      "text": "Advertisement\nUkrainian war veterans swim from Asia to Europe against the odds\nAll three injured soldiers, including two amputees, completed the 6.5km crossing on Ukraine’s Independence Day\nReading Time:4 minutes\nWhy you can trust SCMP\n1\nDuring a pool training session months ago, Ukrainian war veteran Oleh Tserkovnyi was struck by an idea: what if a group of veterans swam across the strait of Bosphorus, between Turkey’s European and Asian shores? And if they did it on August 24, Ukraine’s Independence Day?\nAdvertisement\nThe symbolism of the day would draw attention to the toll and devastation inflicted by Russia’s full-out war on Ukraine, now in its fourth year.\nWhen the 34-year-old pitched the idea to fellow veterans in their One for Another support group, none raised injuries, particularly their amputations, as a barrier. Two joined him right away.\nThey trained for months, with the support of Superhumans Centre, a veterans’ rehabilitation clinic in Ukraine, and coached by CapitalTRI, an amateur triathlon team in Kyiv.\nThey agreed their race would have another goal – to raise money for prosthetics, which remain costly and urgently needed by many of Ukraine’s wounded.\n“We’re not asking for pity,” Tserkovnyi said shortly before the competition. “We’re asking for support.”\nAdvertisement\nSelect Voice\nChoose your listening speed\nGet through articles 2x faster\n1.25x\n250 WPM\nSlow\nAverage\nFast\n1.25x"
    },
    {
      "news_title": "Ukrainian war veterans swim the Bosphorus strait in a triumph over their war injuries",
      "news_link": "https://apnews.com/article/ukraine-russia-turkey-war-veterans-amputee-swimmers-dfa08161b61554109dfd9b478732dc3e",
      "bias": "Lean Left",
      "text": "Ukrainian war veterans swim the Bosphorus strait in a triumph over their war injuries\nISTANBUL (AP) — During a pool training session months ago, Ukrainian war veteran Oleh Tserkovnyi was struck by an idea: What if a group of veterans swam across the strait of Bosphorus, between Turkey’s European and Asian shores? And if they did it on Aug. 24, Ukraine’s Independence Day?\nThe symbolism of the day would draw attention to the toll and devastation inflicted by Russia’s full-out war on Ukraine, now in its fourth year.\nWhen the 34-year-old pitched the idea to fellow veterans in their One for Another support group, none raised injuries, particularly their amputations, as a barrier. Two joined him right away.\nThey trained for months, with the support of Superhumans Center, a veterans’ rehabilitation clinic in Ukraine, and coached by CapitalTRI, an amateur triathlon team in Kyiv. They agreed their race would have another goal — to raise money for prosthetics, which remain costly and urgently needed by many of Ukraine’s wounded.\n“We’re not asking for pity,” Tserkovnyi told The Associated Press shortly before the competition. “We’re asking for support.”\nA race that links continents\nAfter months of rigorous training, discipline and physical challenges, the three Ukrainian veterans on Sunday joined more than 2,800 swimmers from 81 countries in the 6.5-kilometer (4-mile) crossing from Asia to Europe.\nThe Bosphorus Intercontinental Swimming Race is an open-water event held each year in Istanbul, organized by the Turkish Olympic Committee since 1989.\nAll three Ukrainians completed the crossing, each swimming for more than an hour. The two veterans with amputations faced setbacks even before the start — the organizers initially barred them from competing, insisting they have to be in a separate category for people with disabilities.\nBut they persevered and swam the race, alongside the others.\nFor the Ukrainians, it wasn’t just about endurance but about reclaiming control over bodies transformed by war — and sharing their recovery with a world that often seems indifferent to the injuries they carry.\nSeeking balance in the water\nSports had always been a part of Tserkovnyi’s life, but war and injury pushed him to use it as a survival tool after two severe, life-changing concussions — a bridge back to life for war veterans with disabilities.\n“Sport itself heals — we’ve seen that firsthand,” he said. “And the community, it pulls you through. It pushes you, it disciplines you.”\nWhen he speaks, he’s quick to point out the changes he sees in himself — the stutter, the involuntary twitch in his eye.\n“It’s what’s left over. It used to be much worse,” he said.\nBoth of his concussions were the result of prolonged exposure to artillery fire while serving on the front line. He was a sniper when the second one hit. Afterward, he said, it felt like he had lost his sense of balance entirely.\n“There were times I could walk, but then suddenly I’d just tip over like a pencil,” Tserkovnyi said. “I have third-degree hearing loss on one side, no peripheral vision.”\nThe sense of being “a sick person,” he said, felt so foreign to him that he threw himself into recovery with everything he had. For a long time, he also had PTSD symptoms, including dramatic flashbacks to the war.\nBut it was in the pool that he found a way to recognize the warning signs. “I began to understand what triggers them, when they come, and how to stay ahead of them,” he said.\nA path back to oneself\nEngineer Pavlo Tovstyk signed up as a volunteer in the early days after Russia’s full-scale invasion of Ukraine in February 2022. Serving as a driver in an intelligence unit, he stepped on a landmine in June 2023.\nThe blast took his foot and subsequent surgeries led to a partial amputation of his left leg.\nThe 47-year-old, who used to be an active swimmer as a child, never thought swimming would become a lifeline. He was still recovering from his injury when he began sneaking into the swimming pool, keeping it a secret from the doctors.\n“Water became a kind of savior for me,” he said. “At the time, everything felt disoriented. But in the water, my thoughts, my strength, my body — it all came together again. I became myself again. Just ... different.”\nThe idea to swim the strait in Turkey started almost as a dare, then became a plan.\n“To cross the Bosphorus, you need not just physical strength, but a certain mindset — a state of determination that all of us managed to find within ourselves,” he said.\nCalm found in purpose\nOleksandr Dashko discovered swimming only after losing his left leg.\nThe 28-year-old had joined the military at the start of the Russian invasion and served in the infantry in various front-line areas.\nIn June 2023, a mine exploded near him and shrapnel tore into his knee.\n“I didn’t take it very graciously, let’s say,” he said as he recounted the conflicted feelings that tormented him for so long. Adjustment to life with an amputation has been slow and mentally taxing.\nIt was only over the past year that he was able to focus on physical rehabilitation — and swimming, he said, has become the activity that brings him a sense of calm.\nThe challenge of swimming the Bosphorus became a purpose for Dashko.\n“When I do nothing, I slip back to that state right after the injury — depression, apathy, the feeling that the amputation is winning,” he said. “But when something like this shows up on my path, it gives me a jolt — to live, to move forward, to motivate others.”\nPhysical goals, he said, help anchor him. He hopes for more such challenges, not just for himself, but for other veterans.\n“Honestly, if it weren’t for this, I’d probably be drunk and lying under a fence somewhere,” he said.\n___\nArhirova reported from Kyiv, Ukraine."
    }
  ]
}