{
  "story_id": "GN_20250825_215051_9e3f2934",
  "metadata": {
    "title": "Former President Joseph Kabila Faces Death Penalty for War Crimes",
    "timestamp": "2025-08-25T21:50:51.943619",
    "url": "https://ground.news/article/former-president-joseph-kabila-faces-death-penalty-for-war-crimes_9809ea"
  },
  "bias_distribution": {
    "total_sources": "70",
    "leaning_left": "11",
    "center": "18",
    "leaning_right": "8"
  },
  "perspective_summaries": {
    "left": [
      "A military prosecutor in the Democratic Republic of the Congo is seeking the death penalty for former President Joseph Kabila for treason and war crimes, including support for M23 rebels, as stated by General Lucien Rene Likulia.",
      "Joseph Kabila has been accused of supporting the Rwanda-backed M23 rebels that have seized cities in eastern DRC this year, according to the charge sheet seen by the AFP news agency.",
      "The DRC lifted a moratorium on the death penalty last year; however, no judicial executions have occurred since, as noted in the reported court proceedings.",
      "Kabila has denounced the trial as politically motivated, claiming that it is an act of oppression against him, and his supporters believe the charges are part of a campaign against him, according to Ferdinand Kambere."
    ],
    "center": [
      "On Friday, General Lucien Rene Likulia requested the death penalty for former President Joseph Kabila, who has been tried in absentia since July on war crimes, murder, and rape charges.",
      "Following a May vote to lift immunity, officials allege Joseph Kabila supported Rwanda-backed M23 rebels whose offensives seized major eastern cities earlier this year.",
      "The charge sheet describes the forcible occupation of Goma and atrocities in North and South Kivu provinces, while prosecutors also sought 20-year and 15-year prison terms alongside the death penalty for Joseph Kabila on Friday.",
      "Kabila's allies argue the government moved to ban the PPRD and seized Joseph Kabila's assets, with supporters calling the case politically motivated and Kabila denouncing the courts as `an instrument of oppression`.",
      "UN experts report Rwanda's army played a `critical` role in the M23 offensive, while the DRC lifted a death penalty moratorium last year without carrying out executions since."
    ],
    "right": [
      "Joseph Kabila, former President of the Democratic Republic of Congo, is facing the death penalty for war crimes, including homicide and torture, according to General Lucien Rene Likulia in a military court.",
      "Kabila, who has been abroad since late 2023, is wanted for his alleged involvement in civilian massacres and is accused of plotting to overthrow President Felix Tshisekedi.",
      "The military court's recommendation follows the senator's vote to lift Kabila's immunity in May, and Kabila's political party was banned by Congo's government shortly after his announced return in April.",
      "Kabila has criticized the trial, calling the courts an 'instrument of oppression,' while his political party's secretary described the government's actions as 'relentlessness and persecution."
    ]
  },
  "sources": [
    {
      "news_title": "Military auditor in DRC seeks death penalty for former president Kabila",
      "news_link": "https://www.timeslive.co.za/news/africa/2025-08-25-military-auditor-in-drc-seeks-death-penalty-for-former-president-kabila/",
      "bias": "Lean Right",
      "text": "The Democratic Republic of Congo's (DRC) military auditor-general formally told a military court on Friday he is seeking the death penalty for former President Joseph Kabila, who is being tried in absentia for war crimes including homicide, rape and torture.\nKabila spent almost two decades in power before stepping down in 2018. He has been abroad since late 2023, mostly in South Africa. He was last seen in public in rebel-held territory in DRC's volatile east.\nHe is wanted in DRC for alleged crimes against humanity including a role in the massacre of civilians. The military's auditor-general, Gen Likulia Lucien Rene, told the high court he is seeking the death penalty for homicide, rape, deportation and torture, among other crimes.\nKabila announced that he was returning to DRC to help push for peace in the war-ravaged east in April. DRC's government swiftly moved to ban his political party later that month, and seize his assets.\nMilitary auditor in DRC seeks death penalty for former president Kabila\nImage: REUTERS/Arlette Bashizi\nThe Democratic Republic of Congo's (DRC) military auditor-general formally told a military court on Friday he is seeking the death penalty for former President Joseph Kabila, who is being tried in absentia for war crimes including homicide, rape and torture.\nKabila spent almost two decades in power before stepping down in 2018. He has been abroad since late 2023, mostly in South Africa. He was last seen in public in rebel-held territory in DRC's volatile east.\nHe is wanted in DRC for alleged crimes against humanity including a role in the massacre of civilians. The military's auditor-general, Gen Likulia Lucien Rene, told the high court he is seeking the death penalty for homicide, rape, deportation and torture, among other crimes.\nKabila announced that he was returning to DRC to help push for peace in the war-ravaged east in April. DRC's government swiftly moved to ban his political party later that month, and seize his assets.\nIn May DRC's senate voted to lift Kabila's immunity from prosecution.\nKabila made an appearance in the rebel-held east in late May, meeting with religious leaders.\nDRC's long-running crisis in the east erupted this year when Rwanda-backed M23 rebels seized swaths of mineral-rich eastern territory in January.\n\"It is an act of relentlessness and persecution against a member of the opposition,\" Ferdinand Kambere, Kabila's political party secretary, told Reuters on Friday.\nReuters\nREAD MORE:\nRwanda rejects accusations allied M23 rebels in DRC massacred civilians\nDRC and M23 rebels miss deadline to reach Doha peace deal\nDRC ex-president Kabila makes first public appearance in rebel-held Goma\nEx-president Kabila calls DRC justice system 'instrument of oppression'\nDRC ex-prime minister convicted of embezzlement in failed farm project\nWould you like to comment on this article?\nSign up (it's quick and free) or sign in now.\nPlease read our Comment Policy before commenting.\nNews and promos in your inbox\nsubscribeMost read\nLatest Videos"
    },
    {
      "news_title": "Congo prosecutor seeks death penalty for former President Joseph Kabila",
      "news_link": "https://www.africanews.com/2025/08/23/congo-prosecutor-seeks-death-penalty-for-former-president-joseph-kabila/",
      "bias": "Lean Left",
      "text": "Democratic Republic Of Congo\nOn Friday, the country’s public prosecutor called for the death penalty for former President Joseph Kabila, who is being tried in absentia for treason, war crimes, and supporting the M23 rebel group.\nKabila, who ruled from 2001 to 2019, took power at just 29 after the assassination of his father, former President Laurent Kabila. He later delayed elections for two years past his term, sparking widespread unrest.\nThe government accuses him of backing Rwanda-supported M23 rebels, who in recent months have captured major cities in eastern Congo. Kabila returned from self-imposed exile in April, arriving in Goma, a city under rebel control, raising even more questions about his ties to the insurgency. His current whereabouts remain unknown.\nIn court, Gen. Lucien René Likulia, representing the prosecution, also requested a 20-year sentence for Kabila’s alleged condoning of war crimes and 15 years for conspiracy, though no further details were provided.\nKabila’s immunity as a senator for life was revoked in May. His allies call the trial politically motivated. Ferdinand Kambere, a former minister under Kabila, called the move “a disgrace for the Republic.” Meanwhile, security analyst Henry-Pacifique Mayala said the prosecution’s case appears more like a “settling of scores” than a genuine pursuit of justice.\nA verdict date has not been set.\n01:04\nWrongly deported Kilmar Abrego Garcia told he may be sent to Uganda\n01:11\nEswatini government faces court challenge over US deportees\n01:12\nUK compensates Kenyans affected in 2021 military fire\n01:05\nGuinea’s junta suspends three main political parties\n01:02\nStalled peace talks in Doha as Congo and M23 remain deadlocked\n01:13\nFrench judges dismiss genocide case against Habyarimana's widow"
    },
    {
      "news_title": "Military court seeks death penalty against former DR Congo President Joseph Kabila",
      "news_link": "https://www.aa.com.tr/en/africa/military-court-seeks-death-penalty-against-former-dr-congo-president-joseph-kabila/3666914",
      "bias": "Right",
      "text": "Military court seeks death penalty against former DR Congo President Joseph Kabila\nTrial taking place amid heightened political tension with Kabila's political party denouncing 'set-up'\nKINSHASA, Democratic Republic of Congo\nThe public prosecutor sought the death penalty Friday against former Democratic Republic of Congo (DRC) President Joseph Kabila, who is on trial in absentia.\nMilitary auditor general, Liet. Gen. Likulia Bakumi Lucien-Rene, underscored a range of crimes, including the killing of civilians, rapes, summary executions, forced deportations and cruel destructions allegedly committed in occupied areas by the Alliance Fleuve Congo (AFC), or Congo River Alliance, a rebel coalition in eastern Congo that includes the M23.\nLucien-Rene argued before the High Military Court that he established a link between the rebel movement and Kabila, noting that the defendant described rebel acts as “the aspirations of the people,” highlighting the return of fighting to the east occupied by rebels, and welcomed the fighter to galvanize troops.\nThe prosecution contended that all elements of the offenses converged in the defendant, labeling Kabila, who left the DRC two years ago, as the “intellectual author” of the crimes.\nKibla is also accused of plotting to overthrow President Felix Tshisekedi.\nThe prosecution sought the death penalty for all of the charges, except for “praising terrorist acts” and conspiracy, for which it requested 20 and 15 years, respectively, It also requested a sequestration of assets, costs, bodily constraint and immediate detention.\nKabila’s supporters have said the case targets a political rival, describing the charges as a “political persecution” to sideline a powerful figure.\nKabila's party, the People’s Party for Reconstruction and Democracy (PPRD), decried the move as a “set-up” to sideline a major opposition figure."
    },
    {
      "news_title": "Congo’s prosecutor asks for the death penalty for former president",
      "news_link": "https://www.cp24.com/news/world/2025/08/22/congos-prosecutor-asks-for-the-death-penalty-for-former-president/",
      "bias": "Center",
      "text": "GOMA, Congo — Congo’s public prosecutor on Friday asked for the death penalty for former President Joseph Kabila, who is being tried in absentia in a treason case that includes war crimes charges related to his nearly 20-year rule of the West African nation.\nKabila, who led Congo from 2001 to 2019, has been on trial since July, charged with war crimes, murder and rape. He took office at the age of 29 — after his father and former President Laurent Kabila was assassinated — and extended his mandate by delaying elections for two years after his term ended in 2017. in 2001.\nHe is also accused by the Congolese government of supporting the Rwanda-backed M23 rebels who have seized major cities and towns in the country’s east in the past months.\nKabila had been in self-imposed exile since 2023 until April, when he arrived in the rebel-held city of Goma following its seizure in a rapid rebel offensive.\nHis supporters say the trial is politically motivated. Kabila’s presidential immunity was revoked in May, which analysts at the time viewed as a step towards an eventual prosecution. His current whereabouts are unknown.\nIn court on Friday, Gen. Lucien René Likulia representing the prosecution also asked, in addition to the death penalty, for a 20-year-sentence for Kabila’s alleged apologetic behavior for war crimes and 15 years for conspiracy. The general did not elaborate on those charges or say what they refer to.\nNo date has been set for the sentencing.\nCongolese President Felix Tshisekedi last year accused Kabila of backing the rebels and “preparing an insurrection” with them, a claim Kabila denies.\nFerdinand Kambere, a former minister under Kabila and current head of his party, the PPRD, said revoking Kabila’s immunity as senator-for-life was the start of the campaign against him.\n“What we saw was truly a disgrace for the Republic,” Kambere told The Associated Press over the phone.\nHenry-Pacifique Mayala, a researcher and coordinator of the Kivu Security Tracker, told the AP that the prosecution’s demands seem to be “more of a settling of scores session than a quest for truth.”\nJustin Kabumba, The Associated Press"
    },
    {
      "news_title": "DRC prosecutor seeks death penalty for former leader Joseph Kabila",
      "news_link": "https://www.aljazeera.com/news/2025/8/22/drc-prosecutor-seeks-death-penalty-for-former-leader-joseph-kabila",
      "bias": "Lean Left",
      "text": "DRC prosecutor seeks death penalty for former leader Joseph Kabila\nCongolese military auditor general asks court to condemn Kabila to death for war crimes including homicide and torture.\nA military prosecutor in the Democratic Republic of the Congo (DRC) is demanding the death penalty for former President Joseph Kabila who is on trial in absentia.\nGeneral Lucien Rene Likulia, the Congolese military auditor general, on Friday called on judges to condemn Kabila to death for treason and war crimes, including homicide, torture and organising an insurrection, the court heard.\nRecommended Stories\nlist of 3 itemsDRC’s ex-president Kabila slams justice system after losing immunity\nDRC and Rwanda to strike Trump-brokered peace deal: All to know\nThe former president went on trial in his absence in July for his alleged support for Rwanda-backed M23 rebels, who have seized large swaths of mineral-rich eastern DRC this year.\nKabila, who has been outside the DRC for two years, is also accused of having plotted to overthrow President Felix Tshisekedi and other war crimes charges linked to the M23 group.\nThe charge sheet against him, seen by the AFP news agency, also listed the “forcible occupation of the city of Goma”, which was captured by M23 fighters in January before they agreed a ceasefire with the government in July.\nKabila has denounced the trial, calling the courts “an instrument of oppression”.\nFerdinand Kambere, Kabila’s political party secretary, told the Reuters news agency on Friday that “it is an act of relentlessness and persecution against a member of the opposition.”\nThe DRC lifted a moratorium on the death penalty last year, but no judicial executions have been carried out since.\nThe brains behind M23?\nKabila spent almost two decades in power before stepping down in 2018. He has been abroad since late 2023, mostly in South Africa.\nHe announced that he was returning to the DRC to help push for peace in the war-ravaged east in April. The DRC’s government swiftly moved to ban his political party later that month, and seized his assets.\nIn May, the DRC’s senate voted to lift his immunity from prosecution.\nKabila made an appearance in the rebel-held east in late May, meeting local religious leaders in the presence of M23’s spokesperson Lawrence Kanyuka.\nTshisekedi, his successor as president, has branded him the brains behind the armed group, which has seized cities in the resource-rich east, reportedly with Rwanda’s help.\nThe charge sheet described Kabila as “one of the initiators of the Congo River Alliance” (AFC), M23’s political arm, and accuses him of having colluded with Rwanda to try to “overthrow by force the power established by law”.\nIt also accused Kabila of being responsible for atrocities committed by the movement in North and South Kivu provinces.\nRwanda has denied providing military backing to M23, but United Nations experts say its army played a “critical” role in the group’s offensive in the region.\nThe AFC and M23’s executive secretary, Benjamin Mbonimpa, distanced the movement from Kabila in comments to journalists in Goma in July, dismissing his trial as part of a “malevolent strategy” against him.\nKabila ruled the DRC between 2001 and 2009, taking power following his father Laurent Kabila’s assassination.\nAlthough he left the country in 2023, the former leader still has influence over Congolese political life. He has criticised Tshisekedi’s government as a “dictatorship”.\nFor more than three decades, eastern DRC has been ravaged by conflict between various armed groups. The unrest has intensified since M23’s resurgence in 2021."
    },
    {
      "news_title": "Congo's prosecutor asks for the death penalty for former President Kabila for war crimes",
      "news_link": "https://apnews.com/article/congo-kabila-death-penalty-724519240ecb76b3114623d3283941d4",
      "bias": "Lean Left",
      "text": "Congo’s prosecutor asks for the death penalty for former President Kabila for war crimes\nGOMA, Congo (AP) — Congo’s public prosecutor on Friday asked for the death penalty for former President Joseph Kabila, who is being tried in absentia in a treason case that includes war crimes charges related to his ties to the M23 rebel group.\nKabila, who led Congo from 2001 to 2019, has been on trial since July, charged with war crimes, murder and rape. He took office at the age of 29 — after his father and former President Laurent Kabila was assassinated — and extended his mandate by delaying elections for two years after his term ended in 2017.\nHe is accused by the Congolese government of supporting the Rwanda-backed M23 rebels who have seized major cities and towns in the country’s east in the past months.\nKabila had been in self-imposed exile since 2023 until April, when he arrived in the rebel-held city of Goma following its seizure in a rapid rebel offensive.\nHis supporters say the trial is politically motivated. Kabila’s presidential immunity was revoked in May. His current location is unknown.\nIn court on Friday, Gen. Lucien René Likulia representing the prosecution, also asked, in addition to the death penalty, for a 20-year-sentence for Kabila’s alleged condoning of war crimes and 15 years for conspiracy. The general did not elaborate on those charges or say what they referred to.\nNo date has yet been set for the announcement of the verdict.\nCongolese President Felix Tshisekedi last year accused Kabila of backing the rebels and “preparing an insurrection” with them, a claim Kabila denies.\nFerdinand Kambere, a former minister under Kabila and current head of his party, the PPRD, said revoking Kabila’s immunity as senator-for-life was the start of the campaign against him.\n“What we saw was truly a disgrace for the Republic,” Kambere told The Associated Press by phone.\nHenry-Pacifique Mayala, a researcher and coordinator of the Kivu Security Tracker, told the AP that the prosecution’s demands seem to be “more of a settling of scores session than a quest for truth.”\n___\nThis story has been corrected to say that Kabila is being tried for war crimes related to his ties to the M23 group, not for crimes committed while he was president. Also clarifies that he has not been convicted yet and no date has been set for the verdict, rather than the sentencing."
    },
    {
      "news_title": "Military auditor in Congo seeks death penalty for former president Kabila",
      "news_link": "https://www.straitstimes.com/world/military-auditor-in-congo-seeks-death-penalty-for-former-president-kabila",
      "bias": "Lean Right",
      "text": "Military auditor in Congo seeks death penalty for former president Kabila\nSign up now: Get ST's newsletters delivered to your inbox\nFollow topic:\nCongo's military auditor general formally told a military court on Friday that he is seeking the death penalty for former President Joseph Kabila, who is being tried in absentia for war crimes including homicide, rape and torture.\nKabila spent almost two decades in power before stepping down in 2018. He has been abroad since late 2023, mostly in South Africa. He was last seen in public in rebel-held territory in Congo's volatile east.\nHe is wanted in Congo for alleged crimes against humanity including a role in the massacre of civilians.\nThe military's auditor general, General Likulia Lucien Rene, told the high court that he was seeking the death penalty for homicide, rape, deportation and torture, among other crimes.\nKabila announced that he was returning to Congo to help push for peace in the war-ravaged east in April. Congo's government swiftly moved to ban his political party later that month, and seize his assets.\nIn May, Congo's senate voted to lift Kabila's immunity from prosecution.\nKabila made an appearance in the rebel-held east in late May, meeting with religious leaders.\nCongo's long-running crisis in the east erupted this year when Rwanda-backed M23 rebels seized swaths of mineral-rich eastern territory in January.\n\"It is an act of relentlessness and persecution against a member of the opposition,\" Ferdinand Kambere, Kabila's political party secretary, told Reuters on Friday. REUTERS"
    },
    {
      "news_title": "Former President Joseph Kabila Faces Death Penalty for War Crimes",
      "news_link": "https://www.devdiscourse.com/article/law-order/3591196-former-president-joseph-kabila-faces-death-penalty-for-war-crimes",
      "bias": "Center",
      "text": "Former President Joseph Kabila Faces Death Penalty for War Crimes\nFormer Congo President Joseph Kabila is being tried in absentia for war crimes, including homicide, rape, and torture, with the military seeking the death penalty. Kabila, away since 2023, aimed to return for peace efforts in Congo's east, but his political party was banned, and assets seized.\nIn a crucial move, Congo's military auditor general announced on Friday that he is seeking the death penalty for former President Joseph Kabila. The ex-leader faces trial in absentia for an array of war crimes, including homicide, rape, and torture.\nKabila, who ruled for nearly twenty years, stepped down in 2018 and has been predominantly residing in South Africa. Reports indicate that he last appeared publicly in eastern Congo's rebel strongholds, raising questions about his involvement in regional conflicts.\nThis legal pursuit follows a tense April when Kabila declared his intent to return to help stabilize the tumultuous east. However, the Congolese government reacted swiftly, banning his political party and seizing his assets, amidst continued allegations of crimes against humanity linked to him during the conflict.\n(With inputs from agencies.)\nALSO READ\nCharges Filed in Shocking Campus Crime: Law Student Gang-Rape Case\nThe Fall of a Torturer: Michael Sang Correa Sentenced to Prison\nIndian-Origin Trucker Charged with Vehicular Homicide in Tragic Florida Crash\nProminent Figure Arrested in High-Profile Rape Case\nSwift Justice: Life Sentence in Rampur Rape Case"
    },
    {
      "news_title": "DR Congo military prosecutor demands death sentence for former President Kabila amid treason trial",
      "news_link": "https://www.firstpost.com/world/dr-congo-treason-kabila-death-penalty-13927265.html",
      "bias": "Lean Right",
      "text": "On Friday, a military prosecutor recommended the death penalty for former DR Congo President Joseph Kabila, who is being tried in absentia on treason allegations.\nGeneral Lucien Rene Likulia urged the judges to sentence Kabila to death for war crimes, treason, and inciting an insurgency, the court heard.\nIn July, the former president was tried in absentia for allegedly supporting Rwandan terrorists M23.\nKabila, who has been out of the DRC for two years, is also accused of plotting to depose President Felix Tshisekedi, as well as counts of homicide, torture, and rape related to the M23 movement.\nThe charge sheet against him also listed the “forcible occupation of the city of Goma”, captured by M23 fighters in January before they agreed a permanent ceasefire with the government in July.\nKabila arrived in the eastern city in May, meeting local religious leaders in the presence of the M23’s spokesman Lawrence Kanyuka.\nTshisekedi, his successor as president, has branded him the brains behind the armed group, which has seized swathes of the resource-rich Congolese east with Rwanda’s help.\nKabila has denounced the trial, calling the courts “an instrument of oppression”.\nThe DRC lifted a moratorium on the death penalty last year but no judicial executions have been carried out since.\nEnduring influence\nThe charge sheet seen by AFP described him as “one of the initiators of the Congo River Alliance” (AFC), the M23’s political arm and accuses him of having colluded with Rwanda to try to “overthrow by force the power established by law”.\nImpact Shorts\nView AllIt also accused Kabila of being responsible for atrocities committed by the movement in the North and South Kivu provinces in the mineral-rich east.\nRwanda denies providing military backing to the M23 but UN experts say its army played a “critical” role in the group’s offensive in the region.\nThe AFC and M23’s executive secretary Benjamin Mbonimpa distanced the movement from Kabila in comments to journalists in Goma in July, dismissing his trial as part of a “malevolent strategy” against him.\nKabila ruled the country between 2001 and 2009, taking power following his father Laurent Kabila’s assassination.\nAlthough he left the DRC in 2023, the former leader still has influence over Congolese political life. He has criticised Tshisekedi’s government as a “dictatorship”.\nFor more than three decades, the eastern DRC has been ravaged by conflict between various armed groups.\nThe unrest has intensified since the M23’s resurgence in 2021."
    },
    {
      "news_title": "Prosecutors seek death penalty for Kabila on charges including treason",
      "news_link": "https://rwandadispatch.com/prosecutors-seek-death-penalty-for-kabila-on-charges-including-treason/",
      "bias": "unknown",
      "text": "Former President of the Democratic Republic of Congo (DRC), Joseph Kabila is facing the death penalty after military prosecutors requested the maximum sentence against him on charges including treason and collaboration with the rebel movement AFC/M23.\nKabila, 54, who ruled the DRC for 18 years beginning in 2001, is accused of war crimes, violent crimes committed by M23 rebels, and plotting to overthrow the government.\nAt a hearing held in the capital Kinshasa on Friday, prosecutors also called for the seizure of all his assets.\nKabila, who did not appear in court, has not made any public statement in response to the death penalty request.\nIn May, parliament in Kinshasa stripped Kabila of the immunity he previously enjoyed as a former DRC head of state. He did not attend the proceedings to defend himself at the time.\nLater that month, the former DRC president launched a scathing attack on his successor Félix Tshisekedi, branding his government “dictatorial” and accusing the judiciary of being “openly used for political reasons.”\nKabila was last seen in public on 30 May in Goma, in eastern DRC, attending a meeting with traditional leaders in an area controlled by M23 rebels.\nAccording to UN-backed broadcaster Radio Okapi, military prosecutor Lucien René Likulia urged the military high court to also impose additional penalties on Kabila, including:\n20 years in prison for supporting war crimes;\n15 years in prison for attempting to overthrow the government;\nhis immediate arrest;\npayment of legal fees.\nPreviously, prosecutors had demanded that Kabila pay $24 billion in damages to the Congolese state.\nFerdinand Kambere, permanent secretary of Kabila’s banned PPRD party, dismissed the case as “a relentless campaign to persecute an opposition figure.”\nThe trial began late last month and the military high court is expected to issue its ruling no later than 1 September 2025."
    },
    {
      "news_title": "Former DRC President Joseph Kabila Faces Death Penalty in Treason Trial",
      "news_link": "https://sunrise.ug/africa/202508/former-drc-president-joseph-kabila-faces-death-penalty-in-treason-trial.html",
      "bias": "unknown",
      "text": "Africa\nFormer DRC President Joseph Kabila Faces Death Penalty in Treason Trial\nIn a dramatic turn of events, the Democratic Republic of Congo’s public prosecutor has called for the death penalty for former President Joseph Kabila, who is being tried in absentia for treason, war crimes, and alleged support for the M23 rebel group.\nKabila, who ruled the DRC from 2001 to 2019, assumed power at just 29 following the assassination of his father, former President Laurent Kabila. His presidency was later marred by controversy, including a two-year delay of national elections beyond his term, which triggered widespread unrest across the country.\nThe government alleges that Kabila provided backing to the Rwanda-supported M23 rebels, who in recent months have seized major cities in eastern Congo. Kabila returned from self-imposed exile in April, making a high-profile arrival in Goma—a city under rebel control—further fueling speculation about his connections to the insurgency. His current whereabouts remain unknown.\nDuring Friday’s court proceedings, Gen. Lucien René Likulia, representing the prosecution, requested a 20-year prison sentence for Kabila’s alleged condoning of war crimes, and 15 years for conspiracy, in addition to the death penalty for treason. The prosecution did not provide additional details regarding these charges.\nKabila’s immunity as a senator for life was revoked in May, paving the way for his trial. Supporters of the former leader have decried the legal proceedings as politically motivated. Ferdinand Kambere, a former minister under Kabila, described the trial as “a disgrace for the Republic,” while security analyst Henry-Pacifique Mayala said the prosecution’s case “appears more like a settling of scores than a genuine pursuit of justice.”\nA verdict date has not yet been set, leaving the nation in anticipation over what could be one of the most consequential trials in recent Congolese history."
    },
    {
      "news_title": "Prosecutor seeks death penalty for former President Kabila in treason trial - Kahawatungu",
      "news_link": "https://kahawatungu.com/prosecutor-seeks-death-penalty-for-former-president-kabila-in-treason-trial/",
      "bias": "unknown",
      "text": "A military prosecutor on Friday demanded the death penalty for DR Congo’s former president Joseph Kabila who is on trial in absentia on treason charges.\nKabila’s party called the proceedings “a political trial”.\nGeneral Lucien Rene Likulia called on judges to condemn Kabila to death for war crimes, treason and organising an insurrection.\nThe former president, 53, went on trial in his absence in July for his alleged support for Rwanda-backed M23 militants. Kabila, who has been outside the DRC for two years, is accused of plotting to overthrow President Felix Tshisekedi and charges including homicide, torture and rape linked to the M23 group.\nThe violence committed by the M23 in the east of the country had caused “immense prejudice” to the country, for which Kabila had criminal responsibility, Likulia argued.\nKabila, in coordination with Rwanda, had been trying to carry out a coup against Tshisekedi, said Likulia.\n“The accused planned to overthrow by armed force the constitutional regime in place,” he argued, notably with the help of Corneille Nangaa.\nNangaa was the president of the Congolese electoral commission during the 2018 presidential election won by Tshisekedi.\nHe subsequently went on the run and in December 2023 announced the creation of the Congo River Alliance (AFC), a political-military movement of rebel groups including the M23.\nThe charge sheet describes Kabila as “one of the initiators” of the AFC.\nFerdinand Kambere, deputy general secretary of Kabila’s People’s Party for Reconstruction and Democracy (PPRD), denounced the prosecution.\n“It’s a political trial, the regime is trying to hide its diplomatic and military failures,” he told AFP.\nThe prosecution demands amounted to the persecution of an opposition figure, he argued, adding that current conditions “do not guarantee a fair trial”.\nKabila has already denounced the trial, calling the courts “an instrument of oppression”.\nThe indictment also accuses Kabila of responsibility for atrocities committed by M23 in North and South Kivu provinces in the mineral-rich east.\nIt lists the “forcible occupation of the city of Goma”, captured by M23 fighters in January before they agreed a ceasefire with the government in July.\nKabila went to Goma in May, meeting local religious leaders in the presence of M23 spokesman Lawrence Kanyuka.\nTshisekedi, his successor as president, has branded Kabila the brains behind the armed group, which has seized swathes of the resource-rich Congolese east with Rwanda’s help.\nRwanda denies providing military backing to the M23 but UN experts say its army played a “critical” role in the group’s offensive.\nThe AFC and M23’s executive secretary Benjamin Mbonimpa distanced the movement from Kabila in comments to journalists in Goma in July.\nKabila ruled the country between 2001 and 2009, taking power following the assassination of his father Laurent Kabila.\nAlthough he left the DRC in 2023, the former leader still has influence over Congolese political life. He has called Tshisekedi’s government a “dictatorship”.\nThe DRC lifted a moratorium on the death penalty last year but no judicial executions have been carried out since.\nFor more than three decades, the eastern DRC has been ravaged by conflict between various armed groups.\nThe unrest has intensified since the M23’s resurgence in 2021.\nBy Agencies\nEmail your news TIPS to Editor@Kahawatungu.com — this is our only official communication channel"
    },
    {
      "news_title": "Congo prosecutor seeks death penalty for Joseph Kabila",
      "news_link": "https://thesudantimes.com/africa/congo-prosecutor-seeks-death-penalty-for-joseph-kabila/",
      "bias": "unknown",
      "text": "Congo’s public prosecutor has demanded the death penalty for former President Joseph Kabila, who faces treason and war crimes charges. Kabila, who ruled the Democratic Republic of Congo from 2001 until 2019, is being tried in absentia on accusations of murder and rape.\nHe assumed power at 29 after the assassination of his father, Laurent Kabila, but later extended his mandate by delaying elections beyond 2017. Prosecutors allege Kabila supported Rwanda-backed M23 rebels, whose recent offensives captured major cities in eastern Congo, intensifying instability across the region.\nKabila returned briefly from exile in April, appearing in Goma after the city’s dramatic fall to rebels, but his current whereabouts remain uncertain. On Friday, Gen. Lucien René Likulia requested not only the death penalty but also lengthy prison terms for alleged conspiracy and complicity.\nThe general cited “apologetic behavior for war crimes,” though the court offered no clarity on the specific charges underlying these demands. Analysts warn the trial reflects political rivalries rather than impartial justice, especially after Kabila’s presidential immunity was revoked earlier this year.\nSupporters insist the proceedings are orchestrated by President Felix Tshisekedi, who last year accused Kabila of plotting insurrection with rebel groups. Ferdinand Kambere, a close ally and former minister, condemned the case as “a disgrace for the Republic” and politically motivated retribution.\nIndependent researcher Henry-Pacifique Mayala described the prosecution’s demands as “a settling of scores session rather than a genuine quest for truth.” The court has yet to announce a date for sentencing, leaving Kabila’s fate suspended between accusations of tyranny and claims of persecution."
    },
    {
      "news_title": "Death punishment for former Congo president Joseph Campila - accused of war crimes - World Stock Market",
      "news_link": "https://www.worldstockmarket.net/death-punishment-for-former-congo-president-joseph-campila-accused-of-war-crimes/",
      "bias": "unknown",
      "text": "The military prosecutor today requested that the death penalty be imposed on the former President of the People’s Republic of Congo Joseph Campila, who is in absentia for cooperation with the M23 armed guerrilla organization, which is supported by Rwanda. General Lucien René Likulia, who represents the government, asked the judges of the Supreme Military Court to condemn “to death” for “war crimes – such as murders, rape and torture – for the” 15th ” “Conspiracy”. Cambilla, who has been living abroad for more than two years, appeared in late May in Goma, a city controlled by the M23 anti -government organization. There he met and talked to politicians and members of civil society, with the aim, as he said “contributing to the return of peace” to the Congo LD. Since then, it has not been seen in the country again. His trial before the military court began […]\nSource: News Beast\nWith 6 years of experience, I bring to the table captivating and informative writing in the world news category. My expertise covers a range of industries, including tourism, technology, forex and stocks. From brief social media posts to in-depth articles, I am dedicated to creating compelling content for various platforms."
    }
  ]
}