{
  "story_id": "GN_20250825_221559_a78f7ce6",
  "metadata": {
    "title": "Israel airstrike hits Gaza hospital, killing at least 15 including journalists, Palestinian officials say",
    "timestamp": "2025-08-25T22:15:59.404044",
    "url": "https://ground.news/article/israel-airstrike-hits-gaza-hospital-killing-at-least-15-including-journalists-palestinian-officials-say_ec3bf9"
  },
  "bias_distribution": {
    "total_sources": "201",
    "leaning_left": "51",
    "center": "47",
    "leaning_right": "22"
  },
  "perspective_summaries": {
    "left": [
      "An Israeli airstrike on Nasser Hospital in Khan Younis killed at least 20 people, including five journalists, as confirmed by Gaza's health ministry and local news reports.",
      "Mariam Dagga, a visual journalist for the Associated Press, was among those killed in the strike, according to health workers.",
      "Human rights advocates claimed that targeting journalists violates international humanitarian law, highlighting systemic suppression of media coverage in Gaza.",
      "The Israeli military stated it would investigate the incident and regrets any harm to uninvolved individuals, asserting it does not target journalists."
    ],
    "center": [
      "An Israeli airstrike struck Nasser Hospital in Khan Younis, southern Gaza, on Monday, resulting in the deaths of 19 people, including four journalists such as Mariam Dagga, a freelance visual reporter for the Associated Press.",
      "The attack occurred amid a 22-month Israel-Hamas war during which at least 192 journalists have been killed in Gaza, while Israel restricts international media access.",
      "Journalists, many struggling to find food like the local population, rely heavily on Palestinian reporters amid Israeli claims questioning their affiliations and excluding foreign media.",
      "Thibaut Bruttin, head of Reporters Without Borders, described the situation as an unprecedented setback for journalist safety and criticized attempts to suppress independent reporting from Gaza.",
      "The strike and ongoing conflict highlight risks for media workers and raise concerns about press freedom and humanitarian conditions, while Israel’s military pledged an investigation and denies targeting journalists."
    ],
    "right": [
      "At least 20 Palestinians were killed and several others injured in recent attacks across the Gaza Strip, according to medics.",
      "The UN's Integrated Food Security Phase Classification confirmed that famine has begun in northern Gaza and is expected to spread southward.",
      "Israel has closed all crossings into Gaza since March 2, blocking humanitarian aid for the 2.4 million residents in the territory."
    ]
  },
  "sources": [
    {
      "news_title": "Israel strikes a Gaza hospital twice, killing at least 20, including journalists and rescuers",
      "news_link": "https://www.wandtv.com/news/national/israel-strikes-a-gaza-hospital-twice-killing-at-least-20-including-journalists-and-rescuers/article_1dca5ff8-1444-5bdc-bf02-2c152a0fe599.html",
      "bias": "Center",
      "text": "DEIR AL-BALAH, Gaza Strip (AP) — Israel struck southern Gaza ’s main hospital with a missile and then fired another as journalists and rescue workers rushed to the scene, killing at least 20 people, local health workers said Monday.\nThe first strike hit a top floor of a building at Nasser Hospital in Khan Younis. Minutes later, as journalists and rescuers in orange vests rushed up an external staircase, a second missile hit the same spot, said Dr. Ahmed al-Farra, head of Nasser’s pediatrics department.\nAmong those killed was 33-year-old Mariam Dagga, a visual journalist who had worked for The Associated Press. Dagga regularly reported for multiple outlets from the hospital, including a recent story for the AP on doctors struggling to save children from starvation.\nAl Jazeera and Reuters confirmed their journalists and freelancers were among the five journalists killed.\nThe Israeli military confirmed in a statement that it had struck targets in the area of the hospital. It said it would conduct an investigation and “regrets any harm to uninvolved individuals and does not target journalists as such.”\nIsrael has attacked hospitals multiple times throughout 22 months of war, asserting that Hamas embeds itself in and around the facilities, though it rarely provides evidence. Hamas security personnel have been seen inside such facilities over the course of the war, and parts of them have been off limits to reporters and the public.\nThe hospitals that remain open have been overwhelmed by the dead, wounded and now by increasing numbers of malnourished as parts of Gaza are now in famine.\nPalestinians are bracing for an expected Israeli offensive into Gaza City, the territory's most populated area with hundreds of thousands of people, many of them displaced.\nA doctor describes ‘chaos, disbelief, and fear’\nThe first Israeli strike at around 10:10 a.m. hit the hospital’s fourth floor, which has surgical operating rooms and doctor’s residences, killing at least two people, said Zaher al-Waheidi, head of the records department at the Gaza Health Ministry.\nThe second strike on the stairwell killed 17 others, including medical teams, rescuers, journalists and others, al-Waheidi told the AP.\nJournalists often used the external staircase as a location for live TV spots and to pick up an internet signal.\nA British doctor working on the floor that was hit said the second strike came before people could start evacuating from the first.\n“Just absolute scenes of chaos, disbelief and fear,” the doctor said. They described people wounded from the strikes entering the ward and leaving trails of blood. The hospital was already overwhelmed, with patients with IV drips lying on the floor in the corridors in stifling heat.\nThe doctor spoke on condition of anonymity in line with regulations from their organization to avoid reprisals from Israeli authorities. “It leaves me in another state of shock that hospitals can be a target,” the doctor said. “You go to work as a healthcare professional, and you should be protected in the place you work. But you are not.\"\nNasser Hospital has withstood raids and bombardment during the war, with officials repeatedly noting critical shortages of supplies and staff.\nA June strike on the hospital killed three people, according to the Health Ministry. The military said at the time that it targeted a Hamas command and control center. A March strike on its surgical unit days after Israel ended a ceasefire killed a Hamas official and a 16-year-old boy.\nPrime Minister Benjamin Netanyahu’s office did not immediately respond to questions about the airstrikes. They came four days after the Israeli military's Arabic spokesperson urged health officials to evacuate patients from northern Gaza to facilities in the south ahead of Israel's offensive in Gaza City.\nMore Palestinians killed while seeking aid\nAl-Awda Hospital said Israeli gunfire killed six aid-seekers trying to reach a distribution point in central Gaza, and another 15 were wounded.\nThe shootings were the latest in the Netzarim Corridor, a military zone where U.N. convoys have been overrun by looters and desperate crowds, and where people have been shot and killed while heading to sites run by the Gaza Humanitarian Foundation, an Israeli-backed American contractor.\nNeither Israel's military nor GHF immediately responded to questions about the aid-seekers, who the hospital said were killed hundreds of meters (yards) from the distribution point.\nMeanwhile, three Palestinians, including a child, were killed in a strike on a neighborhood in Gaza City, Shifa Hospital said.\nOne of the deadliest wars for journalists\nThe war in Gaza has been one of the bloodiest for media workers, with 192 journalists killed, according to the Committee to Protect Journalists. More than 1,500 health workers have also been killed, according to the U.N.\nThe health ministry said Sunday that at least 62,686 Palestinians have been killed in the war. It does not distinguish between fighters and civilians but says around half have been women and children. The ministry is part of the Hamas-run government and staffed by medical professionals. The U.N. and independent experts consider it the most reliable source on war casualties. Israel disputes its figures but has not provided its own.\nThe war began when Hamas-led militants abducted 251 people and killed around 1,200 people, mostly civilians, in the Oct. 7, 2023, attack. Most of the hostages have been released in ceasefires or other deals but 50 remain in Gaza, with around 20 believed to be alive.\nHostages’ families fear a new offensive will endanger them further, and many Israelis are increasingly vocal about the need for a deal to stop the fighting and bring everyone home. A new call-up of reservists has added to the anxiety.\nThis story has been corrected to note that Israel has provided some evidence of militants operating in and around some of the hospitals it has raided.\nMagdy reported from Cairo, and Metz reported from Jerusalem. Associated Press Writer Melanie Lidman contributed from Jerusalem.\nFollow AP’s war coverage at https://apnews.com/hub/israel-hamas-war"
    },
    {
      "news_title": "Nasser hospital attack in Gaza: Israeli strikes kill 20, journalists among victims — Eyewitnesses reveal shocking scenes",
      "news_link": "https://www.livemint.com/news/world/nasser-hospital-attack-in-gaza-israeli-strikes-kill-20-journalists-among-victims-eyewitnesses-reveal-shocking-scenes-11756129230612.html",
      "bias": "Center",
      "text": "At least 20 people, including five journalists, were killed on Monday (August 25) when Israeli strikes hit the Nasser Hospital complex in southern Gaza. The incident has provoked outrage from press freedom groups, and media organisations while Israel’s military said it would open an inquiry.\nAccording to Gaza’s civil defence agency, the hospital was hit twice — first by an explosive drone and then by a missile as people rushed to rescue the wounded.\nCivil defence spokesman Mahmud Bassal told reporters: “The toll so far is 20 martyrs, including five journalists and one member of the civil defence.”\nDr. Ahmed al-Farra, head of pediatrics at Nasser, said the first strike hit the top floor of one building, followed minutes later by a second missile.\nInternational media outlets confirmed the deaths of their contributors: Associated Press said Mariam Dagga, 33, a freelance visual journalist, was killed.\n“We are shocked and saddened to learn of her death,” AP said.\nAl Jazeera reported the loss of its cameraman Mohammad Salama.\n“This horrific crime is part of a systematic campaign to silence the truth,” the network said.\nReuters confirmed contractor Hussam al-Masri was killed and another, Hatem Khaled, was injured.\n“We are devastated… and are seeking urgent medical assistance for Hatem,” a spokesperson said.\nThe Palestinian Journalists Syndicate also named Moaz Abu Taha and Ahmad Abu Aziz among the victims.\nAccording to the Committee to Protect Journalists, nearly 200 journalists have been killed in the 22-month war.\nThe Israeli military confirmed it struck the area but denied deliberately targeting journalists.\nIn a statement, the Israel Defence Forces (IDF) said: “The IDF regrets any harm to uninvolved individuals and does not target journalists as such. The Chief of the General Staff instructed to conduct an initial inquiry as soon as possible.”\nIsrael has previously accused Hamas of operating from hospitals, though it has rarely provided supporting evidence.\nA British doctor working inside Nasser Hospital described the aftermath: “Absolute scenes of chaos, disbelief, and fear. Patients with IV drips were lying on the floors while stretchers rushed past visitors searching for loved ones.”\nThe doctor added: “You should be protected in the place you work. But you are not. I fear for my colleagues and patients left behind today.”\nAFP footage showed smoke filling the air, bloodied corpses carried through hospital doors, and medical staff overwhelmed as wounded civilians poured in.\nThe Foreign Press Association in Israel called for an “immediate explanation” from both the military and the prime minister’s office: “We call on Israel once and for all to halt its abhorrent practice of targeting journalists.”\nTurkey’s presidential communications office also condemned the strike, calling it “an attack on press freedom and another war crime.”\nNasser is one of the last major hospitals still functioning in Gaza. It has been repeatedly struck since the start of the war, worsening shortages of staff and supplies.\nThe Gaza Health Ministry said that more than 62,000 Palestinians have been killed since the conflict began, with around half being women and children. The United Nations considers these figures credible, though Israel disputes them and has not released its own civilian casualty counts.\n(With AFP, AP inputs)"
    },
    {
      "news_title": "Israel orders probe after airstrikes kill 20 in Gaza, including journalists",
      "news_link": "https://www.usatoday.com/story/news/world/2025/08/25/israel-gaza-hospital-airstrikes-journalists-killed/85813649007/",
      "bias": "Lean Left",
      "text": "Israel orders probe after airstrikes kill 20 in Gaza, including journalists\nThe Israeli Defense Forces said in a statement that it \"regrets any harm to uninvolved individuals\" and denied targeting journalists.\n- At least 20 people were killed in an Israeli airstrike on Nasser hospital in Gaza.\n- Five Palestinian journalists were among those killed in the attack.\n- More than 240 journalists have been killed by Israeli fire in Gaza since the war started with a Hamas attack on Israel on Oct. 7, 2023.\nThe Israeli military said it carried out a strike in the area of Nasser hospital in Khan Younis in the Gaza Strip and that its chief of the general staff had ordered an inquiry.\nPalestinian health officials said at least 20 people had been killed in the August 25 strike, including five journalists, one of whom worked for Reuters.\nIn a statement, the Israel Defence Forces said: \"The IDF regrets any harm to uninvolved individuals and does not target journalists as such. The IDF acts to mitigate harm to uninvolved individuals as much as possible while maintaining the safety of IDF troops.\"\nCameraman Hussam al-Masri, a Reuters contractor, was killed in the first strike, according to the officials. Photographer Hatem Khaled, who was also a Reuters contractor, was wounded in a second strike on the hospital, they said.\nWitnesses said the second strike took place after rescue workers, journalists and other people had rushed to the site of the initial attack. The Reuters live video feed from the hospital, which was operated by Masri, suddenly shut down at the moment of the initial strike, Reuters footage showed.\n\"We are devastated to learn of the death of Reuters contractor Hussam al-Masri and injuries to another of our contractors, Hatem Khaled, in Israeli strikes on the Nasser hospital in Gaza today,\" a Reuters spokesperson said in a statement.\n\"We are urgently seeking more information and have asked authorities in Gaza and Israel to help us get urgent medical assistance for Hatem,\" the spokesperson added.\nThe Israeli military and Prime Minister's Office both had no immediate comment regarding the strikes.\nHealth officials in Gaza named three other journalists as Mariam Abu Dagga, who the Associated Press said freelanced for the AP and other outlets since the start of the Gaza conflict, Mohammed Salama, who Qatar-based Al Jazeera said worked for the broadcaster, and Moaz Abu Taha. A rescue worker was also among those killed, the health officials added.\nThe Palestinian Journalists Syndicate condemned Israel for the strikes, saying it represented \"an open war against free media, with the aim of terrorizing journalists and preventing them from fulfilling their professional duty of exposing its crimes to the world.\"\nMore than 240 Palestinian journalists have been killed by Israeli fire in Gaza since the war started on October 7, 2023, according to the Palestinian Journalists Syndicate."
    },
    {
      "news_title": "Press Freedom Under Fire: Controversial Strikes in Gaza",
      "news_link": "https://www.devdiscourse.com/article/law-order/3602540-press-freedom-under-fire-controversial-strikes-in-gaza",
      "bias": "Center",
      "text": "Press Freedom Under Fire: Controversial Strikes in Gaza\nTurkey's presidential communications office condemned Israel's recent strikes on Gaza, calling them violations of press freedom and war crimes. The attacks resulted in at least 20 deaths, including journalists, raising concerns about targeting media in conflict zones. Israel has launched an inquiry into the incident.\nTurkey's presidential communications office has accused Israel of committing war crimes following recent strikes on Gaza that reportedly killed 20 people, including five journalists. The deadly attack, which occurred at Nasser hospital, has reignited the debate over press freedom in conflict zones.\nIn a post on social media platform X, Burhanettin Duran, head of the communications directorate, criticized Israel's continued 'atrocities' and its attempts to suppress media coverage through systematic attacks. The statement reflects growing international concern regarding the safety of journalists in war-torn areas.\nResponding to the accusations, the Israeli military confirmed it conducted a strike near Nasser hospital but claimed that journalists are not targeted intentionally. An inquiry has been ordered by the Israeli chief of the general staff to investigate the incident further.\n(With inputs from agencies.)\nALSO READ\nIsrael's Strikes on Gaza: An Assault on Press Freedom\nMinister's Highway Haste: Turkey's Top Official Caught Speeding\nPress Freedom Eroding: A Hong Kong Visa Controversy\nFormer President Joseph Kabila Faces Death Penalty for War Crimes\nTurkey's Strategic Railway: Bridging Nations for Peace and Prosperity"
    },
    {
      "news_title": "IDF Says Threat Originated From Gaza Hospital, Orders Immediate Inquiry",
      "news_link": "https://vinnews.com/2025/08/25/idf-says-threat-originated-from-gaza-hospital-orders-immediate-inquiry/",
      "bias": "Center",
      "text": "GAZA – The IDF said Monday it struck Nasser Hospital in Khan Yunis after intelligence indicated Hamas was using the facility for hostile activity. Palestinian reports said at least 20 people were killed, including several journalists.\nJoin our WhatsApp groupSubscribe to our Daily Roundup Email\nA security source told Israel Hayom that Hamas had placed a surveillance camera on the hospital roof to track Israeli forces. The IDF received authorization to disable the device, but the incident escalated into a broader strike that caused significant casualties.\nChief of Staff Lt. Gen. Eyal Zamir ordered a full investigation. The IDF said it “regrets any harm to uninvolved civilians,” does not deliberately target journalists, and takes steps to minimize casualties while protecting its troops.\nAmong those killed, according to reports, were AP freelance reporter Mariam Abu Daqa, Al Jazeera cameraman Mohammed Salama, journalist Ahmad Abu Aziz, and Reuters photographer Hossam al-Masri.\nBREAKING: The Israel Defence Forces has confirmed it carried out the airstrike on Nasser Hospital in Gaza, which has now killed at least 20 people, including several journalists.\nLive updates: https://t.co/WuOYkP3LB2\n📺 Sky 501, Virgin 602, Freeview 233 and YouTube pic.twitter.com/gxMlzjWNc6\n— Sky News (@SkyNews) August 25, 2025\n#Palestine🇵🇸: [UPDATE 25.08.2025] An Israeli airstrike on Nasser Hospital in Khan Yunis killed 4 journalists: Hossam Al-Masri of @Reuters, Mohammed Salama of @AlJazeera, Moaz Abu Taha of @NBCNews and Maryam Abu Deqa of @AP and Independent Arab. pic.twitter.com/OClwQ7HBBt\n— IFJ (@IFJGlobal) August 25, 2025\nACCORDING TO THIS DOCTRINE THE ALLIES SHOULD HAVE APOLOGIZED TO GERMANY YOU SICK ISREALI LEFTIST GOVERNMENT SICK!\nWhere there is smoke there is fire. If they were next to terrorists then….."
    },
    {
      "news_title": "Israeli airstrikes on Gaza hospital kill at least 19 people, including 5 journalists",
      "news_link": "https://www.cbc.ca/news/world/gaza-nasser-hospital-strike-1.7616802",
      "bias": "Lean Left",
      "text": null
    },
    {
      "news_title": "Officials: AP freelancer among 4 journalists killed in Israeli strikes in Gaza",
      "news_link": "http://www.mynews13.com/fl/orlando/international/2025/08/25/journalists-killed-israeli-strikes-gaza-hospital",
      "bias": "Center",
      "text": "DEIR AL-BALAH, Gaza Strip — Israeli strikes on a hospital in southern Gaza killed four journalists Monday, including a freelancer who worked for The Associated Press, according to health officials.\nWhat You Need To Know\n- Health officials say Israeli strikes on a hospital in southern Gaza has killed four journalists, including a freelancer who worked for The Associated Press\n- Mariam Dagga was a visual journalist who freelanced for the AP during the war, as well as other news outlets\n- The AP said in a statement that it was shocked and saddened to learn of Dagga's death, along with those of several other journalists\n- The head of the Health Ministry's records department said that 19 people were killed in Monday's strikes on Nasser Hospital\nMariam Dagga, 33, a visual journalist, freelanced for the AP during the war, as well as other news outlets. The AP said in a statement that it was shocked and saddened to learn of Dagga's death, along with those of other journalists.\nTwo missiles hit Nasser Hospital in Khan Younis, medical officials said. In all, 19 people were killed, according to Zaher al-Waheidi, head of the Gaza Health Ministry's records department.\nThe Israel-Hamas war has been one of the bloodiest conflicts for media workers, with at least 192 journalists killed in Gaza in the 22-month conflict, according to the Committee to Protect Journalists. Comparatively, 18 journalists have been killed so far in Russia's war in Ukraine, according to the CPJ.\nDagga, who has a 12-year-old son who was evacuated from Gaza earlier in the war, frequently based herself at Nasser, most recently reporting on the hospital's doctors struggling to save children from starvation. Independent Arabia, the Arabic language version of the British Independent, said Dagga also worked with the organization.\n\"We are doing everything we can to keep our journalists in Gaza safe as they continue to provide crucial eyewitness reporting in difficult and dangerous conditions,\" the AP said.\nAl Jazeera confirmed that its journalist Mohammed Salam was also among those who were killed in the Nasser strike. Reuters reported that its contractor cameraman Hussam al-Masri was killed and its contractor photographer Hatem Khaled wounded. It was not immediately clear who the fourth journalist killed was.\nThe Israeli military said its troops carried out a strike in the area of Nasser Hospital and that it would conduct an investigation into the incident. The military said it \"regrets any harm to uninvolved individuals and does not target journalists as such.\"\nThibaut Bruttin, the director general of Reporters Without Borders, said press freedom advocates had never seen such a severe step backward for reporters' safety. He noted that journalists have been killed both in indiscriminate strikes and in targeted attacks that Israel's military has acknowledged carrying out.\n\"They are doing everything they can to silence independent voices that are trying to report on Gaza,\" Bruttin said.\nIn some cases, such as with Al Jazeera correspondent Anas al-Sharif, who was targeted and killed by Israel earlier this month, Israel has accused journalists in Gaza of being part of militant groups. Israel's military asserted that al-Sharif had led a Hamas cell — an allegation that Al Jazeera and al-Sharif previously dismissed as baseless.\nAside from rare guided tours, Israel has barred international media from covering the war. News organizations instead rely largely on Palestinian journalists in Gaza — as well as residents — to show the world what is happening there. Israel often questions the affiliations and biases of Palestinian journalists but doesn't permit others in.\nMany of the journalists working in Gaza are facing the same struggles to find food, for themselves and their families, as the people they are covering.\nIn one of Dagga's last social media posts on Sunday, she published a selfie of herself."
    },
    {
      "news_title": "Israeli strikes on southern Gaza hospital kill 19 people including journalists, hospital says",
      "news_link": "https://www.idahostatejournal.com/news/national/israeli-strikes-on-southern-gaza-hospital-kill-19-people-including-journalists-hospital-says/article_36dde75e-37e2-5d06-930e-3e494fb995ae.html",
      "bias": "Center",
      "text": null
    },
    {
      "news_title": "Israel Kills 15, Including 4 Journalists in Gaza Hospital Strikes",
      "news_link": "https://www.moroccoworldnews.com/2025/08/255646/israel-kills-15-including-4-journalists-in-gaza-hospital-strikes/",
      "bias": "Lean Right",
      "text": "Casablanca – In yet another attempt to silence the press reporting on their genocidal crimes, Israel killed 15 people, including four journalists, in strikes on Gaza’s Nasser hospital on Monday.\nAmong them, cameraman Hussam al-Masri, was killed in the first strike, while photographer Hatem Khaled was wounded in the second.\n“We are devastated to learn of the death of Reuters contractor Hussam al-Masri and injuries to another of our contractors, Hatem Khaled, in Israeli strikes on the Nasser hospital in Gaza today,” a Reuters spokesperson said in a statement.\n“We are urgently seeking more information and have asked authorities in Gaza and Israel to help us get urgent medical assistance for Hatem,” the spokesperson added.\nPalestinian health officials named three other journalists, Mariam Abu Dagga, Mohammed Salama and Moaz Abu Taha, as well as a rescue worker, among those killed.\nAccording to witnesses, the second strike occurred after rescuers, journalists and others had gathered at the scene of the first attack.\nThe Israeli Occupation Forces (IOF) and the prime minister’s office offered no immediate comment on the strikes.\nThe Palestinian Journalists Syndicate (PJS) denounced the Israeli strikes, describing them as “an open war against free media, with the aim of terrorising journalists and preventing them from fulfilling their professional duty of exposing its crimes to the world.”\nAccording to the Palestinian Journalist Syndicate (PJS), more than 240 Palestinian journalists have been killed by the Israeli Occupation Forces in Gaza since the genocidal campaign began on October 7, 2023. This marks the deadliest conflict in history for media personnel, according to the Watson Institute for International and Public Affairs, who gathered data in their “Costs of War” project.\nThis enormously high media death toll further speaks to the IOF’s systematic silencing of the suffering of Palestinians in Gaza, where the United Nations’ has officially declared a man-made famine.\nRead also: UN Confirms Famine in Northern Gaza"
    },
    {
      "news_title": "Multiple journalists killed by Israeli strikes on Gaza hospital",
      "news_link": "https://www.nbcnews.com/world/gaza/israel-strikes-gaza-nasser-hospital-journalists-killed-rescue-workers-rcna226926",
      "bias": "Lean Left",
      "text": "Israel struck southern Gaza 's main hospital with a missile and then fired another as journalists and rescue workers rushed to the scene, killing at least 20 people, local health workers said Monday.\nThe first strike hit a top floor of a building at Nasser Hospital in Khan Younis. Minutes later, as journalists and rescuers in orange vests rushed up an external staircase, a second missile hit the same spot, said Dr. Ahmed al-Farra, head of Nasser's pediatrics department.\nAmong those killed was 33-year-old Mariam Dagga, a visual journalist who had worked for The Associated Press. Dagga regularly reported for multiple outlets from the hospital, including a recent story for the AP on doctors struggling to save children from starvation.\nAl Jazeera and Reuters confirmed their journalists and freelancers were among the five journalists killed.\nThe Israeli military confirmed in a statement that it had struck targets in the area of the hospital. It said it would conduct an investigation and \"regrets any harm to uninvolved individuals and does not target journalists as such.\"\nIsrael has attacked hospitals multiple times throughout 22 months of war, asserting that Hamas embeds itself in and around the facilities, though it rarely provides evidence. Hamas security personnel have been seen inside such facilities over the course of the war, and parts of them have been off limits to reporters and the public.\nThe hospitals that remain open have been overwhelmed by the dead, wounded and now by increasing numbers of malnourished as parts of Gaza are now in famine.\nPalestinians are bracing for an expected Israeli offensive into Gaza City, the territory's most populated area with hundreds of thousands of people, many of them displaced.\nA doctor describes 'chaos, disbelief, and fear'\nThe first Israeli strike at around 10:10 a.m. hit the hospital's fourth floor, which has surgical operating rooms and doctor's residences, killing at least two people, said Zaher al-Waheidi, head of the records department at the Gaza Health Ministry.\nThe second strike on the stairwell killed 17 others, including medical teams, rescuers, journalists and others, al-Waheidi told the AP.\nJournalists often used the external staircase as a location for live TV spots and to pick up an internet signal.\nA British doctor working on the floor that was hit said the second strike came before people could start evacuating from the first.\n\"Just absolute scenes of chaos, disbelief and fear,\" the doctor said. They described people wounded from the strikes entering the ward and leaving trails of blood. The hospital was already overwhelmed, with patients with IV drips lying on the floor in the corridors in stifling heat.\nThe doctor spoke on condition of anonymity in line with regulations from their organization to avoid reprisals from Israeli authorities. \"It leaves me in another state of shock that hospitals can be a target,\" the doctor said. \"You go to work as a healthcare professional, and you should be protected in the place you work. But you are not.\"\nNasser Hospital has withstood raids and bombardment during the war, with officials repeatedly noting critical shortages of supplies and staff.\nA June strike on the hospital killed three people, according to the Health Ministry. The military said at the time that it targeted a Hamas command and control center. A March strike on its surgical unit days after Israel ended a ceasefire killed a Hamas official and a 16-year-old boy.\nPrime Minister Benjamin Netanyahu's office did not immediately respond to questions about the airstrikes. They came four days after the Israeli military's Arabic spokesperson urged health officials to evacuate patients from northern Gaza to facilities in the south ahead of Israel's offensive in Gaza City.\nMore Palestinians killed while seeking aid\nAl-Awda Hospital said Israeli gunfire killed six aid-seekers trying to reach a distribution point in central Gaza, and another 15 were wounded.\nThe shootings were the latest in the Netzarim Corridor, a military zone where U.N. convoys have been overrun by looters and desperate crowds, and where people have been shot and killed while heading to sites run by the Gaza Humanitarian Foundation, an Israeli-backed American contractor.\nNeither Israel's military nor GHF immediately responded to questions about the aid-seekers, who the hospital said were killed hundreds of meters (yards) from the distribution point.\nMeanwhile, three Palestinians, including a child, were killed in a strike on a neighborhood in Gaza City, Shifa Hospital said.\nOne of the deadliest wars for journalists\nThe war in Gaza has been one of the bloodiest for media workers, with 192 journalists killed, according to the Committee to Protect Journalists. More than 1,500 health workers have also been killed, according to the U.N.\nThe health ministry said Sunday that at least 62,686 Palestinians have been killed in the war. It does not distinguish between fighters and civilians but says around half have been women and children. The ministry is part of the Hamas-run government and staffed by medical professionals. The U.N. and independent experts consider it the most reliable source on war casualties. Israel disputes its figures but has not provided its own.\nThe war began when Hamas-led militants abducted 251 people and killed around 1,200 people, mostly civilians, in the Oct. 7, 2023, attack. Most of the hostages have been released in ceasefires or other deals but 50 remain in Gaza, with around 20 believed to be alive.\nHostages' families fear a new offensive will endanger them further, and many Israelis are increasingly vocal about the need for a deal to stop the fighting and bring everyone home. A new call-up of reservists has added to the anxiety."
    },
    {
      "news_title": "Israel says it ‘regrets’ deaths as airstrike hits Gaza hospital, killing journalists",
      "news_link": "https://nypost.com/2025/08/25/world-news/israel-says-it-regrets-deaths-as-airstrike-hits-gaza-hospital-killing-journalists/",
      "bias": "Lean Right",
      "text": "Israel says it ‘regrets’ deaths as airstrike hits Gaza hospital, killing journalists\nIsrael said it is investigating how an airstrike hit one of Gaza’s main hospitals on Monday, insisting it was not targeting journalists or civilians killed in the blast.\nIsrael’s chief of the general staff has already ordered an inquiry after multiple missiles hit the Nasser Hospital — the largest in southern Gaza — on Monday. Hamas-tied Palestinian health officials said that at least 20 people were killed, including four journalists.\n“The IDF regrets any harm to uninvolved individuals and does not target journalists as such,” the Israel Defence Forces (IDF) said in a statement\n“The IDF acts to mitigate harm to uninvolved individuals as much as possible while maintaining the safety of IDF troops.”\nThe military didn’t immediately confirm who the intended target was.\nAmong those killed in the blast were journalists who worked for Reuters, the Associated Press and Al Jazeera, according to the outlets and Palestinian health officials.\nCameraman Hussam al-Masri, a Reuters contractor, was killed in one of the strikes. Mariam Dagga, a visual journalist who had freelanced for the AP, also died. Al Jazeera journalist Mohammed Salam was also among the journalists killed, with Palestinian IDing the fourth as Moaz Abu Taha.\nWitnesses said a second strike unfolded soon after rescue workers, journalists and others had rushed to the site of the initial attack.\nPhotographer Hatem Khaled, who was also a Reuters contractor, was wounded in a second strike, the outlet said.\n“We are devastated to learn of the death of Reuters contractor Hussam al-Masri and injuries to another of our contractors, Hatem Khaled, in Israeli strikes on the Nasser hospital in Gaza today,” a Reuters spokesperson said.\nStart your day with all you need to know\nMorning Report delivers the latest news, videos, photos and more.\nThanks for signing up!\n“We are urgently seeking more information and have asked authorities in Gaza and Israel to help us get urgent medical assistance for Hatem.”\nA strike on Nasser Hospital in June killed three people and wounded 10, according to health officials.\nAt the time, Israel’s military said it had been targeting Hamas militants operating from a command and control center inside the hospital.\nMore than 240 Palestinian journalists have been killed by Israeli fire in Gaza since the war started on October 7, 2023, according to the Palestinian Journalist Syndicate.\nIsrael’s Prime Minister Benjamin Netanyahu hasn’t commented on the latest strike.\nWith Post wires"
    },
    {
      "news_title": "4 journalists killed in Israeli strikes on Gaza hospital, health officials say",
      "news_link": "https://www.pennlive.com/nation-world/2025/08/4-journalists-killed-in-israeli-strikes-on-gaza-hospital-health-officials-say.html",
      "bias": "Center",
      "text": "By WAFAA SHURAFA and MELANIE LIDMAN Associated Press\nDEIR AL-BALAH, Gaza Strip (AP) — Israeli strikes on a hospital in southern Gaza killed four journalists Monday, including a freelancer who worked for The Associated Press, according to health officials.\nMariam Dagga, 33, a visual journalist, freelanced for the AP during the war, as well as other news outlets. The AP said in a statement that it was shocked and saddened to learn of Dagga’s death, along with those of other journalists.\nTwo missiles hit Nasser Hospital in Khan Younis, medical officials said. In all, 19 people were killed, according to Zaher al-Waheidi, head of the Gaza Health Ministry’s records department.\nThe Israel-Hamas war has been one of the bloodiest conflicts for media workers, with at least 192 journalists killed in Gaza in the 22-month conflict, according to the Committee to Protect Journalists. Comparatively, 18 journalists have been killed so far in Russia’s war in Ukraine, according to the CPJ.\nDagga, who has a 12-year-old son who was evacuated from Gaza earlier in the war, frequently based herself at Nasser, most recently reporting on the hospital’s doctors struggling to save children from starvation. Independent Arabia, the Arabic language version of the British Independent, said Dagga also worked with the organization.\n“We are doing everything we can to keep our journalists in Gaza safe as they continue to provide crucial eyewitness reporting in difficult and dangerous conditions,” the AP said.\nAl Jazeera confirmed that its journalist Mohammed Salam was also among those who were killed in the Nasser strike. Reuters reported that its contractor cameraman Hussam al-Masri was killed and its contractor photographer Hatem Khaled wounded. It was not immediately clear who the fourth journalist killed was.\nThe Israeli military said its troops carried out a strike in the area of Nasser Hospital and that it would conduct an investigation into the incident. The military said it “regrets any harm to uninvolved individuals and does not target journalists as such.”\nThibaut Bruttin, the director general of Reporters Without Borders, said press freedom advocates had never seen such a severe step backward for reporters’ safety. He noted that journalists have been killed both in indiscriminate strikes and in targeted attacks that Israel’s military has acknowledged carrying out.\n“They are doing everything they can to silence independent voices that are trying to report on Gaza,” Bruttin said.\nIn some cases, such as with Al Jazeera correspondent Anas al-Sharif, who was targeted and killed by Israel earlier this month, Israel has accused journalists in Gaza of being part of militant groups. Israel’s military asserted that al-Sharif had led a Hamas cell — an allegation that Al Jazeera and al-Sharif previously dismissed as baseless.\nAside from rare guided tours, Israel has barred international media from covering the war. News organizations instead rely largely on Palestinian journalists in Gaza — as well as residents — to show the world what is happening there. Israel often questions the affiliations and biases of Palestinian journalists but doesn’t permit others in.\nMany of the journalists working in Gaza are facing the same struggles to find food, for themselves and their families, as the people they are covering.\nIn one of Dagga’s last social media posts on Sunday, she published a selfie of herself.\nLidman reported from Jerusalem. Associated Press writers Samy Magdy contributed from Cairo and Sam Metz from Jerusalem."
    },
    {
      "news_title": "Journalists among at least 20 killed by Israeli attack on Gaza hospital",
      "news_link": "https://www.thenational.scot/news/25414667.journalists-among-19-killed-israeli-attack-nasser-hospital/",
      "bias": "Lean Left",
      "text": "AT least 20 people have been killed, including five journalists, in an Israeli strike on a hospital in Gaza.\nSeveral people were killed in an initial strike at the Nasser Medical Complex in southern Gaza on Monday morning, with others killed in a second strike which happened as rescuers attended the scene, Gaza's Civil Defence said.\nThe hospital is the last major remaining hospital in southern Gaza following Israel's brutal bombardment of the enclave, with around 600,000 Palestinians relying on it.\nFour journalists were initially reported to have been killed in Israel's attack: Hossam al-Masri, a photojournalist with Reuters, Mohammed Salama, a photojournalist with Al Jazeera, Mariam Abu Daqa, a journalist working across several outlets including the Associated Press and the Independent Arabic, and Moaz Abu Taha, a journalist with NBC.\nLater on Monday, a fifth journalist was reported killed. Ahmed Abu Aziz, who worked with Quds Network and other media outlets, died after being wounded in the attack, Al Jazeera reports.\nREAD MORE: Nigel Farage unveils plans for 'the opposite' of Human Rights Act\nThe Palestinian Red Crescent Society (PRCS) also said that one of its medics was injured while tending to the wounded in Nasser Medical Complex, as the organisation shared a video on Twitter/X which showed a clearly marked PRCS rescue van marked with what appear to be bullet holes.\nToday, a Palestine Red Crescent medic was injured while performing his humanitarian duty inside Nasser Medical Hospital in Khan Yunis, as he assisted the wounded following the Israeli occupation’s attack on the hospital.#Gaza pic.twitter.com/ckSWUagl9h\n— PRCS (@PalestineRCS) August 25, 2025\nThe Israeli military had no immediate comment on the attack.\nFrancesca Albanese, UN special rapporteur for Palestine, condemned the attack as she called on states to \"stop this carnage\".\nShe wrote on social media: “Rescuers killed in line of duty. Scenes like this unfold every moment in Gaza, often unseen, largely undocumented. I beg states: how much more must be witnessed before you act to stop this carnage? Break the blockade. Impose an Arms Embargo. Impose Sanctions.\"\nMedical Aid for Palestinians (MAP), a charity which supports vital services at Nasser Hospital, said its teams had been safely evacuated from the complex.\nREAD MORE: 'Let them work': Refugees in Scotland on why they're pushing for change\n\"Israeli military attacks on healthcare facilities are a show of the impunity it is afforded by international leaders and governments,\" a statement from MAP said.\n\"They have attacked Nasser Hospital repeatedly since October 2023. Israel will continue its genocide in Gaza until it’s forced to stop.\"\nMAP called on the UK Government to \"urgently\" suspend all arms transfers to Israel, as well as taking \"decisive legal, diplomatic, and economic action to hold all perpetrators accountable\".\nThe latest Israeli attack comes just weeks after at least seven journalists were targeted and killed in an Israeli strike, including prominent Al Jazeera reporter Anas Al-Sharif, who had previously been threatened by Israel.\nThe Gaza Government media office said the attack on Monday meant the number of journalists killed by Israeli attacks in Gaza since October 7, 2023, has risen to 244."
    },
    {
      "news_title": "20 Palestinians, including 4 journalists, killed in IDF strike on Gaza hospital",
      "news_link": "https://www.axios.com/2025/08/25/gaza-israel-hospital-strike-journalists-killed",
      "bias": "Lean Left",
      "text": null
    },
    {
      "news_title": "Israeli strike on Gaza hospital kills journalists",
      "news_link": "https://www.wbaltv.com/article/israeli-strike-gaza-hospital-journalists-killed/65886041",
      "bias": "Center",
      "text": "At least 4 journalists killed in Israeli strikes on hospital in Gaza, health officials say\nIsraeli strikes on a hospital in southern Gaza killed four journalists Monday, including a freelancer who worked for The Associated Press, according to health officials.\nMariam Dagga, 33, a visual journalist, freelanced for the AP during the war, as well as other news outlets. The AP said in a statement that it was shocked and saddened to learn of Dagga's death, along with those of other journalists.\nTwo missiles hit Nasser Hospital in Khan Younis, medical officials said. In all, 19 people were killed, according to Zaher al-Waheidi, head of the Gaza Health Ministry’s records department.\nThe Israel-Hamas war has been one of the bloodiest conflicts for media workers, with at least 192 journalists killed in Gaza in the 22-month conflict, according to the Committee to Protect Journalists. Comparatively, 18 journalists have been killed so far in Russia’s war in Ukraine, according to the CPJ.\nDagga, who has a 12-year-old son who was evacuated from Gaza earlier in the war, frequently based herself at Nasser, most recently reporting on the hospital's doctors struggling to save children from starvation. Independent Arabia, the Arabic language version of the British Independent, said Dagga also worked with the organization.\n“We are doing everything we can to keep our journalists in Gaza safe as they continue to provide crucial eyewitness reporting in difficult and dangerous conditions,” the AP said.\nAl Jazeera confirmed that its journalist Mohammed Salam was also among those who were killed in the Nasser strike. Reuters reported that its contractor cameraman Hussam al-Masri was killed and its contractor photographer Hatem Khaled wounded. It was not immediately clear who the fourth journalist killed was.\nThe Israeli military said its troops carried out a strike in the area of Nasser Hospital and that it would conduct an investigation into the incident. The military said it “regrets any harm to uninvolved individuals and does not target journalists as such.”\nThibaut Bruttin, the director general of Reporters Without Borders, said press freedom advocates had never seen such a severe step backward for reporters’ safety. He noted that journalists have been killed both in indiscriminate strikes and in targeted attacks that Israel’s military has acknowledged carrying out.\n“They are doing everything they can to silence independent voices that are trying to report on Gaza,” Bruttin said.\nIn some cases, such as with Al Jazeera correspondent Anas al-Sharif, who was targeted and killed by Israel earlier this month, Israel has accused journalists in Gaza of being part of militant groups. Israel’s military asserted that al-Sharif had led a Hamas cell — an allegation that Al Jazeera and al-Sharif previously dismissed as baseless.\nAside from rare guided tours, Israel has barred international media from covering the war. News organizations instead rely largely on Palestinian journalists in Gaza — as well as residents — to show the world what is happening there. Israel often questions the affiliations and biases of Palestinian journalists but doesn’t permit others in.\nMany of the journalists working in Gaza are facing the same struggles to find food, for themselves and their families, as the people they are covering.\nIn one of Dagga's last social media posts on Sunday, she published a selfie.\n___\nLidman reported from Jerusalem. Associated Press writers Samy Magdy contributed from Cairo and Sam Metz from Jerusalem."
    },
    {
      "news_title": "At least 4 journalists killed in Israeli strikes on hospital in Gaza, health officials say",
      "news_link": "https://www.koco.com/article/israeli-strike-gaza-hospital-journalists-killed/65886041",
      "bias": "Center",
      "text": "At least 4 journalists killed in Israeli strikes on hospital in Gaza, health officials say\nIsraeli strikes on a hospital in southern Gaza killed four journalists Monday, including a freelancer who worked for The Associated Press, according to health officials.\nMariam Dagga, 33, a visual journalist, freelanced for the AP during the war, as well as other news outlets. The AP said in a statement that it was shocked and saddened to learn of Dagga's death, along with those of other journalists.\nTwo missiles hit Nasser Hospital in Khan Younis, medical officials said. In all, 19 people were killed, according to Zaher al-Waheidi, head of the Gaza Health Ministry’s records department.\nThe Israel-Hamas war has been one of the bloodiest conflicts for media workers, with at least 192 journalists killed in Gaza in the 22-month conflict, according to the Committee to Protect Journalists. Comparatively, 18 journalists have been killed so far in Russia’s war in Ukraine, according to the CPJ.\nDagga, who has a 12-year-old son who was evacuated from Gaza earlier in the war, frequently based herself at Nasser, most recently reporting on the hospital's doctors struggling to save children from starvation. Independent Arabia, the Arabic language version of the British Independent, said Dagga also worked with the organization.\n“We are doing everything we can to keep our journalists in Gaza safe as they continue to provide crucial eyewitness reporting in difficult and dangerous conditions,” the AP said.\nAl Jazeera confirmed that its journalist Mohammed Salam was also among those who were killed in the Nasser strike. Reuters reported that its contractor cameraman Hussam al-Masri was killed and its contractor photographer Hatem Khaled wounded. It was not immediately clear who the fourth journalist killed was.\nThe Israeli military said its troops carried out a strike in the area of Nasser Hospital and that it would conduct an investigation into the incident. The military said it “regrets any harm to uninvolved individuals and does not target journalists as such.”\nThibaut Bruttin, the director general of Reporters Without Borders, said press freedom advocates had never seen such a severe step backward for reporters’ safety. He noted that journalists have been killed both in indiscriminate strikes and in targeted attacks that Israel’s military has acknowledged carrying out.\n“They are doing everything they can to silence independent voices that are trying to report on Gaza,” Bruttin said.\nIn some cases, such as with Al Jazeera correspondent Anas al-Sharif, who was targeted and killed by Israel earlier this month, Israel has accused journalists in Gaza of being part of militant groups. Israel’s military asserted that al-Sharif had led a Hamas cell — an allegation that Al Jazeera and al-Sharif previously dismissed as baseless.\nAside from rare guided tours, Israel has barred international media from covering the war. News organizations instead rely largely on Palestinian journalists in Gaza — as well as residents — to show the world what is happening there. Israel often questions the affiliations and biases of Palestinian journalists but doesn’t permit others in.\nMany of the journalists working in Gaza are facing the same struggles to find food, for themselves and their families, as the people they are covering.\nIn one of Dagga's last social media posts on Sunday, she published a selfie.\n___\nLidman reported from Jerusalem. Associated Press writers Samy Magdy contributed from Cairo and Sam Metz from Jerusalem."
    },
    {
      "news_title": "Israel kills another four journalists - this time, at a hospital",
      "news_link": "https://www.thecanary.co/global/world-news/2025/08/25/nasser-hospital-attack/",
      "bias": "Left",
      "text": "In a new crime against media crews, four Palestinian journalists were killed by Israel on Sunday morning after a direct attack on press and medical crews inside the Nasser Hospital in Khan Yunis, south of the Gaza Strip.\nMedical sources said the martyrs were: Al Jazeera cameraman Mohammed Salama, cameraman Hossam Al-Masri, journalist Mariam Abu Daqqa, and journalist Moaz Abu Taha. With their deaths, the number of journalists killed since the start of the Israeli war on Gaza on 7 October 2023, has risen to 244, according to the Palestinian Journalists’ Syndicate.\nGaza: the most dangerous place in the world for journalists\nSince the outbreak of the war, Gaza has become the most dangerous professional environment for journalists around the world, with international organizations documenting repeated targeting of media workers, either through direct bombardment during their field coverage or by targeting their homes with their families.\nEarlier, the Committee to Protect Journalists said that “the number of journalists killed in Gaza is the highest in a single conflict since it began documenting its work three decades ago,” while Reporters Without Borders described what is happening as “the extermination of the Palestinian press.”\nThe deaths of the four journalists at Nasser Hospital\nAccording to human rights reports, the intensity and nature of the targeting indicate a systematic policy aimed at silencing media coverage and preventing the world from seeing what is happening. Human rights activists emphasize that journalists are considered “protected civilians” under international humanitarian law, making their targeting a war crime that requires international accountability.\nMedia professionals in Gaza work in an almost impossible environment: near-total power and communications blackouts, a lack of equipment, and constant danger to their lives and those of their families. Yet they continue to cover the massacres and violations, conveying to the world scenes from the field that rarely reach it through other channels.\nThe deaths of the four journalists at Nasser Hospital not only raise the death toll, but also reflect a grim reality that threatens to obscure the truth in Gaza. While media professionals pay with their lives to report on what is happening, the question remains: Who will hold Israel accountable for targeting the press and silencing witnesses to its crimes?\nFeatured image via the Canary"
    },
    {
      "news_title": "Associated Press journalist killed in Israeli strike in Gaza, agency confirms",
      "news_link": "https://abcnews.go.com/International/press-journalist-killed-israeli-strike-gaza-agency-confirms/story?id=124944017",
      "bias": "Lean Left",
      "text": "Associated Press journalist killed in Israeli strike in Gaza, agency confirms\nOfficials said four journalists were killed by an airstrike in Khan Younis.\nLONDON -- Four journalists were among at least 14 people killed in an Israeli airstrike at the Nasser Medical Complex in the southern Gaza city of Khan Younis on Monday morning, officials at the Hamas-run Gaza Government Media Office and Health Ministry said.\nHossam Al-Masry, Mohammed Salama, Mariam Dagga and Moaz Abu Taha were the journalists killed, the media office said in a statement.\nDagga, 33, had been working as a freelance journalist for the Associated Press since the conflict began in October 2022, the AP reported.\nThe IDF issued a statement confirming that it launched a strike in the area of Nasser Hospital.\n\"The IDF regrets any harm to uninvolved individuals and does not target journalists as such,\" the statement said. \"The IDF acts to mitigate harm to uninvolved individuals as much as possible while maintaining the safety of IDF troops.\"\nIsrael said its chief of the general staff had ordered an initial inquiry into the incident.\nThis is a developing story. Please check back for updates.\nABC News' Diaa Ostaz, Camilla Alcini and Dorit Long contributed to this report."
    },
    {
      "news_title": "Broadcasted Israeli Strike on Gaza’s Nasser Hospital Kills 5 journalists: What Happened?",
      "news_link": "https://countercurrents.org/2025/08/live-broadcasted-israeli-strike-on-gazas-nasser-hospital-kills-5-journalists-what-happened/",
      "bias": "Left",
      "text": "Gaza (Quds News Network)- Two consecutive Israeli attacks, one of which was live-broadcasted, on the Nasser Hospital in southern Gaza have killed at least 15 people, including five journalists and a civil defense worker, and injured others.\nThe first attack was carried out by a suicide drone, according to local sources, hitting the upper floor of the hospital, including the roof where a couple of journalists were standing.\nThe second airstrike targeted the rescue team responding to the casualties from the initial bombing and journalists covering the attack.\nAt least five journalists were killed in the attack, Gaza’s Government Media Office confirmed. The five are Hussam Al-Masri, a photojournalist with Reuters News Agency, Mohammed Salama, a photojournalist with Al Jazeera, Mariam Abu Daqa, a journalist with several media outlets, including Independent Arabia and AP and Moath Abu Taha, a journalist with NBC News.Ahmad Abu Aziz later succumbed to his injuries, raising the journalists’ death toll to five.\nThe Office said they were killed while they were on a reporting mission at Nasser Hospital, raising the death toll among journalists since the start of the genocide to 244.\nAt least two journalists were also wounded.\nGaza Civil Defense driver Imad Abdel Hakim Al-Shaer was also killed in the attack. Seven other members were injured while trying to rescue the wounded and recover the victims during the second Israeli strike.\nWhat Happened?\nThe first attack was carried out by a suicide drone, according to local sources, hitting the upper floor of the hospital, including the roof where a couple of journalists were standing, killing Hussam Al-Masri, a photojournalist with Reuters News Agency.\nReuters reported that their live video feed from the hospital, which was operated by cameraman al-Masri, suddenly shut down at the moment of the initial strike.\nThen civil defence teams went up, tried to retrieve the bodies, and tried to rescue whoever was wounded. Journalists also went to cover what happened.\nAnd then the Israeli forces targeted the same place again. Another airstrike at the same exact location and this was documented on air.\nJournalists who were covering the first attack were killed and wounded. And also, the members of the Civil Defence team who were trying to retrieve the bodies of those who were killed were also killed and injured.\nThe four other journalists who were killed in the attack are Mohammed Salama, a photojournalist with Al Jazeera, Mariam Abu Daqa, a journalist with several media outlets, including Independent Arabia and AP, Moath Abu Taha, a journalist with NBC News and Ahmed abu Aziz, a journalist with Quds Feed.\nGaza’s Government Media Office said they were killed while they were on a reporting mission at Nasser Hospital, raising the death toll among journalists since the start of the genocide to 244.\nGaza Civil Defense driver Imad Abdel Hakim Al-Shaer was also killed in the attack. Seven other members were injured.\nThe two attacks resulted in the killing of a total of 20.\nThere have been recent appeals from news organizations, senior journalists, and several countries to protect journalists covering the ongoing Israeli assault on Gaza, who are also facing the threat of starvation due to the Israeli blockade on aid.\nEarlier this month, a targeted and deliberate Israeli strike on a media tent near Al-Shifa Hospital in Gaza City killed six journalists, including well-known Al Jazeera correspondent Anad al-Sharif. The Israeli military admitted to al-Sharif’s killing, claiming, without providing any evidence, that he was leading a Hamas cell, a justification frequently used by Israel to justify the killing of journalists documenting its crimes in Gaza.\nSubscribe to Our Newsletter\nGet the latest CounterCurrents updates delivered straight to your inbox."
    },
    {
      "news_title": "Israeli strike on Gaza's Nasser Hospital kills 15, including 4 journalists, health officials say",
      "news_link": "https://www.cbsnews.com/news/israel-gaza-nasser-hospital-strike-journalists-killed-officials-say/",
      "bias": "Lean Left",
      "text": "Israeli strike on Gaza's Nasser Hospital kills 15, including 4 journalists, health officials say\nDeir al-Balah, Gaza Strip — An Israeli airstrike hit the fourth floor of southern Gaza's main hospital Monday, killing at least eight people including four journalists, health officials said. An official with the civil defense rescue agency in Hamas-run Gaza said later that at least 15 people were killed in the strike in total.\nCivil defense spokesman Mahmud Bassal told journalists at the scene that \"the death toll is 15, including four journalists and one civil defense member,\" according to the French news agency AFP.\nThe victims were killed in a double-tap strike on the hospital, with one missile hitting first, then another moments later as rescue crews arrived, the health ministry said.\nKhan Younis' Nasser Hospital, the largest in southern Gaza, has withstood raids and bombardment throughout 22 months of war, with officials citing critical shortages of supplies and staff.\nAsked about the strike and journalists being among the victims, the Israel Defense Forces issued a statement saying it had carried out an attack and adding that it would \"conduct an initial inquiry as soon as possible,\" adding that it regretted \"any harm to uninvolved individuals and does not target journalists as such.\"\nA hospital official told CBS News that four journalists were killed in the Monday morning double-tap strike at Nasser Hospital. The official identified the four as Hossam al-Masri, who worked for the Reuters news agency, Mohammed Salama, who worked for Al Jazeera, and freelance journalists Maryam Abu Daqqa and Moaz Abu Taha.\nThe Associated Press' news director for the Middle East, Jon Gambrell, said in a social media post that Abu Daqqa had \"freelanced for the AP since the Gaza war began.\"\nReuters confirmed that al-Masri had worked for the international news agency. It said photographer Hatem Khaled, who also worked as a contractor for the agency, was wounded.\nAt least one other journalist was wounded in the strike, a hospital official said, identifying the man as Haithem Omar, who also works for Reuters.\nIsrael has come under mounting pressure over the number of journalists being killed in its military operations in Gaza — including in targeted strikes against individuals whom Israeli officials claim were Hamas operatives.\nIsraeli strikes and raids on hospitals are not uncommon. Multiple hospitals have been struck or raided across the Gaza Strip, with Israel claiming its attacks had targeted militants operating inside the medical facilities, without providing evidence.\nIn a statement issued Monday, the Foreign Press Association, which represents journalists working in Israel and the Palestinian territories, said it was \"outraged and in shock\" over the latest killings of media workers.\n\"This is among the deadliest Israeli attacks on journalists working for international media since the Gaza war began,\" the organization said, confirming the identities of the four people killed. \"These strikes hit the exterior staircase of the hospital where journalists frequently stationed themselves with their cameras. The strikes came with no warning.\"\nThe organization demanded an immediate explanation from the IDF and from Israeli Prime Minister Benjamin Netanyahu's office for the strike, adding: \"This has gone on far too long. Too many journalists in Gaza have been killed by Israel without justification. Israel continues to block international journalists from independent access to Gaza. This must be a watershed moment. We appeal to international leaders: do everything you can to protect our colleagues. We cannot do it ourselves.\"\nThe international Committee to Protect Journalists also condemned the Israeli strike. In a statement, the group called on the international community \"to hold Israel accountable for its continued unlawful attacks on the press.\"\n\"Israel's broadcasted killing of journalists in #Gaza continues while the world watches and fails to act firmly on the most horrific attacks the press has ever faced in recent history,\" CPJ Regional Director Sara Qudah said in the group's post. \"These murders must end now. The perpetrators must no longer be allowed to act with impunity.\"\nOn August 11, Israel's military targeted and killed five Al Jazeera journalists in Gaza, including correspondent Anas al-Sharif. The Israel Defense Forces said it had intelligence and documents from Gaza to prove al-Sharif was the head of a Hamas terrorist cell, and the IDF shared undated photos of Al-Sharif with Yahya Sinwar, the top Hamas leader in Gaza, who was killed last October.\nCBS News could not verify the authenticity of the photos. Al Jazeera and al-Sharif had previously dismissed Israel's claims as baseless, The Associated Press reported. Just three weeks ago, al-Sharif had appealed to the Committee to Protect Journalists over fears he might be assassinated.\nA June strike on Nasser Hospital killed three people and wounded 10, according to the health ministry. At the time, Israel's military said it had targeted Hamas militants operating from a command and control center inside the hospital.\nThe Hamas-run health ministry said Sunday that at least 62,686 Palestinians have been killed since Israel launched its war in Gaza in retaliation for the Hamas-led Oct. 7, 2023 terrorist attack that killed some 1,200 Israelis and saw 251 others taken as hostages.\nThe ministry does not distinguish in its figures between fighters and civilians, but it says around half of those killed have been women and children. The U.N. and independent experts consider it the most reliable information available on war casualties, as such figures are difficult to independently verify as Israel does not permit foreign journalists into Gaza.\nIsrael disputes its figures but has not provided its own."
    },
    {
      "news_title": "‘Chaos, disbelief and fear’: Journalists among at least 19 killed in twin strikes on Gaza hospital",
      "news_link": "https://www.smh.com.au/world/middle-east/israeli-airstrikes-hit-gaza-hospital-killing-at-least-15-including-journalists-20250825-p5mpqf.html",
      "bias": "Lean Left",
      "text": "- Graphic content\n- World\n- Middle East\n- Israeli-Palestinian conflict\n‘Chaos, disbelief and fear’: Journalists among at least 19 killed in twin strikes on Gaza hospital\nWarning: Graphic content\nKhan Younis, Gaza Strip: Israel hit southern Gaza’s main hospital with a double missile strike on Monday, killing at least 19 people, including four journalists, medical officials said.\nThe first strike hit a top floor of one of the buildings at Nasser Hospital. Minutes later, as journalists and rescue workers in orange vests rushed up an external staircase to the scene, a second missile hit in the same spot, the head of Nasser’s paediatrics department, Dr Ahmed al-Farra, said.\nMariam Dagga, 33, a visual journalist who had freelanced for Associated Press and other news outlets since the start of the war, was killed, along with a contractor for Reuters, cameraman Hussam al-Masri.\nAl-Jazeera cameraman Mohammed Salama and Moaz Abu Taha, who Al-Jazeera reported had worked for NBC, were also among the dead, health officials said, while photographer Hatem Khaled, another Reuters contractor, was wounded.\nGaza’s Government Media Office said several doctors and civil defence workers were killed, and dozens of people were injured.\nThe Reuters live video feed from the hospital, which was operated by Masri, suddenly shut down at the moment of the initial strike, Reuters footage showed.\n“We are devastated to learn of the death of Reuters contractor Hussam al-Masri and injuries to another of our contractors, Hatem Khaled, in Israeli strikes on the Nasser Hospital in Gaza today,” a Reuters spokesperson said in a statement.\n“We are urgently seeking more information and have asked authorities in Gaza and Israel to help us get urgent medical assistance for Hatem.”\nThe AP said it was shocked and saddened by the death of Dagga, who frequently based herself at Nasser, most recently reporting on the hospital’s doctors struggling to save children from starvation.\n“We are doing everything we can to keep our journalists in Gaza safe as they continue to provide crucial eyewitness reporting in difficult and dangerous conditions,” it said.\nIsrael’s military in a statement confirmed it had struck targets in the area of the hospital. It said it would conduct an investigation into the incident and that “regrets any harm to uninvolved individuals and does not target journalists as such”.\nA British doctor who was working on the floor that was hit just after 10am, Gaza time, said the second strike hit before people could start evacuating from the first.\n“Just absolute scenes of chaos, disbelief, and fear,” the doctor said. People wounded from the strikes – either directly caught in the blast or hit by debris – entered the ward, leaving trails of blood. Stretchers rushed past visitors searching for loved ones. The chaos hit as the hospital was already overwhelmed, with patients with IV drips lying on the floors in the corridors in stifling heat, they said.\nThe journalists’ deaths come two weeks after one of Al-Jazeera’s most recognisable faces reporting from Gaza, Anas al-Sharif, was killed alongside four colleagues in a strike on a tent near Shifa Hospital in Gaza City. Israel accused Sharif of being a Hamas cell leader posing as a journalist, a claim rejected by rights advocates, Al-Jazeera and organisations representing journalists.\nThe Israel-Hamas war has been one of the bloodiest conflicts for media workers, with at least 192 journalists killed in Gaza in the 22-month conflict, according to the Committee to Protect Journalists. Comparatively, 18 journalists have been killed so far in the Russia-Ukraine war, according to the committee.\nThe Palestinian Journalists’ Syndicate condemned Israel for the strikes, saying they represented “an open war against free media, with the aim of terrorising journalists and preventing them from fulfilling their professional duty of exposing its crimes to the world”.\nAside from rare guided tours, Israel has barred international media from covering the war in person. News organisations instead rely largely on Palestinian journalists in Gaza – as well as residents – to show the world what is happening there. Israel often questions the affiliations and biases of Palestinian journalists, but doesn’t permit others in.\nKhan Younis’ Nasser Hospital, the largest in southern Gaza, has withstood raids and bombardment throughout 22 months of war, and officials cite critical shortages of supplies and staff.\nIsrael’s attacks on hospitals are not uncommon in its war against Hamas in Gaza. Hospitals have been struck or raided across the strip, with Israel claiming it was attacking militants operating from inside the medical facilities, without providing evidence.\nA June strike on Nasser Hospital killed three people and wounded 10, according to the health ministry. At the time, Israel’s military said it had targeted Hamas militants operating from a command and control centre inside the hospital. A March strike on the hospital’s surgical unit, days after a ceasefire broke down, killed two people.\nThe health ministry said on Sunday that at least 62,686 Palestinians had been killed in the war. It does not distinguish between fighters and civilians, but says about half have been women and children. The United Nations and independent experts consider it the most reliable source on war casualties. Israel disputes its figures but has not provided its own.\nReuters, AP\nGet a note directly from our foreign correspondents on what’s making headlines around the world. Sign up for our weekly What in the World newsletter."
    },
    {
      "news_title": "Israel-Gaza war: Multiple journalists killed by Israeli strikes on Gaza hospital",
      "news_link": "https://www.thehindu.com/news/international/multiple-journalists-killed-by-israeli-strikes-on-gaza-hospital/article69974625.ece",
      "bias": "Lean Left",
      "text": "Israeli strikes on a hospital in southern Gaza killed four journalists on Monday (August 25, 2025), including a freelancer who worked for The Associated Press, according to health officials.\nMariam Dagga (33), a visual journalist, freelanced for the AP during the war, as well as other news outlets. The AP said in a statement that it was shocked and saddened to learn of Ms. Dagga’s death, along with those of other journalists.\nTwo missiles hit Nasser Hospital in Khan Younis, medical officials said. In all, 19 people were killed, according to Zaher al-Waheidi, head of the Gaza Health Ministry’s records department.\nThe Israel-Hamas war has been one of the bloodiest conflicts for media workers, with at least 192 journalists killed in Gaza in the 22-month conflict, according to the Committee to Protect Journalists. Comparatively, 18 journalists have been killed so far in Russia’s war in Ukraine, according to the CPJ.\nMs. Dagga, who has a 12-year-old son who was evacuated from Gaza earlier in the war, frequently based herself at Nasser, most recently reporting on the hospital’s doctors struggling to save children from starvation.\nIndependent Arabia, the Arabic language version of the British Independent, said Ms. Dagga also worked with the organisation.\n“We are doing everything we can to keep our journalists in Gaza safe as they continue to provide crucial eyewitness reporting in difficult and dangerous conditions,” the AP said.\nAl Jazeera confirmed that its journalist Mohammed Salam was also among those who were killed in the Nasser strike. Reuters reported that its contractor cameraman Hussam al-Masri was killed and its contractor photographer Hatem Khaled was wounded. It was not immediately clear who the fourth journalist killed was.\nThe Israeli military said its troops carried out a strike in the area of Nasser Hospital and that it would conduct an investigation into the incident. The military said it “regrets any harm to uninvolved individuals and does not target journalists as such.” Thibaut Bruttin, the director general of Reporters Without Borders, said press freedom advocates had never seen such a severe step backward for reporters’ safety. He noted that journalists have been killed both in indiscriminate strikes and in targeted attacks that Israel’s military has acknowledged carrying out.\n“They are doing everything they can to silence independent voices that are trying to report on Gaza,” Mr. Bruttin said.\nIn some cases, such as with Al Jazeera correspondent Anas al-Sharif, who was targeted and killed by Israel earlier this month, Israel has accused journalists in Gaza of being part of militant groups. Israel’s military asserted that al-Sharif had led a Hamas cell — an allegation that Al Jazeera and al-Sharif previously dismissed as baseless.\nAside from rare guided tours, Israel has barred international media from covering the war. News organisations instead rely largely on Palestinian journalists in Gaza — as well as residents — to show the world what is happening there. Israel often questions the affiliations and biases of Palestinian journalists but doesn’t permit others in.\nMany of the journalists working in Gaza are facing the same struggles to find food, for themselves and their families, as the people they are covering.\nIn one of Ms. Dagga’s last social media posts on Sunday (August 24, 2025), she published a selfie of herself.\nPublished - August 25, 2025 03:58 pm IST"
    },
    {
      "news_title": "AP freelancer among 4 journalists killed in Israeli strike on hospital in Gaza, health officials say",
      "news_link": "https://www.nvdaily.com/associated_press_national/ap-freelancer-among-4-journalists-killed-in-israeli-strike-on-hospital-in-gaza-health-officials/article_cef3749a-953d-52a9-8a61-2d390a840df3.html",
      "bias": "Center",
      "text": null
    },
    {
      "news_title": "Al Jazeera says cameraman killed in Israeli strike",
      "news_link": "https://www.semafor.com/article/08/25/2025/al-jazeera-says-cameraman-killed-in-israeli-strike",
      "bias": "Lean Left",
      "text": "Al Jazeera said one of its cameramen was among journalists killed as part of Israel’s intensified offensive on Gaza. The latest deaths followed the killing this month of several of the broadcaster’s staff in the enclave, a strike that Israel defended by alleging that the group’s most prominent member was working with Hamas, claims denied by Al Jazeera and, before he died, the journalist himself.\nThe latest attacks in Gaza came with Israel opening up operations to take full control of Gaza City, and just days after a UN-backed body officially declared a famine in parts of the territory. “Today, what was once the cultural and financial hub of the enclave lies in lawless ruins,” CNN said."
    },
    {
      "news_title": "AP freelancer among 4 journalists killed in Israeli strike on hospital in Gaza, health officials say - Boston News, Weather, Sports",
      "news_link": "https://whdh.com/news/ap-freelancer-among-4-journalists-killed-in-israeli-strike-on-hospital-in-gaza-health-officials-say/",
      "bias": "Center",
      "text": "DEIR AL-BALAH, Gaza Strip (AP) — Israeli strikes on a hospital in southern Gaza killed four journalists Monday, including a freelancer who worked for The Associated Press, according to health officials.\nMariam Dagga, 33, a visual journalist, freelanced for the AP during the war, as well as other news outlets. The AP said in a statement that it was shocked and saddened to learn of Dagga’s death, along with those of other journalists.\nTwo missiles hit Nasser Hospital in Khan Younis, medical officials said. In all, 19 people were killed, according to Zaher al-Waheidi, head of the Gaza Health Ministry’s records department.\nThe Israel-Hamas war has been one of the bloodiest conflicts for media workers, with at least 192 journalists killed in Gaza in the 22-month conflict, according to the Committee to Protect Journalists. Comparatively, 18 journalists have been killed so far in Russia’s war in Ukraine, according to the CPJ.\nDagga, who has a 12-year-old son who was evacuated from Gaza earlier in the war, frequently based herself at Nasser, most recently reporting on the hospital’s doctors struggling to save children from starvation. Independent Arabia, the Arabic language version of the British Independent, said Dagga also worked with the organization.\n“We are doing everything we can to keep our journalists in Gaza safe as they continue to provide crucial eyewitness reporting in difficult and dangerous conditions,” the AP said.\nAl Jazeera confirmed that its journalist Mohammed Salam was also among those who were killed in the Nasser strike. Reuters reported that its contractor cameraman Hussam al-Masri was killed and its contractor photographer Hatem Khaled wounded. It was not immediately clear who the fourth journalist killed was.\nThe Israeli military said its troops carried out a strike in the area of Nasser Hospital and that it would conduct an investigation into the incident. The military said it “regrets any harm to uninvolved individuals and does not target journalists as such.”\nThibaut Bruttin, the director general of Reporters Without Borders, said press freedom advocates had never seen such a severe step backward for reporters’ safety. He noted that journalists have been killed both in indiscriminate strikes and in targeted attacks that Israel’s military has acknowledged carrying out.\n“They are doing everything they can to silence independent voices that are trying to report on Gaza,” Bruttin said.\nIn some cases, such as with Al Jazeera correspondent Anas al-Sharif, who was targeted and killed by Israel earlier this month, Israel has accused journalists in Gaza of being part of militant groups. Israel’s military asserted that al-Sharif had led a Hamas cell — an allegation that Al Jazeera and al-Sharif previously dismissed as baseless.\nAside from rare guided tours, Israel has barred international media from covering the war. News organizations instead rely largely on Palestinian journalists in Gaza — as well as residents — to show the world what is happening there. Israel often questions the affiliations and biases of Palestinian journalists but doesn’t permit others in.\nMany of the journalists working in Gaza are facing the same struggles to find food, for themselves and their families, as the people they are covering.\nIn one of Dagga’s last social media posts on Sunday, she published a selfie of herself.\n(Copyright (c) 2024 The Associated Press. All Rights Reserved. This material may not be published, broadcast, rewritten, or redistributed.)"
    },
    {
      "news_title": "4 Journalists Killed In Israeli Strike On Gaza Hospital",
      "news_link": "https://www.ndtv.com/world-news/al-jazeera-journalist-killed-reuters-journalist-killed-4-journalists-killed-in-israeli-strike-on-gaza-hospital-9155143#publisher=newsstand",
      "bias": "Lean Right",
      "text": null
    },
    {
      "news_title": "Israel strikes Gaza hospital, killing 20, including 5 journalists",
      "news_link": "https://www.scmp.com/news/world/middle-east/article/3323070/israel-hits-gaza-hospital-killing-least-15-people-including-journalists",
      "bias": "Center",
      "text": "Israel hits Gaza hospital, killing at least 20 people, including 5 journalists\nThe Israeli military acknowledged targeting Nasser Hospital and expressed ‘regret’ that the strike resulted in civilian casualties\nGaza’s civil defence agency said five journalists were among at least 20 people killed on Monday when Israeli strikes hit a hospital in the south, with Reuters, the Associated Press and Al Jazeera mourning their slain contributors.\nAgency spokesman Mahmud Bassal said “the toll so far is 20 martyrs, including five journalists and one member of the civil defence”, after strikes hit Nasser Hospital in Khan Younis – a large medical complex in the south that has been targeted several times by Israel since the start of the war.\nAccording to media watchdogs, around 200 journalists have been killed in nearly two years of war between Israel and Hamas.\nIn a statement, the Israeli military said its troops on Monday “carried out a strike in the area of Nasser Hospital in Khan Younis.”\n“The Chief of the General Staff instructed to conduct an initial inquiry as soon as possible,” it said, adding it “regrets any harm to uninvolved individuals and does not target journalists as such”.\nThe civil defence’s Bassal said an Israeli explosive drone targeted a building at Nasser Hospital, followed by an air strike as the wounded were being evacuated."
    },
    {
      "news_title": "Multiple journalists killed by Israeli strikes on Gaza’s Nasser Hospital",
      "news_link": "https://www.theglobeandmail.com/world/article-israeli-strike-gaza-nasser-hospital-journalists-killed/",
      "bias": "Center",
      "text": "Israel struck Nasser hospital in the south of the Gaza Strip on Monday, killing at least 20 people, including five journalists who worked for Reuters, the Associated Press, Al Jazeera and others.\nCameraman Hussam al-Masri, a Reuters contractor, was killed near a live broadcasting position operated by Reuters on an upper floor just below the roof of the hospital in Khan Younis in an initial strike, according to Palestinian health officials.\nOfficials at the hospital and witnesses said Israel then struck the site a second time, killing other journalists, as well as rescue workers and medics, who had rushed to the scene to help.\nThe journalists killed included Mariam Abu Dagga, who freelanced for the Associated Press and other outlets, Mohammed Salama, who worked for Qatar-based broadcaster Al Jazeera, Moaz Abu Taha, a freelance journalist who worked with several news organisations including occasionally contributing to Reuters, and Ahmed Abu Aziz.\nPhotographer Hatem Khaled, also a Reuters contractor, was wounded.\nIsraeli strikes on Nasser Hospital in Gaza on Monday killed at least 15 people, including four journalists, one of whom worked for Reuters, Palestinian health officials said.\nReuters\nIsrael’s military, the Israel Defense Forces, acknowledged striking the area of Nasser hospital and said the chief of the general staff had ordered an inquiry.\nThe IDF “regrets any harm to uninvolved individuals and does not target journalists as such. The IDF acts to mitigate harm to uninvolved individuals as much as possible while maintaining the safety of IDF troops,” it said.\nA Reuters spokesperson said in a statement: “We are devastated to learn that cameraman Hussam al-Masri, a contractor for Reuters, was killed this morning in Israeli strikes on Nasser hospital in Khan Younis in Gaza. Moaz Abu Taha, a freelance journalist whose work had been occasionally published by Reuters, was also killed, and photographer Hatem Khaled, a Reuters contractor, was wounded.”\n“We are urgently seeking more information and have asked authorities in Gaza and Israel to help us get urgent medical assistance for Hatem,” the spokesperson added.\nThe AP said it was “shocked and saddened” to learn of the deaths of Abu Dagga and other journalists, adding that Abu Dagga had often based herself at the hospital for coverage, which recently included stories on starving and malnourished children.\nThe Palestinian Journalists Syndicate condemned Israel for the strikes, saying it represented “an open war against free media, with the aim of terrorising journalists and preventing them from fulfilling their professional duty of exposing its crimes to the world.”\nThe first Israeli strike at around 10:10 a.m. hit the hospital’s fourth floor, where surgical operating rooms and doctor’s residences are located, killing at least two people, said Zaher al-Waheidi, head of Gaza’s Health Ministry’s records department.\nThe second strike on the stairwell killed 17 others, including medical teams, rescuers, journalists and others rushing upstairs, al-Waheidi told the Associated Press.\nA British doctor working on the floor that was hit said the second strike came before people could start evacuating from the first.\n“Just absolute scenes of chaos, disbelief, and fear,” the doctor said. They described people wounded from the strikes entering the ward and leaving trails of blood. The hospital was already overwhelmed, with patients with IV drips lying on the floor in the corridors in stifling heat.\nThe doctor spoke on condition of anonymity in line with regulations from their organization to avoid reprisals from Israeli authorities. “It leaves me in another state of shock that hospitals can be a target,” the doctor said. “You go to work as a health care professional and you should be protected in the place you work. But you are not.”\nWhat we know so far as Israel prepares its Gaza City offensive\nIn Gaza, the only choices are stay under bombardment or flee to overcrowded shelters\nNasser Hospital has withstood raids and bombardment during the war, with officials repeatedly noting critical shortages of supplies and staff. A June strike on the hospital killed three people, according to the Health Ministry. A March strike on its surgical unit days after Israel ended a ceasefire killed two people.\nMore than 240 Palestinian journalists have been killed by Israeli fire in Gaza since the war started on Oct. 7, 2023, according to the Palestinian Journalists Syndicate.\nTwo weeks ago, Israel killed prominent Al Jazeera correspondent Anas Al-Sharif and four other journalists in a strike. In that attack, Israel acknowledged targeting Sharif and said that he worked for the Hamas militant group, which the broadcaster denied.\nMasri operated a Reuters live video feed from the hospital, which suddenly shut down at the moment of the initial strike on Monday.\nReuters and other news providers often deliver live video feeds to media outlets worldwide during major news events to show the scene from the ground in real time. Reuters had frequently broadcast a feed from Nasser hospital during the Gaza conflict, and for the past several weeks had been delivering daily feeds from the Nasser hospital position that was hit.\nIsrael has barred all foreign journalists from entering the Gaza Strip since the start of the war in 2023. Reporting from the territory throughout the war has been produced by Palestinian journalists, many of whom have worked for many years for international media organizations, including wire services such as Reuters and the Associated Press.\nIsrael has also separately said it is investigating the death of Issam Abdallah, a Reuters journalist killed in southern Lebanon by Israeli tank fire in October, 2023, after the Gaza conflict erupted. Israel has not announced any findings.\nWith a report from the Associated Press"
    },
    {
      "news_title": "4 journalists killed in Israeli attacks on Gaza hospital",
      "news_link": "https://www.newslaundry.com/2025/08/25/4-journalists-killed-in-israeli-attacks-on-gaza-hospital",
      "bias": "Lean Left",
      "text": "The journalists were reportedly killed in separate strikes at the same location.\nFour journalists have reportedly been killed in an Israeli attack on the Nasser Hospital in Gaza.\nAccording to Gaza’s government media office, they were identified as Reuters photojournalist Hossam al-Masri, Al Jazeera photojournalist Mohammed Salama, Mariam Abu Daqa, who was a journalist with several media outlets such as the The Independent Arabic and Associated Press, and NBC journalist Moaz Abu Taha.\nThis raises the toll of journalists killed in the region to 244, according to Gaza’s government media office.\nAn Al Jazeera report quoted Hind Khoudary, their journalist reporting from Deir Al Balah in Gaza, to recall the series of events.\n“The Israeli forces launched an explosive suicide drone, where it hit the rooftop of Nasser hospital where at least a journalist was killed. Then civil defence teams went up, tried to retrieve the body, tried to rescue whoever was wounded. Journalists also went to document what happened. And then the Israeli forces targeted the same place again. Another airstrike at the same exact location and this is actually documented on air. Now, what happened is journalists that were covering this have been killed and wounded. And also, the civil defence teams that were trying to retrieve the bodies of those who were killed were also killed,” she was quoted as saying.\nKhoudary said she was also among journalists who report from hospitals.\n“We are in a two-year war where we have been deprived of electricity and internet so Palestinian journalists are using these services at hospitals to continue reporting. We have always following the wounded Palestinians, funeral, malnutrition cases as these are always transferred to hospitals. That is why Palestinian journalists are making hospitals their base and end up being targeted,” she said, according to Al Jazeera.\nFor months, doctors who worked in Gaza, along with aid organisations and international rights groups, warned that the enclave was on the verge of famine. Harrowing accounts and images of starvation emerged, as Gaza’s civil defence repeatedly reported that children were dying every day from hunger. Israel, waging war in Gaza for nearly two years, dismissed these accounts as false, while its Western allies offered little more than symbolic concern. Last week, the UN-backed Integrated Food Security Phase Classification confirmed that a fully “man-made famine” is underway in Gaza’s largest city and nearby areas – the first officially recognised famine in West Asia. According to the IPC, one in five households is facing extreme food shortages, more than a third of children are acutely malnourished, and at least two in every 10,000 people are dying daily from starvation or the combined effects of malnutrition and disease.\nRejecting international calls for a ceasefire, the Israeli army has pursued a brutal offensive on Gaza since October 7, 2023, killing more than 60,000 Palestinians, most of them women and children. Last November, the International Criminal Court issued arrest warrants for Israeli Prime Minister Benjamin Netanyahu and his former Defense Minister Yoav Gallant for war crimes and crimes against humanity in Gaza.\nIsrael also faces a genocide case at the International Court of Justice for its war on the enclave.\nIn times of misinformation, you need news you can trust. We’ve got you covered. Subscribe to Newslaundry and power our work."
    },
    {
      "news_title": "5 journalists among 20 killed in Israeli strike on Gaza hospital",
      "news_link": "https://www.dailysabah.com/world/mid-east/5-journalists-among-20-killed-in-israeli-strike-on-gaza-hospital",
      "bias": "Right",
      "text": "At least five journalists were among 20 people killed in Israeli strikes on Nasser Hospital in Gaza on Monday, Palestinian health officials said.\nThe four journalists were Mohammed Salama, a photojournalist with Al Jazeera; Mariam Abu Daqa, who worked for several media outlets, including The Independent Arabic and Associated Press; Moaz Abu Taha, a journalist with the NBC network and cameraman Hussam al-Masri, a Reuters contractor.\nGaza's civil defense agency spokesperson Mahmud Bassal said \"the toll so far is 20 martyrs, including five journalists and one member of the civil defense,\" after strikes hit Nasser Hospital in Khan Younis – a large medical complex in the south that has been targeted several times by Israel since the start of the war.\nAccording to media watchdogs, over 200 journalists have been killed in Israel's nearly two years of war on Gaza.\nIn a statement, the Israeli military said its troops on Monday \"carried out a strike in the area of Nasser Hospital in Khan Younis.\"\n\"The Chief of the General Staff instructed to conduct an initial inquiry as soon as possible,\" it said, adding it \"regrets any harm to uninvolved individuals and does not target journalists as such.\"\nThe civil defence's Bassal said an Israeli explosive drone targeted a building at Nasser Hospital, followed by an airstrike as the wounded were being evacuated.\nA spokesperson for Qatar-based TV network Al Jazeera on Monday said its photojournalists and cameramen, Salama, was killed in the attack.\n\"Al Jazeera Media Network condemns, in the strongest possible terms, this horrific crime committed by the Israeli occupation forces, who have directly targeted and assassinated journalists as part of a systematic campaign to silence the truth,\" the broadcaster said in a statement.\nThe Associated Press said in a statement that it was \"shocked and saddened\" to learn of the death of Daqa, 33, a visual journalist who had freelanced for the agency since the start of the war.\nIn an earlier statement, it said Daqa had not been on an assignment with the agency when she was killed.\nA spokesperson for Reuters said: \"We are devastated to learn of the death of Reuters contractor Hussam al-Masri and injuries to another of our contractors, Hatem Khaled, in Israeli strikes on the Nasser hospital in Gaza today.\"\n\"We are urgently seeking more information and have asked authorities in Gaza and Israel to help us get urgent medical assistance for Hatem,\" the spokesperson added in a statement.\nThe Palestinian Journalists Syndicate confirmed the killing of Abu Taha and Ahmad Abu Aziz.\nAccording to AFP journalists, Abu Taha had worked with some Palestinian and international outlets.\nMedia restrictions in Gaza and difficulties in accessing many areas mean AFP is unable to independently verify the tolls and details provided by the civil defense agency or the Israeli military.\nAFP footage from the immediate aftermath of the attack showed smoke filling the air and debris from the blast on the floor outside the hospital.\nPalestinians rushed to help the victims, carrying bloodied bodies and severed body parts into the medical complex. One body could be seen dangling from the top floor of the targeted building as a man screamed below.\nA woman wearing medical scrubs and a white coat was among the injured, carried into the hospital on a stretcher with a heavily bandaged leg and blood all over her clothes.\nNasser Hospital is one of the last remaining health facilities in the Gaza Strip that is at least partially functioning.\nBefore the latest killings, media advocacy groups the Committee to Protect Journalists (CPJ) and Reporters Without Borders said around 200 journalists had been killed in the Gaza war.\nEarlier this month, four Al Jazeera staff and two freelancers were killed in an Israeli air strike outside al-Shifa hospital in Gaza City, prompting widespread condemnation.\nThe Israeli military alleged that Anas al-Sharif – a prominent Al Jazeera correspondent killed in the strike – headed a Hamas cell and was \"responsible for advancing rocket attacks\" against Israelis.\nThe CPJ slammed that strike, saying journalists should never be targeted in war.\nThe war in Gaza was sparked by the October 2023 Hamas incursion, which caused 1,219 deaths, according to an AFP tally based on official figures.\nIsrael's genocidal war, in comparison, has killed at least 62,744 Palestinians, most of them civilians, according to figures from the Health Ministry."
    },
    {
      "news_title": "Israel bombs Gaza hospital, killing five journalists",
      "news_link": "https://www.newarab.com/news/israel-bombs-gaza-hospital-killing-five-journalists",
      "bias": "Lean Left",
      "text": "At least 54 Palestinians have been killed in Israeli attacks across Gaza since dawn on Monday, medical sources tell Al Jazeera Arabic.\nBreadcrumb\nAt least 19 people - including five journalists - were killed in an Israeli attack on southern Gaza's main hospital on Monday morning, according to the Gaza health ministry.\nThe ministry said the fourth floor of Nasser Hospital in Khan Younis was attacked in a 'double tap' strike', with one missile hitting the facility followed by a second targeting emergency responders.\nReuters cameraman Hossam al-Masri, Al Jazeera photojournalist Mohammed Salama, photographer Mariam Abu Daqqa, and Muath Abu Taha, a journalist working for NBC, and journalist Ahmed Abu Aziz were all killed in the attack.\nGaza's civil defence said that at least one emergency responder was killed and seven others were injured.\nEarlier, at least 20 people were killed in Israeli attacks across Gaza on Monday, including one person seeking aid.\nAnother 11 people have died of starvation over the past 24 hours, including two children, as Israel's restrictions on aid push Gaza deeper into famine.\nMalnutrition has now claimed the lives of 300 people, including 117 children, since the war started on 7 October 2023, according to the Gaza health ministry said this morning.\nMeanwhile, Israel's military chief Lt. Gen. Eyal Zamir has again called on Prime Minister Benjamin Netanyahu to back down on plans to occupy Gaza City and agree to the ceasefire proposed by Qatar and Egypt last week.\n\"There is a [captive] deal on the table, we need to take it,\" he was quoted as saying during a visit to the Haifa naval base by Israel's Channel 13 News.\n\"The Israeli military brought about the conditions for a deal, now it is in Netanyahu’s hands,\" he reportedly said.\nNetanyahu's decision to press ahead with plans to occupy Gaza City is opposed by many in the country's defence establishment, including Zamir. More than 600 former security and military chiefs earlier this month issued a plea to US president Donald Trump to force Netanyahu to end the war.\nThe Committee to Protect Journalists, Reporters San Frontiers and the International Federation of Journalists have condemned Israel's killing of five journalists at the Nasser Hospital.\nCPJ’s Regional Director Sara Qudah called Israel's repeated targeting of journalists \"the most horrific attacks the press has ever faced in recent history\".\n\"These murders must end now. The perpetrators must no longer be allowed to act with impunity,\" she said in a statement.\nMore than 200 journalists have been killed in Israeli attacks in Gaza since 7 October 2023.\nRSF reiterated its call for an emergency UN Security Council resolution to prevent Israel from continuing to kill of journalists and allow international reporters to enter Gaza.\nMeanwhile, the IFJ said it \"strongly condemns the latest war crime perpetrated by Israel\".\n\"To date, the IFJ has recorded at least 217 Palestinian journalists killed by Israeli forces since the war started on 7 October 2023. We demand JUSTICE,\" it wrote on social media.\nSpain's foreign minister has condemned Israel's attack on Nasser Hospital, calling it an \"extremely serious violation of international humanitarian law\".\n\"The Israeli attack today against a hospital in Gaza and against journalists, the deaths it has caused, the induced famine, all of these are extremely serious violations of international humanitarian law,\" José Manuel Albares wrote in a post on X.\n\"The war in Gaza must end now. Spain works every day for that.\"\nMeanwhile, UK Foreign Secretary David Lammy said he was \"horrified\" by the attack.\nFour healthcare workers were among the 20 people killed in Israel's attack on the Nasser Hospital in southern Gaza earlier today, the head of the World Health Organisation has said.\nTedros Adhanom Ghebreyesus said that more than 50 people were injured in the 'double tap' strike, which also killed five journalists and emergency responders.\nThe strike hit the hospital’s main building, which houses the emergency department, inpatient ward, and surgical unit, damaging the emergency staircase, he wrote in a post on X.\n\"While people in Gaza are being starved, their already limited access to health care is being further crippled by repeated attacks,\" he said.\n\"We cannot say it loudly enough: STOP attacks on health care. Ceasefire now!\"\n.@WHO received reports of two strikes on the Nasser Medical Complex this morning, resulting in the deaths of at least 20 people, including four health workers and five journalists. Fifty others were injured, among them critically ill patients who were already receiving care.\n— Tedros Adhanom Ghebreyesus (@DrTedros) August 25, 2025\nThe… pic.twitter.com/XzTM4u0pAt\nThe United Nations insisted Monday that journalists and hospitals should never be targeted, after an Israeli strike on a hospital killed at least 20 people including five journalists.\n\"The killing of journalists in Gaza should shock the world - not into stunned silence but into action, demanding accountability and justice,\" UN rights office spokeswoman Ravina Shamdasani said in a statement, insisting: \"Journalists are not a target. Hospitals are not a target.\"\n(AFP)\nThe Palestinian Red Crescent has said one of its medics was injured in an attack while he was treating the wounded outside Nasser Hospital earlier today.\nThe humanitarian organisation posted a video on X appearing to show bullet holes in the windscreen and the side of a PRCS ambulance.\nOn Wednesday morning, the Israeli military conducted a 'double tap' strike on the hospital, killing at least 20 people, including five journalists and a number of medics and emergency responders.\nToday, a Palestine Red Crescent medic was injured while performing his humanitarian duty inside Nasser Medical Hospital in Khan Yunis, as he assisted the wounded following the Israeli occupation’s attack on the hospital.#Gaza pic.twitter.com/ckSWUagl9h\n— PRCS (@PalestineRCS) August 25, 2025\nPrime Minister Benjamin Netanyahu on Monday said Israel was ready to back Lebanon's efforts to disarm Hezbollah and offered \"a phased\" pullout of its troops if Beirut followed through with plans to seize the group's weapons.\nFollowing the war between Israel and Iran-backed Hezbollah last year, the Lebanese army has been deploying in the country's south and dismantling the militant group's infrastructure there.\nLebanon has been grappling with the thorny issue of disarming Hezbollah, with the cabinet this month tasking the army with developing a plan to do so by the end of the year.\nDespite the November ceasefire that ended the war, Israel has continued to strike Lebanon, saying it will do so until Hezbollah is disarmed.\nIsraeli forces also continue to occupy five areas of the south that they deem strategic.\n\"Israel stands ready to support Lebanon in its efforts to disarm Hezbollah and to work together towards a more secure and stable future for both nations,\" said Netanyahu, according to a statement released by his office.\nBelgium's foreign minister on Monday called for tougher action against Israel, on the same day five Palestinian journalists were killed in a strike against the al-Nasser Hospital.\n\"If the government does not take a tougher stance on human rights violations by the Israeli government or recognise Palestine, there is a risk of a major crisis,\" Maxime Prevot, who is also the deputy PM, told De Standaard on Monday.\nHe added that for him, Gaza is a \"crucial issue\".\nSyria on Monday strongly condemned Israel's military incursion in the Damascus countryside, Reuters reported.\nThe founder of the fashion label Boxfresh issued a statement stating he has been banned from Brighton and Hove Albion football club for wearing a Palestine shirt.\nRoger Wade said he had been banned for five matches after wearing the kit at a Fulham game.\nThe shirt does not contain any political statements, but features the word 'Palestine' at the front, along with the flag.\nWade added that stewards confronted him and asked him to leave the area without providing a reason, and once he complained, he was issued a letter stating he had been banned.\nThe Turkish presidency condemned Israel's attack on Gaza's Nasser Hospital on Monday, saying that the country \"has added yet another to its list of crimes against humanity and war crimes\".\nAt least 20 people were killed in two separate attacks on the hospital. Among them were five journalists and several doctors and emergency responders.\n\"Press freedom and human values have once again been targeted, under the shadow of genocide, amidst the anguished cries of the innocent,\" Burhanettin Duran, the head of the Turkish presidential communications directorate, wrote on social media.\nHe continued: \"Israel, which continues its oppressions without regard for any humanitarian or legal principles, is under the delusion that it can prevent the truth from being reported through its systematic attacks on journalists. It is pursuing the extermination of a nation under blockade and genocide.\"\nThe Foreign Press Association on Monday called for an \"immediate explanation\" from the Israeli military and prime minister's office, after an Israeli strike on a hospital killed five journalists.\n\"We demand an immediate explanation from the Israel Defense Forces and the Israeli prime minister's office. We call on Israel once and for all to halt its abhorrent practice of targeting journalists,\" the group said in a statement.\nThe death toll from Israel's attack on Nasser Hospital has risen to 20, according to Gaza’s Government Media Office.\nFive journalists and several doctors and civil defence workers were among the dead.\nThe number of journalists killed in Israel's 22-month war on Gaza has now reached 245.\nThe Israeli military killed 58 people and wounded 308 others in Gaza in the past 24 hours, according to the local health ministry.\nAmong the dead were 28 people who were killed trying to receive aid. More than 2,100 aid seekers have been killed since the end of May, when the Israel- and US-backed Gaza Humanitarian Foundation took control of aid distribution in the strip.\nThe overall death toll since 7 October 2023 has risen to 62,744 and 158,259 others have been injured, it said in its daily report. Thousands of others are thought to be buried beneath the rubble.\nReuters and the Associated Press said they were devastated after contributing journalists were killed in an Israeli strike on Nasser Hospital on Monday.\n\"We are devastated to learn of the death of Reuters contractor Hussam al-Masri and injuries to another of our contractors, Hatem Khaled, in Israeli strikes on the Nasser hospital in Gaza today,\" a Reuters spokesperson said in a statement.\nIn a statement, the AP said that it was \"shocked and saddened\" to learn of the death of Mariam Abu Daqqa, 33, a visual journalist who freelanced for the agency since the start of the war.\n(AFP and TNA staff)\nThe Israeli military has issued a statement confirming that it launched an attack \"in the area of Nasser Hospital\" but did not disclose what it was targeting.\nIsrael conducted a 'double tap' strike on the hospital earlier today, with an explosive drone hitting the fourth floor of of the hospital followed by a second when emergency responders had reached the scene.\nFive journalists and an unknown number of emergency workers were killed.\nIt repeated previous claims that it does not intentionally target journalists and said it would open an investigation.\nIsrael has killed 244 media workers since 7 October 2023, according to the Gaza Government Media Office.\nAn official at Nasser Hospital has told Al Jazeera that another journalist, Ahmed Abu Aziz, has died following Israel's attack on the facility earlier today.\nFive journalists have now died following Israel's 'double tap' strike on the hospital, the only functioning hospital that remains in southern Gaza.\nThe Gaza health ministry has condemned Israel's strikes on Nasser Hospital as a \"heinous crime\" and urged the international community to protect what remains of Gaza's healthcare system and humanitarian workers.\n\"The Palestinian Ministry of Health – Gaza strongly condemns in the harshest terms the heinous crime committed by the Israeli occupation through its direct targeting of Nasser Medical Complex in Khan Younis this morning, which is the only functioning public hospital in the southern Gaza Strip,\" it said in a statement.\nIt continued: \"The occupation’s attack on the hospital today, killing medical teams, journalists, and civil defense crews, is a continuation of the systematic destruction of the health system, an ongoing genocide, and a blatant message of defiance to the entire world and to all values of humanity and justice.\"\nSyria's interim president, Ahmed al-Sharaa, will speak at the United Nations General Assembly next month, a foreign ministry official told AFP on Monday.\nSharaa \"will take part in the United Nations General Assembly in New York where he will deliver a speech\", the official said, requesting anonymity as they were not authorised to brief the media, adding that he will be the first Syrian president to address the assembly since 1967.\n(AFP)\nReuters says that photojournalist Hatem Khaled was injured in the second strike to hit Nasser Hospital.\nHis colleague, photojournalist Hossam al-Masri, among the four journalists killed in the attack earlier this morning.\nThe Organisation of Islamic Cooperation (OIC) will hold an emergency meeting in Jeddah on Monday to discuss the situation in Gaza.\n\"This extraordinary meeting aims to coordinate joint positions and efforts to confront the decisions and plans aiming to enshrine the full Israeli occupation and control over the Gaza Strip, as well as the Israeli crimes of genocide, starvation, displacement, blockade and the unprecedented humanitarian crisis in the Gaza Strip,\" the 57-member organisation said in a statement.\nThe United Nations Security Council will vote Monday on the future of the blue helmet peacekeeping mission in southern Lebanon that has faced US and Israeli opposition.\nThe council will vote on a French-drafted compromise that would keep the United Nations Interim Force in Lebanon (UNIFIL), deployed in 1978 to separate Israel and Lebanon, in place for one more year while it prepares to withdraw.\nIn the latest draft text seen by AFP, the council would signal \"its intention to work on a withdrawal of UNIFIL with the aim of making the Lebanese Government the sole provider of security in southern Lebanon.\"\nIt was not clear if the US - which has been pushing alongside Israel to dismantle the peacekeeping force - would accept the compromise language, with a State Department spokesman previously telling AFP it would not comment on Council deliberations.\n(AFP)\nWith today's bombing of the Nasser Hospital, the Israeli military has now killed 244 media workers since 7 October 2023, according to the Gaza Government Media Office.\nThe number of people killed in the Israeli attack on Nasser Hospital has risen to 14, medics at the facility have told Al Jazeera.\nIsrael's airstrike on Nasser Hospital killed four journalists, according to reports.\nReuters photojournalist Hossam al-Masri, Al Jazeera photojournalist Mohammed Salama, journalist Mariam Abu Daqqa, who worked with the Associated Press and Independent Arabia, and Moaz Abu Taha, a journalist working for NBC, were all reportedly killed in the attack.\nAt least eight people were killed in an Israeli attack on southern Gaza's main hospital on Monday morning, according to the Gaza health ministry.\nThe ministry said the fourth floor of Nasser Hospital in Khan Younis was attacked in a 'double tap' strike', with one missile hitting the facility followed by a second targeting emergency responders\nReports say that a number of journalists were among those killed in the attack.\nAnother 11 people have died of starvation in Gaza over the past 24 hours, including two children, the local health ministry said this morning.\nMalnutrition has now claimed the lives of 300 people, including 117 children, since the war started on 7 October 2023.\nIsrael's military chief Lt. Gen. Eyal Zamir has urged Prime Minister Benjamin Netanyahu to agree to the ceasefire proposed by Qatar and Egypt last week, according to Israeli media.\n\"There is a [captive] deal on the table, we need to take it,\" he was quoted as saying during a visit to the Haifa naval base by Israel's Channel 13 News.\n\"The Israeli military brought about the conditions for a deal, now it is in Netanyahu’s hands,\" he reportedly said.\nNetanyahu's decision to press ahead with plans to occupy Gaza City is opposed by many in the country's defence establishment, including Zamir. More than 600 former security and military chiefs earlier this month issued a plea to US president Donald Trump to force Netanyahu to end the war.\nHamas last week agreed to a ceasefire proposed by Qatar and Egypt, which would see it free around half of the remaining captives in exchange for a 60-day truce, a surge of aid into Gaza, and the release of some Palestinian detainees.\nNetanyahu has not responded to the proposal and instead pushed ahead with plans to displace hundreds of thousands of Palestinians from northern Gaza and besiege Gaza City.\nAt least 20 people have been killed in Israeli attacks in Gaza on Monday, medical sources tell Al Jazeera Arabic.\nIsrael continued its bombardment across Gaza overnight on Monday, bombing Gaza City, Khan Younis and Nuseirat refugee camp in central Gaza.\nAn Israeli air attack on aid seekers in central Gaza reportedly killed at least one person and injured six."
    },
    {
      "news_title": "At least 20 killed, including five journalists, in Israeli strikes on Gaza's Nasser hospital",
      "news_link": "https://www.france24.com/en/middle-east/20250825-at-least-15-killed-including-four-journalists-in-israeli-strikes-on-gaza-s-nasser-hospital",
      "bias": "Center",
      "text": "At least 20 killed, including five journalists, in Israeli strikes on Gaza's Nasser hospital\nAt least 20 people were killed, including five journalists, in Israeli air strikes Monday on Gaza's Nasser Hospital, Palestinian health officials said. More than 240 Palestinian journalists have been killed by Israeli forces in Gaza since the war began on October 7, 2023, according to the Palestinian Journalist Syndicate.\nTo display this content from YouTube, you must enable advertisement tracking and audience measurement.\nOne of your browser extensions seems to be blocking the video player from loading. To watch this content, you may need to disable it on this site.\nGaza's civil defence agency said five journalists were among at least 20 people killed Monday when Israeli strikes hit a hospital in the south, with Reuters, the Associated Press and Al Jazeera mourning their slain contributors.\nAgency spokesman Mahmud Bassal said \"the toll so far is 20 martyrs, including five journalists and one member of the civil defence,\" after strikes hit Nasser Hospital in Khan Younis – a large medical complex in the south that has been targeted several times by Israel since the start of the war.\nIsrael has struck or raided hospitals repeatedly throughout the war, justifying its attacks by saying it is targeting militants operating inside the medical facilities, without providing evidence.\nHospitals have been overwhelmed by war wounded and now by increasing numbers of malnourished as parts of Gaza slide into famine. Palestinians are also facing an escalated Israeli offensive into Gaza City, which threatens a greater wave of displacement.\nAccording to media watchdogs, around 200 journalists have been killed in nearly two years of war between Israel and Hamas.\nIn a statement, the Israeli military said its troops on Monday \"carried out a strike in the area of Nasser Hospital in Khan Younis\".\n\"The Chief of the General Staff instructed to conduct an initial inquiry as soon as possible,\" it said, adding it \"regrets any harm to uninvolved individuals and does not target journalists as such\".\nRead more'Death follows us everywhere': Israel pounds Gaza City as it vows to press on with offensive\nThe civil defence's Bassal said an Israeli explosive drone targeted a building at Nasser Hospital, followed by an air strike as the wounded were being evacuated.\nA spokesperson for Qatar-based TV network Al Jazeera on Monday said one of its photojournalists and cameramen, Mohammad Salama, was killed in the attack.\n\"Al Jazeera Media Network condemns, in the strongest possible terms, this horrific crime committed by the Israeli occupation forces, who have directly targeted and assassinated journalists as part of a systematic campaign to silence the truth,\" the broadcaster said in a statement.\nThe Associated Press said in a statement that it was \"shocked and saddened\" to learn of the death of Mariam Dagga, 33, a visual journalist who had freelanced for the agency since the start of the war.\nIn an earlier statement, it said Dagga had not been on an assignment with the agency when she was killed.\nA spokesperson for Reuters said: \"We are devastated to learn of the death of Reuters contractor Hussam al-Masri and injuries to another of our contractors, Hatem Khaled, in Israeli strikes on the Nasser hospital in Gaza today.\"\n\"We are urgently seeking more information and have asked authorities in Gaza and Israel to help us get urgent medical assistance for Hatem,\" the spokesperson added in a statement.\nThe Palestinian Journalists Syndicate also named two other victims as Moaz Abu Taha and Ahmad Abu Aziz.\nAccording to AFP journalists, Abu Taha had worked with some Palestinian and international outlets.\nTo display this content from YouTube, you must enable advertisement tracking and audience measurement.\nOne of your browser extensions seems to be blocking the video player from loading. To watch this content, you may need to disable it on this site.\nSmoke, bloodied bodies\nIsrael does not allow international news organisations into Gaza to report freely, so many organisations rely on Gaza-based reporters for coverage.\nAFP footage from the immediate aftermath of the attack showed smoke filling the air and debris from the blast on the floor outside the hospital.\nPalestinians rushed to help the victims, carrying bloodied bodies and severed body parts into the medical complex. One body could be seen dangling from the top floor of the targeted building as a man screamed below.\nA woman wearing medical scrubs and a white coat was among the injured, carried into the hospital on a stretcher with a heavily bandaged leg and blood all over her clothes.\nNasser Hospital is one of the last remaining health facilities in the Gaza Strip that is at least partially functioning.\nRead more'Far too late': Palestinian despair mounts after UN declaration of famine in Gaza\nBefore the latest killings, media advocacy groups the Committee to Protect Journalists (CPJ) and Reporters Without Borders said around 200 journalists had been killed in the Gaza war.\nEarlier this month, four Al Jazeera staff and two freelancers were killed in an Israeli air strike outside Al-Shifa hospital in Gaza City, prompting widespread condemnation.\nThe Israeli military alleged that Anas al-Sharif – a prominent Al Jazeera correspondent killed in the strike – headed a Hamas \"terrorist cell\" and was \"responsible for advancing rocket attacks\" against Israelis.\nThe CPJ slammed that strike, saying journalists should never be targeted in war.\nThe war in Gaza was sparked by Hamas's October 2023 attack on Israel, which resulted in the deaths of 1,219 people, mostly civilians, according to an AFP tally based on official figures.\nIsrael's offensive has killed at least 62,744 Palestinians, most of them civilians, according to figures from the health ministry in Hamas-run Gaza that the United Nations considers reliable.\n(FRANCE 24 with AP and AFP)"
    },
    {
      "news_title": "Israeli Airstrike on Southern Gaza Hospital Kills 19, Including 4 Journalists, Hospital Says",
      "news_link": "https://english.aawsat.com/arab-world/5178802-israeli-airstrike-southern-gaza-hospital-kills-19-including-4-journalists",
      "bias": "Lean Right",
      "text": "Israel struck Nasser hospital in the south of the Gaza Strip on Monday, killing at least 20 people, including five journalists who worked for Reuters, the Associated Press, Al Jazeera and others.\nCameraman Hussam al-Masri, a Reuters contractor, was killed near a live broadcasting position operated by Reuters on an upper floor just below the roof of the hospital in Khan Younis in an initial strike, Palestinian health officials said.\nOfficials at the hospital and witnesses said Israel then struck the site a second time, killing other journalists as well as rescue workers and medics, who had rushed to the scene to help.\nThe journalists killed included Mariam Abu Dagga, who freelanced for the Associated Press and other outlets, Mohammed Salama, who worked for Qatar-based broadcaster Al Jazeera, Moaz Abu Taha, a freelance journalist who worked with several news organizations including occasionally contributing to Reuters, and Ahmed Abu Aziz.\nPhotographer Hatem Khaled, also a Reuters contractor, was wounded.\nIsrael's military acknowledged striking the area of Nasser hospital and said the chief of the general staff had ordered an inquiry.\nThe army \"regrets any harm to uninvolved individuals and does not target journalists as such. The army acts to mitigate harm to uninvolved individuals as much as possible while maintaining the safety of troops,\" it said.\nA Reuters spokesperson said in a statement: \"We are devastated to learn that cameraman Hussam al-Masri, a contractor for Reuters, was killed this morning in Israeli strikes on Nasser hospital in Khan Younis in Gaza. Moaz Abu Taha, a freelance journalist whose work had been occasionally published by Reuters, was also killed, and photographer Hatem Khaled, a Reuters contractor, was wounded.\"\n\"We are urgently seeking more information and have asked authorities in Gaza and Israel to help us get urgent medical assistance for Hatem,\" the spokesperson added.\nRISING DEATH TOLL\nThe AP said it was \"shocked and saddened\" to learn of the deaths of Abu Dagga and other journalists, adding that Abu Dagga had often based herself at the hospital for coverage, which recently included stories on starving and malnourished children.\nThe Palestinian Journalists Syndicate condemned Israel for the strikes, saying it represented \"an open war against free media, with the aim of terrorizing journalists and preventing them from fulfilling their professional duty of exposing its crimes to the world\".\nThe syndicate said more than 240 Palestinian journalists have been killed by Israeli fire in Gaza since the war started on October 7, 2023.\nThe Committee to Protect Journalists, which put the number of journalists and media workers killed since the war began at 197 including 189 Palestinians in Gaza, called for \"the international community to hold Israel accountable for its continued unlawful attacks on the press\".\nTwo weeks ago, Israel killed prominent Al Jazeera correspondent Anas Al-Sharif and four other journalists in a strike. In that attack, Israel acknowledged targeting Sharif and said he worked for the Hamas group, which the broadcaster denied.\nWitnesses said Monday's second strike took place after rescue workers, journalists and others had rushed to the site of the initial attack.\nThe Reuters live video feed from the hospital which Masri had been operating from the hospital suddenly shut down at the moment of the initial strike.\nReuters and other news providers often deliver live video feeds to media outlets worldwide during major news events to show the scene from the ground in real time. Reuters had frequently broadcast a feed from Nasser hospital during the Gaza conflict, and for the past several weeks had been delivering daily feeds from the Nasser hospital position that was hit.\nIsrael has barred all foreign journalists from entering the Gaza Strip since the start of the war in 2023. Reporting from the territory throughout the war has been produced by Palestinian journalists, many of whom have worked for many years for international media organizations, including wire services such as Reuters and the Associated Press.\nIsrael has also separately said it is investigating the death of Issam Abdallah, a Reuters journalist killed in southern Lebanon by Israeli tank fire in October 2023 after the Gaza conflict erupted. Israel has not announced any findings."
    },
    {
      "news_title": "Multiple journalists killed by Israeli strikes on Nasser Hospital, including freelance journalist who worked for AP",
      "news_link": "https://www.heraldbulletin.com/news/nation_world/multiple-journalists-killed-by-israeli-strikes-on-nasser-hospital-including-freelance-journalist-who-worked-for/article_7088f103-4398-566e-a15e-ea33c126c2da.html",
      "bias": "Center",
      "text": "DEIR AL-BALAH, Gaza Strip (AP) — Multiple journalists killed by Israeli strikes on Nasser Hospital, including freelance journalist who worked for AP.\nAP\nDEIR AL-BALAH, Gaza Strip (AP) — Multiple journalists killed by Israeli strikes on Nasser Hospital, including freelance journalist who worked for AP.\nCopyright 2025 The Associated Press. All rights reserved. This material may not be published, broadcast, rewritten or redistributed without permission.\n|\nSupport local journalism Local news, sports and entertainment when you want it. Please consider subscribing so we can continue to bring you the best local news, sports and entertainment coverage. |"
    },
    {
      "news_title": "More than a dozen people killed in Israeli strikes on hospital in southern Gaza, including journalists",
      "news_link": "https://www.cnn.com/2025/08/25/middleeast/more-than-dozen-killed-israeli-strikes-gaza-hospital-journalists-intl",
      "bias": "Lean Left",
      "text": "Israel is facing fierce condemnation after a pair of strikes on a Gaza hospital killed five journalists as well as medical workers and others on Monday.\nAt least 20 people were killed in the attack on Monday, according to the Palestinian Ministry of Health, with many more injured.\nIsrael carried out back-to-back strikes on the Nasser Hospital in Khan Younis separated by only a matter of minutes, the ministry said. The “double-tap” hits killed journalists, health workers and emergency response crews who had rushed to the scene after the initial attack, the Nasser Hospital said.\nDr. Mohammad Saqer, a hospital spokesman and head of nursing, said that five journalists and four health workers had died.\nThe journalists killed are Mohammad Salama, a cameraman from Al Jazeera, Hussam Al-Masri, who was a contractor for Reuters, Mariam Abu Dagga, who has worked with the Associated Press (AP) and other outlets throughout the war, and freelance journalists Moath Abu Taha and Ahmed Abu Aziz.\nGaza’s Civil Defense organization said one of its crew members also died in the strike.\nThe Israeli attacks hit a balcony on the hospital used by reporters for an elevated view of Khan Younis.\nA first strike on the hospital hit the fourth floor of Nasser Medical Complex, the health ministry said, followed by a second attack a short time later that hit ambulance crews and emergency responders.\nVideo from the scene shows Saqer holding up a blood-soaked cloth after the first strike when another explosion rocks the building, filling the air with smoke and sending people running for cover.\nA live camera from Al Ghad TV shows emergency workers on a damaged staircase at the hospital when the second attack hits the building.\nThe Israel Defense Forces (IDF) said in a statement that it “carried out a strike in the area of” the hospital. The IDF added it “does not target journalists as such,” and that the military’s chief has instructed an initial inquiry to be opened as soon as possible.\nAn Israeli security official with knowledge of the details of that initial inquiry said IDF forces identified a camera on the roof of the hospital that they claimed was being used by Hamas to monitor the Israeli military.\nThe forces received authorization to strike the camera with a drone, the source said. But instead, Israeli forces fired two tank shells: the first at the camera and the second at rescue forces.\nThe details of the inquiry are a remarkable admission from an Israeli official that it intentionally targeted the first responders that arrived at the scene after the initial strike.\nA ‘watershed moment’\nJournalist organizations and international bodies reacted to the deaths with shock and anger.\nThe Foreign Press Association in Israel and the Palestinian Territories described the strikes as “among the deadliest Israeli attacks on journalists working for international media since the Gaza war began.”\n“This has gone on far too long. Too many journalists in Gaza have been killed by Israel without justification. Israel continues to block international journalists from independent access to Gaza,” the organization added, saying it should be regarded as a “watershed moment.”\nPhilippe Lazzarini, the head of UNRWA, the main UN agency for Palestinian refugees, said on social media that the strikes amounted to “silencing the last remaining voices reporting about children dying silently amid famine.”\nThe Palestinian Journalists Syndicate also condemned the attack, calling it a “heinous massacre perpetrated by the Israeli occupation forces… which directly targeted media and journalistic crews.”\nAccording to the Committee to Protect Journalists (CPJ), Israel had killed 192 journalists since the start of the war in Gaza, before Monday.\nJodie Ginsberg, the CPJ president, accused Israel of deliberately targeting a Reuters camera position. “First responders moved in, including journalists, and they were killed in the second attack,” she said in an interview with CNN’s Becky Anderson.\n“So in both instances, it looks like Israel has committed unlawful killings, war crimes, both in the deliberate killing of the Reuters cameraman and in this so-called double tap attack,” Ginsberg added.\nCNN profiled one of the victims, Abu Dagga, last year. Then 31 years old, she said: “We are covering the war on Gaza because this is our journalistic duty. It is entrusted upon us.”\nAt the time, Abu Dagga worked for the Independent Arabic. She also freelanced for AP since the war began. “We challenged the Israeli occupation. We challenged the difficult circumstances and the reality of this war, a genocidal war,” Abu Dagga told CNN in 2024.\nAP said it was “shocked and saddened” to learn of Abu Dagga’s death along with several other journalists. Her 12-year-old son was evacuated from Gaza earlier in the war, the news agency said.\n“(Abu) Dagga reported on Nasser Hospital doctors struggling to save children with no prior health issues who were wasting away from starvation,” AP said in a statement.\nAl Jazeera condemned the killings as a “horrific crime” committed by Israeli forces who have “directly targeted and assassinated journalists.”\nThe network said in a statement: “The ongoing campaign by the Israeli occupation against journalists has violated all international norms and laws, amounting to war crimes under the Rome Statute and the Geneva Conventions, both of which strictly prohibit the deliberate targeting of civilians and journalists in conflict zones.”\nIn a statement, Hamas said: “The cowardly enemy aims to deter journalists from conveying the truth and covering war crimes, ethnic cleansing, and the catastrophic living conditions of our Palestinian people in Gaza.”\nTwo weeks ago, Israel killed several Al Jazeera journalists in a strike in Gaza City, including one of the network’s most prominent correspondents, Anas Al-Sharif. It came after the IDF accused Al-Sharif of being the leader of a Hamas rocket cell, an accusation he vehemently denied.\nThis story has been updated with additional developments."
    },
    {
      "news_title": "Al Jazeera journalist killed in Israeli strike in Gaza: broadcaster",
      "news_link": "https://www.iol.co.za/news/world/al-jazeera-journalist-killed-in-israeli-strike-in-gaza-broadcaster-83a17109-faf8-4039-a6bd-e341c9bd6227",
      "bias": "Center",
      "text": null
    },
    {
      "news_title": "Israel hits Gaza hospital, killing at least 20 people, including journalists",
      "news_link": "https://www.abc.net.au/news/2025-08-25/israel-strikes-nasser-hospital-southern-gaza-kills-journalists/105696068",
      "bias": "Lean Left",
      "text": "Israeli strikes on southern Gaza's Nasser Hospital kill at least 20, including journalists\nIn short:\nTwo strikes on the Nasser Hospital in southern Gaza have killed at least 20 people including journalists working for world's largest media organisations.\nReuters contractor cameraman Hussam al-Masri was killed in the initial strike while Mariam Abu Dagga, freelancer for the AP, and journalist Moaz Abu Taha were killed in the second strike while inspecting the scene, which was captured on live TV.\nWhat's next?\nIsrael admitted to the strikes but said it \"does not target journalists as such\". The actions were condemned as an attack on press freedom and healthcare.\nIsrael has launched a series of attacks on Nasser Hospital in southern Gaza, with local health authorities reporting at least 20 people have been killed, including five journalists.\nThe second strike on the fourth floor of the facility in Khan Younis was broadcast live on television, as rescue crews scoured the building to evacuate people killed and injured from the first strike minutes earlier.\nReuters contractor cameraman Hussam al-Masri, was killed in the initial strike, according to officials. Reuters said its live video feed from the hospital, which was operated by him, suddenly shut down at that moment.\nMariam Abu Dagga, who the Associated Press said freelanced for the AP, and journalist Moaz Abu Taha were killed in the second strike while inspecting the scene.\nMohammed Salama who was a photojournalist with Al Jazeera was also killed and Ahmad Abu Aziz later died from injuries sustained in the attack.\nPhotographer Hatem Khaled, who is also a Reuters contractor and could be seen in the live broadcast footage wearing a red shirt and taking photos of the damage when the second strike hit, was wounded.\n\"We are devastated to learn of the death of Reuters contractor Hussam al-Masri and injuries to another of our contractors, Hatem Khaled, in Israeli strikes on the Nasser hospital in Gaza today,\" a Reuters spokesperson said in a statement.\n\"We are urgently seeking more information and have asked authorities in Gaza and Israel to help us get urgent medical assistance for Hatem,\" the spokesperson added.\nAP said it was \"shocked and saddened to learn\" Abu Daqqa had been killed. The journalist had a 12-year-old son who was evacuated from Gaza earlier in the war.\n\"Mariam regularly based herself at the hospital for coverage,\" the agency said in a statement.\n\"Her recent work included strong stories of starving and malnourished children in Gaza. She freelanced for the AP and other news outlets.\n\"We are doing everything we can to keep our journalists in Gaza safe as they continue to provide crucial eyewitness reporting in difficult and dangerous conditions.\"\nOne of deadliest attacks on journalists in Gaza\nThe Foreign Press Association said it was \"outraged and in shock\" at the killings of \"journalists from several major international news outlets\".\n\"This is among the deadliest Israeli attacks on journalists working for international media since the Gaza war began,\" it said in a statement.\n\"These strikes hit the exterior staircase of the hospital where journalists frequently stationed themselves with their cameras. The strikes came with no warning.\n\"We demand an immediate explanation from the Israel Defense Forces and the Israeli Prime Minister's Office. We call on Israel once and for all to halt its abhorrent practice of targeting journalists.\n\"This has gone on far too long. Too many journalists in Gaza have been killed by Israel without justification.\n\"Israel continues to block international journalists from independent access to Gaza. This must be a watershed moment.\"\nThe UN rights office spokeswoman Ravina Shamdasani condemned the strikes, saying: \"Journalists are not a target. Hospitals are not a target.\"\n\"The killing of journalists in Gaza should shock the world — not into stunned silence but into action, demanding accountability and justice,\" she added in a statement.\nUNRWA's Commissioner-General also reacted with outrage, saying \"the world’s indifference and inaction is shocking\".\n\"Silencing the last remaining voices reporting about children dying silently amid famine,\" Philippe Lazzarini wrote on X.\nHe called for the \"manmade famine\" to be undone by allowing aid in without restrictions and the protection of journalists, humanitarian and health workers.\n\"Like Hannah Arendt said: 'The death of human empathy is one of the earliest and most telling signs of a culture about to fall into barbarism.'\n\"This cannot be our future new norm. Compassion must prevail … Time for political will. Not tomorrow, now.\"\nTurkey's presidential communications office called the strikes \"an attack on press freedom and another war crime\".\n\"Israel, which continues its atrocities without regard for any humanitarian or legal principles, is under the illusion that it can prevent the truth from being revealed through its systematic attacks on journalists,\" Burhanettin Duran, head of the communications directorate, said in a post on X.\nThe Hamas government media office said it was another example of \"the systematic targeting, killing, and assassination of Palestinian journalists\" by Israeli forces.\nThe Palestinian Journalists Syndicate condemned Israel for the strikes, saying it represented \"an open war against free media, with the aim of terrorising journalists and preventing them from fulfilling their professional duty of exposing its crimes to the world.\"\nMore than 240 Palestinian journalists have been killed by Israeli fire in Gaza since the war started on October 7, 2023, according to the Palestinian Journalists Syndicate.\nThe Israel Defense Forces (IDF) did not immediately respond to the ABC's questions about the attacks.\nIt later released a short statement admitting \"IDF troops carried out a strike in the area of Nasser Hospital\" and said an \"initial inquiry will be conducted\".\n\"The IDF regrets any harm to uninvolved individuals and does not target journalists as such. The IDF acts to mitigate harm to uninvolved individuals as much as possible while maintaining the safety of IDF troops.\"\nThe statement does not address questions about how many times Israeli forces attacked the hospital, or why the hospital was targeted at all.\nIsraeli media is reporting that security sources say the IDF \"received permission to neutralise the camera\" which was being used to film its troops, which then escalated into a wider attack. The sources said the attack did not come from the air but rather from a tank.\nJournalists regularly congregate near hospitals in Gaza, given they are some of the few facilities with semi-regular power and internet access.\nEarlier this month the IDF killed Al Jazeera correspondent Anas Al-Sharif, described by his colleagues as one of the bravest journalists in Gaza.\n'Systematic destruction of health system'\nIn a statement the Palestinian Health Ministry in Gaza said medical personnel, patients and civil defence personnel were also among those killed, in addition to dozens of injuries.\n\"The bombing has caused panic and chaos, disrupted operations in the operating room, and deprived patients and the wounded of their right to treatment,\" it said in a statement.\n\"[It's] a continuation of the systematic destruction of the health system and the continuation of genocide. It is a message of defiance to the entire world and to all values of humanity and justice.\"\n\"The Ministry of Health issues a distress call to protect what remains of health services and calls on the international community and all concerned institutions to take immediate and urgent action to protect humanitarian personnel in Gaza.\"\n\"The international silence and failure to take real measures to curb the occupation and stop its crimes is an effective partnership and a declaration that this crime will continue.\"\nThe head of the World Health Organization called for attacks on healthcare facilities to stop\n\"While people in Gaza are being starved, their already limited access to health care is being further crippled by repeated attacks,\" WHO Director-General Tedros Adhanom Ghebreyesus said on X.\n\"We cannot say it loudly enough: STOP attacks on health care. Ceasefire now!\nHe said 50 people had also been wounded in the strikes, including critically ill patients who had already been receiving care.\nLoading...Khan Younis's Nasser Hospital, the largest in southern Gaza, has withstood raids and bombardment throughout 22 months of war, with officials citing critical shortages of supplies and staff, rendering it the last functioning public hospital in the area.\nIsraeli strikes and raids on hospitals are not uncommon. Multiple hospitals have been struck or raided across the Gaza Strip, with Israel claiming its attacks had targeted militants operating inside the medical facilities, without providing detailed evidence.\nA June strike on Nasser Hospital killed three people and wounded 10, according to the health ministry.\nAt the time, Israel's military said it had targeted Hamas militants operating from a command and control centre inside the hospital.\nThe war began when Hamas militants attacked southern Israel on October 7, 2023, killing about 1,200 people and taking over 250 hostages.\nAt least 62,686 Palestinians have been killed since, according to Gaza's Ministry of Health. It does not distinguish between fighters and civilians but says around half have been women and children.\nABC with wires"
    },
    {
      "news_title": "Five journalists among 20 killed in Israeli strikes on Gaza hospital",
      "news_link": "http://www.naharnet.com/stories/en/314878",
      "bias": "Center",
      "text": "Five journalists among 20 killed in Israeli strikes on Gaza hospital\nAn Israeli airstrike hit the fourth floor of southern Gaza's main hospital Monday, killing at least 20 people, including 5 journalists, Gaza's civil defense said.\nReuters and the Associated Press said they were devastated after contributors were killed Monday in strikes on Gaza blamed on the Israeli military.\n\"We are devastated to learn of the death of Reuters contractor Hussam al-Masri and injuries to another of our contractors, Hatem Khaled, in Israeli strikes on the Nasser hospital in Gaza today,\" a Reuters spokesperson said in a statement.\nIn a statement, the AP said that it was \"shocked and saddened\" to learn of the death of Mariam Dagga, 33, a visual journalist who freelanced for the agency since the start of the war.\nAl Jazeera journalist Mohammad Salama was also among the killed.\nThe victims on the fourth floor of Nasser Hospital in Khan Younis were killed in a double-tap strike with one missile hitting first, then another moments later as rescue crews arrived, the health ministry said.\nKhan Younis' Nasser Hospital, the largest in southern Gaza, has withstood raids and bombardment throughout 22 months of war, with officials citing critical shortages of supplies and staff.\nThe Foreign Press Association called for an \"immediate explanation\" from the Israeli military and prime minister's office.\n\"We demand an immediate explanation from the Israel Defense Forces and the Israeli prime minister's office. We call on Israel once and for all to halt its abhorrent practice of targeting journalists,\" the group said in a statement.\nThe Israeli military said it will investigate the strike.\n\"Earlier today (Monday), IDF troops carried out a strike in the area of Nasser Hospital in Khan Younis. The Chief of the General Staff instructed to conduct an initial inquiry as soon as possible,\" the military said in a statement, adding it \"regrets any harm to uninvolved individuals and does not target journalists as such.\"\nIsraeli strikes and raids on hospitals are not uncommon. Multiple hospitals have been struck or raided across the Gaza Strip, with Israel claiming its attacks had targeted militants operating inside the medical facilities, without providing evidence.\nA June strike on Nasser Hospital killed three people and wounded 10, according to the health ministry. At the time, Israel's military said it had targeted Hamas militants operating from a command and control center inside the hospital.\nThe health ministry said Sunday that at least 62,686 Palestinians have been killed in the war. Around half have been women and children."
    },
    {
      "news_title": "Israel kills five journalists in new hospital massacre",
      "news_link": "https://thecradle.co/articles-id/32751",
      "bias": "Left",
      "text": null
    },
    {
      "news_title": "Israeli Strike on Nasser Hospital Kills Journalists and Patients in Gaza",
      "news_link": "https://www.palestinechronicle.com/israeli-strike-on-nasser-hospital-kills-journalists-and-patients-in-gaza/",
      "bias": "Left",
      "text": null
    },
    {
      "news_title": "Israel kills Middle East Eye journalists in double-tap strike on Gaza's Nasser Hospital",
      "news_link": "https://www.middleeasteye.net/news/israel-kills-middle-east-eye-journalists-gaza-nasser-hospital",
      "bias": "Left",
      "text": "Israel kills Middle East Eye journalists in double-tap strike on Gaza's Nasser Hospital\nIsraeli forces killed Middle East Eye journalists Mohamed Salama and Ahmed Abu Aziz on Monday, in a double-tap strike on the Nasser Hospital in the southern Gaza Strip.\nIsraeli forces bombed the fourth floor of the facility at around 11am local time (09:00 BST), then moments later, according to videos seen by MEE, fired a second missile deliberately at reporters, bystanders and first responders who had gathered to help recover the dead and wounded.\nAt the time of the attack, videos showed smoke billowing from an upper level at the hospital as rescue workers, standing on what appeared to be a staircase, appealed to those at ground level for help.\nThen the second missile struck the exact area where they had amassed, with a correspondent for Jordan's Al-Ghad TV channel crying out during a live broadcast that innocent people had been killed.\nAt least three other journalists were among the 19 Palestinians killed in the attack, including Mariam Dagga, a freelance reporter who worked with several media outlets including the Associated Press; Hussam al-Masri, a photojournalist with the Reuters news agency; and freelance reporter Moaz Abu Taha.\nNew MEE newsletter: Jerusalem Dispatch\nSign up to get the latest insights and analysis on Israel-Palestine, alongside Turkey Unpacked and other MEE newsletters\nSalama, who started working with MEE shortly after Israel launched its genocidal campaign on the besieged enclave, also contributed for several other media outlets in a freelance capacity, most notably Al Jazeera Arabic and Al Jazeera Mubasher.\nHe filed regular reports for MEE and covered Israel's January 2024 siege on the Nasser Hospital, the furore over the now-pulled BBC documentary Gaza: How to Survive a War Zone, and the killing of a frail 10-year-old boy, Abdulrahim 'Amir' al-Jarabe'a, at a Gaza Humanitarian Fund (GHF) site in May.\nLate last week, Salama spoke with MEE's head of video production, Khaled Shalaby, about Israel's starvation policy in the strip and discussed what he, and his partner Hala Asfour, a fellow journalist, also intended to cover in the week ahead.\nIn the phone call he said that he feared being targeted by Israeli forces following the recent assassination of Al Jazeera Arabic correspondent Anas al-Sharif and several of his crew members.\n'Israel cannot hide the truth of the genocide it is waging in Gaza, so it is killing as many of those who record each strike as it can'\n- David Hearst, editor-in-chief\nThe Israeli military claimed, without providing any evidence, that it killed Sharif because he \"served as the head of a terrorist cell in the Hamas terrorist organisation.\"\nSince Israel launched its war on the enclave in October 2023, it has routinely accused Palestinian journalists in Gaza of being Hamas members as part of what rights groups say is an effort to discredit their reporting of Israeli abuses.\nMeanwhile, Abu Aziz, a freelance journalist based in Khan Younis, had contributed to dozens of reports for MEE since the Israeli genocide in Gaza began in October 2023.\nHe constantly updated MEE's newsdesk with reports from the enclave, despite suffering a serious back injury which went untreated due to the war.\nDavid Hearst, the editor-in-chief of Middle East Eye, called Salama and Abu Aziz \"exceptional journalists,\" and said they were working in \"near impossible conditions\" before they were \"murdered\" by Israel.\n\"Israel cannot hide the truth of the genocide it is waging in Gaza, so it is killing as many of those who record each strike as it can,\" he said.\n\"What Israel is doing in Gaza is terrorism practised by a state. In killing as many civilians and non combatants as it can, in targeting hospitals, first responders and journalists, it is seeking to terrorise Palestinians into fleeing abroad.\n\"It must not and cannot be allowed to succeed. It is up to every nation that calls itself civilised to stop it.\"\nMEE's Jerusalem bureau chief, Lubna Masarwa, said that she was in deep shock over the journalists' killings, and said that Abu Aziz, who she was in constant contact with, had a deep \"love for life\".\n\"His stories were exceptional, as well as very intimate,\" she said. \"He had capacity to see things others couldn't and describe them in a detailed way.\n\"He had ambition, he was stubborn and he just kept going. He taught me that I could not afford to stop working on Gaza.\"\nShortly after Monday's attack, the UN special rapporteur on human rights in the occupied Palestinian Territories, Francesca Albanese, called on the international community to impose sanctions on Israel.\n\"Rescuers killed in line of duty. Scenes like this unfold every moment in Gaza, often unseen, largely undocumented,\" she wrote.\n\"I beg states: how much more must be witnessed before you act to stop this carnage? Break the blockade. Impose an Arms Embargo. Impose Sanctions.\"\nMore than 200,000 Palestinians have either been killed or wounded since Israel went to war in Gaza in October 2023, with recent reports, based on Israeli military intelligence data, indicating that more than 80 percent of those killed in the enclave until May of this year were civilians.\nIsrael's genocidal war has been described as the \"worst ever conflict\" for journalists, according to a report published in April by the Watson Institute for International and Public Affairs.\nThe report, titled News Graveyards: How Dangers to War Reporters Endanger the World, said the Israeli assault on the Gaza Strip since October 2023 had \"killed more journalists than the US Civil War, World Wars I and II, the Korean War, the Vietnam War (including the conflicts in Cambodia and Laos), the wars in Yugoslavia in the 1990s and 2000s, and the post-9/11 war in Afghanistan, combined\".\nIn a statement, the Foreign Press Association called for an \"immediate explanation\" from the Israeli military and called the double-tap \"among the deadliest Israeli attacks on journalists working for international media since the Gaza war began.\"\nIt said the \"came with no warning\" and hit an exterior staircase of the hospital \"where journalists frequently stationed themselves with their cameras.\"\nMiddle East Eye delivers independent and unrivalled coverage and analysis of the Middle East, North Africa and beyond. To learn more about republishing this content and the associated fees, please fill out this form. More about MEE can be found here."
    },
    {
      "news_title": "Palestinian media says 15 killed in Nasser Hospital strike, including 4 journalists",
      "news_link": "https://www.timesofisrael.com/liveblog_entry/palestinian-media-says-14-killed-in-nasser-hospital-strike-including-3-journalists/",
      "bias": "Center",
      "text": null
    },
    {
      "news_title": "Four journalists among 15 killed in Israeli strikes on Gaza hospital, officials say",
      "news_link": "https://www.sbs.com.au/news/article/israel-hits-gaza-hospital-killing-at-least-15-people-including-four-journalists/y9a7vyl19",
      "bias": "Lean Left",
      "text": "Gaza's civil defence agency said four journalists were among at least 15 people killed Monday when Israeli strikes hit Nasser Hospital in Khan Yunis.\nAgency spokesman Mahmud Bassal said \"the death toll is 15, including four journalists and one civil defence member\", after strikes hit Nasser Hospital in Khan Yunis.\nAccording to media watchdogs, around 200 journalists have been killed in nearly two years of war between Israel and Hamas.\nThe Israeli military said it will investigate the strike.\n\"Earlier today (Monday), IDF troops carried out a strike in the area of Nasser Hospital in Khan Yunis. The Chief of the General Staff instructed to conduct an initial inquiry as soon as possible,\" the military said in a statement, adding it \"regrets any harm to uninvolved individuals and does not target journalists as such.\"\nAccording to the International Federation of Journalists, at least 195 journalists and media workers have been killed in the Hamas-Gaza conflict since October 2023. Source: SBS News\nIn a statement, it named the reporters as photojournalists Hossam Al-Masri, Mohammad Salama and Mariam Dagga, and journalist Moaz Abu Taha.\nA spokesperson for Qatar-based TV network Al Jazeera on Monday confirmed its photojournalist and cameraman Mohammad Salama was killed in the attack on the medical complex.\nThe three others worked with some Palestinian and international outlets, according to Agence France-Presse journalists.\nAssociated Press said Mariam Dagga was a freelancer for the news agency but was not on an assignment with the media outlet when she was killed.\nReuters said that one of the journalists killed and one of those injured were contractors for the news agency.\nThe civil defence's Bassal said an Israeli explosive drone targeted a building at Nasser Hospital, followed by an air strike as the wounded were being evacuated.\nBefore the latest killings, media advocacy groups the Committee to Protect Journalists (CPJ) and Reporters Without Borders said around 200 journalists had been killed in the Gaza war.\nEarlier this month, four Al Jazeera staff and two freelancers were killed in an Israeli air strike outside Al-Shifa hospital in Gaza City, prompting widespread condemnation."
    },
    {
      "news_title": "Al Jazeera journalist killed in Israeli attack on Nasser hospital in Gaza",
      "news_link": "https://www.aljazeera.com/video/newsfeed/2025/8/25/al-jazeera-journalist-killed-in-israeli-attack-on-nasser-hospital-in-gaza",
      "bias": "Lean Left",
      "text": "Al Jazeera journalist killed in Israeli attack on Nasser hospital in Gaza\nAn Al Jazeera journalist is among 15 Palestinians killed in an Israeli attack on the Nasser hospital in Khan Younis, southern Gaza. At least three other journalists were killed in this attack.\nPublished On 25 Aug 2025"
    },
    {
      "news_title": "Israel's ‘double-tap’ strike on Nasser Hospital leaves 19 dead, including 4 journalists: Who were they?",
      "news_link": "https://www.wionews.com/world/israel-s-double-tap-strike-on-nasser-hospital-leaves-19-dead-including-4-journalists-who-were-they-1756122185694",
      "bias": "Center",
      "text": "An Israeli strike on Gaza’s Nasser Hospital killed 19, including four journalists. Two rapid strikes targeted the hospital and emergency responders, causing multiple casualties among health workers and first responders.\nAn Israeli strike on a hospital in southern Gaza killed four journalists on Monday, according to local officials. In total, 19 people were killed in the attack on Nasser Hospital in Khan Younis, said Zaher al-Waheidi, head of the Gaza Health Ministry’s records department.\nThe Palestinian health ministry said Israel carried out two strikes on the hospital within minutes of each other. The first hit the fourth floor of the Nasser Medical Complex. Soon after, a second strike hit ambulance crews and emergency workers who had rushed to the scene. The hospital said the “double-tap” attacks killed journalists, health workers, and first responders.\nThe Israel Defense Forces (IDF) confirmed it had carried out “a strike in the area of” the hospital. It added that it “does not target journalists as such” and said the military chief has ordered an initial inquiry. However, the IDF statement did not acknowledge hitting the hospital directly, nor did it mention the two consecutive strikes or specify what was being targeted.\nGaza’s Government Media Office identified the four journalists killed in the strike as:\n• Hossam al-Masri – photojournalist with Reuters\n• Mohammed Salama – photojournalist with Al Jazeera\n• Mariam Abu Daqa – journalist who worked with outlets including The Independent Arabic and Associated Press\n• Moaz Abu Taha – freelance journalist\nThe Israel-Hamas war has become one of the deadliest conflicts for journalists in modern history. At least 192 journalists have been killed in Gaza over the past 22 months, according to the Committee to Protect Journalists (CPJ). In comparison, CPJ says 18 journalists have been killed during Russia’s war in Ukraine.\nWith international media barred from entering Gaza except on rare guided tours, global news coverage relies heavily on Palestinian reporters and local residents. Israel has often questioned their affiliations but continues to deny access to others.\nIn a statement, Hamas said, “The cowardly enemy aims to deter journalists from conveying the truth and covering war crimes, ethnic cleansing, and the catastrophic living conditions of our Palestinian people in Gaza.”"
    },
    {
      "news_title": "Israel strikes Gaza's Nasser Hospital, kills journalists",
      "news_link": "https://www.washingtonpost.com/video/world/israel-strikes-gazas-nasser-hospital-kills-journalists/2025/08/25/c82c150e-8d77-4864-8577-227e7d228b79_video.html",
      "bias": "Lean Left",
      "text": null
    },
    {
      "news_title": "Israel hits Gaza hospital, killing at least 15 people, including journalists",
      "news_link": "https://www.reuters.com/world/middle-east/israel-hits-gaza-hospital-killing-least-15-people-including-journalists-2025-08-25/",
      "bias": "Center",
      "text": null
    },
    {
      "news_title": "Israeli airstrike on Gaza hospital kills atleast 20, including 5 journalists",
      "news_link": "https://www.newindianexpress.com/world/2025/Aug/25/israeli-airstrike-on-hospital-in-southern-gaza-kills-eight",
      "bias": "Lean Left",
      "text": "An Israeli airstrike hit the fourth floor of southern Gaza’s main hospital Monday, killing at least 20 people, Gaza’s health ministry said.\nGaza's civil defence agency said five journalists were among at least 20 people killed Monday when Israeli strikes hit a hospital in the south, with Reuters, The Associated Press and Al Jazeera mourning their slain contributors.\nThe ministry said the victims on the fourth floor of Nasser Hospital were killed in a double-tap strike — one missile hitting first, then another moments later as rescue crews arrived.\nKhan Younis’ Nasser Hospital, the largest in southern Gaza, has withstood raids and bombardment throughout 22 months of war, with officials citing critical shortages of supplies and staff.\nIsrael’s military did not immediately respond to questions about the strike.\nAmong the five journalists who were killed, Mariam Daqqa, 33 freelanced for the AP since the Gaza war began, as well as other news outlets.\nDagga, who has a 12-year-old son who was evacuated from Gaza earlier in the war, frequently based herself at Nasser, most recently reporting on the hospital's doctors struggling to save children from starvation.\nThe Associated Press said in a statement that it was \"shocked and saddened\" to learn of the death of Mariam Dagga, 33, a visual journalist who had freelanced for the agency since the start of the war.\nAl Jazeera confirmed that its journalist Mohammed Salam was among those who were killed in the Nasser hospital strike. Reuters reported that its contractor cameraman Hussam al-Masri was also killed in the strike. Photographer Hatem Khaled, who was also a Reuters contractor, was wounded, the news agency reported.\n\"Al Jazeera Media Network condemns, in the strongest possible terms, this horrific crime committed by the Israeli occupation forces, who have directly targeted and assassinated journalists as part of a systematic campaign to silence the truth,\" the broadcaster said in a statement.\nA spokesperson for Reuters said: \"We are devastated to learn of the death of Reuters contractor Hussam al-Masri and injuries to another of our contractors, Hatem Khaled, in Israeli strikes on the Nasser hospital in Gaza today.\"\n\"We are urgently seeking more information and have asked authorities in Gaza and Israel to help us get urgent medical assistance for Hatem,\" the spokesperson added in a statement.\nThe Palestinian Journalists Syndicate also named two other victims as Moaz Abu Taha and Ahmad Abu Aziz.\nAccording to AFP journalists, Abu Taha had worked with some Palestinian and international outlets.\nThe Israel-Hamas has been one of the bloodiest conflicts for media workers, with a total of at least 200 journalists killed in Gaza in the 22-month conflict, according to the Committee to Protect Journalists. Comparatively, 18 journalists have been killed so far in the Russia-Ukraine war, according to the CPJ.\nThe Israeli Prime Minister’s Office and Israeli military refused to comment on the incident.\nThe Israeli military later said its troops carried out a strike in the area of Nasser Hospital and that it would conduct an investigation into the incident. The military said it “regrets any harm to uninvolved individuals and does not target journalists as such.”\nThibaut Bruttin, the director general of Reporters Without Borders, said press freedom advocates had never seen such a severe step backward for reporters’ safety. He noted that journalists have been killed both in indiscriminate strikes and in targeted attacks that Israel’s military has acknowledged carrying out.\n“They are doing everything they can to silence independent voices that are trying to report on Gaza,” Bruttin said.\nIsrael’s attacks on hospitals are not in comment in its war against Hamas in Gaza. Multiple hospitals were struck or raided across the strip with Israel claiming attacking militants operating from inside the medical facilities without providing evidence.\nA June strike on Nasser hospital killed three people and wounded 10. At the time Israeli military said it had precisely struck Hamas militants operating from within a command and control center at the hospital.\n(With inputs from AP, AFP)"
    },
    {
      "news_title": "Israeli airstrike on southern Gaza hospital kills 20, including journalists",
      "news_link": "https://www.arabnews.com/node/2612944/middle-east",
      "bias": "Lean Right",
      "text": "Israeli airstrike on southern Gaza hospital kills 20, including journalists\nThe ministry said the victims on the fourth floor of Nasser Hospital were killed in a double-tap strike — one missile hitting first, then another moments later as rescue crews arrived\nKhan Younis’ Nasser Hospital, the largest in southern Gaza, has withstood raids and bombardment throughout 22 months of war\nUpdated 13 sec ago\nArab News\nKHAN YOUNIS: An Israeli airstrike hit the fourth floor of southern Gaza’s main hospital Monday, killing at least 20 people, Gaza’s health ministry said.\nThe ministry said the victims on the fourth floor of Nasser Hospital were killed in a double-tap strike — one missile hitting first, then another moments later as rescue crews arrived.\nThe victims of the strike included four journalists, Palestinian health officials said.\nCameraman Hossam Al-Masri, who was killed in the strike, was a contractor for Reuters. Photographer Hatem Khaled, who was also a Reuters contractor, was wounded, the officials said.\nAl Jazeera also confirmed photojournalist, Mohammad Salama, was killed in the hospital strike.\nThe other victims included, Mariam Abu Daqa, who had worked for various outlets including The Independent Arabic and Associated Press as well as Moaz Abu Taha, a journalist with NBC network.\nKhan Younis’ Nasser Hospital, the largest in southern Gaza, has withstood raids and bombardment throughout 22 months of war, with officials citing critical shortages of supplies and staff.\nIsrael’s military did not immediately respond to questions about the strike.\nThe Israeli military said Monday it will investigate a strike in the area of Nasser Hospital in Khan Yunis.\nIsraeli attacks on hospitals are not uncommon. Multiple hospitals were struck or raided across the strip with Israel claiming attacking militants operating from inside the medical facilities without providing evidence.\nA June strike on Nasser hospital killed three people and wounded 10. At the time Israeli military said it had precisely struck Hamas militants operating from within a command and control center at the hospital, however, no evidence was provided of the claim.\nJordan condemns settler attacks on Gaza aid convoy\nJordan has dispatched on Monday its 193rd humanitarian convoy into the enclave to deliver essential food supplies aboard 59 trucks\nUpdated 2 min 49 sec ago\nArab News\nDUBAI: Jordan on Monday denounced the attacks on Jordanian relief trucks en route to the Gaza Strip by Israeli settlers, describing their actions as dangerous for aid drivers aside from obstructing humanitarian operations for the besieged enclave.\nA group of settlers tried Sunday evening to block a convoy of 59 relief trucks, which later managed to cross into Gaza, Mohammad Momani, government spokesperson and Minister of Government Communication, said in a report from state news agency Petra.\nMomani said four of the trucks were attacked, with settlers pelting them with stones, smashing windshields, slashing tires as well as damaging front and side panels\nThe Jordanian official emphasized that Israeli authorities were responsible for failing to restrain such incidents, calling the response “lax” and warning that the attacks posed risks to driver safety, hindered relief work and violated international conventions and agreements.\nMeanwhile, Jordan has dispatched on Monday its 193rd humanitarian convoy into the enclave to deliver essential food supplies aboard 59 trucks.\nThe deliveries, according to Momani, would continue despite obstacles such as requirements for electronic applications to transport aid, limited inspection hours at border crossings and newly imposed customs fees.\nThese measures, he said, have stretched delivery times from about two hours to as long as 36 hours.\nSyria president to speak at UN General Assembly: official\nSyria’s interim president, Ahmed Al-Sharaa, will speak at the United Nations General Assembly next month, a foreign ministry official told AFP on Monday\nUpdated 1 min 45 sec ago\nAFP\nDAMASCUS: Syria’s interim president, Ahmed Al-Sharaa, will speak at the United Nations General Assembly next month, a foreign ministry official told AFP on Monday, the first Syrian leader to do so in decades.\nSharaa “will take part in the United Nations General Assembly in New York where he will deliver a speech,” the official said, requesting anonymity as they were not authorized to brief the media.\nSharaa took power in December after his Islamist group led a coalition of forces that toppled longtime ruler Bashar Assad after nearly 14 years of gruelling civil war.\n“He will be the first Syrian president to speak at the United Nations since former president Nureddin Al-Atassi (in 1967), and the first Syrian president ever to take part in the General Assembly’s high-level week,” scheduled for September 22-30, the official added.\nSince taking power, Syria’s new authorities have gained regional and international support.\nIn April, Syrian Foreign Minister Asaad Al-Shaibani addressed the United Nations for the first time and raised his country’s new flag at the body’s New York headquarters.\nSharaa met US President Donald Trump in May in Saudi Arabia, a week after meeting French President Emmanuel Macron in Paris on his first trip to the West.\nSharaa remains under United Nations sanctions and a travel ban due to his past as a wanted jihadist, and must request an exemption for all foreign trips.\nNetanyahu says Israel could withdraw from Lebanon if Hezbollah is disarmed\nIsrael says it is ready to support Lebanon in disarming Hezbollah\nUpdated 25 August 2025\nAP\nTEL AVIV: Israeli Prime Minister Benjamin Netanyahu said he welcomed the Lebanese cabinet’s “momentous decision” earlier this month to work towards the disarmament of Hezbollah by the end of 2025 and it could lead to Israel's troops withdrawing from the country.\nHe said that if Lebanon takes the necessary steps to disarm Hezbollah, then Israel will respond with reciprocal measures, including a phased reduction of the Israeli military presence in southern Lebanon.\nSince the Israel-Hezbollah war ended in November with a U.S.-brokered ceasefire, Hezbollah officials have said the group will not discuss its disarmament until Israel withdraws from five hills it controls inside Lebanon and stops almost daily airstrikes that have killed or wounded hundreds of people, most of them Hezbollah members.\nBeirut is under U.S. pressure to disarm the group that recently fought a 14-month war with Israel and was left gravely weakened, with many of its political and military leaders dead.\nFrankly Speaking: How former Israeli PM Olmert views the war\nOlmert warns the Gaza war is endangering Israel’s global standing, accuses Netanyahu of reckless policies driven by self-interest\nAsked whether Israel’s Smotrich and Ben-Gvir are terrorists, Olmert went even further, branding them “messianic” and “extremists”\nUpdated 25 August 2025\nArab News\nRIYADH: Former Israeli Prime Minister Ehud Olmert has been outspoken in his criticism of Benjamin Netanyahu. While stopping short of accusing his successor of committing genocide, he has repeatedly said that what is happening in Gaza constitutes war crimes.\nSpeaking to Katie Jensen, host of the Arab News current affairs program “Frankly Speaking,” Olmert said that although Israel’s response was justified following the Oct. 7, 2023, Hamas-led attack, the conflict had become untenable — and a “death trap for Israelis.”\n“The whole war which started after the ... violation of the temporary ceasefire agreement in March of 2025 is an illegitimate war,” said Olmert, who served as prime minister from 2006 to 2009.\n“And in the illegitimate war, which is opposed by the majority of the Israelis, over 70 percent, in which lots of Israeli soldiers will be killed, when there is a serious danger to the lives of the hostages, and there will be thousands of Palestinians killed for a war which has no objective, which can’t reach any goal, which will do nothing good for any party involved, such a war is a crime, and I’ve accused the Israeli government of doing it.”\nHe added that many Israelis now believe the war primarily serves Netanyahu’s personal interests rather than the families of the remaining hostages and the security of wider Israeli society.\n“This is what everyone says in Israel now,” he said. “This is an unneeded and unnecessary war, that there is not any national interest of Israel which can be served by continuing the war. And therefore, the inevitable conclusion is that it serves the personal interests of the prime minister. This is something which has been said by everyone.\n“Expanding the war now against Gaza, which is so densely populated with more than a million people and where Hamas is hiding inside the most densely populated areas with non-involved citizens, is a death trap for Israelis, for something which doesn’t serve any national interest is a crime, and you have to ask yourself: What does it serve? And therefore many people conclude that it serves a personal interest.”\nWhen asked by Jensen whether he still believes Netanyahu belongs in The Hague to face war crimes charges, Olmert said he did not recall making such a statement. This is despite a widely shared clip from an interview with UK broadcaster Piers Morgan on June 2, in which Olmert was asked directly whether Netanyahu should face trial in The Hague.\n“Look, there should be a voice. And if as a result of the fact that I was prime minister and I’m fairly well-known in the international community that people want to hear what I have to say, I have to say it. Yes,” Olmert told Morgan in the clip.\nAlthough he now appears to have walked back those comments, Olmert did endorse describing Israel’s Minister of National Security Itamar Ben-Gvir and Finance Minister Bezalel Smotrich as terrorists, calling them “messianic” and “extremists.”\nBen-Gvir has provoked outrage by leading Jewish prayers at Jerusalem’s Al-Aqsa Mosque, violating long-standing agreements and drawing condemnation from Palestinian, Arab, and international leaders.\nHe has also advocated for Israeli sovereignty over Gaza, and promoting mass “voluntary” Palestinian emigration. Western governments have sanctioned him for incitement to violence and past criminal convictions for supporting terrorism and racism.\nSmotrich, also sanctioned by Western states, has been criticized for inflammatory statements backing settlement expansion in the West Bank, incitement against Palestinians, and positions seen by EU partners and rights groups as undermining Palestinian rights and peace prospects.\nJensen teed up the issue with this question: “When we look at some of the comments from (Netanyahu’s) ministers, people like Smotrich, who said there is no such thing as Palestinian people — he stood under a map of ‘Greater Israel’ while saying that — he also said the Palestinian village of Huwara should be wiped out.\n“Or comments from Ben-Gvir, who went on Israeli television and said his right to move freely in the West Bank is more important than Palestinians’ freedom of movement … If we consider these men’s words and actions, in your view, are these men terrorists?”\nOlmert was unequivocal in his response.\n“Look, this is an easy part of the question,” he said. “Yes, they are in a way in the sense that Ben-Gvir was convicted for taking part in what is considered to be terrorist actions in the past. But I think that this situation is more, somewhat more complex.\n“Let’s face it. On one hand, there are these messianic groups, which are totally, totally unacceptable. For the majority of the Israelis, there’s no question about it. They are extreme, they are messianic.\n“Yes, indeed, they want to expel all the Palestinians from the West Bank and annex the West Bank. And so they want to do it in Gaza. But I think that the majority of the Israelis are against it.”\nUnlike Netanyahu, who has leaned into the rhetoric of his far-right ministers, Olmert said he would never have supported the notion of a “Greater Israel” — a political concept espoused by extremists that envisions expanding Israeli territory to include swathes of Palestine, Lebanon, Jordan, Syria, and even land between the Nile and the Euphrates.\nOlmert warned that such rhetoric and policies were costing Israel friends and allies.\n“There is a deep division between a major part of the public opinion, which is in favor of changing course, and a part which is now governed by the Netanyahus and the group of thugs which are known to be the cabinet ministers,” he said.\n“Now, what they are doing, they are causing a very big damage to the reputation of the state of Israel, to the integrity of the state of Israel, and to the perception of what Israel stands for.\n“And that causes a huge difficulty in the relations of Israel with the traditional friends of Israel, European countries, France, Germany, Great Britain, Canada, other countries. And it also creates difficulties that will become more and more difficult to deal with, with America.\n“And unfortunately also it creates difficulties with our very important friends in Egypt and Jordan, and also in the Emirates. And it certainly prevents the possible movement towards a normalization process with Saudi Arabia.”\nNetanyahu has faced corruption charges since 2019, including allegations of bribery, fraud, and breach of trust. His trial, which began in 2020, has been repeatedly delayed on security grounds. He denies all charges.\nThere are also outstanding arrest warrants issued by the International Criminal Court against Netanyahu and his former defense minister, Yoav Gallant, relating to alleged war crimes in Gaza. Israel itself faces charges of genocide at the International Court of Justice.\nOlmert himself resigned as prime minister in 2009 amid corruption allegations and was later convicted and imprisoned for bribery and breach of trust. Despite this, he insists his voice carries weight, arguing that most Israelis now oppose Netanyahu.\nIndeed, mass demonstrations across Israel in recent weeks opposing an expansion of the war in Gaza highlight a dramatic shift in public attitudes toward the trajectory of the right-wing coalition government.\n“Had I been prime minister, it would have been entirely different,” said Olmert. “I would have adopted what I represented at the time that I was prime minister, talking about the two-state solution, negotiating, (and) hopefully trying to force a Palestinian leadership to comply.”\nOlmert said the failure of the Israeli-Palestinian peace process to date could not be blamed entirely on Israel. He recalled that during his tenure he had offered the Palestinians a state, but says they rejected the proposal.\n“Let’s not forget that in 2008, 2009, when I was prime minister, I proposed to the president of the Palestinian Authority a comprehensive peace plan based on the (19)67 borders,” he said.\nHis plan included an Israeli withdrawal from much of the West Bank, land swaps for annexed settlements, a corridor linking Gaza and the West Bank, shared or international administration of Jerusalem’s holy sites, and the symbolic acceptance of a limited number of Palestinian refugees into Israel, with compensation and resettlement for the rest.\nThe Palestinians rejected the deal over concerns about the right of return, the rushed timetable for consideration, doubts over Olmert’s political survival, and dissatisfaction with the terms on Jerusalem and land allocation.\nRegardless of fault, the repeated collapse of peace efforts in this period culminated in the Oct. 7, 2023, Hamas-led attack and Israel’s ensuing war on Gaza, which has since killed at least 60,000 Palestinians and left the enclave devastated.\nOne of the war’s greatest scandals to date has been the creation of the Gaza Humanitarian Foundation in early 2025. Critics have denounced the GHF for sidelining UN-led relief mechanisms in favor of a US- and Israeli-backed scheme that placed military personnel and private US contractors in charge of distributing aid in militarized zones.\nReports have documented hundreds of deaths and injuries among Palestinians seeking food at GHF aid sites. Groups including Medecins Sans Frontieres described the locations as scenes of “orchestrated killing” and demanded the program’s immediate suspension.\nOlmert said he did not know whether Israelis had deliberately targeted civilians at GHF sites, but insisted it was Israel’s responsibility to feed Gazans.\n“I think that there is a lot of fake information about precisely the circumstances regarding the humanitarian supplies and how Hamas is trying to provoke in order to reach out for food for their own needs, knowing that Hamas is not particularly careful about the lives of Palestinians and … how much is it a result of very unacceptable practices of Israeli soldiers. I don’t know,” he said.\n“I say one thing and this is at the bottom line, which I think is what counts. Israel controls Gaza, we are in charge there. Therefore, it is incumbent upon Israel to provide the humanitarian needs in Gaza to everyone that needs it, effectively, comprehensively, and without the interference or the provocations of whoever wants to disturb it. This is our responsibility.”\nIsraeli bulldozers uproot hundreds of trees in West Bank village\n“They completely uprooted and leveled them under false pretenses,” he said, explaining he and other residents had already begun replanting the pulled-up trees\nUpdated 24 August 2025\nAFP\nAL-MUGHAYYIR: Israeli bulldozers uprooted hundreds of trees in the West Bank village of Al-Mughayyir on Sunday in the presence of the Israeli military, according to journalists who witnessed the scene.\nMost of the felled vegetation appeared to be olive trees, essential to the economy and culture of the West Bank, while olive groves have also long been a flashpoint for violent clashes between farmers and encroaching Israeli settlers.\nAbdelatif Mohammed Abu Aliya, a local farmer from the village near Ramallah, said he lost olive trees that were over 70 years old on about one hectare of land.\n“They completely uprooted and leveled them under false pretenses,” he said, explaining he and other residents had already begun replanting the pulled-up trees.\nAFP photographers on the ground saw overturned soil, olive trees lying on the ground, and several bulldozers operating on the hills surrounding the village.\nOne bulldozer had an Israeli flag, and Israeli military vehicles were parked nearby.\n“The goal is control and forcing people to leave. This is just the beginning — it will expand across the entire West Bank,” said Ghassan Abu Aliya, who leads a local agricultural association.\nResidents said the bulldozing began on Thursday.\nA Palestinian NGO reported 14 people had been arrested in the village over the past three days.\nWhen asked about the incident, the Israeli army said they were looking into the matter.\nIn a statement, the army said it had arrested a man from Al-Mughayyir, accusing him of being “responsible for a terrorist attack” nearby.\nOn Aug. 16, the Palestinian Authority reported that an 18-year-old man had been shot and killed by the Israeli army in the same village.\nThe army said its forces responded to stones thrown by “terrorists” but did not directly link the incident to the young man’s death.\nIn a video widely circulated in Israeli media on Friday, a senior military commander refers to the attack in Al-Mughayyir and vows to make “every village and every enemy ... pay a heavy price” for attacks against Israelis.\nAvi Bluth, the military’s top commander in the West Bank, says in the video that the villages of Palestinian attackers could face curfews, sieges, and terrain “shaping actions” with the aim of deterrence."
    },
    {
      "news_title": "At least 19 killed, including journalists in airstrike on Gaza hospital",
      "news_link": "https://cbs2iowa.com/news/nation-world/at-least-19-killed-including-associated-press-al-jazeera-reuters-journalists-in-airstrike-on-gaza-southern-hospital-khan-younis-nasser-israel-hamas-war-palestinians-hostaged-famine-humanitarian-crisis",
      "bias": "Lean Right",
      "text": "WASHINGTON (TNND) — At least 19 people, including journalists, have been killed in an Israeli airstrike on southern Gaza's main hospital on Monday, according to the Gaza Health Ministry.\nAn Associated Press journalist, 33-year-old Mariam Dagga, was among the 19 killed when missiles hit Khan Younis’ Nasser Hospital, the Associated Press reported.\nDagga was a freelancer who regularly reported from Nasser Hospital, including on doctors struggling to save children from starvation.\nMohammad Salama, a cameraman from Al Jazeera and Hussam Al-Masri, a contractor for Reuters, were also killed in the strike.\nThe first strike hit the fourth floor of Nasser Medical Complex, followed by a second attack that hit ambulance crews and emergency responders.\nThe Israel-Hamas war has been one of the bloodiest conflicts for media workers, with a total of 192 journalists killed in Gaza in the 22-month conflict, according to the Committee to Protect Journalists.\nNeither Israel’s military nor the Prime Minister's office immediately responded to questions about the strike.\nOn Sunday, airstrikes hit Yemen's capital days after Houthi rebels fired a missile toward Israel. The Houthi-run health ministry said at least six people were killed and 86 others were wounded.\n_____\nEditor's note: The Associated Press contributed to this article."
    },
    {
      "news_title": "Report: Al-Sharaa says Syria in advanced stages of security talks with Israel",
      "news_link": "https://www.haaretz.com/middle-east-news/2025-08-25/ty-article/report-al-sharaa-says-syria-in-advanced-stages-of-security-talks-with-israel/00000198-dfc2-d9a7-add9-dfe7d1240000",
      "bias": "Lean Left",
      "text": "Report: Al-Sharaa Says Syria in Advanced Stages of Security Talks With Israel\nSyria's President Ahmad al-Sharaa said he was likely to sign a security agreement with Israel, according to a Sky News Arabia report.\nSyria's President Ahmad al-Sharaa said he was likely to sign a security agreement with Israel, according to a Sky News Arabia report."
    },
    {
      "news_title": "Four journalists among 15 killed in Israeli strikes on Gaza hospital: civil defence",
      "news_link": "https://www.al-monitor.com/originals/2025/08/four-journalists-among-15-killed-israeli-strikes-gaza-hospital-civil-defence",
      "bias": "Lean Left",
      "text": "Five journalists among 20 killed in Israeli strikes on Gaza hospital\nGaza's civil defence agency said five journalists were among at least 20 people killed Monday when Israeli strikes hit a hospital in the south, with Reuters, the Associated Press and Al Jazeera mourning their slain contributors.\nCivil defence spokesman Mahmud Bassal said \"the toll so far is 20 martyrs, including five journalists and one member of the civil defence\", after strikes hit Khan Yunis's Nasser Hospital -- a large medical complex that has been targeted several times by Israel since the start of the war.\nAccording to the media watchdogs Committee to Protect Journalists and Reporters Without Borders, around 200 journalists have been killed in nearly two years of war between Israel and Hamas.\nIn a statement, the Israeli military said its troops on Monday \"carried out a strike in the area of Nasser Hospital in Khan Yunis\".\n\"The Chief of the General Staff instructed to conduct an initial inquiry as soon as possible,\" it said, adding it \"regrets any harm to uninvolved individuals and does not target journalists as such\".\nThe civil defence's Bassal said an Israeli explosive drone targeted a building at the hospital, followed by an air strike as the wounded were being evacuated.\nA spokesperson for Qatar-based TV network Al Jazeera said on Monday that one of its photojournalists and cameramen, Mohammad Salama, was killed in the attack.\n\"Al Jazeera Media Network condemns, in the strongest possible terms, this horrific crime committed by the Israeli occupation forces, who have directly targeted and assassinated journalists as part of a systematic campaign to silence the truth,\" the broadcaster said in a statement.\nThe Associated Press said in a statement that it was \"shocked and saddened\" to learn of the death of Mariam Dagga, 33, a visual journalist who had freelanced for the agency since the start of the war.\nIn an earlier statement, it said Dagga had not been on an assignment with the agency when she was killed.\nA spokesperson for Reuters said: \"We are devastated to learn of the death of Reuters contractor Hussam al-Masri and injuries to another of our contractors, Hatem Khaled, in Israeli strikes on the Nasser hospital in Gaza today.\"\n\"We are urgently seeking more information and have asked authorities in Gaza and Israel to help us get urgent medical assistance for Hatem,\" the spokesperson added in a statement.\nThe Palestinian Journalists Syndicate named two other victims as Moaz Abu Taha and Ahmad Abu Aziz.\nAccording to AFP journalists, Abu Taha had worked with some Palestinian and international outlets.\n- Smoke, bloodied bodies -\nMedia restrictions in Gaza and difficulties in accessing many areas mean AFP is unable to independently verify the tolls and details provided by the civil defence agency or the Israeli military.\nAFP footage from the immediate aftermath of the attack showed smoke filling the air and debris from the blast on the floor outside the hospital.\nPalestinians rushed to help the victims, carrying bloodied corpses and severed body parts into the medical complex. One body could be seen dangling from the top floor of the targeted building as a man screamed below.\nA woman wearing medical scrubs and a white coat was among the injured, carried into the hospital on a stretcher with a heavily bandaged leg and blood all over her clothes.\nNasser Hospital is one of the last remaining health facilities in the Gaza Strip that is at least partially functioning.\nLater in the day, a crowd carried the bodies of some of the slain journalists at a funeral in Khan Yunis, with the dead wrapped in white burial shrouds and their press flak jackets resting on top.\n- 'Immediate explanation' -\nFollowing the strike, the Israel-based Foreign Press Association called for an \"immediate explanation\" from the military and prime minister's office.\n\"We call on Israel once and for all to halt its abhorrent practice of targeting journalists,\" the group said in a statement.\nEarlier this month, four Al Jazeera staff and two freelancers were killed in an Israeli air strike outside Al-Shifa hospital in Gaza City, prompting widespread condemnation.\nThe Israeli military alleged that Anas al-Sharif -- a prominent Al Jazeera correspondent killed in the strike -- headed a Hamas \"terrorist cell\" and was \"responsible for advancing rocket attacks\" against Israelis.\nThe Committee to Protect Journalists slammed that strike, saying journalists should never be targeted in war.\nThe war in Gaza was sparked by Hamas's October 2023 attack on Israel, which resulted in the deaths of 1,219 people, mostly civilians, according to an AFP tally based on official figures.\nIsrael's retaliatory offensive has killed at least 62,744 Palestinians, most of them civilians, according to figures from the health ministry in Hamas-run Gaza that the United Nations considers reliable."
    },
    {
      "news_title": "AP freelancer among 4 journalists killed in Israeli strikes on Gaza hospital, health officials say",
      "news_link": "https://www.thespec.com/news/world/middle-east/ap-freelancer-among-4-journalists-killed-in-israeli-strikes-on-gaza-hospital-health-officials-say/article_5e78e35b-6b9c-578a-8376-29edc5d582d3.html",
      "bias": "Lean Left",
      "text": "DEIR AL-BALAH, Gaza Strip (AP) — Israeli strikes on a hospital in southern Gaza killed five journalists Monday, including a freelancer who worked for The Associated Press, according to health officials.\nMariam Dagga, 33, a visual journalist, freelanced for the AP during the war, as well as other news outlets. The AP said in a statement that it was shocked and saddened to learn of Dagga’s death, along with those of other journalists.\nTwo missiles hit Nasser Hospital in Khan Younis in quick succession, medical officials said. In all, 20 people were killed, according to Zaher al-Waheidi, head of the Gaza Health Ministry’s records department.\nThe Israel-Hamas war has been one of the bloodiest conflicts for media workers, with at least 192 journalists killed in Gaza in the 22-month conflict, according to the Committee to Protect Journalists. Comparatively, 18 journalists have been killed so far in Russia’s war in Ukraine, according to the CPJ.\nDagga, who has a 13-year-old son who was evacuated from Gaza earlier in the war, frequently based herself at Nasser, most recently reporting on the hospital’s doctors struggling to save children from starvation. Independent Arabia, the Arabic language version of the British Independent, said Dagga also worked with the organization.\n“We are doing everything we can to keep our journalists in Gaza safe as they continue to provide crucial eyewitness reporting in difficult and dangerous conditions,” the AP said.\nAl Jazeera confirmed that journalist Mohammed Salama was also among those who were killed in the Nasser strike. Reuters reported that its contractor cameraman Hussam al-Masri and Moaz Abu Taha, a freelancer who worked occasionally for the organization, were killed. The agency’s contractor photographer Hatem Khaled was wounded.\nAhmad Abu Aziz was also killed, according to Health Ministry official al-Waheidi. He had worked as a freelancer for Middle East Eye, a U.K.-based media outlet, the organization said.\nThe Israeli military said its troops carried out a strike in the area of Nasser Hospital and that it would conduct an investigation into the incident. The military said it “regrets any harm to uninvolved individuals and does not target journalists as such.”\nThibaut Bruttin, the director general of Reporters Without Borders, said press freedom advocates had never seen such a severe step backward for reporters’ safety. He noted that journalists have been killed both in indiscriminate strikes and in targeted attacks that Israel’s military has acknowledged carrying out.\n“They are doing everything they can to silence independent voices that are trying to report on Gaza,” Bruttin said.\nIn some cases, such as with Al Jazeera correspondent Anas al-Sharif, who was targeted and killed by Israel earlier this month, Israel has accused journalists in Gaza of being part of militant groups. Israel’s military asserted that al-Sharif had led a Hamas cell — an allegation that Al Jazeera and al-Sharif previously dismissed as baseless.\nAside from rare guided tours, Israel has barred international media from covering the war. News organizations instead rely largely on Palestinian journalists in Gaza — as well as residents — to show the world what is happening there. Israel often questions the affiliations and biases of Palestinian journalists but doesn’t permit others in.\nMany of the journalists working in Gaza are facing the same struggles to find food, for themselves and their families, as the people they are covering.\nIn one of Dagga’s last social media posts on Sunday, she published a selfie of herself.\n___\nThis story has been updated to correct that Dagga’s son is 13, not 12, and to correct the spelling of the last name of the one of the journalists to Salama, not Salam.\n___\nLidman reported from Jerusalem and Magdy from Cairo. Associated Press writer Sam Metz contributed from Jerusalem.\nError! Sorry, there was an error processing your request.\nThere was a problem with the recaptcha. Please try again.\nYou may unsubscribe at any time. By signing up, you agree to our terms of use and privacy policy. This site is protected by reCAPTCHA and the Google privacy policy and terms of service apply.\nWant more of the latest from us? Sign up for more at our newsletter page.\nTo join the conversation set a first and last name in your user profile.\nSign in or register for free to join the Conversation"
    },
    {
      "news_title": "Israel kills 20 more Palestinians in fresh attacks across Gaza Strip",
      "news_link": "https://www.aa.com.tr/en/middle-east/israel-kills-20-more-palestinians-in-fresh-attacks-across-gaza-strip/3667514",
      "bias": "Right",
      "text": "Israel kills 20 more Palestinians in fresh attacks across Gaza Strip\n2 children, 8 aid seekers among victims of Israeli strikes in famine-ravaged Gaza\nANKARA\nAt least 20 Palestinians were killed and several others injured in a new wave of attacks across the Gaza Strip on Sunday, medics said.\nA medical source said three people were killed in Israeli artillery shelling targeting the towns of Jabalia and Jabalia al-Nazla in northern Gaza.\nThree more were killed, others injured when the Israeli army opened fire on civilians waiting for aid delivery in northwestern Gaza.\nIn Gaza City, a woman was killed when Israeli forces struck a school in the Zeitoun neighborhood, while Israeli warplanes carried out an airstrike near Al-Shafi’i Mosque in the same area.\nIsraeli army forces also shelled a civilian gathering in the Sabra neighborhood of Gaza City, leaving six people dead, medics said.\nFour more people were killed and several others injured when Israeli forces struck a crowd waiting for humanitarian aid near the Netzarim Corridor in central Gaza, a medical source said.\nA Palestinian man was also killed and several people were wounded while waiting for aid near a distribution center north of Rafah in southern Gaza.\nTwo children were also killed in an airstrike targeting a tent sheltering displaced families west of Khan Younis in southern Gaza.\nMeanwhile, the Israeli army demolished several residential buildings in Jabalia, and the Zeitoun and Shejaiya neighborhoods in northern Gaza.\nThe fresh attacks came as the Israeli army plans to occupy Gaza City, as part of a broader strategy to reoccupy the entire Gaza Strip.\nOn Friday, the UN’s Integrated Food Security Phase Classification (IPC) confirmed that famine has taken hold in northern Gaza and is expected to spread further south by the end of September.\nSince March 2, Israel has closed all crossings into Gaza, blocking humanitarian aid despite stockpiled aid trucks at the border. Only extremely limited quantities have been allowed in, insufficient to meet the minimum needs of the territory’s 2.4 million population.\nIsrael has killed over 62,600 Palestinians in Gaza since October 2023. The military campaign has devastated the enclave, which is facing famine.\nLast November, the International Criminal Court issued arrest warrants for Israeli Prime Minister Benjamin Netanyahu and his former Defense Minister Yoav Gallant for war crimes and crimes against humanity in Gaza.\nIsrael also faces a genocide case at the International Court of Justice for its war on the enclave.\nAnadolu Agency website contains only a portion of the news stories offered to subscribers in the AA News Broadcasting System (HAS), and in summarized form. Please contact us for subscription options."
    },
    {
      "news_title": "Israeli airstrikes kill at least 25 more Palestinians in Gaza seeking aid and shelter",
      "news_link": "https://globalnews.ca/video/11347441/israeli-airstrikes-kill-at-least-25-more-palestinians-in-gaza-seeking-aid-and-shelter",
      "bias": "Lean Left",
      "text": "Israeli airstrikes kill at least 25 more Palestinians in Gaza seeking aid and shelter\nVideos\n-\nIsraeli airstrikes kill at least 25 more Palestinians in Gaza seeking aid and shelter\n01:52 | August 23, 2025\n-\nGaza City braces for Israeli assault\n02:10 | August 24, 2025\n-\nCarney won’t rule out Canadian troops in Ukraine as part of security guarantees\n02:22 | August 24, 2025\n-\n‘Canada will always stand in solidarity with Ukraine,’ says Carney on Ukraine Independence day\n02:35 | August 24, 2025\n-\nUkrainians around the world mark 34th Independence Day from Soviet Union\n02:08 | August 23, 2025\n-\nUN-backed monitor declares famine in Gaza City\n02:49 | August 22, 2025\n-\nFamine declared in Gaza City, UN calls situation ‘unmistakable’\n03:01 | August 22, 2025\n-\nAttack on police helicopter leaves 12 dead in Colombia\n01:34 | August 22, 2025\n-\nNetanyahu approves Gaza City takeover plan\n02:13 | August 21, 2025\n-\nRussia unleashes large bombardment on Ukraine, brushes off Western efforts for peace\n02:12 | August 21, 2025\n-\nIsrael pushes ahead with Gaza City takeover amid renewed ceasefire talks\n02:12 | August 21, 2025\n-\nMaduro says Trump ordered U.S. anti-drug mission in Venezuela as pretext for intervention\n01:48 | August 21, 2025\n-\nRussia hits Ukraine with 550+ drones, missiles in overnight attack\n01:27 | August 21, 2025\n-\nIsrael begins ‘preliminary actions’ on Gaza City offensive\n02:25 | August 20, 2025\n-\nRussia says it must be included in talks on Ukraine’s security\n02:16 | August 20, 2025\n-\nAustralia’s Albanese responds to ‘weak politician’ remark from Netanyahu amid diplomatic spat\n01:39 | August 20, 2025\n-\nIsrael says it’s in control of area in outskirts of Gaza City, ready to call up 60K more troops\n02:11 | August 20, 2025\n-\nAfghanistan bus crash kills nearly 80, including children expelled from Iran\n01:31 | August 20, 2025\n-\nWhy a Swedish town is moving its historic church to new site\n02:08 | August 19, 2025\n-\nIsrael mulling Gaza ceasefire proposal accepted by Hamas\n02:01 | August 19, 2025\n-\nTrump seeks trilateral talks with Putin, Zelenskyy over Russia’s war on Ukraine\n02:10 | August 19, 2025\n-\nTrump says China won’t attack Taiwan on his watch, island maintains it must rely on its own security\n01:16 | August 19, 2025\n-\nMore floods sweep through Northern Pakistan\n02:03 | August 19, 2025\n-\n‘No tennis for genocide!’ Activists call for boycott of Davis Cup against Israel\n08:37 | August 19, 2025\n-\nHumanoid robots compete and crash at China’s first ‘robot Olympics’\n02:09 | August 18, 2025\n-\nUkrainians skeptical about Russia peace deal\n02:00 | August 18, 2025\n-\nTrump, Zelenskyy, European leaders meet for talks to end Ukraine war\n02:20 | August 18, 2025\n-\nPutin-Zelenskyy meeting to take place within 2 weeks, trilateral summit with Trump to follow: Merz\n01:09 | August 18, 2025\n-\nSon of Norway’s crown princess charged with rape and assault\n01:06 | August 18, 2025\n-\nZelenskyy, European leaders strategize ahead of Trump meeting in Washington\n02:13 | August 17, 2025\n-\nSouth Asia flooding: Why the Kashmir region is increasingly susceptible to climate change\n01:54 | August 16, 2025\n-\nIsraeli airstrikes kill at least 25 more Palestinians in Gaza seeking aid and shelter\n01:52 | August 23, 2025\n-\nGaza City braces for Israeli assault\n02:10 | August 24, 2025\n-\nCarney won’t rule out Canadian troops in Ukraine as part of security guarantees\n02:22 | August 24, 2025\n-\n‘Canada will always stand in solidarity with Ukraine,’ says Carney on Ukraine Independence day\n02:35 | August 24, 2025\n-\nUkrainians around the world mark 34th Independence Day from Soviet Union\n02:08 | August 23, 2025\n-\nUN-backed monitor declares famine in Gaza City\n02:49 | August 22, 2025\n-\nFamine declared in Gaza City, UN calls situation ‘unmistakable’\n03:01 | August 22, 2025\n-\nAttack on police helicopter leaves 12 dead in Colombia\n01:34 | August 22, 2025\n-\nNetanyahu approves Gaza City takeover plan\n02:13 | August 21, 2025\n-\nRussia unleashes large bombardment on Ukraine, brushes off Western efforts for peace\n02:12 | August 21, 2025\n-\nIsrael pushes ahead with Gaza City takeover amid renewed ceasefire talks\n02:12 | August 21, 2025\n-\nMaduro says Trump ordered U.S. anti-drug mission in Venezuela as pretext for intervention\n01:48 | August 21, 2025\n-\nRussia hits Ukraine with 550+ drones, missiles in overnight attack\n01:27 | August 21, 2025\n-\nIsrael begins ‘preliminary actions’ on Gaza City offensive\n02:25 | August 20, 2025\n-\nRussia says it must be included in talks on Ukraine’s security\n02:16 | August 20, 2025\n-\nAustralia’s Albanese responds to ‘weak politician’ remark from Netanyahu amid diplomatic spat\n01:39 | August 20, 2025\n-\nIsrael says it’s in control of area in outskirts of Gaza City, ready to call up 60K more troops\n02:11 | August 20, 2025\n-\nAfghanistan bus crash kills nearly 80, including children expelled from Iran\n01:31 | August 20, 2025\n-\nWhy a Swedish town is moving its historic church to new site\n02:08 | August 19, 2025\n-\nIsrael mulling Gaza ceasefire proposal accepted by Hamas\n02:01 | August 19, 2025\n-\nTrump seeks trilateral talks with Putin, Zelenskyy over Russia’s war on Ukraine\n02:10 | August 19, 2025\n-\nTrump says China won’t attack Taiwan on his watch, island maintains it must rely on its own security\n01:16 | August 19, 2025\n-\nMore floods sweep through Northern Pakistan\n02:03 | August 19, 2025\n-\n‘No tennis for genocide!’ Activists call for boycott of Davis Cup against Israel\n08:37 | August 19, 2025\n-\nHumanoid robots compete and crash at China’s first ‘robot Olympics’\n02:09 | August 18, 2025\n-\nUkrainians skeptical about Russia peace deal\n02:00 | August 18, 2025\n-\nTrump, Zelenskyy, European leaders meet for talks to end Ukraine war\n02:20 | August 18, 2025\n-\nPutin-Zelenskyy meeting to take place within 2 weeks, trilateral summit with Trump to follow: Merz\n01:09 | August 18, 2025\n-\nSon of Norway’s crown princess charged with rape and assault\n01:06 | August 18, 2025\n-\nZelenskyy, European leaders strategize ahead of Trump meeting in Washington\n02:13 | August 17, 2025\n-\nSouth Asia flooding: Why the Kashmir region is increasingly susceptible to climate change\n01:54 | August 16, 2025\nIsraeli airstrikes kill at least 25 more Palestinians in Gaza seeking aid and shelter\nDescription\nAugust 23, 2025\nHeavy smoke was seen rising in Deir Al Balah, Gaza, on Saturday, following an Israeli airstrike. At least 25 people were reported dead by the authorities.\n-\nIsraeli airstrikes kill at least 25 more Palestinians in Gaza seeking aid and shelter01:52 | August 23, 2025\n-\nGaza City braces for Israeli assault02:10 | August 24, 2025\n-\nCarney won’t rule out Canadian troops in Ukraine as part of security guarantees02:22 | August 24, 2025\n-\n‘Canada will always stand in solidarity with Ukraine,’ says Carney on Ukraine Independence day02:35 | August 24, 2025\n-\nUkrainians around the world mark 34th Independence Day from Soviet Union02:08 | August 23, 2025\n-\nUN-backed monitor declares famine in Gaza City02:49 | August 22, 2025\n-\nFamine declared in Gaza City, UN calls situation ‘unmistakable’03:01 | August 22, 2025\n-\nAttack on police helicopter leaves 12 dead in Colombia01:34 | August 22, 2025\n-\nNetanyahu approves Gaza City takeover plan02:13 | August 21, 2025\n-\nRussia unleashes large bombardment on Ukraine, brushes off Western efforts for peace02:12 | August 21, 2025\n-\nIsrael pushes ahead with Gaza City takeover amid renewed ceasefire talks02:12 | August 21, 2025\n-\nMaduro says Trump ordered U.S. anti-drug mission in Venezuela as pretext for intervention01:48 | August 21, 2025\n-\nRussia hits Ukraine with 550+ drones, missiles in overnight attack01:27 | August 21, 2025\n-\nIsrael begins ‘preliminary actions’ on Gaza City offensive02:25 | August 20, 2025\n-\nRussia says it must be included in talks on Ukraine’s security02:16 | August 20, 2025\n-\nAustralia’s Albanese responds to ‘weak politician’ remark from Netanyahu amid diplomatic spat01:39 | August 20, 2025\n-\nIsrael says it’s in control of area in outskirts of Gaza City, ready to call up 60K more troops02:11 | August 20, 2025\n-\nAfghanistan bus crash kills nearly 80, including children expelled from Iran01:31 | August 20, 2025\n-\nWhy a Swedish town is moving its historic church to new site02:08 | August 19, 2025\n-\nIsrael mulling Gaza ceasefire proposal accepted by Hamas02:01 | August 19, 2025\n-\nTrump seeks trilateral talks with Putin, Zelenskyy over Russia’s war on Ukraine02:10 | August 19, 2025\n-\nTrump says China won’t attack Taiwan on his watch, island maintains it must rely on its own security01:16 | August 19, 2025\n-\nMore floods sweep through Northern Pakistan02:03 | August 19, 2025\n-\n‘No tennis for genocide!’ Activists call for boycott of Davis Cup against Israel08:37 | August 19, 2025\n-\nHumanoid robots compete and crash at China’s first ‘robot Olympics’02:09 | August 18, 2025\n-\nUkrainians skeptical about Russia peace deal02:00 | August 18, 2025\n-\nTrump, Zelenskyy, European leaders meet for talks to end Ukraine war02:20 | August 18, 2025\n-\nPutin-Zelenskyy meeting to take place within 2 weeks, trilateral summit with Trump to follow: Merz01:09 | August 18, 2025\n-\nSon of Norway’s crown princess charged with rape and assault01:06 | August 18, 2025\n-\nZelenskyy, European leaders strategize ahead of Trump meeting in Washington02:13 | August 17, 2025\n-\nSouth Asia flooding: Why the Kashmir region is increasingly susceptible to climate change01:54 | August 16, 2025\n-\nIsraeli airstrikes kill at least 25 more Palestinians in Gaza seeking aid and shelter01:52 | August 23, 2025\n-\nGaza City braces for Israeli assault02:10 | August 24, 2025\n-\nCarney won’t rule out Canadian troops in Ukraine as part of security guarantees02:22 | August 24, 2025\n-\n‘Canada will always stand in solidarity with Ukraine,’ says Carney on Ukraine Independence day02:35 | August 24, 2025\n-\nUkrainians around the world mark 34th Independence Day from Soviet Union02:08 | August 23, 2025\n-\nUN-backed monitor declares famine in Gaza City02:49 | August 22, 2025\n-\nFamine declared in Gaza City, UN calls situation ‘unmistakable’03:01 | August 22, 2025\n-\nAttack on police helicopter leaves 12 dead in Colombia01:34 | August 22, 2025\n-\nNetanyahu approves Gaza City takeover plan02:13 | August 21, 2025\n-\nRussia unleashes large bombardment on Ukraine, brushes off Western efforts for peace02:12 | August 21, 2025\n-\nIsrael pushes ahead with Gaza City takeover amid renewed ceasefire talks02:12 | August 21, 2025\n-\nMaduro says Trump ordered U.S. anti-drug mission in Venezuela as pretext for intervention01:48 | August 21, 2025\n-\nRussia hits Ukraine with 550+ drones, missiles in overnight attack01:27 | August 21, 2025\n-\nIsrael begins ‘preliminary actions’ on Gaza City offensive02:25 | August 20, 2025\n-\nRussia says it must be included in talks on Ukraine’s security02:16 | August 20, 2025\n-\nAustralia’s Albanese responds to ‘weak politician’ remark from Netanyahu amid diplomatic spat01:39 | August 20, 2025\n-\nIsrael says it’s in control of area in outskirts of Gaza City, ready to call up 60K more troops02:11 | August 20, 2025\n-\nAfghanistan bus crash kills nearly 80, including children expelled from Iran01:31 | August 20, 2025\n-\nWhy a Swedish town is moving its historic church to new site02:08 | August 19, 2025\n-\nIsrael mulling Gaza ceasefire proposal accepted by Hamas02:01 | August 19, 2025\n-\nTrump seeks trilateral talks with Putin, Zelenskyy over Russia’s war on Ukraine02:10 | August 19, 2025\n-\nTrump says China won’t attack Taiwan on his watch, island maintains it must rely on its own security01:16 | August 19, 2025\n-\nMore floods sweep through Northern Pakistan02:03 | August 19, 2025\n-\n‘No tennis for genocide!’ Activists call for boycott of Davis Cup against Israel08:37 | August 19, 2025\n-\nHumanoid robots compete and crash at China’s first ‘robot Olympics’02:09 | August 18, 2025\n-\nUkrainians skeptical about Russia peace deal02:00 | August 18, 2025\n-\nTrump, Zelenskyy, European leaders meet for talks to end Ukraine war02:20 | August 18, 2025\n-\nPutin-Zelenskyy meeting to take place within 2 weeks, trilateral summit with Trump to follow: Merz01:09 | August 18, 2025\n-\nSon of Norway’s crown princess charged with rape and assault01:06 | August 18, 2025\n-\nZelenskyy, European leaders strategize ahead of Trump meeting in Washington02:13 | August 17, 2025\n-\nSouth Asia flooding: Why the Kashmir region is increasingly susceptible to climate change01:54 | August 16, 2025\nIsraeli airstrikes kill at least 25 more Palestinians in Gaza seeking aid and shelter\nDescription\nAugust 23, 2025\nHeavy smoke was seen rising in Deir Al Balah, Gaza, on Saturday, following an Israeli airstrike. At least 25 people were reported dead by the authorities.\nNational News\n-\nU.S. National Guard troops carry weapons while patrolling D.C. streets2:026 hours ago\n-\nCanada to quadruple Canada’s defence spending by 2030: Carney2:336 hours ago\n-\nOutrage after Florida officials paint over rainbow crosswalk memorial for Pulse nightclub shooting2:1618 hours ago\n-\nTrump plans to send National Guard to Chicago2:1118 hours ago\n-\nGaza City braces for Israeli assault2:107 hours ago\n-\nCarney details spending in Ukraine, won’t rule out Canadian troops2:577 hours ago\n-\nCalifornia wildfires: Firefighters ‘confident’ despite growth of Pickett Fire1:5219 hours ago\n-\nCarney won’t rule out Canadian troops in Ukraine as part of security guarantees2:221 day ago\n-\nWhy are U.S. states racing to redraw voting maps ahead of 2026 mid-term elections?8:271 day ago\n-\n‘Canada will always stand in solidarity with Ukraine,’ says Carney on Ukraine Independence day2:351 day ago\nAdvertisement\nTop News\n-\nCanada to quadruple Canada’s defence spending by 2030: Carney2:336 hours ago\n-\nCarney details spending in Ukraine, won’t rule out Canadian troops2:577 hours ago\n-\n‘Canada will always stand in solidarity with Ukraine,’ says Carney on Ukraine Independence day2:351 day ago\n-\nCarney dropping US tariffs under CUSMA, a one-sided bargain?3:163 days ago\n-\nCarney’s elbows ‘mysteriously gone missing’ as he removes retaliatory tariffs on U.S.: Poilievre2:513 days ago\n-\nCarney holds ‘substantive and lengthy’ call with Trump as U.S. trade war stretches on2:014 days ago\n-\n‘Inhumanity’: France probes death of man on livestream after violence, humiliation1:324 days ago\n-\n‘The ocean is speaking’ : Hurricane Erin stirs powerful flooding along North Carolina’s Outer Banks1:454 days ago\n-\nAustralia’s Albanese responds to ‘weak politician’ remark from Netanyahu amid diplomatic spat1:395 days ago\n-\nAfghanistan bus crash kills nearly 80, including children expelled from Iran1:314 days ago\nSponsored Content\nTrending\n-\nLong Lake fire keeps grows as province issues update on wildfire situation2:017 days ago\n-\nCourt documents offer new details about missing N.S. siblings, Lilly and Jack Sullivan0:292 days ago\n-\nSearch continues for missing Norwegian hiker4:334 days ago\n-\nA look at tipping culture and whether people can afford it2:0412 months ago\n-\nNew chapter in trade dispute with U.S. as Canada drops retaliatory tariffs3:487 hours ago\nCanada\n-\nAtlantic Canada wild blueberry farmers warn of steep losses amid drought1:587 hours ago\n-\n‘Canada will always stand in solidarity with Ukraine,’ says Carney on Ukraine Independence day2:351 day ago\n-\nCarney in Europe seeking economic alliances, peace for Ukraine2:162 days ago\n-\nCanadian industries split after Carney drops tariffs against US products under CUSMA2:033 days ago\n-\n‘Unanimous no’: End of road for Universal Ostrich Farm as it loses final appeal2:063 days ago\n-\nCalls for action after 8-year-old boy shot and killed2:063 days ago\n-\nCanada’s 1st dinosaur-era dragonfly fossil unearthed2:055 days ago\n-\n60 trapped hikers rescued from flash flood in Bugaboo Provincial Park1:434 days ago\n-\nCanadians divided on Indigenous issues, poll finds2:054 days ago\n-\nCarney gets red carpet treatment in Montreal1:555 days ago\nU.S. News\n-\nCalifornia wildfires: Firefighters ‘confident’ despite growth of Pickett Fire1:5219 hours ago\n-\nFBI raids Trump’s ex-national security adviser John Bolton’s home2:013 days ago\n-\nCalifornia lawmakers pass Democrat redistricting plan ahead of vote on congressional map2:513 days ago\n-\nFirefighters rescue 40-year-old man stuck in slide at children’s playground in Connecticut0:323 days ago\n-\nFrank Caprio, ‘nicest judge in the world,’ dead at 882:114 days ago\n-\n‘It’s about control’: Locals slam Trump’s D.C. takeover2:084 days ago\n-\n‘Scary’: California resident tests positive for bubonic plague after camping near Lake Tahoe1:294 days ago\n-\nCalifornia democrats to counter Texas with vote on new congressional map1:474 days ago\n-\nBoxer Julio César Chávez Jr. deported from U.S., jailed in Mexico0:295 days ago\n-\n2 U.S. tourists drown in separate incidents on Carnival Cruises resort1:171 week ago\nAdvertisement\nWorld\n-\nGaza City braces for Israeli assault2:107 hours ago\n-\nCarney won’t rule out Canadian troops in Ukraine as part of security guarantees2:221 day ago\n-\n‘Canada will always stand in solidarity with Ukraine,’ says Carney on Ukraine Independence day2:351 day ago\n-\nUkrainians around the world mark 34th Independence Day from Soviet Union2:082 days ago\n-\nB.C. Ukrainians getting ready to mark their homeland’s independence day2:152 days ago\n-\nIsraeli airstrikes kill at least 25 more Palestinians in Gaza seeking aid and shelter1:522 days ago\n-\nCountdown to 2026 FIFA World Cup6:062 days ago\n-\nSmart strategy or giving in? Canada drops some retaliatory tariffs against the U.S.4:392 days ago\n-\nUN-backed monitor declares famine in Gaza City2:493 days ago\n-\nFamine declared in Gaza City, UN calls situation ‘unmistakable’3:013 days ago\nPolitics\n-\nB.C.’s Jobs Minister weighs in on Ottawa’s decision to drop some retaliatory U.S tariffs5:136 hours ago\n-\nYWCA, Elizabeth Fry Society and Adsum for Women and Children partner on call-to-action for sustained WAGE funding at federal level5:567 hours ago\n-\nOutrage after Florida officials paint over rainbow crosswalk memorial for Pulse nightclub shooting2:1618 hours ago\n-\nTrump plans to send National Guard to Chicago2:1118 hours ago\n-\nCarney details spending in Ukraine, won’t rule out Canadian troops2:577 hours ago\n-\nHalifax joins Ukraine Independence celebrations2:0723 hours ago\n-\nNew chapter in trade dispute with U.S. as Canada drops retaliatory tariffs3:487 hours ago\n-\nPetition to amalgamate White Rock and Surrey3:341 day ago\n-\nRemoving US retaliatory tariffs garners mixed reaction for Carney3:112 days ago\n-\nCarney in Europe seeking economic alliances, peace for Ukraine2:162 days ago\nHealth and Wellness\n-\nAlberta government reveals cost to get COVID-19 vaccine for most citizens1:483 days ago\n-\nBed shortage leaves N.B. seniors stuck in hospitals1:483 days ago\n-\nHealth Matters: Safety risks linked to baby nests and loungers2:414 days ago\n-\nHealth Matters: Burgers to Beat MS Campaign4:524 days ago\n-\nLake Country woman urges self-advocacy after early cancer diagnosis1:424 days ago\n-\nLung cancer a growing concern for non-smokers2:045 days ago\n-\nBack to school bus experience helps children with diverse needs prepare to head back to classes1:124 days ago\n-\nInconsistent home care leaves families hurting1:436 days ago\n-\nEmpowering potential: How Resilient Hearts is changing lives in Calgary4:286 days ago\n-\nHealth Checkup: Family planning choices5:134 days ago\nAdvertisement\nInvestigative News\n-\nCourt docs reveal CSIS told RCMP about alleged Quebec militia members2:053 days ago\n-\nPotential hate crime suspect photos released by Kelowna RCMP2:194 days ago\n-\nClear-cutting and what role it may have played in wildfire situation2:037 days ago\n-\nB.C. woman wrongly declared ‘deceased’ by federal Vaccine Injury Support Program2:591 week ago\n-\nHow did a Chinese company win a contract with BC Ferries?2:062 weeks ago\n-\nCBS News investigation claims to find discrepancies in FBI Epstein jail video9:463 weeks ago\n-\nOttawa will ‘try’ to improve Vaccine Injury Support Program: health minister1:121 month ago\n-\n‘Slap in the face’: Calls for investigation into Vaccine Injury Support Program2:411 month ago\n-\nFederal Vaccine Injury Support Program leaving some injured people waiting for years3:012 months ago\n-\n‘Chaos’ inside Federal Vaccine Injury Support Program4:032 months ago\nNews Bloopers\n-\n‘Can’t use that on TV’: Watch a Global News reporter jump from the highest bungee jump in Canada0:364 months ago\n-\nBlack bear in tree has rough landing after being tranquilized at Halifax-area park0:4811 months ago\n-\nEdmonton, B.C. morning show hosts settle NHL playoff bet3:0515 months ago\n-\n‘You can’t make this stuff up:’ Loud clap of thunder interrupts live TV segment at pivotal moment0:2423 months ago\n-\nGlobal Calgary weather anchor startled by surprise guest appearance0:2127 months ago\n-\nFun times? Global News personalities help clear snow in search of ‘fun’ story2:0034 months ago\n-\n‘Buzzworthy moment’: Colin D’Mello recaps Doug Ford accidentally swallowing a bee1:5736 months ago\n-\n‘Did you just call me daddy?’: Morning show hosts can’t hold back laughter after on-air mixup1:1437 months ago\n-\nB.C. dad hoping to see his cloud photo on TV get his wish following viral TikTok campaign2:1140 months ago\n-\nBloopers: Phil Darlington slips, slides and falls in these Our Winter City outtakes1:3834 months ago"
    },
    {
      "news_title": "Death toll of Palestinian journalists in Gaza rises to 239 as another reporter killed in Israeli strike",
      "news_link": "https://presstv.ir/Detail/2025/08/19/753359/Death-toll-of-Palestinian-journalists-rises-to-239-as-another-reporter-dies-in-Israeli-strike-on-Gaza",
      "bias": "Right",
      "text": "Local Gaza authorities say the Israeli military has killed another Palestinian journalist in the strip, bringing the death toll to 239 since the occupying Tel Aviv regime launched its all-out onslaught on the blockaded territory in early October 2023.\nA medical source stated that at least three Palestinians were killed and several others injured in an Israeli strike on the Sabra neighborhood of Gaza City on Monday.\nLocal Palestinian outlets reported that journalist Islam al-Koumi was among the victims.\nThis comes as the remains of a journalist from Gaza were uncovered weeks after an Israeli strike claimed her life.\nMarwa Musallam was buried under the rubble after an Israeli airstrike in Gaza City in July. Her cries for help went unanswered amid pleas to pressure Israel to allow rescuers to reach her.\nMusallam’s remains were discovered 45 days later.\nMeanwhile, the Columbia Journalism Review (CJR) has requested suggestions from reporters, editors, and rights specialists to investigate innovative methods for safeguarding Palestinian journalists in Gaza.\nIn a recently introduced feature, the CRJ has advocated for a courageous, innovative strategy aimed at protecting reporters on the ground, who are confronted with assassinations and smear campaigns due to the deterioration of legal and institutional safeguards.\nThe proposals included sanctions against Israeli officials, media strikes, coordinated blackouts, and charges of war crimes at the International Criminal Court.\n“Journalists in Western newsrooms could strike. They could refuse to work until some sort of substantive demand for a policy change at these institutions is fulfilled,” Drop Site News’s Sharif Abdel Kouddous said.\n“What could this policy change be? Perhaps a disclaimer at the bottom, or within, every article that quotes Israeli authorities that Israel has killed far more journalists in Gaza than anywhere in the world since the Committee to Protect Journalists started keeping records, and therefore the veracity of any statement is dubious.”\nAs Israel persists in prohibiting foreign journalists from accessing the coastal territory, Palestinian reporters continue to be the exclusive source of firsthand reporting from within the conflict zone.\nThe Federation of News Agencies of the Organization of Islamic Cooperation (OIC) has expressed its deep concern over the continued assassination of Palestinian journalists by the Israeli forces while carrying out their duties.\nThe federation emphasized that what is happening in Gaza constitutes a clear violation of international laws and norms, and comes in the context of Israeli violations of freedom of the press and media, and its policy of confiscating the truth, gagging, covering up its daily violations, and preventing them from reaching global public opinion.\nThe Israeli military has pursued a brutal offensive on Gaza since October 7, 2023, dismissing international appeals for a ceasefire. The war has killed at least 62,004 Palestinians, predominantly women and children.\nThe unrelenting airstrikes have also ravaged the region and caused significant food shortages.\nThe International Criminal Court issued arrest warrants last November for Israeli Prime Minister Benjamin Netanyahu and former minister of military affairs Yoav Gallant, citing war crimes and crimes against humanity in Gaza.\nIsrael also faces a genocide case at the International Court of Justice for its war on the besieged coastal territory."
    },
    {
      "news_title": "Only way to stop the war is for Gazans to rise up against Hamas, writes Palestinian journalist",
      "news_link": "https://www.thejc.com/news/israel/only-way-to-stop-the-war-is-for-gazans-to-rise-up-against-hamas-writes-palestinian-journalist-ylavp1it",
      "bias": "Lean Right",
      "text": null
    },
    {
      "news_title": "Israeli Strike on Gaza Hospital Kills 19",
      "news_link": "https://www.editorji.com/world-news/israeli-strike-on-gaza-hospital-kills-19-1756127245625",
      "bias": "unknown",
      "text": "Deir Al-Balah (Gaza Strip), Aug 25 (AP) — A significant strike by Israel on southern Gaza's main hospital on Monday led to the deaths of at least 19 individuals, including four journalists, according to medical officials.\nThe assault commenced with a missile targeting the top floor of a Nasser Hospital building. As journalists and rescue workers hurried up an external staircase to respond, a second missile struck the same spot, said Dr. Ahmed al-Farra, head of the hospital's pediatrics department.\nAmong the victims was Mariam Dagga, a 33-year-old visual journalist associated with The Associated Press. Dagga often reported from Nasser Hospital, including a piece on doctors' efforts to combat child starvation. Al Jazeera and Reuters confirmed their journalists were also among those killed.\nIsrael's military confirmed targeting areas near the hospital and announced an investigation into the incident. The military expressed regret over harm to non-involved individuals, emphasizing that targeting journalists was not their intention. This event is a continuation of various attacks on hospitals during the ongoing conflict, with these facilities overwhelmed by the injured from warfare and rising malnutrition cases attributed to parts of Gaza nearing famine.\nThe initial missile hit at approximately 10:10 am struck operating rooms and doctors' residences on the fourth floor, resulting in at least two deaths, stated Zaher al-Waheidi, head of the Health Ministry's records department. The second strike on the stairwell claimed 17 more lives, impacting medical staff, rescuers, and journalists.\nThe building's external staircase was frequently used by journalists for live TV spots and for internet access. A British doctor present during the strikes described the resultant chaos, noting how blood trails filled the corridors as stretcher-bearers dashed past anxious visitors in search of loved ones. The overwhelming scenario reached a head as the hospital operated beyond capacity, with patients and their IV drips relegated to the floors amid stifling heat.\nExpressing horror at the attack on what should be a sanctuary for medical professionals, the doctor, choosing anonymity for safety reasons, voiced concern for colleagues and patients left at Nasser Hospital.\nKhan Younis' Nasser Hospital, as southern Gaza's largest, has withstood attacks throughout the conflict. Prime Minister Benjamin Netanyahu's office did not offer immediate comments on the recent strike, though prior hospital attacks drew a ranged array of reactions.\nPrior to the hospital strike, Israel's military Arabic spokesperson, Avichay Adraee, had advised Gaza's health officials to relocate patients to the south, as preparations for an offensive in Gaza City intensified. Meanwhile, hospital officials from northern Gaza reported significant casualties from strikes and gunfire on aid routes.\nIn addition to Nasser Hospital casualties, Shifa Hospital confirmed three deaths, including a child, from a strike as Israel readied its ground invasion. Al-Awda Hospital also reported fatalities and injuries from an incident involving Israeli gunfire directed at aid seekers.\nThe Israel-Hamas conflict has marked one of the bloodiest periods for the press, with 192 journalists killed over 22 months, and more than 1,500 health workers lost, according to the UN. Israel maintains that its raids on hospitals target militants allegedly operating from these facilities, though evidence has not been provided.\nEarlier incidents include a June strike on Nasser Hospital that resulted in three deaths and ten injuries, under allegations of targeting a Hamas center within the hospital. The health ministry reports over 62,686 Palestinian deaths in the war, estimating approximately half as women and children. The UN considers these statistics the most reliable, though Israel disputes their accuracy without presenting alternative numbers. (AP) SKS GRS GRS\n(Only the headline of this report may have been reworked by Editorji; the rest of the content is auto-generated from a syndicated feed.)"
    },
    {
      "news_title": "Four journalists among victims of Israeli strike on Gaza hospital",
      "news_link": "https://www.eadt.co.uk/news/national/25414536.four-journalists-among-victims-israeli-strike-gaza-hospital/",
      "bias": "unknown",
      "text": "An Israeli strike has hit southern Gaza’s main hospital, killing at least 20 people.\nThe victims on the fourth floor of Nasser Hospital died when one missile hit and was followed in the same spot by another missile moments later as rescue crews arrived, the health ministry said.\nKhan Younis’ Nasser Hospital, the largest in southern Gaza, has withstood raids and bombardment throughout 22 months of war, with officials warning of critical shortages of supplies and staff.\nAmong the those killed were five journalists including 33-year-old Mariam Dagga, a broadcast journalist who had worked for The Associated Press since the start of the war.\nMs Dagga was a freelancer who recently reported on Nasser Hospital doctors struggling to save children with no prior health issues who were dying or wasting away from starvation. Al Jazeera and Reuters also confirmed their journalists and freelancers were among those killed.\nThe Israel-Hamas war has been one of the bloodiest conflicts for media workers, with at least 192 journalists killed in Gaza in the 22-month conflict, according to the Committee To Protect Journalists.\nIn addition to the 15 killed at Nasser Hospital, hospital officials in northern Gaza also reported deaths from strikes and gunfire along the route to aid sites.\nThree Palestinians, including a child, were killed in a strike on a neighbourhood in Gaza City, where Israel is preparing for a broader ground invasion in the coming days, Shifa Hospital said.\nAl-Awda Hospital reported six people trying to reach an aid distribution point in central Gaza were killed by Israeli gunfire in an incident that also wounded 15.\nIsraeli strikes and raids on hospitals are not uncommon. Multiple hospitals have been struck or raided across the Gaza Strip, with Israel claiming its attacks targeted militants operating inside the medical facilities, without providing evidence.\nA June strike on Nasser Hospital killed three people and wounded 10, according to the health ministry.\nAt the time, Israel’s military said it had targeted Hamas militants operating from a command and control centre inside the hospital. A March strike on the hospital’s surgical unit days after a ceasefire broke down killed two people.\nThe Hamas-run health ministry said on Sunday that at least 62,686 Palestinians have been killed in the war.\nIt does not distinguish between fighters and civilians but says around half have been women and children. The UN and independent experts consider it the most reliable source on war casualties. Israel disputes its figures but has not provided its own."
    },
    {
      "news_title": "Israel bombs Gazan hospital twice, killing Al Jazeera journalist among 15 others",
      "news_link": "https://thepeninsulaqatar.com/article/25/08/2025/israel-bombs-gazan-hospital-twice-killing-al-jazeera-journalist-among-15-others",
      "bias": "unknown",
      "text": "Graphic content / Palestinian medics bring an injured civil defence member at Nasser Hospital in Khan Yunis, in the southern Gaza Strip, on August 25, 2025, following Israeli air strikes. Israeli strikes on the hospital killed at least 15 people on August 25, including four journalists and one civil defence member. (Photo by AFP)\nDoha, Qatar: At least four Palestinian journalists among 15 people were killed by an Israeli airstrike on Al Nasr Medical Complex in southern Gaza, Al-Jazeera reports.\nOne of the martyrs is a reporter for Al-Jazeera media network, which has been a consistent target for the relentless deliberate murder campaign Israel has been launching against journalists in Gaza and other international bodies.\nPalestinians gather outside Nasser hospital in Khan Yunis in the southern Gaza Strip on August 25, 2025, following Israeli strikes. Photo by AFP.\nAccording to Jazeera reporter, Hind Khoudary, the events unfolded as follows:\nThe Israeli forces launched an explosive suicide drone, where it hit the rooftop of Nasser hospital where at least a journalist was killed.\nAs the civil defence teams rushed to retrieve the body and rescue the wounded, the Israeli forces targeted the same place again, which was documented on air due to the presence of journalists in the vicinity.\nKhoudary added that not just the journalists that were covering this have been killed and wounded, the Civil defence teams that were trying to retrieve the bodies of those who were killed were also killed.\nGraphic content / People help Palestinian photojournalist Hatem Omar, who was injured in Israeli strikes on Nasser hospital in Khan Yunis in the southern Gaza Strip on August 25, 2025. Photo by AFP.\nThe journalists killed were identified as Palestine TV cameraman Hossam Al Masry, Al Jazeera cameraman Mohammed Salama, Maryam Abu Daqqa, and Moaz Abu Taha. Several other journalists were also reported injured.\nNasser Hospital, the largest medical facility in southern Gaza, has endured repeated raids and bombardments over the course of 22 months of conflict, despite critical shortages of staff and medical supplies."
    },
    {
      "news_title": "Israeli Airstrike on Gaza’s Nasser Hospital Kills 19, Including Four Journalists",
      "news_link": "https://thecsrjournal.in/israeli-airstrike-on-gaza-nasser-hospital-kills-including-four-journalists/",
      "bias": "unknown",
      "text": "Israeli Airstrike on Gaza’s Nasser Hospital Kills 19, Including Four Journalists\nRelated Articles\nCalcutta High Court asks West Bengal to share accounts of clubs that received Durga Puja grants in past few years\nHow many clubs have revealed their accounts for Durga Puja donations till last year? What action has been taken against those who have not?...\nLove Turned Fatal: Teen Girl Shot Dead in Home By Boyfriend After Relationship Ends\nIn a disturbing act of violence, a 19-year-old girl named Ishita Mallik was shot and killed inside her own residence on Monday afternoon in...\nYouTuber Sagar Kundu swept away at Duduma waterfall in Odisha\nA tragic incident has been reported from Odisha where a young YouTuber, Sagar Kundu, was swept away in the strong currents of the Duduma..."
    },
    {
      "news_title": "Associated Press journalist killed in Israeli strike in Gaza, agency confirms - Everett Post",
      "news_link": "https://www.everettpost.com/world/associated-press-journalist-killed-in-israeli-strike-in-gaza-agency-confirms/",
      "bias": "unknown",
      "text": null
    },
    {
      "news_title": "Israeli Airstrike on Gaza Hospital Kills 19, Including 4 Journalists",
      "news_link": "https://thehindustangazette.com/election/israeli-airstrike-gaza-hospital-19-killed-4-journalists-38977",
      "bias": "unknown",
      "text": "Khan Younis: At least 19 people, including four journalists, were killed on Monday after an Israeli airstrike hit the fourth floor of Nasser Hospital in southern Gaza, according to the Gaza Health Ministry.\nOfficials said the strike was a “double-tap” attack—one missile first hit the hospital, and a second struck when rescue workers arrived. Nasser Hospital, the largest in southern Gaza, has faced repeated bombings during the conflict.\nAmong the dead were journalists Mariam Dakka, a 33-year-old freelancer for the Associated Press, Al Jazeera reporter Mohammad Salam, and cameraman Hussam al-Masri. Reuters confirmed its photographer Hatem Khaled was injured in the attack. Israel has not yet commented on the incident."
    },
    {
      "news_title": "Israeli Airstrike on Southern Gaza Hospital Kills 19 Including 4 Journalists",
      "news_link": "https://www.khaosodenglish.com/news/international/2025/08/25/israeli-airstrike-on-southern-gaza-hospital-kills-19-including-4-journalists/",
      "bias": "unknown",
      "text": null
    },
    {
      "news_title": "Multiple Journalists Killed By Israeli Strikes On Gaza Hospital",
      "news_link": "https://kashmirobserver.net/2025/08/25/multiple-journalists-killed-by-israeli-strikes-on-gaza-hospital/",
      "bias": "unknown",
      "text": "Deir al-Balah(Gaza Strip)- Four journalists were among at least eight people killed on Monday in a strike on a hospital in southern Gaza, including a freelancer who worked for the Associated Press.\nMariam Dagga, 33 freelanced for the AP since the Gaza war began, as well as other news outlets.\nDagga reported on Nasser Hospital doctors struggling to save children with no prior health issues who were wasting away from starvation.\nAl Jazeera confirmed that its journalist Mohammed Salam was among those who were killed in the Nasser hospital strike. Reuters reported that its contractor cameraman Hussam al-Masri was also killed in the strike. Photographer Hatem Khaled, who was also a Reuters contractor, was wounded, the news agency reported.\nThe Israel-Hamas has been one of the bloodiest conflicts for media workers, with a total of 192 journalists killed in Gaza in the 22-month conflict, according to the Committee to Protect Journalists. Comparatively, 18 journalists have been killed so far in the Russia-Ukraine war, according to the CPJ.\nThe Israeli Prime Minister’s Office and Israeli military refused to comment on the incident. (AP)"
    },
    {
      "news_title": "Israeli strikes kill 51 Palestinians in Gaza",
      "news_link": "https://minutemirror.com.pk/israeli-strikes-kill-51-palestinians-in-gaza-428829/",
      "bias": "unknown",
      "text": "At least 51 Palestinians were killed in the latest wave of Israeli air and ground assaults on Gaza, according to Palestinian medical authorities.\nArab media outlets, citing the Palestinian Civil Defense, reported that Israeli forces have destroyed more than 1,000 residential and commercial buildings in the Zeitoun and Sabra neighborhoods and surrounding areas. Officials said these communities have been reduced to rubble since the Israeli military intensified its operations on August 6.\nThe Civil Defense further noted that heavy bombardment continued through Sunday, leaving main roads blocked and forcing emergency teams to suspend search and rescue efforts. “Working in these areas is an overwhelming task compared to our capacity,” the agency said, pointing to the shortage of equipment and personnel needed to respond to the scale of destruction.\nAuthorities added that no part of Gaza—whether in the north or south—can be considered safe anymore, as residential homes, camps, and even temporary shelters have come under fire.\nMedical officials confirmed that among the 51 fatalities, 24 were civilians waiting for humanitarian aid, underscoring the increasing danger faced by people gathering at aid distribution points.\nWe welcome your contributions! Submit your blogs, opinion pieces, press releases, news story pitches, and news features to opinion@minutemirror.com.pk and minutemirrormail@gmail.com"
    },
    {
      "news_title": "Damascus and Jerusalem Edge Toward Security Understanding: Syrian President Confirms “Advanced Talks”",
      "news_link": "https://tjvnews.com/news/israel/damascus-and-jerusalem-edge-toward-security-understanding-syrian-president-confirms-advanced-talks/",
      "bias": "unknown",
      "text": "|\nGetting your Trinity Audio player ready...\n|\nDamascus and Jerusalem Edge Toward Security Understanding: Syrian President Confirms “Advanced Talks”\nBy: Fern Sidman\nIn a development that could signal a rare recalibration in one of the Middle East’s most entrenched conflicts, Syrian President Ahmed al-Sharaa confirmed on Sunday that “advanced talks” are underway between Damascus and Jerusalem regarding a prospective security agreement. His remarks, delivered to Arab media representatives, underscore an evolving diplomatic track that may reduce hostilities along one of Israel’s most sensitive borders. According to a report on Sunday at Israel National News (INN), the discussions are widely seen as an effort to renew the 1974 disengagement framework, which has largely defined the Israel-Syria frontier for nearly half a century.\nPresident al-Sharaa stated explicitly that the proposed agreement would be anchored in the 1974 disengagement line, a demarcation established after the Yom Kippur War under U.S. and U.N. auspices. As the INN report highlighted, this line, monitored by U.N. peacekeepers, has served as the practical buffer between Israeli and Syrian forces on the Golan Heights, preserving a tenuous but enduring ceasefire despite decades of enmity.\nAl-Sharaa described the objective as a renewal of the ceasefire and the establishment of “security arrangements” intended to safeguard Syria’s sovereignty while reducing the risk of cross-border escalation. He carefully noted that while these steps could open the door to broader initiatives, he does not yet foresee the prospect of a full peace treaty with Israel. “If a peace agreement serves the interests of Syria and the Syrian people, I will not hesitate to choose that option,” he said, leaving the possibility open but distant.\nThe timing of al-Sharaa’s remarks is notable. Just last week, Independent Arabia reported that Israel and Syria are expected to sign a security arrangement on September 25, under American mediation. The reported accord would be limited in scope, designed to stabilize the border and reduce military friction, rather than constitute a comprehensive peace agreement.\nAs INN reported, Syria’s official news agency revealed that Syrian Foreign Minister Asaad al-Shaibani recently met an Israeli delegation in Paris, reportedly led by Israel’s Minister of Strategic Affairs, Ron Dermer. These secretive encounters, facilitated by Washington, appear to have laid the groundwork for what could become the most tangible Israeli-Syrian understanding since the 1970s.\nAccording to sources cited by INN, the talks have focused on several core issues critical to regional security:\nDe-escalation along the border: Ensuring that Syrian and Israeli forces refrain from provocative maneuvers that could ignite clashes.\nNon-interference in internal affairs: Israel seeking assurances that its territory will not become a platform for Iranian entrenchment or Hezbollah expansion under Syrian cover.\nStability in southern Syria: Addressing the volatile Druze Mountain area and preventing militias from exploiting local tensions.\nCeasefire monitoring: Renewing mechanisms for oversight and verification that the 1974 disengagement principles are being upheld.\nThe INN report emphasized that these topics reflect both sides’ mutual interest in avoiding unintended escalation, particularly at a moment when the Syrian state is weakened by years of civil war and Israel remains focused on countering Iran’s regional ambitions.\nFor Damascus, engagement with Israel represents a pragmatic maneuver rather than an ideological shift. After more than a decade of war that has left much of the country in ruins, President al-Sharaa faces pressing demands for reconstruction and stability. As the INN report noted, the Syrian leader appears intent on consolidating his hold on power by reducing external pressures. Renewing the disengagement framework could ease tensions along the Golan frontier, allowing Damascus to redirect resources inward while signaling to Arab and Western actors that Syria is capable of limited, responsible diplomacy.\nYet al-Sharaa was clear in his remarks: normalization or peace is not on the table for now. Instead, he framed the talks as a security necessity rather than a political reconciliation. His comments appear designed to balance domestic sensitivities—where anti-Israel sentiment remains widespread—with the practical need for quiet borders.\nFrom Jerusalem’s vantage point, any deal with Damascus must be measured against the overriding concern of Iranian entrenchment in Syria. Israel has repeatedly struck Iranian weapons convoys and facilities inside Syria to prevent Hezbollah’s military build-up. A renewed disengagement framework would allow Israel to press Damascus to curtail Iranian or Hezbollah activity in proximity to Israeli territory.\nAs the INN report observed, Israeli officials are cautiously weighing the opportunity to achieve greater stability on the northern frontier without making sweeping concessions. With Lebanon teetering on the edge of collapse and Hezbollah continuing its provocations, a limited understanding with Damascus could reduce the risk of simultaneous escalations on multiple fronts.\nThe United States has long played a pivotal role in managing the Israel-Syria relationship. From Henry Kissinger’s shuttle diplomacy in 1974 to the Clinton-era peace efforts of the 1990s, Washington has consistently viewed the Golan Heights as a flashpoint requiring careful oversight.\nAccording to the information provided in the INN report, the Trump administration is eager to demonstrate diplomatic engagement in the region at a time when U.S. influence is being challenged by Russia and Iran. By mediating an Israel-Syria security accord, Washington could reaffirm its role as the indispensable stabilizer in the Middle East while signaling support for Israel’s security concerns.\nDespite the apparent progress, formidable obstacles remain. Al-Sharaa’s insistence on preserving Syrian sovereignty could conflict with Israel’s demand for robust monitoring of Iranian activity. Trust between the two states remains minimal, and the legacy of decades of conflict cannot be erased by technical agreements alone.\nFurthermore, as the INN report pointed out, the broader regional context—ranging from Hezbollah’s posture in Lebanon to Iranian ambitions in Syria—could undermine any bilateral deal. If Damascus is unwilling or unable to restrain Tehran’s presence on its soil, the value of an agreement could be limited.\nPresident Ahmed al-Sharaa’s confirmation of “advanced talks” with Israel represents one of the most significant diplomatic developments between the two countries in decades. While the proposed agreement is far from a peace treaty, it reflects a mutual recognition that stability along the Golan frontier is in both nations’ interests.\nAs the INN report indicated, the potential accord would renew the spirit of the 1974 disengagement agreement while adapting it to today’s realities: the need to contain Iranian influence, preserve Syrian sovereignty, and prevent spirals of escalation.\nFor Syria, the talks offer a path toward limited regional reintegration and domestic stability. For Israel, they provide a chance to reduce immediate threats while preserving freedom of action against Iran. For Washington, the process represents an opportunity to reaffirm its role as guarantor of Middle Eastern order.\nThough still tentative, the negotiations highlight a paradox of Middle Eastern diplomacy: even adversaries with decades of enmity can find common cause in the pursuit of quiet borders. Whether these talks succeed will depend not only on signatures but on the capacity of both sides to enforce their commitments in a region where ceasefires are fragile and mistrust is abundant."
    },
    {
      "news_title": "Four journalists killed in Israeli strike on Gaza hospital, including Al Jazeera cameraman",
      "news_link": "https://english.mathrubhumi.com/news/world/al-jazeera-journalist-among-14-killed-in-israeli-strike-on-gaza-hospital-u0oteysq",
      "bias": "unknown",
      "text": "Photojournalist Mohammad Salama killed in Israeli strike on Gaza medical complex, 14 dead.\nDoha: Four journalists were among at least eight people killed on Monday in a strike on a hospital in southern Gaza.\nAl Jazeera on Monday said one of its journalists was killed in an Israeli strike in Gaza, two weeks after the broadcaster lost six staff and freelancers in an attack.\nMohammad Salama, a photojournalist and cameraman, was killed in an attack on a medical complex that left 14 people dead, the Qatar-based news network said.\nHis death was \"confirmed\", a spokesperson told AFP.\nMariam Dagga, 33 freelanced for the AP since the Gaza war began, as well as other news outlets.\nDagga reported on Nasser Hospital doctors struggling to save children with no prior health issues who were wasting away from starvation.\nReuters reported that its contractor cameraman Hussam al-Masri was also killed in the strike. Photographer Hatem Khaled, who was also a Reuters contractor, was wounded, the news agency reported.\nThe Israel-Hamas has been one of the bloodiest conflicts for media workers, with a total of 192 journalists killed in Gaza in the 22-month conflict, according to the Committee to Protect Journalists. Comparatively, 18 journalists have been killed so far in the Russia-Ukraine war, according to the CPJ.\nThe Israeli Prime Minister's Office and Israeli military refused to comment on the incident.\nEarlier this month, four Al Jazeera staff and two freelancers were killed in an Israeli air strike outside Al-Shifa hospital in Gaza City, prompting widespread condemnation.\nMahmud Bassal, Gaza's Civil Defence spokesman, also said the death toll in the latest attack stood at 14, including journalists.\nAn Israeli explosive drone targeted a building at Nasser Hospital in Khan Younis, followed by an airstrike as the wounded were being evacuated, Bassal said.\n(With inputs AFP, AP)\nRelated Topics\nSubscribe to our Newsletter\nGet Latest Mathrubhumi Updates in English\nDisclaimer: Kindly avoid objectionable, derogatory, unlawful and lewd comments, while responding to reports. Such comments are punishable under cyber laws. Please keep away from personal attacks. The opinions expressed here are the personal opinions of readers and not that of Mathrubhumi.\nMost Commented"
    },
    {
      "news_title": "Israeli strike on Gaza medical complex kills 10, including 4 journalists",
      "news_link": "https://www.anews.com.tr/middle-east/2025/08/25/israeli-strike-on-gaza-medical-complex-kills-10-including-4-journalists",
      "bias": "unknown",
      "text": "Ten Palestinians, including four journalists and a firefighter, were killed and several others wounded Monday in an Israeli strike on the Nasser Medical Complex in Khan Younis, southern Gaza Strip, according to Gaza health authorities and eyewitnesses.\nAccording to Anadolu correspondents, the Israeli military targeted the top floor of the emergency building, known as the \"Al-Yassin\" floor.\nEarlier, the Gaza Health Ministry said in a statement that eight people were killed and several others were injured in the attack.\nThe ministry added that the Israeli military hit the fourth floor of one of the complex's buildings in two airstrikes, noting that the second strike occurred as rescue teams arrived to evacuate the wounded and recover the dead.\nOfficial Palestine TV reported that among the deceased were its cameraman Hussam al-Masri, while Qatari channel Al Jazeera confirmed that its photographer Mohammad Salama was also killed.\nA medical source cited by Anadolu also confirmed the death of photojournalist Maryam Abu Daqqa.\nPhotojournalist Moaz Abu Taha was also killed in the Israeli strike targeting the hospital.\nThe Palestinian Civil Defense said in a statement that a fire engine driver was killed during the strike and that seven others from his team were injured while attempting to rescue victims and recover bodies."
    },
    {
      "news_title": "US, Israel, Syria in Crucial Talks for Security Agreement",
      "news_link": "https://timesng.com/israel-syria-crucial-talks/",
      "bias": "unknown",
      "text": "World\nUS, Israel, Syria in Crucial Talks for Security Agreement\nJERUSALEM, Israel — US envoy Thomas Barrack met with Israeli Prime Minister Benjamin Netanyahu on Sunday to discuss ongoing negotiations between Israel and Syria regarding a potential security agreement. This meeting comes as Syrian interim President Ahmed al-Sharaa confirmed that the government is in advanced talks with Israel during an interview with Arab journalists.\nAl-Sharaa stated that any deal would be rooted in the 1974 ceasefire lines established after the Yom Kippur War. He emphasized the importance of national unity in Syria, hinting that while the time may not seem right for a comprehensive peace deal, he is open to any agreement that would benefit Syria.\nThe discussions in Jerusalem were reported by three Israeli officials and initially covered by Axios. Barrack’s meeting follows previous talks with Israel’s Strategic Affairs Minister Ron Dermer and Defense Minister Israel Katz. US Ambassador to Israel Mike Huckabee was also present. The envoys are scheduled to head to Lebanon on Monday, accompanied by Republican Senator Lindsey Graham.\nDermer held separate talks with Syrian Foreign Minister Asaad al-Shibani in Paris on Tuesday, discussing security arrangements in southern Syria. Reports indicate that another round of discussions will focus on de-escalating conflict and establishing a demilitarized zone around the Golan Heights.\nChannel 12 reported that the proposed security agreement might include measures to prevent Syrian military restoration and the entry of weapons threatening Israel, along with a humanitarian corridor to the Jabal al-Druze region in exchange for the rehabilitation of war-torn Syria by the US and Gulf countries.\nBarack called for Israel to support a plan aimed at disarming Hezbollah by year-end in exchange for a cessation of Israeli military operations in Lebanon. This plan, backed by Lebanon’s cabinet earlier this month despite Hezbollah’s reluctance, outlines a phased disarmament roadmap.\nIsrael and Syria have been in a state of conflict since 1948, particularly after Israel captured the Golan Heights in 1967. They reached a disengagement agreement a year post-Yom Kippur War, maintaining a fragile peace until recent tensions arose following the fallout of the Assad government.\nIn light of the escalating hostilities between Israel and Hezbollah, which saw renewed violence starting October 7, 2023, this renewed push for dialogue may present a potential avenue for stabilization, though internal divisions in Syria and regional dynamics complicate the landscape."
    },
    {
      "news_title": "Four Journalists Killed in Israeli Strike on Gaza’s Nasser Hospital",
      "news_link": "https://www.defensemirror.com/news/40090",
      "bias": "unknown",
      "text": "Four journalists were killed in an Israeli strike on Nasser Hospital in the southern Gaza Strip, according to reports.\nThe journalists killed were identified as Hossam al-Masri, a Reuters photojournalist; Mohammed Salama, a photojournalist with Al Jazeera; Mariam Abu Daqa, a journalist who contributed to several outlets including The Independent Arabic and Associated Press; and Moaz Abu Taha, a journalist with NBC network.\nA hospital spokesman told Al Jazeera that at least 14 people were killed in the attack on the emergency department. Palestinian health officials later reported the death toll at 15, including four journalists and one rescue worker.\nWitnesses said the strikes occurred in two stages. An Israeli explosive drone hit the hospital rooftop, killing one journalist. As rescue workers, journalists, and others rushed to the site, an airstrike followed, causing more casualties. Reuters reported that its live feed from Nasser Hospital, operated by al-Masri, cut off at the moment of the first strike.\nNeither the Israeli army nor Prime Minister Benjamin Netanyahu’s office have commented on the hospital attack.\nThe Gaza Government Media Office said that 244 journalists have been killed in Israeli strikes since October 7, 2023, when hostilities began in the enclave.\nThe strike comes as Israel escalates operations in southern Gaza. Last week, Netanyahu approved plans to take control of the entire Gaza Strip and defeat Hamas. According to Israel’s army radio, Galei Tzahal, the offensive may continue until 2026, with up to 130,000 reservists mobilized at its peak.\nEgypt and Qatar have condemned the plan and presented Hamas with a ceasefire proposal that includes the release of hostages and prisoners. Hamas accepted the initiative, but Israel has not responded."
    },
    {
      "news_title": "Four journalists killed in Israeli attack on Gaza hospital",
      "news_link": "https://babel.ua/en/news/120862-four-journalists-killed-in-israeli-attack-on-gaza-hospital",
      "bias": "unknown",
      "text": "On Monday, August 25, the Israeli army attacked Nasser Hospital in the city of Khan Yunis in the southern Gaza Strip.\nReuters and Al Jazeera write about this.\nA total of 15 people were killed in the attack. Four of them were journalists: Mohammed Salama of Al Jazeera, Hossam al-Masri of Reuters, Moaz Abu Taha of NBC, and freelance journalist Mariam Abu Daka.\nPhotographer Hatem Khaled, who worked for Reuters, was also injured.\nIDF confirmed the attack on the hospital. The Chief of Staff of the Israeli Army ordered an investigation into the incident.\nThe military added in the statement that they “regret any harm caused to innocent people” and that they are not targeting journalists.\nThis is not the first time journalists have been killed in Israeli attacks on the Gaza Strip. Five Al Jazeera journalists were killed in an attack on August 11. The Palestinian Journalists Syndicate says at least 230 media workers have been killed since the war began in October 2023.\nWar between Israel and Hamas\nActive hostilities between Israel and Hamas have been ongoing since October 7, 2023. In mid-January 2025, Israel and Hamas reached agreements on a ceasefire in Gaza and the release of hostages.\nHowever, on the night of March 18, Israel resumed hostilities in the Gaza Strip and launched large-scale operations there.\nOn August 7, Israeli Prime Minister Benjamin Netanyahu reported that the country intended to take control of the entire coastal territory. The Israeli military subsequently approved a framework plan for a new offensive operation in Gaza.\nOn the evening of August 17, hundreds of thousands of people gathered in Tel Aviv to demand that the Israeli government reach an agreement with Hamas to return the hostages. Netanyahu accused the demonstrators of strengthening Hamasʼ negotiating position.\nThe next day, it was reported that Hamas had agreed to the latest offer from regional mediators for a deal with Israel on a ceasefire in Gaza and the release of hostages.\nFor more news and in-depth stories from Ukraine, please follow us on X."
    },
    {
      "news_title": "Associated Press journalist killed in Israeli strike in Gaza, agency confirms | TALK! 100.7 FM",
      "news_link": "https://wutqfm.com/associated-press-journalist-killed-in-israeli-strike-in-gaza-agency-confirms/",
      "bias": "unknown",
      "text": "Kilmar Abrego Garcia to check in with ICE in Maryland under deportation threat\nAugust 25, 2025SpaceX scrubs 10th flight test of Starship moments before it was set to launch\nAugust 25, 2025Associated Press journalist killed in Israeli strike in Gaza, agency confirms\n(LONDON) — Four journalists were among at least 14 people killed in an Israeli airstrike at the Nasser Medical Complex in the southern Gaza city of Khan Younis on Monday morning, officials at the Hamas-run Gaza Government Media Office and Health Ministry said.\nHossam Al-Masry, Mohammed Salama, Mariam Dagga and Moaz Abu Taha were the journalists killed, the media office said in a statement.\nDagga, 33, had been working as a freelance journalist for the Associated Press since the conflict began in October 2022, the AP reported.\nThe IDF issued a statement confirming that it launched a strike in the area of Nasser Hospital.\n“The IDF regrets any harm to uninvolved individuals and does not target journalists as such,” the statement said. “The IDF acts to mitigate harm to uninvolved individuals as much as possible while maintaining the safety of IDF troops.”\nThe IDF said that its chief of the general staff had ordered an initial inquiry into the incident.\nCopyright © 2025, ABC Audio. All rights reserved."
    },
    {
      "news_title": "Israel kills 4 journalists in double tap strike on Nasser hospital",
      "news_link": "https://www.madamasr.com/en/2025/08/25/news/u/israel-kills-4-journalists-in-double-tap-strike-on-nasser-hospital/",
      "bias": "unknown",
      "text": "Fifteen people, including four journalists and several civil defense workers, were killed on Monday morning in two consecutive Israeli drone strikes on Nasser Medical Complex in western Khan Younis, southern Gaza, according to eyewitnesses and a health official who spoke to Mada Masr.\nThe health facility, south Gaza’s largest, has been targeted repeatedly throughout the nearly two years of Israel’s genocidal war on the strip, including in the May airstrike that killed journalist Hassan Eslaih.\nAmong the journalists killed in Monday’s attack are Reuters photojournalist Hossam al-Masry, who was targeted in the first strike, Al Jazeera photojournalist Mohamed Salama who contributed photography to Mada Masr earlier this year, as well as Moaz Abu Taha and Associated Press journalist Mariam Abu Dagga, according to Gaza’s Government Media Office.\nThe first attack on the hopsital came earlier on Monday morning, according to Gaza’s Health Ministry General Director Mounir al-Bursh, who told Mada Masr that an Israeli suicide drone targeted the fourth floor of a building within the medical facility without prior warning. A reporter identified the targeted site as an external staircase to the Yassin building.\nAs first respondents and journalists gathered to try to rescue those killed and injured and to document the aftermath of the initial strike, the site was hit a second time by a missile fired from a surveillance drone, eyewitness Raafat al-Attar said.\nThe second blast was massive, scattering shrapnel and body parts throughout the complex, Attar said. Some fragments fell on people outside the hospital.\nA second eyewitness who rushed into the medical complex after the first airstrike said it took place at around 10 am, with the second following around 20 minutes later, as medical teams worked to retrieve those killed and injured in the first strike. The eyewitness described the scene as “horrific.”\nSeveral operating rooms within the facility were forced out of service, Bursh said, telling Mada Masr that the blast caused extensive destruction to the hospital.\nMohamed Saqr, head of nursing at the complex, told Mada Masr that the strike caused extensive damage to several departments, forced the suspension of many operations and injured multiple patients. The strike would further cripple the facility already operating beyond capacity, he said.\nAlongside the journalists killed in the attack, a firetruck driver was killed and seven civil defense members were injured while rescuing the injured and recovering bodies following the initial strike, the Civil Defense Agency said. The attack raised the death toll among civil defense members to 136 since the start of the war.\nIsraeli assaults have deliberately targeted at least six other journalists in Gaza in August alone. Palestine TV’s Khaled al-Madhoun was shot down on Saturday. Earlier this month, Israel targeted a press tent at the Shifa Medical Complex, killing Al Jazeera correspondents Anas al-Sharif and Mohamed Qraiqea and photojournalists Ibrahim Taher, Mohamed Noufal and Mosaab al-Sharif.\nAccording to the Gaza Government Media Office, the attack brings the total number of journalists killed since the start of the Israeli war on Gaza to 244.\nEditorial note: This piece was amended after publication to include additional information provided by a second eyewitness and the head of nursing at the Nasser Medical Complex."
    }
  ]
}