{
  "story_id": "GN_20250820_bb864375",
  "metadata": {
    "title": "Kim’s sister says North Korea will never see the South as a diplomatic partner",
    "timestamp": "2025-08-20T21:35:08.052207",
    "url": "https://ground.news/article/kim-yo-jong-south-korea-cannot-be-our-diplomatic-partner"
  },
  "bias_distribution": {
    "total_sources": "27",
    "leaning_left": "7",
    "center": "8",
    "leaning_right": "5"
  },
  "perspective_summaries": {
    "left": [
      "Kim Yo Jong stated that North Korea will never view South Korea as a diplomatic partner.",
      "Kim Yo Jong criticized the South Korea-U.S. military drills, calling them a \"reckless\" invasion rehearsal and claiming that Seoul's peace gestures hide a \"sinister intention\" against Pyongyang.",
      "Kim Yo Jong labeled South Korea as the \"top-class faithful dog\" of the United States and asserted that inter-Korean relations will \"never\" be repaired.",
      "Kim Yo Jong has rejected calls to restart negotiations on North Korea's nuclear and missile programs and expressed disdain for South Korea's political system, saying, \"We are sick and tired of it."
    ],
    "center": [
      "Kim Yo Jong, sister of North Korean leader Kim Jong Un, stated that her country will never see South Korea as a partner for diplomacy.",
      "She denounced the ongoing South Korea-U.S. military drills as an 'invasion rehearsal' and accused Seoul of harboring a 'sinister intention' against Pyongyang.",
      "Kim Jong Un condemned the drills and vowed to rapidly expand his nuclear forces while inspecting a warship fitted with nuclear-capable systems."
    ],
    "right": [
      "Kim Yo Jong stated that North Korea will never see South Korea as a diplomatic partner, according to state media reports.",
      "She condemned South Korea as the 'top-class faithful dog' of the United States, stating that the desired reparation of relations 'will never' happen.",
      "Kim Yo Jong urged the Foreign Ministry to take 'proper countermeasures' against South Korea, labeling it the 'most hostile state.'",
      "She claimed that the diplomatic arena will be centered on North Korea and that South Korea 'will not even have a subordinate role."
    ]
  },
  "sources": [
    {
      "news_title": "Kim Jong Un's sister says South Korea will never be a diplomatic partner",
      "news_link": "https://www.upi.com/Top_News/World-News/2025/08/20/Kim-Yo-Jong-dismisses-Seoul-diplomatic-partner-Lee-Jae-Myung/1351755683781/",
      "bias": "Center",
      "source_name": "UPI"
    },
    {
      "news_title": "Kim's Sister Says North Korea Will Never See the South as a Diplomatic Partner",
      "news_link": "https://www.military.com/daily-news/2025/08/20/kims-sister-says-north-korea-will-never-see-south-diplomatic-partner.html",
      "bias": "Center",
      "source_name": "Military.com"
    },
    {
      "news_title": "Leader’s sister says North Korea will never see South as diplomatic partner",
      "news_link": "https://torontosun.com/news/world/leaders-sister-says-north-korea-will-never-see-south-as-diplomatic-partner",
      "bias": "Right",
      "source_name": "Toronto Sun"
    },
    {
      "news_title": "North Korea slams South Korea’s peace overtures as US drills continue",
      "news_link": "https://www.aljazeera.com/news/2025/8/20/n-korea-says-s-korea-cannot-be-a-diplomatic-partner-as-us-drills-continue",
      "bias": "Lean Left",
      "source_name": "Al Jazeera"
    },
    {
      "news_title": "Kim's sister says North Korea will never see the South as a diplomatic partner",
      "news_link": "https://apnews.com/article/north-korea-kim-yo-jong-south-1701026499f18123634a563463259c5a",
      "bias": "Lean Left",
      "source_name": "Associated Press News"
    }
  ]
}