{
  "story_id": "GN_20250826_002057_1ee89088",
  "metadata": {
    "title": "Governor DeSantis Defies Judge's Order to Halt Operations at 'Alligator Alcatraz': 'We're Not Gonna Be Deterred'",
    "timestamp": "2025-08-26T00:20:57.297651",
    "url": "https://ground.news/article/desantis-responds-to-alligator-alcatraz-ruling-touts-deportation-depot"
  },
  "bias_distribution": {
    "total_sources": "38",
    "leaning_left": "10",
    "center": "14",
    "leaning_right": "7"
  },
  "perspective_summaries": {
    "left": [
      "Governor Ron DeSantis announced that deportations will continue at Alligator Alcatraz, despite a judge's order to halt operations and dismantle parts of the facility.",
      "U.S. District Judge Kathleen Williams issued a temporary injunction requiring the dismantling of parts of Alligator Alcatraz due to environmental risks.",
      "The lawsuit against Alligator Alcatraz was filed by Friends of the Everglades, the Center for Biological Diversity, and the Miccosukee Tribe, claiming violations of environmental regulations.",
      "DeSantis asserted that his administration would continue deportations, stating, \"this is not going to deter us\" from their mission."
    ],
    "center": [
      "On Thursday, U.S. District Judge Kathleen Williams ordered the Everglades-based Alligator Alcatraz dismantled within 60 days, while Governor Ron DeSantis announced the new Deportation Depot at Baker Correctional Institution with 1,300 beds.",
      "The June 27 lawsuit filed by Friends of the Everglades, the Center for Biological Diversity, and the Miccosukee Tribe alleges construction violated environmental rules, risking 2,000 acres used by Florida panthers.",
      "U.S. District Judge Rodolfo Ruiz earlier this week ordered a detainee-rights suit moved to the Middle District of Florida and barred further TNT site expansion or added industrial lighting.",
      "Florida appealed the order Friday to the 11th U.S. Circuit Court of Appeals , and Governor Ron DeSantis vowed the ruling will not deter state deportation efforts with President Donald Trump.",
      "Betty Osecola of the Miccosukee Tribe said `This is a win for the environment` as Alligator Alcatraz, inside Big Cypress National Preserve near the Miccosukee reservation, bypassed review after a state of emergency declaration."
    ],
    "right": [
      "Florida is proceeding with its immigration enforcement despite a federal court's order to dismantle the 'Alligator Alcatraz' detention center, as stated by U.S. District Judge Kathleen Williams.",
      "Governor Ron DeSantis expressed confidence in continuing immigration operations, stating, 'We’re not going to be deterred; we’re totally in the right on this.'",
      "The state plans to open a new detention facility with an initial capacity of 1,300 beds and an eventual expansion to 2,000 beds, as the appeal proceeds.",
      "DeSantis claimed the ruling indicates an activist judge trying to do policy from the bench and insisted it would not derail Florida’s deportation efforts."
    ]
  },
  "sources": [
    {
      "news_title": "Alligator Alcatraz could be shut down. Ron DeSantis has a backup plan",
      "news_link": "https://www.independent.co.uk/news/world/americas/us-politics/alligator-alcatraz-closing-desantis-deportation-b2813175.html",
      "bias": "Lean Left",
      "text": "Alligator Alcatraz could be shut down. Ron DeSantis has a backup plan\nLegal challenges to notorious migrant detention center may see it close as soon as October\nFlorida’s controversial 3,000-bed “Alligator Alcatraz” immigrant detention center could be shut down as soon as this fall after a wave of legal challenges.\nBut the state’s Republican Governor Ron DeSantis has a backup plan, and Donald Trump’s administration claims that a federal judge’s order to temporarily shut down parts of the facility — which could become permanent — will not halt the president’s aggressive anti-immigration agenda.\nImmigrants are expected to be detained at other facilities in the state instead.\nOn Thursday, a federal judge ruled that no more detainees can be sent to the facility, which was built in a matter of days deep in the Everglades on an airstrip. The state can continue to detain immigrants who are currently imprisoned there until they are deported, according to the judge.\nThere was widespread outrage over the very notion of the facility when it was announced, with state and federal officials officially naming the detention camp after the notorious California prison, due to the threatening wildlife that surrounds it, which the Trump administration touted as a deterrent to people escaping.\nMigrants are confined to cages with bunk beds, enduring Florida’s sweltering summer heat, pests and rationed meals. A separate federal lawsuit accuses the facility of blocking detainees from legal counsel and forcing people into “overcrowded, unsanitary, and harsh conditions” with inadequate food and “excessive use of force” from guards that sent at least one man to a hospital.\nMembers of Congress and state lawmakers who visited were stunned by the conditions they witnessed, and they demanded its immediate closure.\nA preliminary injunction was issued this week in a federal lawsuit brought by environmental groups and the Miccosukee Tribe of Indians of Florida.\nJudge Kathleen Williams' ruling on Thursday follows serious concerns from the Miccosukee Tribe, a Native American community whose reservation lies within miles of the facility, about the development's impact on their land and the environmentally sensitive Everglades.\n“The project creates irreparable harm in the form of habitat loss and increased mortality to endangered species in the area,” Judge Williams said in the order. The further installation of any lighting, fencing, paving, tents, or buildings is forbidden, and “all generators, gas, sewage, and other waste and waste receptacles that were installed to support this project” must be removed in 60 days.\nWhile the injunction is only temporary until a court can make a final decision in the case, the state and federal governments have appealed the decision and requested that the judge rule on enforcement while their appeal is pending, asking that she make a decision by Monday at 5 p.m.\nMeanwhile, a third federal lawsuit against the facility — filed by immigrants’ rights advocates including the American Civil Liberties Union — challenges Florida’s authority to detain people there.\nThe suit targets the state’s use of what it describes as the “expansive and unlawful use” of the federal 287(g) program, which allows local and state law enforcement agencies to enforce federal immigration law.\nResponding to Judge Williams’ decision, Governor DeSantis said on Friday that it was “not unexpected,” and the state would “respond accordingly.”\n“We’re not going to be deterred,” DeSantis said. “We are totally in the right on this,” he added, referring to the president’s mass deportation program that Americans largely oppose.\nFlorida’s plan, it appears, is to double down on state-run detention centers and a second 2,000-capacity facility, dubbed “Deportation Depot,” at a shuttered state prison that closed in 2021 due to staff shortages.\nThat prison — located within a rural stretch of the state between Tallahassee and Jacksonville — will operate inside Baker Correctional Institution, joining a new wave of state-run detention centers as ICE looks to build capacity to detain more immigrants in similar facilities across the country.\n“The reason for this is not to just house people indefinitely. We want to process, stage, and then return illegal aliens to their home country. That is the name of the game,” DeSantis said at a press conference announcing the detention center last week.\nSpeaking to NewsNation on Saturday, border czar Tom Homan said that “they’re not going to stop us doing what we’re doing.”\n“We’ll follow the judge’s order, and we’ll litigate and we’ll appeal it,” he said. “But [the] bottom line is, we’re going to continue to arrest public safety threats and national security threats every day across this country.”\nHoman said that ICE would simply adapt.\n“If we have to send them to another facility. That’s what we’re going to do,” he said. “That’s why the president has asked for 100,000 beds in the Big, Beautiful Bill. So, we’re going to build 100,000 beds, so we’re not going to have a lack of bed space.”\nThe Independent reported earlier this month that ICE has inked nearly 800 federal 287(g) program agreements covering 40 states, funded by $45 billion in new funding to expand ICE capacity.\nIn Indiana, officials announced plans earlier this month to expand the Miami Correctional Centre, located 70 miles north of Indianapolis. Homeland Security Secretary Kristi Noem stated that the facility will have the capacity to detain approximately 1,000 immigrants. Officials have already dubbed this new detention centre the \"Speedway Slammer\".\nSeparately, the Trump administration is reportedly in talks with Louisiana officials to detain immigrants at the infamous Angola prison. This facility, the largest maximum-security prison in the country, was built on a former plantation owned by a slaveholder. The Wall Street Journal reported that Angola, which currently holds around 4,300 people, mostly convicted of violent crimes, could house 450 immigrants as early as next month.\nJoin our commenting forum\nJoin thought-provoking conversations, follow other Independent readers and see their replies\nComments"
    },
    {
      "news_title": "Florida Appeals Judge's Ruling Against Expansion Of 'Alligator Alcatraz'",
      "news_link": "https://www.zerohedge.com/political/florida-appeals-judges-ruling-against-expansion-alligator-alcatraz",
      "bias": "Right",
      "text": null
    },
    {
      "news_title": "ACLU Fights Florida 'Alligator Alcatraz' Citing Unlawful Detentions, Inhumane Conditions",
      "news_link": "https://www.tampafp.com/aclu-fights-florida-alligator-alcatraz-citing-unlawful-detentions-inhumane-conditions/",
      "bias": "Lean Right",
      "text": "Illegal Immigrant Advocates Allege State Has No Authority to Run Facility.\nA coalition of immigrants’ rights organizations filed a federal lawsuit Friday challenging Florida’s authority to detain people at the “Alligator Alcatraz” detention center, a controversial facility constructed in the middle of the Everglades. The lawsuit claims the state is operating an independent immigration detention system, a role reserved for the federal government.\nThe American Civil Liberties Union, ACLU of Florida, Community Justice Project, and National Immigrant Justice Center filed the suit on behalf of people detained at the facility. They argue the state’s use of 287(g) agreements—which allow a narrow set of immigration enforcement tasks for local law enforcement—does not grant it the power to create its own detention camp.\nREAD: Federal Court Blocks Trump Admin From Withholding Funds To ‘Sanctuary Jurisdictions’\nThe lawsuit highlights a host of alleged legal and humanitarian issues at the facility, which has been operational for less than two months. Detainees are reportedly being held without charge, are not showing up in the online detainee locator system, and are being denied access to their attorneys and immigration court.\n“This facility has already become a disaster in the first few weeks of its operations,” said Spencer Amdur, staff attorney with the ACLU’s Immigrants’ Rights Project and lead counsel. “This is exactly why Congress did not allow states to set up their own immigration facilities. The government needs to follow the law when people’s lives and liberties are at stake.”\nAllegations of Unlawful Detention and Abusive Conditions\nThe complaint alleges several issues, including the lack of proper training for state officers and the use of private contractors who are not authorized to perform immigration functions. Federal immigration officers receive months of in-person training, while some Florida officers at the facility have reportedly only completed a few hours of online training.\nREAD: Vice President JD Vance Promotes Tax Cuts And Blasts Ossoff In Georgia\nThe lawsuit also describes the physical conditions as “atrocious and dangerous,” with detainees housed in large, temporary tents vulnerable to flooding and surrounded by mosquitoes. According to the lawsuit, there are reports of respiratory illnesses spreading, sewage backups, and restrictions on access to water and showers.\nOne case highlighted in the lawsuit is that of M.A., a man with a work permit and asylum application pending, who was allegedly pressured to sign a voluntary removal order he could not read. He was later deported to Guatemala in error, despite having no final removal order.\nAmy Godshall, an attorney with the ACLU of Florida, said the state has “wasted hundreds of thousands of taxpayer dollars to unlawfully detain people in this abusive immigration detention center.” She called the situation a “crisis created entirely by the state’s reckless decision to ignore federal law.”\nFederal Authority vs. State Actions\nAccording to the complaint, federal law gives the Department of Homeland Security exclusive authority over immigration detention. The 287(g) program is designed to deputize individual state officers to assist with federal tasks, not to enable states to run their own detention operations.\nREAD: Salvadoran National Kilmar Abrego Garcia’s Case Takes Wild Turn After Release From Jail\nThe lawsuit asserts that Florida’s actions are an unprecedented overstep, with state officials having “complete discretion” over the facility’s operations. Miriam Haskell, an attorney with Community Justice Project, stated, “Florida’s authoritarian experiment cannot continue unchecked, and we are confident the court will see that there is no lawful authority for Florida to operate this immigration facility.”\nThe lawsuit, filed in the U.S. District Court for the Middle District of Florida, seeks a temporary restraining order and a permanent injunction to bar further detentions at the facility, as well as a writ of habeas corpus for the release of the detained individuals.\nPlease make a small donation to the Tampa Free Press to help sustain independent journalism. Your contribution enables us to continue delivering high-quality, local, and national news coverage.\nConnect with us: Follow the Tampa Free Press on Facebook and Twitter for breaking news and updates.\nSign up: Subscribe to our free newsletter for a curated selection of top stories delivered straight to your inbox."
    },
    {
      "news_title": "Florida-Run ‘Alligator Alcatraz’ Violates US Law, ACLU Says",
      "news_link": "https://www.bloomberg.com/news/articles/2025-08-23/florida-run-alligator-alcatraz-violates-us-law-aclu-says",
      "bias": "Lean Left",
      "text": null
    },
    {
      "news_title": "Another lawsuit challenges Alligator Alcatraz",
      "news_link": "https://floridapolitics.com/archives/752916-another-lawsuit-challenges-alligator-alcatraz/",
      "bias": "Center",
      "text": "Florida’s ad hoc immigration lockup, Alligator Alcatraz, is facing yet another legal complaint charging abuse of power and legal prerogative.\nThe American Civil Liberties Union, ACLU of Florida, Community Justice Project, and National Immigrant Justice Center are suing the state of Florida on behalf of inmates.\nIn the complaint that names Florida Division of Emergency Management Director Kevin Guthrie and other state officials along with a “warden” from private contractor Critical Response Strategies, the plaintiffs claim that the state is abusing 287(g) agreements governing immigration enforcement cooperation with the federal government, forcing inmates to languish for weeks amid what is allegedly “the clear lack of authority at the heart of the facility’s operations.”\nFederal law “does not provide authority for state agencies to hold immigration detainees during the removal process. And it certainly does not let them place detention in the hands of untrained, unsupervised private contractors who are not and cannot be deputized to perform immigration functions,” the plaintiffs allege, leading to “exactly the kind of disaster that Congress took pains to avoid.”\nThe plaintiff arrived in the U.S. in 2018, filed an asylum claim, and is married to a U.S. citizen. The complaint alleges that he was forced to sign a “voluntary removal form” that he couldn’t read, and that his treatment under state custody has left him wheelchair bound.\n“The facility is Florida-owned and Florida-operated. State and federal officials have stated in court filings that Florida exercises’ complete discretion’ over operations and over who is detained at the facility,” the plaintiff filing states, adding that private contractor employees make up 90% of the staff.\nThe filing also alleges “atrocious conditions” at the facility, including insufficient water, a plague of mosquitoes, and solid waste allowed to dry and cake up after the hastily-installed toilets overflow in the tent cell blocks.\nThe relief sought includes injunctions blocking the incarceration at the facility and a declaratory judgment asserting a lack of authority to run the prison.\nJudge Kathleen Williams has already ordered the state to wind down the facility, barring further construction on the South Florida airport repurposed for the fight, and ordering the transfer of the detainees to other facilities within 60 days.\nThe DeSantis administration has shrugged off adverse rulings to this point and is appealing Williams’.\nAlex Lanfranconi, a spokesperson for DeSantis, said after Williams’ ruling: “The deportations will continue until morale improves.”\n“This was not something that was unexpected. This was a Judge who was not going to give us a fair shake. This was preordained, very much an activist Judge that is trying to do policy from the bench,” DeSantis said.\n5 comments\nRory\nAugust 23, 2025 at 12:48 pm\nStopped reading when I saw ACLU. Too many scumbag lawyers in the United States.\nFrankie M.\nAugust 23, 2025 at 2:18 pm\nAnyone that disagrees with Ronnie D is automatically an activist judge or God forbid worse…a liberal. Just look at what Trump’s police state is doing to its perceived enemies… whether it be the people of DC or John Bolton.\nRory\nAugust 24, 2025 at 3:06 am\nHey mate. Read the news in the UK today. Widespread protests yesterday in major cities. The Brits have had enough of this importing refugees as well.\nHugh M\nAugust 25, 2025 at 6:11 am\nIt’s an embarrassment to our justice system that judges’ rulings can be determined by the party affiliation of the president who appointed them.\nFrankie M.\nAugust 25, 2025 at 10:57 am\nI wonder how many of those limeys want to pick their own tomatoes and oranges."
    },
    {
      "news_title": "DeSantis Delivers a Rousing Response to Judge's Decision on Alligator Alcatraz",
      "news_link": "https://redstate.com/nick-arama/2025/08/23/desantis-on-alligator-alcatraz-and-deportations-n2193140",
      "bias": "Right",
      "text": "As we reported, an Obama appointee, U.S. District Judge Kathleen Williams, issued an order stopping the expansion of the illegal alien detention center known as \"Alligator Alcatraz\" and bringing in any new detainees. The main argument against the facility appeared to be environmental.\nWithin 60 days, “and once the population attrition allows for safe implementation of this Order,” the facility must also remove “all generators, gas, sewage, and other waste and waste receptacles that were installed to support this project,” the 82-page ruling said.\nFlorida immediately filed an appeal.\nA spokesperson for the Department of Homeland Security, Tricia McLaughlin, said in a statement that the ruling \"ignores the fact that this land has already been developed for a decade. It is another attempt to prevent the President from fulfilling the American people’s mandate to remove the worst of the worst including gang members, murderers, pedophiles, terrorists, and rapists from our country.\"\n\"This activist judge doesn’t care about the invasion of our country facilitated by the Biden administration, but the American people do,\" McLaughlin said. \"We have the law, the facts, and common sense on our side.”\nHowever, as our sister site Twitchy reported, Florida Gov. Ron DeSantis stood strong, saying that they would continue to carry out their mission. He said the ruling was not unexpected, and he termed the judge an \"activist judge,\" and said the decision was \"pre-ordained.\"\n🚨 BREAKING: Governor Ron DeSantis just announced the deportations WILL CONTINUE at Alligator Alcatraz after an activist judge ordered they start shutting the facility down.\n— Eric Daugherty (@EricLDaugh) August 22, 2025\n\"We're not gonna be deterred. We're totally in the right on this.\"\n\"We are gonna be opening ANOTHER… pic.twitter.com/kVwx4YrnQn\n\"We’re not going to be deterred. We’re totally in the right on this. But I would also note, because of the success of Alligator Alcatraz, there’s demand for more,” DeSantis said. He explained how they were going to be opening another facility right outside of Jacksonville...and we call that the 'Deportation Depot.'\nWe'll have to see how the Florida appeal goes, but they already have the additional option coming, with the new facility near Jacksonville.\nAlligator Alcatraz Goes National? Kristi Noem Wants Florida-Style Detention Centers in Other States.\nWe have previously reported on how they would be opening that facility, as well as that such facilities are being considered in other states. So whatever happens in the particular case of Alligator Alcatraz 1.0, it appears to be spawning many other children.\nDeSantis is continuing to take action on illegal aliens, launching another operation in the Florida Panhandle.\nThis week, a first-of-its kind immigration enforcement operation started in Florida’s Panhandle, led by the Florida Highway Patrol in coordination with federal partners. The Panhandle Immigration Enforcement Operation has apprehended hundreds of illegal aliens—including fugitives… pic.twitter.com/0HjPnSnBYH\n— Ron DeSantis (@GovRonDeSantis) August 22, 2025\nSo operations will continue.\nEditor’s Note: We voted for mass deportations, not mass amnesty. Help us continue to fight back against those trying to go against the will of the American people.\nJoin RedState VIP today and use promo code FIGHT to get 60% off your VIP membership.\nJoin the conversation as a VIP Member"
    },
    {
      "news_title": "DeSantis Undeterred by Woke Ruling on Alligator Alcatraz",
      "news_link": "https://pjmedia.com/catherinesalgado/2025/08/23/desantis-undeterred-by-woke-ruling-on-alligator-alcatraz-n4942960",
      "bias": "Far Right",
      "text": "Florida Gov. Ron DeSantis is more determined than ever to advance immigration enforcement despite a ridiculous ruling from a woke judge, attempting to shut down the “Alligator Alcatraz” detention facility over supposed “environmental harms.”\nYesterday, after U.S. District Judge Kathleen Williams ruled that alleged “environmental harms” of the famous Florida illegal alien detention facility outweighed the facility’s necessity, DeSantis assured Floridians and other Americans that the mission to arrest, imprison, and deport illegals will continue. He also plans to open another facility to counteract the ruling.\n🚨 BREAKING: Governor Ron DeSantis just announced the deportations WILL CONTINUE at Alligator Alcatraz after an activist judge ordered they start shutting the facility down. \"We're not gonna be deterred. We're totally in the right on this.\" \"We are gonna be opening ANOTHER facility...Deportation Depot.\" 🔥 @GovRonDeSantis\n— Eric Daugherty (@EricLDaugh) Aug 22, 2025\nThe governor said at a press conference, “This was not something that was unexpected. This is a judge that was not going to give us a fair shake. This was preordained, very much an activist judge that is trying to do policy from the bench.”\nHe emphatically assured listeners, “This is not going to deter us. We're going to continue working on the deportations, advancing that mission. We knew that this would be something that would likely happen, and we will respond accordingly.”\nRead Also: Turley: John Bolton Could Face Years in Prison\nThe “Alligator Alcatraz” facility’s launch by Donald Trump, Homeland Security Secretary Kristi Noem, and DeSantis was greeted with great enthusiasm by MAGA, but immediately targeted by Democrat politicians, lawyers, and activists.\nIt’s the usual weaponized lawfare from leftists. DeSantis declared, “This mission is important. You either have a country or you don't. You have people that are in this country that have already been ordered to be removed by the current system, and yet the previous administration didn't want to do anything about it.” In fact, of course, the Biden-Harris administration deliberately fueled the problem.\nBut times have changed. DeSantis stated, “We're committed to the mission. We're not going to be deterred. We see this happening all over the country. We knew the minute this judge got the case, we knew exactly what she was going to do. This is not anything that was unexpected, but we'll make sure to get the job done in the end.”\nBack at the beginning of July, Trump and DeSantis toured the Alligator Alcatraz facility together. At the time of the opening, two environmentalist groups were already suing to stop the project. It is incredible how these activists always object to projects such as a detention center for illegal aliens, but not the fact that illegal aliens tend to trash large swaths of land through which they travel on their way to America and once they arrive here.\nOne hopes that the appeal will succeed, and the detention facility, which cost taxpayer money to set up and run, will not be shut down already. It is outrageous that a judge is trying to claim environmentalist allegations are more valid than the necessity of government holding criminals for deportation.\nSupport our work at PJ Media so that we can continue to bring you the truth. Join PJ Media VIP and use the promo code FIGHT to get 60% off your VIP membership!\nJoin the conversation as a VIP Member"
    },
    {
      "news_title": "Florida mantendrá las deportaciones a pesar del fallo legal reciente - Latino-News - El periódico de los hispanos",
      "news_link": "https://latino-news.com/florida-mantendra-las-deportaciones-a-pesar-del-fallo-legal-reciente/",
      "bias": "Center",
      "text": "22 de agosto de 2025 – Miami – EFE.\nEl gobernador de Florida, Ron DeSantis, ha declarado que la reciente orden judicial para cerrar el centro de detención migratoria conocido como ‘Alligator Alcatraz’ no detendrá los esfuerzos del estado en materia de deportación. A pesar del fallo, DeSantis afirmó que los vuelos de expulsión semanales continuarán. Sus comentarios se producen un día después de que una jueza federal dictaminara que la instalación, ubicada al oeste de Miami, debe desmantelarse en un plazo de 60 días y se prohíba la entrada de nuevos migrantes.\nEl gobernador criticó a la jueza Kathleen Williams, calificándola de “activista” y sugiriendo que no era imparcial. DeSantis hizo estas declaraciones en un evento en Panama City y, poco después, su administración apeló la decisión judicial. El gobernador subrayó que la misión de deportar migrantes seguirá siendo una prioridad para Florida.\nDeSantis detalló que, en colaboración con el Servicio de Inmigración y Control de Aduanas (ICE) y la Guardia Costera, su administración ha estado realizando vuelos de deportación semanales desde Tallahassee. También mencionó que la Patrulla de Carreteras de Florida detuvo a 200 inmigrantes en las últimas 72 horas, según datos de su fiscal, James Uthmeier. El gobernador reafirmó el compromiso de su equipo de usar todos los recursos disponibles para identificar, aprehender y expulsar a quienes, según él, “buscan explotar” el estado.\nEl fallo judicial fue una victoria para grupos ambientalistas como Friends of The Everglades y Center for Biological Diversity, además de la tribu Miccosukee, quienes estuvieron a favor de la demanda. Los demandantes han expresado su disposición a defender el caso en instancias superiores, incluyendo la Corte Suprema, si es necesario. A pesar de la orden de cierre, el gobierno de Florida insiste en que las deportaciones continuarán desde la instalación, que tenía una capacidad para 2,000 personas y planeaba expandirse a 4,000.\nLos demócratas, sin embargo, creen que la administración de Florida ya se esperaba este fallo. El congresista federal Maxwell Frost señaló que había menos de 340 migrantes en el centro cuando lo visitó esta semana, lo que sugiere una reducción de su capacidad anticipada.\nAdemás, DeSantis anunció hace una semana la apertura de un nuevo centro de detención, el ‘Depot de deportaciones’, en una antigua cárcel en el norte del estado. Esta nueva instalación tiene capacidad para más de 1,300 personas, lo que indica que Florida está consolidando su infraestructura para continuar con las deportaciones, independientemente de las decisiones judiciales."
    },
    {
      "news_title": "Florida Appeals Judge’s Ruling Against Expansion of ‘Alligator Alcatraz’",
      "news_link": "https://www.theepochtimes.com/us/florida-appeals-judges-ruling-against-expansion-of-alligator-alcatraz-5905108",
      "bias": "Lean Right",
      "text": "Florida Gov. Ron DeSantis’s administration on Aug. 21 appealed a ruling made by a federal judge halting the expansion of the “Alligator Alcatraz” illegal immigrant detention center in the Everglades.\nThe appeal follows U.S. Judge Kathleen Williams’s ruling on Aug. 21 in favor of environmental groups who had brought a lawsuit against the facility, saying that it endangers the Everglades and its wildlife."
    },
    {
      "news_title": "DeSantis Vows to Increase Illegal Immigrant Jails",
      "news_link": "https://www.wlsam.com/2025/08/22/desantis-vows-to-increase-illegal-immigrant-jails/",
      "bias": "Right",
      "text": null
    },
    {
      "news_title": "DeSantis comments on recent Alligator Alcatraz ruling",
      "news_link": "https://www.wfla.com/video/desantis-comments-on-recent-alligator-alcatraz-ruling/11006985/",
      "bias": "Center",
      "text": null
    },
    {
      "news_title": "DeSantis: 'Alligator Alcatraz' ruling won’t ‘deter’ Florida immigration enforcement",
      "news_link": "https://www.politico.com/news/2025/08/22/desantis-alligator-alcatraz-ruling-wont-deter-florida-immigration-enforcement-00519721",
      "bias": "Lean Left",
      "text": null
    },
    {
      "news_title": "\"Not Going to Deter Us\" - Governor DeSantis Responds To Judge's Order to Close 'Alligator Alcatraz'",
      "news_link": "https://www.thegatewaypundit.com/2025/08/not-going-deter-us-governor-desantis-responds-judges/",
      "bias": "Far Right",
      "text": "Yesterday, The Gateway Pundit reported that US District Judge Kathleen Williams had ordered a South Florida Detention Facility affectionately nicknamed ‘Alligator Alcatraz’ to cease receiving new detainees and dismantle the facility in 60 days.\n“The Court ENTERS a Preliminary Injunction prohibiting the State and Federal Defendants and their officers, agents, employees, attorneys, and any person who is in active concert or participation with them from (1) installing any additional industrial-style lighting (described by witnesses as “Sunbelt” lighting); or doing any paving, filling, excavating, or fencing; or doing any other site expansion, including placing or erecting any additional buildings, tents, dormitories, or other residential or administrative facilities on the TNT site; and (2) bringing any additional persons onto the TNT site who were not already being detained at the site at the time of this Order going into effect,” the judge wrote in an 82-page order reviewed by The Gateway Pundit.\nThe facility is located inside the Big Cypress National Preserve in Ochopee, FL at the Dade-Collier Training and Transition Airport.\nThis morning, during a press conference with Florida Highway Patrol to announce the results of a major immigration enforcement operation, Governor Ron DeSantis said that the ruling “is not going to deter us.”\nThis was not something that was unexpected. This is a judge that was not going to give us a fair shake. This was preordained. Very much an activist judge that is trying to do policy from the bench. This is not going to deter us. We are going to continue working on the deportations, advancing that mission. We knew that this would be something that would likely happen and we will respond accordingly.\nWe’re now in this position where we’re leading the state effort to help the Trump administration actually enforce the law and actually remove these illegal aliens from not just Florida, but from our country. That’s something that we didn’t have for four years and now that’s something that we’re absolutely on board with making sure happens going forward.\nNot only did Governor DeSantis stand in the gap against a federal judge trying to dismantle a state facility, the Florida governor doubled down on the creation of a new facility in the northern portion of the state to be known as the “Deportation Depot”:\nI would also note that because of the success of Alligator Alcatraz, there’s demand for more. So I did announce that we’re going to be opening another facility right outside of Jacksonville in Baker County. We’ve called that the “Deportation Depot.” So that is something will be able to hold another 2,000 and there’s an airport close by. So you have the processing and the removal.\nDuring the announcement, Gov. DeSantis called on the Republican-led Congress to defund sanctuary states like California, who issued a commercial drivers license to an illegal alien who killed three Floridians when he made an illegal U-turn on the Florida Turnpike in St. Lucie County.\nJUST IN – GOV. RON DESANTIS: “We’ve got a Republican Congress! All these guys that run when they ask you for their vote, ‘Oh, I’m going to secure the border, I’m going to be tough on immigration.’ Not one runs openly on being weak on immigration, right? Because they know they… pic.twitter.com/WBZ3hBvgQT\n— Florida’s Voice (@FLVoiceNews) August 22, 2025\nBREAKING: @GovRonDeSantis announces deportations will continue at Alligator Alcatraz as they fight the ruling from an activist judge\n“We’re not gonna be deterred. We’re totally in the right on this.”\n“We are gonna be opening another facility…Deportation Depot.” pic.twitter.com/9YL6RKJyN3\n— Florida’s Voice (@FLVoiceNews) August 22, 2025\nGovernor DeSantis Announces Results of Major Immigration Enforcement Operation https://t.co/A1oooXaW3D\n— Ron DeSantis (@GovRonDeSantis) August 22, 2025"
    },
    {
      "news_title": "DeSantis responds to ‘Alligator Alcatraz’ ruling, touts ‘Deportation Depot’",
      "news_link": "https://thehill.com/homenews/state-watch/5466219-desantis-responds-to-alligator-alcatraz-ruling-touts-deportation-depot/",
      "bias": "Center",
      "text": null
    },
    {
      "news_title": "DeSantis plans to challenge judge’s ruling to shut down Alligator Alcatraz",
      "news_link": "https://www.tampabay.com/news/florida-politics/2025/08/22/desantis-alligator-alcatraz-judge-immigrant-detention/",
      "bias": "Center",
      "text": "Anyone can view a sampling of recent comments, but you must be a Times subscriber to contribute. Log in above or subscribe here.\nConversations are opinions of our readers and are subject to the Community Guidelines.\nThe Tampa Bay Times e-Newspaper is a digital replica of the printed paper seven days a week that is available to read on desktop, mobile, and our app for subscribers only. To enjoy the e-Newspaper every day, please subscribe."
    },
    {
      "news_title": "Immigration efforts continue in Florida despite judge’s ruling",
      "news_link": "https://floridaphoenix.com/2025/08/22/immigration-efforts-continue-in-florida-despite-judges-ruling/",
      "bias": "Left",
      "text": null
    },
    {
      "news_title": "DeSantis says Florida remains 'committed to the mission' despite ruling to stop expanding 'Alligator Alcatraz'",
      "news_link": "https://www.wptv.com/news/state/desantis-says-florida-remains-committed-to-the-mission-despite-ruling-to-stop-expanding-alligator-alcatraz",
      "bias": "Center",
      "text": "PANAMA CITY, Fla. — Gov. Ron DeSantis doubled down on his commitment to \"Alligator Alcatraz,\" a day after a judge ruled that the immigration detention center built in the middle of the Everglades must halt expansion.\nDuring a news conference in Panama City, the governor said the ruling by U.S. District Judge Kathleen Williams was something the state was expecting and would \"respond accordingly.\"\nWATCH BELOW: DeSantis says judge's ruling won't 'deter' state\n\"This is a judge that was not going to give us a fair shake,\" DeSantis said. \"This was preordained, very much an activist judge who is trying to do policy from the bench. This is not going to deter us.\"\nDespite the controversy surrounding \"Alligator Alcatraz,\" the governor called the facility a \"success,\" prompting a \"demand for more\" centers to hold undocumented immigrants.\nThe governor said his push to open a similar facility in Baker County, deemed the \"Deportation Depot,\" would not be set back by Thursday's ruling.\n\"We're committed to the mission,\" the governor said. \"We'll make sure to get the job done in the end.\"\nRead the judge's 82-page ruling below:\nState Files Appeal\nThe state of Florida filed a notice of appeal Thursday night, shortly after the ruling was issued.\n\"The deportations will continue until morale improves,\" DeSantis spokesman Alex Lanfranconi said in response to the judge's ruling.\nWilliams said she expected the population of the facility to decline within 60 days through the transferring of the detainees to other facilities, and once that happened, fencing, lighting and generators should be removed. She wrote that the state and federal defendants can't bring anyone other than those who are already being detained at the facility onto the property. The order does not prohibit modification or repairs to existing facilities, \"which are solely for the purpose of increasing safety or mitigating environmental or other risks at the site.\"\nThe preliminary injunction includes \"those who are in active concert or participation with” the state of Florida or federal defendants or their officers, agents, employees,\" the judge wrote in an 82-page order.\nWilliams said state officials never sufficiently explained why the facility needed to be in the middle of the Florida Everglades.\n\"What is apparent, however, is that in their haste to construct the detention camp, the State did not consider alternative locations,\" Williams said.\nWATCH BELOW: Environmental groups call ruling 'victory for the rule of law'\nJudge cites decades-long efforts to preserve Everglades\nWilliams said her order gave the state and federal defendants time to wind down the facility so that it can undergo the required environmental assessments. She noted the three-quarters century of efforts to preserve the Everglades.\n\"Since that time, every Florida governor, every Florida senator, and countless local and national political figures, including presidents, have publicly pledged their unequivocal support for the restoration, conservation, and protection of the Everglades,\" she wrote. \"This order does nothing more than uphold the basic requirements of legislation designed to fulfill those promises.\"\nPresident Donald Trump toured the facility last month and suggested it could be a model for future lockups nationwide as his administration races to expand the infrastructure necessary for increasing deportations.\nEnvironmental groups and the Miccosukee Tribe had argued that further construction and operations should be stopped until federal and state officials complied with federal environmental laws. Their lawsuit claims the project threatens environmentally sensitive wetlands that are home to protected plants and animals and would reverse billions of dollars' worth of environmental restoration.\nEve Samples, executive director of Friends of the Everglades, called the ruling a landmark victory for the Everglades and Americans who believe this imperiled wilderness should be protected.\n\"It sends a clear message that environmental laws must be respected by leaders at the highest levels of our government — and there are consequences for ignoring them,\" Samples said in a statement.\nSamples said Friday the ruling was a \"victory for the rule of law and for holding government accountable.\"\nMiccosukee Tribe Chairman Talbert Cypress said this isn't the first time the tribe has had to fight for its land and rights.\n\"We will always stand up for our culture, our sovereignty, and for the Everglades,\" Cypress said in a statement.\nThe state unsuccessfully argued in its defense that the National Environmental Policy Act doesn't apply to them, contending that it only applies to federal agencies.\n\"We also intend to vindicate other environmental laws, including violations we noticed under the Endangered Species Act, Clean Water Act, and laws that govern our public lands, like Big Cypress National Preserve,\" Elise Bennett, senior attorney for the Center for Biological Diversity, said.\nAttorneys for the state and federal defendants didn't immediately respond to emailed inquiries late Thursday. But they have previously argued that, although the detention center would be holding federal detainees, the construction and operation of the facility was entirely under the state of Florida, meaning the federal environmental law didn't apply.\nThe judge has said the detention facility was, at a minimum, a joint partnership between the state and federal government.\nThe detention center was quickly built almost two months ago at a lightly used, single-runway training airport in the middle of the Everglades. It currently holds several hundred detainees but was designed to eventually hold up to 3,000 detainees in temporary tent structures.\nRead more of WPTV's related coverage below:\nNational Politics\nFlorida must stop expanding ‘Alligator Alcatraz’ immigration center, judge says\nWPTV Investigates\nMan with disability deported, allegedly signed papers he couldn't understand\nMiami-Dade\nPart of lawsuit over legal rights of detainees at Everglades facility dismissed\nMiami-Dade\nHearing for 'Alligator Alcatraz' ends without immediate ruling\nWPTV Investigates\nWhat a federal lawsuit reveals about the inner-workings of Alligator Alcatraz\nWPTV Investigates\nEnvironmental court battle over 'Alligator Alcatraz' exposes impacts on state\nState\nDeSantis admin left county officials in the dark as detention facility built\nState\nThe Miccosukee Tribe of Florida wants to join lawsuit against Alligator Alcatraz\nMiami-Dade\nFlorida Democrats condemn 'Alligator Alcatraz' conditions after tour\nMiami-Dade\nWorms in food and wastewater on floor, say detainees at Everglades facility\nState\nNew lawsuit filed after state lawmakers denied access to Everglades facility\nMiami-Dade\nAttorney says client had no access to running water at Alligator Alcatraz\nMiami-Dade\nDetainees allege inhumane conditions at Everglades detention center\nState\n'Alligator Alcatraz' 2.0: Second detention center planned in Florida Everglades\nNational Politics\nFirst immigration detainees arrive at 'Alligator Alcatraz' center in Florida\nMiami-Dade\nPresident Trump visits 'Alligator Alcatraz' detention center\nMiami-Dade\nProtesters arrive at Alligator Alcatraz to share concerns, praise project\nState\nProtesters line highway in Florida Everglades to oppose 'Alligator Alcatraz'\nState\nEnvironmental groups sue to block 'Alligator Alcatraz'\nState\nDeSantis floats building another detention center in northern Florida\nMiami-Dade"
    },
    {
      "news_title": "‘Alligator Alcatraz’ fight: DeSantis vows to appeal judge's order to scale back Everglades immigrant-detention center",
      "news_link": "https://www.fox35orlando.com/news/alligator-alcatraz-fight-desantis-vows-appeal-judges-order-scale-back-everglades-immigrant-detention-center",
      "bias": "Center",
      "text": "‘Alligator Alcatraz’ fight: DeSantis vows to appeal judge's order to scale back Everglades immigrant-detention center\nORLANDO, Fla. - Florida Gov. Ron DeSantis is pushing ahead with plans for a controversial immigrant-detention center in the Everglades despite a federal judge’s order to begin dismantling parts of the facility.\nWhat we know:\nA federal judge has ordered Gov. Ron DeSantis’ administration to begin dismantling portions of a controversial immigrant-detention center in the Everglades, known as \"Alligator Alcatraz.\"\nCLICK TO DOWNLOAD THE FOX LOCAL APP\nThe ruling halts further construction, bans the transfer of new detainees and requires removal of fencing, lighting and equipment within 60 days. Environmental groups and the Miccosukee Tribe sued, arguing the state skipped a required federal environmental review.\nWhat we don't know:\nIt remains unclear whether the state will comply with the order during the appeals process. DeSantis’ office has not confirmed if dismantling will begin while the case moves to the 11th U.S. Circuit Court of Appeals.\nQuestions also linger over why the site was chosen in the Everglades and whether other detention centers, including one DeSantis has proposed in Baker County, will face similar challenges.\nThe backstory:\nThe lawsuit claims both the DeSantis and Trump administrations failed to follow the National Environmental Policy Act, which requires environmental-impact studies and public input before projects can proceed.\nThe Miccosukee Tribe says the facility, located near the Big Cypress National Preserve, threatens sacred ceremonial sites, tribal traditions and endangered species habitats. The facility has already disrupted access to off-road trails and plants used for medicine and ceremonies.\nWhat they're saying:\nThe Everglades facility has become a point of contention for critics who accuse the state of prioritizing political theater over legal requirements.\n\"We knew the minute this judge got the case, we knew exactly what she was going to do,\" said Gov. Ron DeSantis. \"This is not anything that was unexpected, but we will make sure to get the job done in the end.\"\nEnvironmental advocates say runoff and wastewater from the complex could pollute waterways where most Miccosukee tribal members live.\n\"We are still concerned because the psychic harm, the mental trauma that our children and our young adults are going to have to live with … will be felt for generations,\" explained Curtis Osceola, Miccosukee attorney. \"When it comes to our homelands, there is no compromise, and we will continue to fight.\"\nAttorney Paul Schwiep, for environmental groups, said, \"Any rational NEPA analysis … would conclude it makes no sense to build a 5,000-person detention center in the heart of the Everglades.\"\nSIGN-UP FOR FOX 35'S BREAKING NEWS, DAILY NEWS NEWSLETTERS\nThe Source: This story was written based on reporting by the Associated Press, the News Service of Florida, court filings and a news conference by Gov. Ron DeSantis, held on Aug. 22, 2025."
    },
    {
      "news_title": "Desantis vows to continue work on Alligator Alcatraz despite ruling ordering a halt",
      "news_link": "https://www.palmbeachpost.com/story/news/politics/state/2025/08/22/gov-ron-desantis-says-recent-ruling-wont-affect-running-of-alligator-alcatraz-mission/85779317007/",
      "bias": "Center",
      "text": "Desantis vows to continue work on Alligator Alcatraz despite ruling ordering a halt\n- A federal judge issued a temporary injunction to halt operations at \"Alligator Alcatraz,\" a Florida immigration detention center.\n- Florida Gov. Ron DeSantis vowed to continue deportations despite the ruling.\n- The Miccosukee Tribe and environmental groups celebrated the injunction as a win.\n- A separate lawsuit regarding detainee rights was transferred to a different court.\nThe aftershock of U.S. District Judge Kathleen Williams' is sending waves through the environmental and political realms as the future of Alligator Alcatraz, at this point, is unsure.\nBut less than a day after the ruling halting operations, Gov. Ron DeSantis said the state will not be deterred.\n\"We had a judge try to upset the apple cart with respect to our deportation and detainee center in south Florida at Alligator Alcatraz,\" Desantis said at a news conference in Panama City on Aug. 22. \"This is not something that was not expected. This was a judge that was not going to give us a fair shake.\"\nWilliams put in place a temporary injunction that says DeSantis and President Donald Trump should pack up all the trucks, bunks, tarps, fences and people and vacate the property.\nDeSantis response was no surprise to the opposition.\n\"This is a win for the environment,\" said Betty Osecola, an influential member of the Miccosukee Tribe of Indians of Florida. \"And though the preliminary injunction was issued, we still need to take a stand to continue this fight because we know very well the state and the federal government are going to continue in their efforts in appealing this decision.\"\nThe Miccosukee reservation is just a few miles from the Alligator Alcatraz site, which was formly a flight training center operated by Miami-Dade County.\nTo make matters more complicated, the facility is actually in Collier County, where commissioners have vowed to stay out of this divisive matter.\nAlligator Alcatraz is a controversial immigration detention center at the enterface of the Big Cypress National Preserve and Everglades National Park.\nConstruction started in June, after Florida Attorney General James Uthmeier announced the detention center on social media.\nThe center wasn't the idea of a planning staff, a review committee or even the Department of Homeland Security.\nAnd Alligator Alcatraz didn't go through the typical review process as DeSantis declared a state of emergency to avoid staff review and public comment periods.\n\"You have people that are in the country that have already been ordered to be removed by the system,\" DeSantis said. \"And the previous administration didn’t want to do anything.\"\nEarlier Aug. 22, Alex Lanfranconi, the governor's communications director, released a statement: “The deportations will continue until morale improves.”\nThe ruling stems from a June 27 lawsuit filed by Friends of the Everglades, the Center for Biological Diversity, and joined by the Miccosukee Tribe of Indians of Florida. The defendants in the case include the Florida Division of Emergency Management, the Department of Homeland Security, ICE, and Miami-Dade County.\n\"So, let's celebrate this win today, but let's stay determined for that fight for the long haul,\" Osceola said.\nDeSantis remained committed to the plan.\n\"We’re in the position of leading the state efforts to help the Trump administration remove these illegal aliens not just from Florida but from our country,\" he said.\nThe other Alligator Alcatraz lawsuit\nIn another case focusing on plaintiffs legal and civil rights, U.S. District Judge Rodolfo Ruiz ruled Aug. 18 the matter should move to a different court while also declaring part of the lawsuit moot.\nAt the heart of the case was whether the government had violated detainees’ rights to due process and legal counsel. Civil rights attorneys had said the remote Everglades facility made it nearly impossible for immigrants to speak confidentially with lawyers or even find out which immigration court can hear their cases.\nThe plaintiffs’ attorneys filed suit in the Southern District of Florida, which includes Miami-Dade County, though state and federal officials argued that it should have been filed in the Middle District of Florida, which includes Collier County.\nIn his 47-page order, Ruiz agreed, transferring the case to the middle district. He also dismissed the immigration-court allegations in the lawsuit, saying they were moot after a federal decision that judges at Krome North Processing Service Center would handle the detainees’ cases.\nThe case now heads to “a sister court in the Middle District of Florida to reach the merits of plaintiffs’ remaining claims under the First Amendment,” Ruiz wrote.\nDeSantis said the most recent ruling won't affect operations.\n\"This is not going to deter us. \"We’re going to continue the deportations and this mission,\" he said.\nBreaking News and Visuals Editor Stacey Henson contributed to this report."
    },
    {
      "news_title": "Governor DeSantis Defies Judge's Order to Halt Operations at 'Alligator Alcatraz': 'We're Not Gonna Be Deterred'",
      "news_link": "https://www.latintimes.com/governor-desantis-defies-judges-order-halt-operations-alligator-alcatraz-were-not-gonna-588731",
      "bias": "Lean Left",
      "text": "Florida Governor Ron DeSantis has responded defiantly to U.S. District Judge Kathleen Williams' ruling halting operations at Alligator Alcatraz by saying that his administration \"will not be deterred\" by the order.\nSpeaking at a news conference in Panama City, DeSantis introduced the subject noting that \"we had a judge try to upset the apple cart with respect to our deportation and detainee center in south Florida at Alligator Alcatraz.\"\nHe then continued:\n\"This was not something that was unexpected. This was a judge that was not going to give us a fair shake, this was preordained. It's an act from this judge that is trying to do policy from the bench. This is not going to deter us. We're going to keep working on the deportations, advancing that mission\"\nDeSantis went on to say that he's confident that \"we're totally in the right on this\" since \"we're leading the state efforts to help the Trump administration actually enforce the law to remove these illegal aliens from not just Florida but from our country.\" He also took the opportunity to say that he'd be doubling down on efforts with the recently-announced \"Deportation Depot.\"\nWilliams issued a temporary injunction on Thursday, requiring Florida authorities to begin dismantling parts of the Alligator Alcatraz facility—including temporary fencing, lighting, and generators—within 60 days, and to conduct environmental studies before further work proceeds. The court cited risks to the surrounding habitat, including the reduction of 2,000 acres of land used by Florida panthers and loss of access to trails for members of the Miccosukee Tribe.\nThe injunction stems from a June 27 lawsuit filed by Friends of the Everglades, the Center for Biological Diversity, and the Miccosukee Tribe. The plaintiffs argued that the construction and operation of the detention center violated environmental regulations and failed to consult stakeholders or assess risks.\nThe case is not the only one Alligator Alcatraz is facing, as Fort Myers News-Press points out. In another case focusing on plaintiffs legal and civil rights, U.S. District Judge Rodolfo Ruiz ruled earlier this week the matter should move to a different court while also declaring part of the lawsuit moot.\nAt the heart of that case is whether the government violated detainees' rights to due process and legal counsel, as civil rights attorneys have said the remote Everglades facility made it nearly impossible for immigrants to speak confidentially with lawyers or even find out which immigration court can hear their cases.\n© 2025 Latin Times. All rights reserved. Do not reproduce without permission."
    },
    {
      "news_title": "DeSantis vows to continue work on Alligator Alcatraz despite ruling ordering a halt",
      "news_link": "https://www.news-press.com/story/news/environment/2025/08/22/gov-ron-desantis-says-recent-ruling-wont-affect-running-of-alligator-alcatraz-mission/85775302007/",
      "bias": "Lean Left",
      "text": null
    },
    {
      "news_title": "DeSantis administration appeals judge's halt to ‘Alligator Alcatraz' expansion",
      "news_link": "https://www.nbcmiami.com/news/local/desantis-administration-appeals-judges-halt-to-alligator-alcatraz-expansion/3681267/",
      "bias": "Lean Left",
      "text": "Gov. Ron DeSantis’ administration quickly appealed a federal judge’s ruling Thursday that sided with environmental groups and the Miccosukee Tribe and required winding down operations at a controversial immigrant-detention facility in the Everglades.\nThe state filed a notice of appealing a preliminary injunction issued by U.S. District Judge Kathleen Williams that prevents additional construction and bringing additional detainees to the facility, which the state has dubbed “Alligator Alcatraz.” Williams also ordered the removal within 60 days of temporary fencing, detention-center lighting and such things as generators.\nWatch NBC6 free wherever you are\nAs is common, the notice filed by the state did not detail arguments the DeSantis administration will make at the Atlanta-based 11th U.S. Circuit Court of Appeals. Williams’ ruling came in a lawsuit filed against state and federal officials by Friends of the Everglades and the Center for Biological Diversity and joined by the Miccosukee Tribe.\n'ALLIGATOR ALCATRAZ' LATEST\n“Plaintiffs have provided extensive evidence supporting their claims of significant ongoing and likely future environmental harms from the project,” the 82-page ruling said. “By contrast, while the defendants repeatedly espouse the importance of immigration enforcement, they offered little to no evidence why this detention camp, in this particular location, is uniquely suited and critical to that mission.”\nThe state opened the detention facility last month at the Dade-Collier Training and Transition Airport, which is used for flight training. State officials touted it as part of an effort to support President Donald Trump’s fight against illegal immigration.\nState officials have disputed that the facility poses environmental threats and have cited the decades-long use of the airport. But Williams rejected such arguments, pointing to issues such as additional paving for the detention facility and high-powered lights.\n“The light pollution is far worse now than before the camp’s construction,” Williams wrote. “The addition of 800,000 square feet of asphalt paving (with another 1 million planned) increases harmful water runoff relative to the areas previously paved. The frenetic human activity, including vehicular traffic and wastewater from thousands of people daily, was essentially absent prior to the detention camp’s construction.”\nSpeaking at a news conference on Friday, DeSantis criticized the ruling from Williams, who was appointed by then-President Barack Obama.\n\"This was not something that was unexpected. This is a judge that was not going to give us a fair shake. This was preordained, very much an activist judge that is trying to do policy from the bench,\" DeSantis said. \"This is not going to deter us. We're going to continue working on the deportations, advancing that mission. We knew that this would be something that would likely happen, and we will respond accordingly.\"\nThe lawsuit, filed in the federal Southern District of Florida, alleges violations of the National Environmental Policy Act, a federal law that requires evaluating potential environmental impacts before such a project can move forward.\nWilliams wrote Thursday that there was “no process” to evaluate the risks of the facility, which is surrounded by the Big Cypress National Preserve.\nIt was not immediately clear how many immigrants are detained at the facility. State officials initially said it would house up to 3,000 detainees and could be expanded to add 1,000 people. State Division of Emergency Management Director Kevin Guthrie said last week the facility had a capacity for 2,000 detainees and held 1,000.\n\"This mission is important. You either have a country or you don't. You have people that are in this country that have already been ordered to be removed by the current system, and yet the previous administration didn't want to do anything about it,\" DeSantis said Friday. \"We're committed to the mission. We're not going to be deterred. We see this happening all over the country. We knew the minute this judge got the case, we knew exactly what she was going to do. This is not anything that was unexpected, but we'll make sure to get the job done in the end.\"\nWilliams’ ruling Thursday came after she issued a temporary restraining order on Aug. 7 that blocked state and federal officials from further expansion of the facility. The temporary restraining order was slated to last two weeks.\nThe environmental lawsuit is one of two closely watched cases about the facility. The other case involves issues about access to legal representation for detainees."
    },
    {
      "news_title": "Alligator Alcatraz could be shut down. Ron DeSantis has a backup plan – UK Times",
      "news_link": "https://uk-times.com/alligator-alcatraz-could-be-shut-down-ron-desantis-has-a-backup-plan-uk-times/",
      "bias": "unknown",
      "text": "Florida’s controversial 3,000-bed “Alligator Alcatraz” immigrant detention center could be shut down as soon as this fall after a wave of legal challenges.\nBut the state’s Republican Governor Ron DeSantis has a backup plan, and Donald Trump’s administration claims that a federal judge’s order to temporarily shut down parts of the facility — which could become permanent — will not halt the president’s aggressive anti-immigration agenda.\nImmigrants are expected to be detained at other facilities in the state instead.\nOn Thursday, a federal judge ruled that no more detainees can be sent to the facility, which was built in a matter of days deep in the Everglades on an airstrip. The state can continue to detain immigrants who are currently imprisoned there until they are deported, according to the judge.\nThere was widespread outrage over the very notion of the facility when it was announced, with state and federal officials officially naming the detention camp after the notorious California prison, due to the threatening wildlife that surrounds it, which the Trump administration touted as a deterrent to people escaping.\nMigrants are confined to cages with bunk beds, enduring Florida’s sweltering summer heat, pests and rationed meals. A separate federal lawsuit accuses the facility of blocking detainees from legal counsel and forcing people into “overcrowded, unsanitary, and harsh conditions” with inadequate food and “excessive use of force” from guards that sent at least one man to a hospital.\nMembers of Congress and state lawmakers who visited were stunned by the conditions they witnessed, and they demanded its immediate closure.\nA preliminary injunction was issued this week in a federal lawsuit brought by environmental groups and the Miccosukee Tribe of Indians of Florida.\nJudge Kathleen Williams’ ruling on Thursday follows serious concerns from the Miccosukee Tribe, a Native American community whose reservation lies within miles of the facility, about the development’s impact on their land and the environmentally sensitive Everglades.\n“The project creates irreparable harm in the form of habitat loss and increased mortality to endangered species in the area,” Judge Williams said in the order. The further installation of any lighting, fencing, paving, tents, or buildings is forbidden, and “all generators, gas, sewage, and other waste and waste receptacles that were installed to support this project” must be removed in 60 days.\nWhile the injunction is only temporary until a court can make a final decision in the case, the state and federal governments have appealed the decision and requested that the judge rule on enforcement while their appeal is pending, asking that she make a decision by Monday at 5 p.m.\nMeanwhile, a third federal lawsuit against the facility — filed by immigrants’ rights advocates including the American Civil Liberties Union — challenges Florida’s authority to detain people there.\nThe suit targets the state’s use of what it describes as the “expansive and unlawful use” of the federal 287(g) program, which allows local and state law enforcement agencies to enforce federal immigration law.\nResponding to Judge Williams’ decision, Governor DeSantis said on Friday that it was “not unexpected,” and the state would “respond accordingly.”\n“We’re not going to be deterred,” DeSantis said. “We are totally in the right on this,” he added, referring to the president’s mass deportation program that Americans largely oppose.\nFlorida’s plan, it appears, is to double down on state-run detention centers and a second 2,000-capacity facility, dubbed “Deportation Depot,” at a shuttered state prison that closed in 2021 due to staff shortages.\nThat prison — located within a rural stretch of the state between Tallahassee and Jacksonville — will operate inside Baker Correctional Institution, joining a new wave of state-run detention centers as ICE looks to build capacity to detain more immigrants in similar facilities across the country.\n“The reason for this is not to just house people indefinitely. We want to process, stage, and then return illegal aliens to their home country. That is the name of the game,” DeSantis said at a press conference announcing the detention center last week.\nSpeaking to NewsNation on Saturday, border czar Tom Homan said that “they’re not going to stop us doing what we’re doing.”\n“We’ll follow the judge’s order, and we’ll litigate and we’ll appeal it,” he said. “But [the] bottom line is, we’re going to continue to arrest public safety threats and national security threats every day across this country.”\nHoman said that ICE would simply adapt.\n“If we have to send them to another facility. That’s what we’re going to do,” he said. “That’s why the president has asked for 100,000 beds in the Big, Beautiful Bill. So, we’re going to build 100,000 beds, so we’re not going to have a lack of bed space.”\nThe Independent reported earlier this month that ICE has inked nearly 800 federal 287(g) program agreements covering 40 states, funded by $45 billion in new funding to expand ICE capacity.\nIn Indiana, officials announced plans earlier this month to expand the Miami Correctional Centre, located 70 miles north of Indianapolis. Homeland Security Secretary Kristi Noem stated that the facility will have the capacity to detain approximately 1,000 immigrants. Officials have already dubbed this new detention centre the “Speedway Slammer”.\nSeparately, the Trump administration is reportedly in talks with Louisiana officials to detain immigrants at the infamous Angola prison. This facility, the largest maximum-security prison in the country, was built on a former plantation owned by a slaveholder. The Wall Street Journal reported that Angola, which currently holds around 4,300 people, mostly convicted of violent crimes, could house 450 immigrants as early as next month."
    },
    {
      "news_title": "“Not Going to Deter Us” – Governor DeSantis Responds To Judge’s Order to Close ‘Alligator Alcatraz’",
      "news_link": "https://politicom.com.au/not-going-to-deter-us-governor-desantis-responds-to-judges-order-to-close-alligator-alcatraz/?utm_source=rss&utm_medium=rss&utm_campaign=not-going-to-deter-us-governor-desantis-responds-to-judges-order-to-close-alligator-alcatraz",
      "bias": "unknown",
      "text": "Yesterday, The Gateway Pundit reported that US District Judge Kathleen Williams had ordered a South Florida Detention Facility affectionately nicknamed ‘Alligator Alcatraz’ to cease receiving new detainees and dismantle the facility in 60 days.\n“The Court ENTERS a Preliminary Injunction prohibiting the State and Federal Defendants and their officers, agents, employees, attorneys, and any person who is in active concert or participation with them from (1) installing any additional industrial-style lighting (described by witnesses as “Sunbelt” lighting); or doing any paving, filling, excavating, or fencing; or doing any other site expansion, including placing or erecting any additional buildings, tents, dormitories, or other residential or administrative facilities on the TNT site; and (2) bringing any additional persons onto the TNT site who were not already being detained at the site at the time of this Order going into effect,” the judge wrote in an 82-page order reviewed by The Gateway Pundit.\nThe facility is located inside the Big Cypress National Preserve in Ochopee, FL at the Dade-Collier Training and Transition Airport.\nThis morning, during a press conference with Florida Highway Patrol to announce the results of a major immigration enforcement operation, Governor Ron DeSantis said that the ruling “is not going to deter us.”\nThis was not something that was unexpected. This is a judge that was not going to give us a fair shake. This was preordained. Very much an activist judge that is trying to do policy from the bench. This is not going to deter us. We are going to continue working on the deportations, advancing that mission. We knew that this would be something that would likely happen and we will respond accordingly.\nWe’re now in this position where we’re leading the state effort to help the Trump administration actually enforce the law and actually remove these illegal aliens from not just Florida, but from our country. That’s something that we didn’t have for four years and now that’s something that we’re absolutely on board with making sure happens going forward.\nNot only did Governor DeSantis stand in the gap against a federal judge trying to dismantle a state facility, the Florida governor doubled down on the creation of a new facility in the northern portion of the state to be known as the “Deportation Depot”:\nI would also note that because of the success of Alligator Alcatraz, there’s demand for more. So I did announce that we’re going to be opening another facility right outside of Jacksonville in Baker County. We’ve called that the “Deportation Depot.” So that is something will be able to hold another 2,000 and there’s an airport close by. So you have the processing and the removal.\nDuring the announcement, Gov. DeSantis called on the Republican-led Congress to defund sanctuary states like California, who issued a commercial drivers license to an illegal alien who killed three Floridians when he made an illegal U-turn on the Florida Turnpike in St. Lucie County.\nJUST IN – GOV. RON DESANTIS: “We’ve got a Republican Congress! All these guys that run when they ask you for their vote, ‘Oh, I’m going to secure the border, I’m going to be tough on immigration.’ Not one runs openly on being weak on immigration, right? Because they know they… pic.twitter.com/WBZ3hBvgQT\n— Florida’s Voice (@FLVoiceNews) August 22, 2025\nBREAKING: @GovRonDeSantis announces deportations will continue at Alligator Alcatraz as they fight the ruling from an activist judge\n“We’re not gonna be deterred. We’re totally in the right on this.”\n“We are gonna be opening another facility…Deportation Depot.” pic.twitter.com/9YL6RKJyN3\n— Florida’s Voice (@FLVoiceNews) August 22, 2025\nGovernor DeSantis Announces Results of Major Immigration Enforcement Operation https://t.co/A1oooXaW3D\n— Ron DeSantis (@GovRonDeSantis) August 22, 2025\nThe post “Not Going to Deter Us” – Governor DeSantis Responds To Judge’s Order to Close ‘Alligator Alcatraz’ appeared first on The Gateway Pundit."
    },
    {
      "news_title": "Sides Gear Up for Continued 'Alcatraz' Fight",
      "news_link": "https://www.newsserviceflorida.com/latest/headlines/sides-gear-up-for-continued-alcatraz-fight/article_9e0faf4c-7c25-487d-8417-616946067895.html",
      "bias": "unknown",
      "text": null
    }
  ]
}