{
  "story_id": "GN_20250825_224112_9ae8a75b",
  "metadata": {
    "title": "Indonesia and US Kick Off Largest Super Garuda Shield With Indo-Pacific Partners",
    "timestamp": "2025-08-25T22:41:12.591866",
    "url": "https://ground.news/article/indonesia-hosts-annual-us-led-combat-drills-with-indo-pacific-allies_76a186"
  },
  "bias_distribution": {
    "total_sources": "32",
    "leaning_left": "8",
    "center": "9",
    "leaning_right": "3"
  },
  "perspective_summaries": {
    "left": [
      "Indonesia and the United States began annual joint military exercises with forces from twelve other nations, focusing on regional security amid concerns over China.",
      "A total of 6,500 troops are participating, including forces from Australia, Japan, and others.",
      "Paparo stated that the expanded participants symbolize a commitment to partnership and respect for sovereignty.",
      "Indonesia aims to diversify its defense by purchasing arms from the U.S. while maintaining its strategic neutrality in the region."
    ],
    "center": [
      "The annual Super Garuda Shield military drills kicked off on Monday in Jakarta and nearby areas, featuring Indonesian and U.S. forces along with troops from 11 allied nations.",
      "The exercises occur amid regional tensions and aim to ensure Asia-Pacific stability while the US urges allies to more seriously address threats from China's growing assertiveness.",
      "The exercises include over 6,500 personnel—comprising 4,100 Indonesian and 1,300 American troops—and feature activities such as command simulations, cybersecurity training, and weapons firing drills, continuing through September 4.",
      "Samuel Paparo, US Indo-Pacific Command commander, called this year the largest Super Garuda Shield, emphasizing the collective deterrence against violent attempts to change facts on the ground.",
      "The expanded drills reflect a commitment to partnership and sovereignty, but have raised concerns from China, while Indonesia balances strong ties with both Washington and Beijing amid ongoing regional rivalry."
    ],
    "right": [
      "The US and Indonesia began joint military drills, Super Garuda Shield 2025, involving troops from 13 nations to ensure stability in the Asia-Pacific region.",
      "Commander of the US Indo-Pacific Command, Samuel Paparo, stated that this year's exercises were 'the largest Super Garuda Shield ever.'",
      "Participating nations included Australia, Japan, and the United Kingdom, among others, totaling approximately 6,500 troops.",
      "China expressed anxiety over the exercises, accusing the US of trying to limit its military influence in the region."
    ]
  },
  "sources": [
    {
      "news_title": "Indonesia and US begin joint annual military drills",
      "news_link": "https://www.dw.com/en/indonesia-and-us-begin-joint-annual-military-drills/a-73753086",
      "bias": "Center",
      "text": "Indonesia and US begin joint annual military drills\nAugust 25, 2025Indonesia and the United States began their annual joint military exercises on Monday together with forces from 11 other countries.\nThe drills, aimed at ensuring stability in the Asia-Pacific region, come at a time when the US is seeking to ensure their allies take possible threats from China more seriously.\nMore than 4,000 Indonesian and 1,300 American troops are taking part until September 4, alongside troops from Australia, Japan, France, the United Kingdom, and others.\nLargest military drills to date\nThis year's annual \"Super Garuda Shield\" drills are the largest to have been participated in since they began in 2009, and they will take place in the capital, Jakarta, as well as locations on both the island of Sumatra and the Riau archipelago.\nSamuel Paparo, commander of US Indo-Pacific Command, said the exercises would help those participating to boost deterrence.\n\"It represents deterring anyone that would hope to change the facts on the ground using violence with the collective determination of all participants to uphold the principles of sovereignty,\" he said at the opening ceremony.\n\"If the unforgiving hour comes when we need each other as partners, we pick up the phone, operating from a basis of deep trust,\" Paparo added.\nThe Indonesian military has announced that staff exercises, cyber defense drills, and a live-fire event will be conducted. Observers have been sent from India, Papua New Guinea, and East Timor.\nUS believes China is increasing its influence\nThe United States and some of its allies, such as Australia, have expressed concern about China's growing assertiveness in the Pacific region.\nAlthough Indonesia maintains a good relationship with Beijing, it has recently become alarmed by what it sees as Chinese intrusion into its exclusive economic zone in the South China Sea.\nMeanwhile, the expanded drills raised concerns for China, which accused the US of trying to create an \"Asian NATO\" with the aim to limit China's growing military and diplomatic influence in the region.\nHowever, Washington has said that these drills, as well as others held in the region, are not aimed at Beijing.\nEdited by: Dmytro Hubenko"
    },
    {
      "news_title": "Indonesia hosts major US combat drills to 'deter' China",
      "news_link": "https://www.the-express.com/news/world-news/181402/indonesia-hosts-major-us-combat-drills-war-allies-nation-seeks-deter-china",
      "bias": "Right",
      "text": "Indonesia hosts major US combat drills with war allies as nation seeks to 'deter' China\nSuper Garuda Shield is a joint military exercise that has been held annually by U.S. and Indonesian soldiers since 2009.\nA massive display of military might against China was showcased as Indonesia played host to US combat drills with war allies.\nJoint military exercises kicked off on Monday, involving forces from a dozen other nations, in a move seen as the US urging its allies to take the threats posed by China more seriously.\nThe Indonesian National Armed Forces hosted this year's Super Garuda Shield, which aimed at bolstering regional ties amidst an increasingly volatile global scenario, according to Gen. Tandyo Budi Revita, the military's Deputy Commander.\nHe stated: \"It serves as a joint exercise where we stand together to respond every challenge quickly and precisely.\"\nThis was part of his speech at the opening ceremony, alongside Admiral Samuel Paparo, the Commander of the U.S. Indo-Pacific Command.\nThis annual exercise has been conducted in Jakarta by US and Indonesian soldiers since 2009.\nParticipating countries include Australia, Japan, Singapore, the United Kingdom, France, Canada, Germany, the Netherlands, New Zealand, Brazil, and South Korea, bringing the total number of troops to 6,500.\nPaparo indicated that it symbolized a commitment to partnership and each country's sovereignty through mutual respect.\nHe further added: \"It represents deterring anyone that would hope to change the facts on the ground using violence with the collective determination of all participants to uphold the principles of sovereignty,\".\nJakarta has voiced alarm about what it perceives as Chinese intrusion into its exclusive economic zone in the South China Sea, while sustaining broadly favorable relations with Beijing.\nMultiple Asian nations also dispatched observers to the 11-day combat exercise in Jakarta and on Sumatra island. The maneuvers will conclude on Sept. 4 with a joint live-fire drill.\nThe broadened exercises have triggered anxiety from China, which has accused the US of attempting to establish an \"Asian NATO\" to constrain China's expanding military and diplomatic clout in the region.\nIn a recent address in Singapore, US Defense Secretary Pete Hegseth warned that pursuing US military backing while depending on Chinese economic assistance involves significant risk.\nHegseth stated Washington has been bolstering military partnerships in the Indo-Pacific to comfort allies troubled by Beijing's escalating military and economic pressure from China and aggressive maneuvers in the contested South China Sea.\nAlthough heightened activities by Chinese coast guard ships and fishing vessels in the region have rattled Jakarta, Indonesia has attempted to prevent confrontation and maintained economic cooperation with China.\nJakarta's choice to circumvent the matter aligns with its established approach of keeping tensions with Beijing private.\nMuhammad Zulfikar Rakhmat stated: \"This dual-track diplomacy might seem inconsistent. But for Jakarta, it is strategic. Indonesia is embracing defense diversification, not alignment.\"\nHe further stated that the country has maintained its commitment to Super Garuda Shield and continued purchasing US and French arms while developing interoperability with Western militaries.\nRakhmat also noted: \"In a region defined by rising tensions and great power rivalry, Indonesia's refusal to choose sides, at least in defense, might be its strongest asset.\""
    },
    {
      "news_title": "Indonesia hosts annual US-led combat drills with Indo-Pacific allies",
      "news_link": "https://apnews.com/article/indonesia-us-super-garuda-shield-military-exercise-4d75f0f85b693a0bf0fe7a9654a92fe0",
      "bias": "Lean Left",
      "text": "Indonesia hosts annual US-led combat drills with Indo-Pacific allies\nIndonesia hosts annual US-led combat drills with Indo-Pacific allies\nJAKARTA, Indonesia (AP) — Indonesia and the United States began annual joint military exercises on Monday together with forces from a dozen other countries, as the U.S. pushes its allies to take threats from China more seriously.\nHosted by the Indonesian National Armed Forces, this year’s Super Garuda Shield focused on strengthening regional ties in an increasingly unstable global landscape, said Gen. Tandyo Budi Revita, the military’s Deputy Commander.\n“It serves as a joint exercise where we stand together to respond every challenge quickly and precisely.” he said in his speech at kick-off ceremony along with Admiral Samuel Paparo, the Commander of the U.S. Indo-Pacific Command.\nThe exercise has been held annually in Jakarta by U.S. and Indonesian soldiers since 2009. The list of participants expanded since 2022 to include Australia, Japan, Singapore, the United Kingdom, France, Canada, Germany, the Netherlands, New Zealand, Brazil and South Korea, bringing the total number of troops taking part in the drill to 6,500.\nPaparo said the expanded participants symbolizes a commitment to partnership and to the sovereignty of each country through mutual respect.\n“It represents deterring anyone that would hope to change the facts on the ground using violence with the collective determination of all participants to uphold the principles of sovereignty,” Paparo said.\nJakarta has expressed concern about what it sees as Chinese encroachment on its exclusive economic zone in the South China Sea, while maintaining generally positive ties with Beijing.\nSeveral Asian countries also sent observers to the 11-day combat exercise in Jakarta and on Sumatra island. They will end on Sept. 4 with a combined live-fire drill.\nThe expanded drills have sparked concern from China, which accused the U.S. of trying to build an “Asian NATO” to limit China’s growing military and diplomatic influence in the region.\nDuring a recent speech in Singapore, U.S. Defense Secretary Pete Hegseth cautioned that seeking U.S. military support while relying on Chinese economic support carries risk.\nHegseth said Washington has been strengthening an arc of military alliances in the Indo-Pacific to reassure allies alarmed by Beijing’s increasing military and economic pressure from China and provocative actions in the disputed South China Sea.\nDespite increased activities by Chinese coast guard vessels and fishing boats in the area have unnerved Jakarta, Indonesia has sought to avoid confrontation and continued economic initiatives with China.\nJakarta’s decision to sidestep the issue is consistent with its longstanding policy of keeping friction with Beijing behind closed doors, especially given the scale of Chinese trade and investment in the Indonesian economy, said Muhammad Zulfikar Rakhmat and Yeta Purnama, researchers at the Center of Economic and Law Studies or CELIOS.\n“This dual-track diplomacy might seem inconsistent. But for Jakarta, it is strategic. Indonesia is embracing defense diversification, not alignment,” said Rakhmat of CELIOS.\nThe country has remained committed to Super Garuda Shield and continued purchasing U.S. and French arms and developing interoperability with Western militaries, he added.\n“In a region defined by rising tensions and great power rivalry, Indonesia’s refusal to choose sides, at least in defense, might be its strongest asset,” Rakhmat said."
    },
    {
      "news_title": "Indonesia, US start 13-nation ‘Super Garuda Shield’ military drills",
      "news_link": "https://www.scmp.com/news/asia/southeast-asia/article/3323032/indonesia-us-start-13-nation-super-garuda-shield-military-drills",
      "bias": "Center",
      "text": "Advertisement\nIndonesia, US start 13-nation ‘Super Garuda Shield’ military drills\nMore than 4,100 Indonesian and 1,300 American troops will take part in this year’s ‘largest ever’ drills, aimed at boosting deterrence\nReading Time:2 minutes\nWhy you can trust SCMP\nIndonesia and the United States launched joint military drills on Monday that will last more than a week, joining allies from 11 countries in exercises aimed at ensuring stability in the Asia-Pacific region.\nAdvertisement\nThe annual “Super Garuda Shield” drills will take place in the capital, Jakarta, and several locations on the western island of Sumatra and the Riau archipelago until September 4.\nThis year’s exercises focused on strengthening regional ties in an increasingly unstable global landscape, said Armed Forces Deputy Commander Tandyo Budi Revita.\n“It serves as a joint exercise where we stand together to respond every challenge quickly and precisely,” he said in his speech at the kick-off ceremony.\nMore than 4,100 Indonesian and 1,300 American troops will take part, joined by participants from Australia, Japan, Singapore, France, New Zealand, Britain and other nations.\nAdvertisement\nAdvertisement\nSelect Voice\nChoose your listening speed\nGet through articles 2x faster\n1.25x\n250 WPM\nSlow\nAverage\nFast\n1.25x"
    },
    {
      "news_title": "Indonesia, US and allies launch joint military drills",
      "news_link": "https://www.channelnewsasia.com/asia/indonesia-us-allies-joint-military-drills-super-garuda-shield-2025-5312256",
      "bias": "Center",
      "text": "Indonesia, US and allies launch joint military drills\nJAKARTA: Indonesia and the United States launched joint military drills on Monday (Aug 25) that will last more than a week, joining allies from 11 countries in exercises aimed at ensuring stability in the Asia-Pacific region.\nThe annual \"Super Garuda Shield\" drills will take place in the capital Jakarta and several locations on the western island of Sumatra and the Riau archipelago until Sep 4.\nMore than 4,100 Indonesian and 1,300 American troops will take part, joined by participants from Australia, Japan, Singapore, France, New Zealand, Britain and other nations.\nThe US and some allies such as Australia have expressed growing concern about China's increasing assertiveness in the Pacific, but Washington has previously said such drills are not aimed at Beijing.\nSamuel Paparo, commander of US Indo-Pacific Command, said this year's exercises were \"the largest Super Garuda Shield ever\", adding that they would help participating nations boost deterrence, without elaborating.\n\"It represents deterring anyone that would hope to change the facts on the ground using violence with the collective determination of all participants to uphold the principles of sovereignty,\" Paparo said at Monday's opening ceremony.\n\"We do this by getting better every day across all domains ... so if the unforgiving hour comes when we need each other as partners, we pick up the phone and we begin operating from a basis of deep trust.\"\nThe programme includes staff exercises, cyber defence drills, and a live-fire event, the Indonesian military said.\nCountries including India, Papua New Guinea and East Timor also sent observers for the exercise.\nIndonesia maintains a neutral foreign policy and tries to keep good relations with Washington and Beijing, walking the diplomatic tightrope in the superpower rivalry."
    },
    {
      "news_title": "Indonesia, US and allies launch joint military drills - Asia & Pacific - The Jakarta Post",
      "news_link": "https://www.thejakartapost.com/world/2025/08/25/indonesia-us-and-allies-launch-joint-military-drills.html",
      "bias": "Lean Left",
      "text": "Can't find what you're looking for?\nView all search resultsCan't find what you're looking for?\nView all search resultsThe annual \"Super Garuda Shield\" drills will take place in the capital Jakarta and several locations on the western island of Sumatra and the Riau archipelago until September 4.\nndonesia and the United States launched joint military drills on Monday that will last more than a week, joining allies from 11 countries in exercises aimed at ensuring stability in the Asia-Pacific region.\nThe annual \"Super Garuda Shield\" drills will take place in the capital Jakarta and several locations on the western island of Sumatra and the Riau archipelago until September 4.\nMore than 4,100 Indonesian and 1,300 American troops will take part, joined by participants from Australia, Japan, Singapore, France, New Zealand, Britain and other nations.\nThe US and some allies such as Australia have expressed growing concern about China's increasing assertiveness in the Pacific, but Washington has previously said such drills are not aimed at Beijing.\nSamuel Paparo, commander of US Indo-Pacific Command, said this year's exercises were \"the largest Super Garuda Shield ever\", adding that they would help participating nations boost deterrence, without elaborating.\n\"It represents deterring anyone that would hope to change the facts on the ground using violence with the collective determination of all participants to uphold the principles of sovereignty,\" Paparo said at Monday's opening ceremony.\n\"We do this by getting better every day across all domains... so if the unforgiving hour comes when we need each other as partners, we pick up the phone and we begin operating from a basis of deep trust.\"\nThe programme includes staff exercises, cyber defence drills, and a live-fire event, the Indonesian Military (TNI) said.\nCountries including India, Papua New Guinea and Timor Leste also sent observers for the exercise.\nIndonesia maintains a neutral foreign policy and tries to keep good relations with Washington and Beijing, walking the diplomatic tightrope in the superpower rivalry.\nLast week, German foreign minister Johann Wadephul said during a visit to Jakarta that China's assertiveness in the South China Sea and tensions in the Taiwan Strait pose threats to international security that also impact Europe.\n\"China's growing military assertiveness in the South China Sea not only threatens Asia's security, but also undermines the international rules-based order as a whole,\" Wadephul said in a speech at a foreign policy event, adding that essential trade routes were also at risk as a result.\nOn the Taiwan Strait, the minister said: \"Any escalation would have serious consequences for global security and prosperity – and directly affect German and European interests, too.\"\nShare your experiences, suggestions, and any issues you've encountered on The Jakarta Post. We're here to listen.\nThank you for sharing your thoughts. We appreciate your feedback.\nQuickly share this news with your network—keep everyone informed with just a single click!\nShare the best of The Jakarta Post with friends, family, or colleagues. As a subscriber, you can gift 3 to 5 articles each month that anyone can read—no subscription needed!\nGet the best experience—faster access, exclusive features, and a seamless way to stay updated."
    },
    {
      "news_title": "Indonesia, US Lead Regional Allies in Largest-Ever Super Garuda Shield",
      "news_link": "https://www.metrotvnews.com/read/b2lCpY1P-indonesia-us-lead-regional-allies-in-largest-ever-super-garuda-shield",
      "bias": "unknown",
      "text": "Commander of United States Indo-Pacific Command Admiral Samuel J. Paparo said that Super Garuda Shield has grown into one of the region’s premier exercises. (US Embassy in Jakarta)\nWilly Haryono • 25 August 2025 17:21\nJakarta: The Indonesian National Armed Forces (TNI) and the United States Armed Forces, in collaboration with 11 other troop-contributing nations, officially launched the 2025 Super Garuda Shield exercise today with an opening ceremony at the Naval Staff and Command College (Seskoal) in Jakarta. The joint exercise will take place across Jakarta, Baturaja in South Sumatra, and Dabo Singkep in Lampung from August 25 to September 4, 2025.\nThis year, Super Garuda Shield brings together more than 6,000 troops from Indonesia, the United States, Australia, Canada, the United Kingdom, Japan, Brazil, South Korea, the Netherlands, New Zealand, Singapore, Germany, and France.\nSuper Garuda Shield is a large-scale, multinational joint military exercise designed to enhance interoperability, build mutual trust, and strengthen collective readiness among the participating armed forces of partner nations. Originally established in 2006 as a bilateral information and training exchange between the United States and Indonesia under the name Garuda Shield, the exercise expanded in 2022 to include additional partner nations, reflecting the growing importance of defense cooperation in the Indo-Pacific region.\nIn his remarks at the opening ceremony, Commander of United States Indo-Pacific Command Admiral Samuel J. Paparo said, “Super Garuda Shield has grown into one of the region’s premier exercises... whether its airborne operations, littoral and jungle operations, maritime maneuver, or staff planning, this exercise builds interoperability and resilience. It ensures that, as a team of nations, we can meet regional challenges and keep the Indo-Pacific free and open.”\n“The Super Garuda Shield Joint Exercise 2025 is not merely a military drill,” said the Deputy Commander of Indonesian Armed Force (TNI) General Tandyo Budi Revita in his opening remarks. “It is a platform of trust, a bridge of friendship, and a beacon of our shared commitment to safeguard peace and stability.”\n“Super Garuda Shield exemplifies the strength of our Comprehensive Strategic Partnership with Indonesia and the unwavering commitment of all participating nations to strengthen regional security and stability,” said U.S. Charge d’Affaires Ambassador Peter Haymond. “Each year this exercise grows in importance and reflects our shared dedication to peace and security.”\nSuper Garuda Shield increases readiness through realistic training in a variety of climates, terrains, and environments. This training and interaction also provide leaders, soldiers, sailors, airmen, and marines with the cultural awareness and familiarization necessary to operate in overseas contingencies.\nSuper Garuda Shield 2025 features maritime and field training events to include engineering construction activities, staff training exercises, airborne operations, jungle training, air assault operations, an amphibious exercise, a large field training exercise and combined arms live fire exercises, and a High Mobility Artillery Rocket System (HIMARS) live fire exercise. These lines of effort will feature joint and multinational planning, operations, exchanges, and activities that increase the participating nations’ military capabilities to provide for combined defense of the Indonesia archipelago.\nAlso read: U.S.-Indonesian Reviewed the Strength and Success of the Defense Relationship"
    },
    {
      "news_title": "US-Indonesia Military Drills Amid China Concerns",
      "news_link": "https://www.editorji.com/world-news/usindonesia-military-drills-amid-china-concerns-1756107244356",
      "bias": "unknown",
      "text": "Jakarta, Aug 25 (AP) — Indonesia and the United States initiated their annual military exercises on Monday, collaborating with forces from over a dozen other nations. The US has been encouraging its allies to more seriously consider threats from China.\nOrganized by the Indonesian National Armed Forces, this year's Super Garuda Shield aims to bolster regional alliances amid a globally unstable environment, stated Gen Tandyo Budi Revita, the military's Deputy Commander.\n\"It acts as a joint training where we unite to address any challenges swiftly and accurately,\" Revita remarked at the opening ceremony, alongside Admiral Samuel Paparo, Commander of the US Indo-Pacific Command.\nSince 2009, these exercises have been jointly conducted in Jakarta by US and Indonesian troops. Starting in 2022, the list of participants grew to include Australia, Japan, Singapore, the UK, France, Canada, Germany, the Netherlands, New Zealand, Brazil, and South Korea, bringing the total troop count to 6,500.\nPaparo emphasized that the expanded roster of participants demonstrates a commitment to partnership and respects each nation's sovereignty.\n\"It signifies a resolve to deter any force that might attempt to alter the status quo using violence, backed by the collective intent to uphold sovereignty principles,\" Paparo noted.\nWhile Jakarta has voiced concerns about Chinese advances into its exclusive economic zone in the South China Sea, it maintains largely positive relations with Beijing.\nSeveral Asian nations also dispatched observers to the 11-day combat drills held in Jakarta and on Sumatra Island, concluding on Sept. 4 with a joint live-fire exercise.\nThe broadened exercises have raised alarms for China, which accuses the US of constructing an \"Asian NATO\" to constrain China's burgeoning military and diplomatic sway.\nIn a recent address in Singapore, US Defence Secretary Pete Hegseth warned that depending on US military aid while simultaneously relying on Chinese economic backing poses inherent risks.\nHegseth noted that the US has been solidifying a network of military partnerships in the Indo-Pacific, aiming to reassure allies concerned by Beijing's mounting military and economic assertiveness and provocative maneuvers in the contested South China Sea.\nDespite increased activity by Chinese coast guard and fishing vessels in the area, which has caused unease for Jakarta, Indonesia strives to avoid confrontation and persists in economic enterprises with China.\nJakarta's choice to skirt the issue aligns with its enduring strategy of managing tensions with Beijing discreetly, especially considering the scope of Chinese trade and investment in Indonesia's economy, explained Muhammad Zulfikar Rakhmat and Yeta Purnama, researchers at the Centre of Economic and Law Studies (CELIOS).\n\"This dual-track diplomacy might seem contradictory. But for Jakarta, it is a strategic move. Indonesia is favoring defense diversification over alignment,\" stated Rakhmat of CELIOS.\nThe nation stays dedicated to Super Garuda Shield while continuously procuring US and French arms and enhancing its interoperability with Western militaries, he added.\n\"In a region characterized by escalating tensions and great power competition, Indonesia's choice not to align itself, at least concerning defense, could be its most potent asset,\" Rakhmat concluded. (AP) SKS RD RD\n(Only the headline of this report may have been reworked by Editorji; the rest of the content is auto-generated from a syndicated feed.)"
    },
    {
      "news_title": "Indonesia, US, Allies Launch Joint Military Drills",
      "news_link": "https://www.islamtimes.com/en/news/1228974/indonesia-us-allies-launch-joint-military-drills",
      "bias": "unknown",
      "text": "Indonesia, US, Allies Launch Joint Military Drills\nStory Code : 1228974\nThe annual “Super Garuda Shield” drills will take place in the capital Jakarta and several locations on the western island of Sumatra and the Riau archipelago until September 4, AFP reported.\nMore than 4,100 Indonesian and 1,300 American troops will take part, joined by participants from Australia, Japan, Singapore, France, New Zealand, Britain and other nations.\nThe US and some allies such as Australia have expressed growing concern about China’s activities in the Pacific, but Washington has previously said such drills are not aimed at Beijing.\nSamuel Paparo, commander of US Indo-Pacific Command, said this year’s exercises were “the largest Super Garuda Shield ever,” adding that they would help participating nations boost deterrence, without elaborating.\n“It represents deterring anyone that would hope to change the facts on the ground using violence with the collective determination of all participants to uphold the principles of sovereignty,” Paparo said at Monday’s opening ceremony.\n“We do this by getting better every day across all domains... so if the unforgiving hour comes when we need each other as partners, we pick up the phone and we begin operating from a basis of deep trust.”\nThe program includes staff exercises, cyber defense drills, and a live-fire event, the Indonesian military said.\nCountries including India, Papua New Guinea and East Timor also sent observers for the exercise.\nIndonesia maintains a neutral foreign policy and tries to keep good relations with Washington and Beijing, walking the diplomatic tightrope in the superpower rivalry."
    },
    {
      "news_title": "U.S., Allied Forces Join for Exercise Pacific Vanguard 2025",
      "news_link": "https://www.dvidshub.net/news/546352/us-allied-forces-join-exercise-pacific-vanguard-2025",
      "bias": "unknown",
      "text": "NAVAL BASE GUAM – Maritime forces from the Royal Australian Navy (RAN) and Air Force (RAAF), Royal New Zealand Navy, Japan Maritime Self-Defense Force (JMSDF), Republic of Korea (ROK) Navy, U.S. Navy and U.S. Marine Corps are conducting multilateral maritime exercise Pacific Vanguard 2025 beginning with an opening ceremony on Aug. 25.\nThe cooperative exercise brings together service members from five Indo-Pacific nations to enhance their skills in maritime operations, anti-submarine warfare, air warfare, and advanced maneuvering scenarios to improve overall interoperability between the forces.\n“We are always grateful for the opportunity to deploy to Guam and conduct these exercises with like-minded partners,” said Capt. Arran Moore, commanding officer of the Royal Australian Air Force’s No. 92 Wing. “Exercise Pacific Vanguard represents essential training for our workforce, allowing them to validate our skills in high-end air-maritime integration, refine tactics, techniques and procedures, and ensure we have contemporary experience in scenarios that we cannot recreate on our own. The Royal Australian Air Force places a high value on training like Exercise Pacific Vanguard where we build experience and people-to-people links that ensure we can collectively respond to shared security challenges with our partners.”\nAdditionally, the exercise provides personnel from the five nations’ forces ashore opportunities to build shared multi-domain awareness and develop relationships that will help streamline combined operations in response to any crisis.\n\"Pacific Vanguard is a valuable opportunity for us to demonstrate our high-end tactical capabilities,\" said Rear Adm. Natsui Takashi, commander, Japan Maritime Self-Defense Force Escort Flotilla Four. \"Through Pacific Vanguard, the JMSDF can enhance our interoperability with the participating countries and contribute to the overall peace and stability in Indo-Pacific region. A free and open Indo-Pacific promotes the prosperous socio-economic activity that has benefited the region. Our deepening partnership with the Republic of Korea Navy, Royal Australian Navy and U.S. Navy in Guam symbolizes this stability and shared deterrence that upholds peace in the Indo-Pacific.\"\nPacific Vanguard participants included the Chungmugong Sun-Sin-class destroyer ROKS Wang Geon (DDH 978), Arleigh Burke-class guided missile destroyer USS Higgins (DDG 76), Hyūga-class helicopter destroyer JS Ise (DDH 182), Takanami-class destroyer JS Suzunami (DD 114), Mashū-class replenishment ship JS Ōmi (AOE 426) and Lewis and Clark-class dry cargo ship USNS Richard E. Byrd (T AKE 4).\n“Pacific Vanguard training is the best opportunity to strengthen interoperability between multinational navies and enhance combined operational capabilities,” said Capt. Ahn Woo Jin, commanding officer of Wang Geon. “I will treat the training as an actual mission and will utilize it as an opportunity to improve combat readiness posture.”\nThe U.S. military and its allies and partners continually operate in designated land, air, and sea areas of the Mariana Islands to safely train service members in equipment use, tactics, joint operations, and humanitarian aid missions.\n“Exercises like Pacific Vanguard are when our ties to our allies and partners are best displayed,” said Rear Adm. Eric Anduze, Commander, Carrier Strike Group Five. “The ability to come together seamlessly, and demonstrate the capacity to integrate in all aspects of maritime operations, is a testament to the abilities of every country involved. We all share a commitment to a free and open Indo-Pacific, and Pacific Vanguard is the latest example of that unwavering belief.”\nU.S. 7th Fleet is the U.S. Navy's largest forward-deployed numbered fleet, and routinely interacts and operates with allies and partners in preserving a free and open Indo-Pacific region.\n| Date Taken: | 08.25.2025 |\n| Date Posted: | 08.25.2025 01:24 |\n| Story ID: | 546352 |\n| Location: | AT SEA |\n| Web Views: | 107 |\n| Downloads: | 0 |\nThis work, U.S., Allied Forces Join for Exercise Pacific Vanguard 2025, by LT andrew kelly, identified by DVIDS, must comply with the restrictions shown on https://www.dvidshub.net/about/copyright."
    },
    {
      "news_title": "Indonesia and US launch joint Asia-Pacific military drills with allies",
      "news_link": "https://www.tag24.com/world/indonesia-and-us-launch-joint-asia-pacific-military-drills-with-allies-3414525",
      "bias": "unknown",
      "text": "Indonesia and US launch joint Asia-Pacific military drills with allies\nJakarta, Indonesia - Indonesia and the US launched joint military drills on Monday that will last more than a week, joining allies from 11 countries in exercises purportedly aimed at ensuring stability in the Asia-Pacific region.\nThe annual \"Super Garuda Shield\" drills will take place in the capital Jakarta and several locations on the western island of Sumatra and the Riau archipelago until September 4.\nMore than 4,100 Indonesian and 1,300 American troops will take part, joined by participants from Australia, Japan, Singapore, France, New Zealand, Britain, and other nations.\nThe US and some allies such as Australia have expressed growing concern about China's increasing assertiveness in the Pacific, but Washington has previously said such drills are not aimed at Beijing.\nSamuel Paparo, commander of US Indo-Pacific Command, said this year's exercises were \"the largest Super Garuda Shield ever,\" adding that they would help participating nations boost deterrence, without elaborating.\n\"It represents deterring anyone that would hope to change the facts on the ground using violence with the collective determination of all participants to uphold the principles of sovereignty,\" Paparo said at Monday's opening ceremony.\n\"We do this by getting better every day across all domains... so if the unforgiving hour comes when we need each other as partners, we pick up the phone and we begin operating from a basis of deep trust.\"\nThe program includes staff exercises, cyber defense drills, and a live-fire event, the Indonesian military said.\nCountries including India, Papua New Guinea, and East Timor also sent observers for the exercise.\nIndonesia maintains a neutral foreign policy and tries to keep good relations with Washington and Beijing, walking the diplomatic tightrope in the superpower rivalry.\nCover photo: BAY ISMOYO / AFP"
    }
  ]
}