{
  "story_id": "GN_20250823_200859_c603688d",
  "metadata": {
    "title": "Mamdani’s fundraising surges past Cuomo, Adams in New York mayoral race",
    "timestamp": "2025-08-23T20:08:59.493919",
    "url": "https://ground.news/article/mamdanis-fundraising-surges-past-cuomo-adams-in-new-york-mayoral-race_8dd7f4"
  },
  "bias_distribution": {
    "total_sources": "20",
    "leaning_left": "1",
    "center": "10",
    "leaning_right": "8"
  },
  "perspective_summaries": {
    "left": [
      "Zohran Mamdani's campaign for New York City mayor is surging with over 50,000 volunteers, thousands of small-dollar donors, and genuine enthusiasm, according to his spokesperson.",
      "Mamdani, who has criticized the role of billionaires, received a $250,000 donation from Elizabeth Simons, the daughter of a late billionaire hedge-fund co-founder, to a pro-Mamdani super PAC.",
      "Mamdani has raised far more than incumbent Mayor Eric Adams and former Governor Andrew Cuomo, with $4.4 million cash on hand and expecting over $2 million in public funds."
    ],
    "center": [
      "Zohran Mamdani's campaign for New York City mayor is surging with over 50,000 volunteers, thousands of small-dollar donors, and genuine enthusiasm, according to his spokesperson.",
      "Mamdani, who has criticized the role of billionaires, received a $250,000 donation from Elizabeth Simons, the daughter of a late billionaire hedge-fund co-founder, to a pro-Mamdani super PAC.",
      "Mamdani has raised far more than incumbent Mayor Eric Adams and former Governor Andrew Cuomo, with $4.4 million cash on hand and expecting over $2 million in public funds."
    ],
    "right": [
      "Zohran Mamdani has raised $1.05 million over the past month, significantly outpacing former New York Governor Andrew Cuomo's $507,660 in the same period according to Politico.",
      "Mamdani holds $4.4 million in campaign funds and may receive an additional $2.2 million in matching funds from the New York City Campaign Finance Board, as reported by Politico.",
      "A Siena Institute poll shows Mamdani leading with 44% support, while Cuomo has 25%, highlighting a 19-point gap according to MacCallum."
    ]
  },
  "sources": [
    {
      "news_title": "Zohran Mamdani leads fundraising in NYC mayoral race",
      "news_link": "https://www.aa.com.tr/en/americas/zohran-mamdani-leads-fundraising-in-nyc-mayoral-race/3667022",
      "bias": "Right",
      "text": "Zohran Mamdani leads fundraising in NYC mayoral race\nDemocratic nominee Mamdani’s campaign holds nearly $4.4M in total\nISTANBUL\nDemocratic nominee for New York City mayor, Zohran Mamdani, has surged ahead in fundraising for the race, collecting more than $1 million in recent weeks, according to new filings with the city’s Campaign Finance Board.\nMamdani has quickly become a rising star among progressive Democrats after he won New York City's mayoral Democratic primary in June, putting him on track to become the first Muslim and first South Asian to lead the US largest city.\nHis $1,051,200 raised from mid-July to mid-August 2025 far exceeds the $420,886 raised by incumbent Mayor Eric Adams, who is pursuing a second term as an independent, and the $507,660 reported by former Gov. Andrew Cuomo since restarting his campaign in July after losing to Mamdani in the primary.\nCuomo has also transferred more than $68,000 from a state-level campaign account to bolster his city campaign funds, according to media reports.\nAnadolu Agency website contains only a portion of the news stories offered to subscribers in the AA News Broadcasting System (HAS), and in summarized form. Please contact us for subscription options."
    },
    {
      "news_title": "Mamdani’s fundraising surges past Cuomo, Adams in New York mayoral race",
      "news_link": "https://www.cnn.com/2025/08/23/politics/mamdani-fundraising-cuomo-adams-new-york-mayor-race",
      "bias": "Lean Left",
      "text": "Zohran Mamdani, the Democratic nominee for New York City mayor, has rocketed past his rivals in fundraising, bringing in a little more than $1 million in recent weeks, according to new campaign reports filed Friday.\nMamdani’s haul far exceeds the $425,000 raised by the city’s embattled incumbent Mayor Eric Adams, who is waging a long-shot independent bid for a second term, and that of former New York Gov. Andrew Cuomo, who raised a little more than $507,000 since relaunching his campaign in July after his bruising primary loss to Mamdani.\nIn one sign of the former governor’s financial challenge, Cuomo also opted to transfer more than $68,000 from a state campaign account to help build his coffers for the city contest.\nThe Republican nominee Curtis Sliwa – viewed as a marginal candidate in the deeply Democratic city – raised about $407,000.\nThe haul by Mamdani between July 12 and August 18 marks an uptick from the roughly $852,000 he collected a month earlier as the democratic socialist shocked the political world by trouncing Cuomo in June’s Democratic primary.\nMamdani builds big war chest\nMamdani also has built a substantial war chest – with $4.4 million cash on hand, according to Friday’s filings with the New York City Campaign Finance Board. His campaign said it also expects to qualify for more than $2 million in public money under the city’s public fund matching program.\nIn all, more than 8,000 people contributed to Mamdani in roughly five weeks. And about half of his money came from donors who live outside the city, the filings show.\n“With over 50,000 volunteers, thousands of small-dollar donors, and genuine enthusiasm for Zohran’s vision for a more affordable New York City, our momentum is surging,” Mamdani’s campaign spokesperson Dora Pekec said in a statement Friday.\nCuomo, who announced in mid-July that he would continue to mount a general election campaign as a third-party candidate, has about $1.2 million in available cash. His campaign said Friday it is hoping to secure some $525,000 in matching funds.\nThe city’s campaign finance regulators will meet next week to consider the candidates’ funding requests.\nAdams, meanwhile, has a cash balance of roughly $3.9 million but has been repeatedly denied valuable public funds from the New York campaign board, which has cited its ongoing investigation of his campaign’s practices. He recently sued the board over its denial.\nFederal prosecutors last year indicted Adams on corruption charges, which the Trump administration has since dropped. On Friday, Adams insisted he would not abandon his reelection bid, a day after his former chief advisor was accused of accepting thousands of dollars in bribes. The mayor has not been accused of wrongdoing in the case.\nProminent outside donors open wallets\nMamdani, who has sharply criticized the role of billionaires in the race, also is benefitting from the support from the family member of a billionaire, recent filings show.\nPhilanthropist Elizabeth Simons, the daughter of late hedge-fund co-founder James Simons, donated $250,000 earlier this month to a pro-Mamdani super PAC, New Yorkers for Lower Costs. The donation is the largest contribution reported by the group to date.\nSuper PACs operate independently of candidates’ campaigns.\nShortly after winning the Democratic primary in June, Mamdani said he didn’t think billionaires should exist. “I don’t think that we should have billionaires because, frankly, it is so much money in a moment of such inequality, and ultimately, what we need more of is equality across our city and across our state and across our country,” Mamdani said on NBC’s “Meet the Press” at the time.\nA Mamdani campaign official on Friday declined to comment on Simons’ donation to the independent group.\nMeanwhile, recent bold-faced contributors to a super PAC promoting Cuomo’s candidacy include billionaire Walmart heir Alice Walton. Walton contributed $100,000 earlier this month to the pro-Cuomo Fix the City PAC, bringing her total donations to the group to $200,000.\nThe group spent more than $22 million in the Democratic primary fight.\nCNN’s David Wright and Gloria Pazmino contributed to this report."
    },
    {
      "news_title": "Cuomo Taps N.Y. State Funds to Counter Mamdani",
      "news_link": "https://www.997wpro.com/2025/08/22/cuomo-taps-n-y-state-funds-to-counter-mamdani/",
      "bias": "Lean Right",
      "text": "Former New York Gov. Andrew Cuomo tapped into money from his state campaign coffers directly to his city account in an attempt to compete with Zohran Mamdani, who has become a prodigious fundraiser since winning the Democrat mayoral primary, Politico said.\nCuomo has raised $507,660 over the last five weeks and has transferred $68,225 from his state account that he used in his prior campaigns for governor. Cuomo has $1.2 million on hand, according to his filing with the New York City Campaign Finance Board.\nMamdani reported raised $1.05 million over the past month, according to his filing. Mamdani has $4.4 million and is expected to be eligible for $2.2 million in matching funds from the New York City Campaign Finance Board, Politico reported. Cuomo is hoping to receive $400,000.\nCuomo trails Mamdani by double digits and has been unsuccessful in trying to get other candidates, like New York City Mayor Eric Adams, to drop out of the race.\n“Certain people wanted to transfer donations they made to the state account to the city account and, in consultation with [the NYCCFB], were permitted to on an individual basis,” Cuomo spokesperson Rich Azzopardi said in a statement.\nCuomo, who resigned during his third term, has $7.5 million in his state campaign account. To transfer more of the money to his city account, he has to get past donors to fill out forms acceding to the transfer of funds, Politico reported. Due to city fundraising rules that differ from the state, not all of Cuomo’s funds would be eligible to be transferred.\nFix the City, a super PAC that spent $22 million on Cuomo in the primary, has not raised significant amounts of money for the primary, Politico reported.\nMamdani and Cuomo both saw 52% of their campaign funds come from outside the five boroughs, Politico reported.\nAdams reported raising $420,886 and has $3.9 million on hand. Republican nominee Curtis Sliwa raised $407,332 and has $2 million on hand.\n© 2025 Newsmax. All rights reserved."
    },
    {
      "news_title": "Cuomo Addresses NYC Mayoral Bid On Fox News, Pushes Back On Mamdani's Rise",
      "news_link": "https://www.tampafp.com/cuomo-addresses-nyc-mayoral-bid-on-fox-news-pushes-back-on-mamdanis-rise/",
      "bias": "Lean Right",
      "text": "Former NY Governor Andrew Cuomo is campaigning for NYC Mayor, challenging Democratic Socialist Zohran Mamdani.\nFormer New York Governor Andrew Cuomo, now an independent candidate for New York City mayor, spoke on FOX News Channel’s The Story with Martha MacCallum, about his campaign on Friday, addressing his opponent, Democratic Socialist Zohran Mamdani, and his own political history.\nThe interview took place as a recent poll showed Mamdani leading the field by a significant margin.\nMacCallum cited a recent Siena Institute poll showing Mamdani with 44% support among registered voters, a 19-point lead over Cuomo’s 25%.\nOther candidates in the race, including incumbent Mayor Eric Adams, lag significantly behind. Adams, who is running for re-election as an independent, publicly stated he would not drop out of the race and criticized Mamdani, calling him a “beret-wearing carnival display.”\nREAD: Inmates Taunt “Creepy” Bryan Kohberger As Troubling Past Behavior Comes To Light\nCuomo, who lost to Mamdani in the Democratic primary but is continuing his run on an independent line, downplayed the poll numbers. He argued that Mamdani’s support would drop as the public learns more about his socialist policies.\n“I don’t think the public even knows who the assemblyman is,” Cuomo said, adding that his opponent’s anti-business and anti-police stances would not resonate with New York voters. Mamdani has previously advocated for policies such as rent freezes, free bus fares, and city-owned grocery stores. While he once called to “dismantle the NYPD,” he has recently said he would work with police.\nWhen asked about the sexual harassment allegations that led to his resignation as governor, Cuomo was direct. He stated that the accusations “have all gone nowhere” and were “fully investigated by numerous bodies,” an issue he believes will not impact his mayoral campaign.\nREAD: Cuban-American Entrepreneur Hernandez Enters NYC Mayoral Race, Aims To Counter Mamdani\nHe also addressed a report in Politico suggesting he was seeking support from President Donald Trump to help him against Mamdani. Cuomo denied this, but acknowledged that he believes he will be “very competitive with Republicans and with independents” due to his moderate positions on issues like law and order and capitalism.\nThe former governor was also pressed on his role in New York’s bail reform legislation. While he signed the initial bill, he said it has been amended multiple times since and that there is no “credible evidence” that bail reform has contributed to a rise in crime. He instead blamed the defunding of the police for increased crime rates, a move he attributed to the socialist movement.\nREAD: Liberals Beg Dems To Ditch Woke Lingo And Just Talk Normally\nCuomo also rejected the idea of federal intervention in New York City’s day-to-day management, stating that the city does not need the National Guard for public safety. He differentiated this from using the National Guard for emergencies such as hurricanes or large-scale protests, a practice he engaged in during his time as governor.\nFinally, Cuomo criticized the “woke” culture within the Democratic Party, arguing that a “hypersensitivity to superficiality” has caused the party to “miss the big issues,” such as affordable housing, crime, and high taxes. He contrasted this with his own focus on “bread-and-butter issues” that he said matter most to working-class families.\nPlease make a small donation to the Tampa Free Press to help sustain independent journalism. Your contribution enables us to continue delivering high-quality, local, and national news coverage.\nConnect with us: Follow the Tampa Free Press on Facebook and Twitter for breaking news and updates.\nSign up: Subscribe to our free newsletter for a curated selection of top stories delivered straight to your inbox."
    },
    {
      "news_title": "Zohran Mamdani Outraises Cuomo and Adams in New York Mayoral Race",
      "news_link": "https://examiner.co.ug/politics/zohran-mamdani-outraises-cuomo-and-adams-in-new-york-mayoral-race/",
      "bias": "unknown",
      "text": "Zohran Mamdani, the Democratic nominee for New York City mayor, has pulled far ahead of his rivals in the fundraising race, collecting just over $1 million in recent weeks, according to new filings released Friday.\nThe haul places Mamdani well above incumbent Mayor Eric Adams, who raised $425,000 while running as an independent in his bid for a second term, and former Governor Andrew Cuomo, who brought in a little more than $507,000 since relaunching his campaign in July following his primary defeat to Mamdani.\nCuomo’s filings also revealed that he moved more than $68,000 from a state campaign account to bolster his mayoral run, underscoring the financial challenges facing his campaign. Meanwhile, Republican nominee Curtis Sliwa, considered a long-shot contender in the heavily Democratic city, reported raising about $407,000.\nBetween July 12 and August 18, Mamdani’s fundraising marked a significant increase from the $852,000 he raised a month earlier, building momentum after his upset victory over Cuomo in June’s Democratic primary. His campaign now reports $4.4 million cash on hand and expects to receive an additional $2 million through the city’s public matching funds program.\nMore than 8,000 people contributed to Mamdani’s campaign over the five-week period, with roughly half of the donations coming from outside New York City. “With over 50,000 volunteers, thousands of small-dollar donors, and genuine enthusiasm for Zohran’s vision for a more affordable New York City, our momentum is surging,” campaign spokesperson Dora Pekec said in a statement.Cuomo, continuing his bid as a third-party candidate, has $1.2 million available and is seeking about $525,000 in matching funds. The New York City Campaign Finance Board is scheduled to review candidates’ funding requests next week.\nAdams, who holds about $3.9 million in cash reserves, has been denied public matching funds due to ongoing investigations into his campaign practices. He recently filed a lawsuit challenging the board’s decision. Although federal prosecutors dropped corruption charges against him last year, scrutiny has persisted, especially after one of his former advisers was accused of accepting bribes. Adams, however, has maintained that he will not withdraw from the race\n.Mamdani, a democratic socialist, has built his campaign on grassroots fundraising and vocal opposition to billionaire influence in politics. However, recent filings revealed that a pro-Mamdani super PAC, New Yorkers for Lower Costs, received a $250,000 donation from philanthropist Elizabeth Simons, daughter of hedge fund co-founder James Simons. The contribution is the largest the group has reported so far.\nWhile super PACs are independent of candidate campaigns, the donation highlights the growing interest from wealthy donors in the race. Mamdani himself previously argued against the existence of billionaires, saying in June after his primary win that “in a moment of such inequality, what we need more of is equality across our city, our state, and our country.”His campaign declined to comment on Simons’ contribution.\nThe Black Examiner: Unfolding The Truth\nWe’re here for you.\nYour feedback helps us tell better stories. Share what resonated with you and where we can do better. Have a story idea or something to say? Reach out to us via email.\neditorial@examiner.co.ug"
    }
  ]
}