{
  "story_id": "GN_20250826_002225_f52b794c",
  "metadata": {
    "title": "Justice Dept. declines to defend grants for Hispanic-serving colleges, calling them unconstitutional",
    "timestamp": "2025-08-26T00:22:25.552451",
    "url": "https://ground.news/article/trump-administration-says-grants-for-hispanic-serving-colleges-are-unconstitutional-and-it-wont-defend-them-in-court"
  },
  "bias_distribution": {
    "total_sources": "124",
    "leaning_left": "28",
    "center": "69",
    "leaning_right": "3"
  },
  "perspective_summaries": {
    "left": [
      "The Trump administration will not defend a grant program for colleges with large Hispanic student populations, claiming the funding is unconstitutional.",
      "The Justice Department stated it agrees with a lawsuit to eliminate grants for colleges where at least 25% of undergraduates are Hispanic.",
      "Tennessee argues that all its public universities serve Hispanic students but do not qualify for the grants due to an 'arbitrary ethnic threshold."
    ],
    "center": [
      "Solicitor General John Sauer notified Republican House Speaker Mike Johnson on July 25 that the U.S. Justice Department has decided not to defend the Hispanic-Serving Institution grant program.",
      "The State of Tennessee and an anti-affirmative action group sued the U.S. Education Department in June, and the Justice Department told Congress it agrees with the legal challenge.",
      "Justice Department officials said the Hispanic-Serving Institution grant program confers an unconstitutional advantage based on race or ethnicity.",
      "Congress appropriated about $350 million for the program in 2024, and the suit says affected schools lose tens of millions, while more than 500 colleges designated Hispanic-Serving Institutions compete for grants.",
      "The program, created by Congress in 1998, targets colleges with at least a quarter undergraduate Hispanic share to address Latino students' lower college and graduation rates."
    ],
    "right": [
      "The Trump Administration is ending a $350 million-a-year federal program for Hispanic-Serving Institutions, declaring it unconstitutional according to Solicitor General D. John Sauer's letter to House Speaker Mike Johnson.",
      "This decision may confront other identity-driven grant programs across the government.",
      "Officials indicated that Historically Black Colleges and Universities do not face similar constitutional issues due to their historical status, not quotas.",
      "The Department of Education reserves funds for universities with at least 25 percent Hispanic enrollment, excluding others that do not meet this requirement."
    ]
  },
  "sources": [
    {
      "news_title": "Program for Hispanic students is hobbled",
      "news_link": "https://buffalonews.com/article_74fc2b97-9a54-5e66-be0e-26f4bee72c8c.html",
      "bias": "Center",
      "text": null
    },
    {
      "news_title": "America’s Best Hispanic-Serving Colleges",
      "news_link": "https://washingtonmonthly.com/2025/08/24/best-hispanic-serving-colleges/",
      "bias": "Lean Left",
      "text": "|\nGetting your Trinity Audio player ready...\n|\nIn the near future, a collegiate crisis is looming. Beyond the federal government’s ongoing assault on higher education, with its politicized investigations and threats to funding, an inevitable and devastating cliff awaits. We’re talking, of course, about enrollment.\nAs the abnormally large Millennial generation gives way to the smaller Gen Z, American colleges are losing their ability to fill seats—and balance their budgets. Between 2010 and 2021, universities lost 15 percent of their student population, or about 2.7 million people. Hundreds of schools closed. As if that weren’t enough, demographers predict that those numbers will soon plummet again, decreasing by as much as another 15 percent by 2039. Losing close to a third of their student population in total will likely mean lights out for many more schools.\nThere is hope, however. Even as the general population shrank, Hispanic students made up 80 percent of increases in degree attainment between 2017 and 2022. Numbers of Hispanic high school graduates are projected to increase by 16 percent by 2041. Given the existential importance of serving this population, one might think that colleges would be ferociously competing to recruit these students and get them through school, and that major education publications would be closely tracking their progress. But there are few such measures of excellence out there, and the rankings of Hispanic-serving schools that do exist mostly rely on generalized data, rather than numbers that tell you specifically how Hispanic students are doing. And that’s why this year the Washington Monthly, in collaboration with the non-profit Excelencia in Education, is releasing a comparison of how schools serve this all-important population.\nThe Best Colleges for Hispanic Students ranking combines the social mobility focus of the Monthly’s college rankings with the deep knowledge that Excelencia has built over decades of studying Hispanic performance in higher education. Among many other metrics, the D.C.-based non-profit gathers data on the transfer and graduation rates of Hispanic students, which are a good approximation of how well schools serve them. The hundreds of schools that apply for the organization’s “Seal of Excelencia” certification provide that information for consideration—and much more. They also submit data about diversity among faculty and staff, along with other metrics, and descriptions of their programming, communications, and long-range planning around Hispanic education. To reflect those nuanced evaluations, we tracked in our ranking whether or not a school was awarded the seal. To those metrics we added two social mobility measures from our own rankings: net price (the annual amount students pay when factoring in aid), and the percentage of students who receive Pell Grants.\nWe limited our ranking to federally recognized Hispanic-serving institutions (HSIs) that provided this information when they applied for the Seal of Excelencia—151 schools, out of the 615 HSIs. As a result, we’re calling this the “Best” Colleges for Hispanic Students, not “Best and Worst.” Any school that serves so many Hispanic students (the minimum for an HSI is 25 percent) and that cares enough about its performance to go through the rigorous seal application is deserving of praise.\nMany of the top performers, like UT–Rio Grande Valley (number two among four-year schools) and Fresno State (number eight), are favorites in the Monthly’s overall rankings (see Best Colleges for Your Tuition (and Tax) Dollars rankings). That’s no accident—those schools are already focused on delivering a quality education at low cost to underprivileged student populations. Take our number one university for Hispanic students, Cal State–Los Angeles. The regional university in East L.A. is a powerful engine of social mobility, with a low net price of $4,551 (fourth of the 1,421 schools in our overall rankings) and a high proportion of students on Pell Grants—66 percent. The school is more than three-quarters Hispanic, and it serves those students well: They graduate at close to the same rate as the general population (51 percent versus 53 percent, compared to the 13-point national gap). Cal State–LA also received the Seal of Excelencia in 2023, one of only nine institutions that year.\nPatterns emerge in the rankings, especially around location. A high proportion of Hispanic college students are in California, Texas, and New York. Those states dominate the top slots here, and if the list were expanded to include the bottom two-thirds of HSIs, you might expect to see them there, too. But demographic happenstance also gives rise to intentional excellence. Eight of the top 20 schools are California State campuses, which are united by their low prices, favorable graduation rates, and high numbers of non-wealthy students. The University of Texas and Texas A&M systems also do well. Texas A&M International is in third place, with an incredibly low price of $3,833 and a graduation rate for Hispanic students equal to that of the general population. Five other Texas schools occupy the top 20, including little-known Sul Ross State University (nine), a Seal of Excelencia winner that graduates Hispanic students at a better rate than it does the general population. The same is true of UT–San Antonio (13), which also boasts a seal, 42 percent Pell enrollment, and reasonably low costs.\nThe rest of the country has plenty to offer, too. A few Florida schools, including Florida International University (18), reach the upper echelons. Like California and New York, much of the Florida state system’s excellence in our rankings is owed to a unified governance structure whose focus on affordability keeps tuition low. (See Christopher M. Mullin, “Florida’s Fresh-Squeezed Colleges.”) In Georgia, Dalton State College rises to 16th place mostly by virtue of its attractive cost—$5,083 a year. (The graduation rates, though not great, are about equal between Hispanic students and the general population of the college.) Two CUNY branches, Lehman and John Jay, make the top 20. Just a few miles apart and roughly the same size, they offer very low costs—around $4,000—to their roughly half-Hispanic student populations, and have virtually no ethnic graduation gap. John Jay proudly features a wide array of student support resources, including ¡Adelante!, a two-year leadership program that provides academic mentorship, career advice, and financial support to Hispanic students.\nWe also rank two-year schools in a separate list, because of a methodological wrinkle: Given how often students at these institutions finish their degrees at other schools, we count transfers as a positive rather than a negative. The number one performer is South Texas College, a community college in the Rio Grande Valley with an overwhelmingly Hispanic student body—95 percent. Students pay a staggeringly low $1,414 a year, net of aid, and more than a third are on Pell Grants. In 2022, South Texas College celebrated its high performance in a ranking from Excelencia of schools that enroll and graduate Latinos. “Being an HSI is more than just a designation for STC, it’s our identity; it’s who we are,” Matthew Hebbard, vice president of student affairs and enrollment management, said in a statement. The school focuses heavily on student support services for its many first-generation and ESL students, as well as on hands-on vocational training, including at partner universities in Mexico that prepare students for manufacturing jobs.\nThese schools offer many concrete lessons about the kinds of programs that best serve Hispanic students. Crucially, they aren’t limited to one part of college. Our number two four-year school, UT–Rio Grande Valley, boasts a comprehensive strategy that includes “Tuition Advantage,” a program that pays tuition and fees for students with family incomes under $125,000; a dual credit program with several area high schools; and a robust international student services department for its Latin American undergraduates. One of Excelencia in Education’s regular awards is the “Examples of Excelencia,” four programs chosen from dozens around the country as a model for what works. They include a wide range of programs, from student support services to language instruction to academic skills classes to scholarships and recruiting initiatives meant to boost access to college.\nThere are many places to find great ideas, including at schools that aren’t on this list. In 2024, one of the finalists for the Examples of Excelencia award was a student support service at Santa Barbara City College called the Writing Center, which works with high numbers of Hispanic students. Just creating a student service center focused on writing support isn’t the innovation; what’s special about the Writing Center, Emma Trelles, the poet and former professor who directs the center, told me, is the staff’s understanding of how cultural and linguistic understanding affects success. “As the daughter of immigrants and the first in my family to complete college and go on to get a master’s, I know firsthand how hard it is to navigate bureaucracies and complete platforms and all the things you have to do as a student when you don’t have guidance,” she told me. The center’s handpicked tutors, about a third of whom are bilingual in English and Spanish, view themselves as “collaborators,” Trelles said, not teachers or lecturers. Some students come for just a few sessions—like a young man of Mexican descent who recently asked Trelles for help navigating the college online dashboard. Others come back again and again, brushing up on their writing, polishing their English, and sometimes just talking through their daily problems and fears. In applying for the Examples of Excelencia award, the Writing Center tracked down statistics on its own effectiveness. From 2017 to 2023, Hispanic students who visited the center between one and three times completed their classes at rates 13 to 25 percent higher than those who didn’t visit at all.\nCompletion, and enrollment—colleges will need to improve their performance in these areas over the coming decade if they wish to survive. And to do so, they will need to serve an expanding and often under-privileged student population that itself is a focus of many of today’s political attacks. (On his first day in office, Donald Trump rescinded Biden-era initiatives to support HSIs as part of a slew of executive orders against what he called “harmful” DEI.) By highlighting the schools that have recognized and accepted that mantle, we hope to inspire others to follow. Maybe then that cliff will not seem so steep."
    },
    {
      "news_title": "Justice Department declines to defend grants for Hispanic-serving colleges, calling them unconstitutional",
      "news_link": "https://www.cnn.com/2025/08/23/politics/hispanic-serving-colleges-justice-department",
      "bias": "Lean Left",
      "text": "The Trump administration said Friday it will not defend a decades-old grant program for colleges with large numbers of Hispanic students that is being challenged in court, declaring the government believes the funding is unconstitutional.\nIn a memo sent to Congress, the Justice Department said it agrees with a lawsuit attempting to strike down grants that are reserved for colleges and universities where at least a quarter of undergraduates are Hispanic. Congress created the program in 1998 after finding Latino students were going to college and graduating at far lower rates than White students.\nJustice Department officials argued the program provides an unconstitutional advantage based on race or ethnicity.\nThe state of Tennessee and an anti-affirmative action organization sued the US Education Department in June, asking a judge to halt the Hispanic-Serving Institution program. Tennessee argued all of its public universities serve Hispanic students but none meet the “arbitrary ethnic threshold” to be eligible for the grants. Those schools miss out on tens of millions of dollars because of discriminatory requirements, the suit said.\nOn Friday, the Justice Department released a letter in which Solicitor General John Sauer notified Republican House Speaker Mike Johnson that the department “has decided not to defend” the program, saying certain aspects of it are unconstitutional. The letter, dated July 25, cited a 2023 Supreme Court decision that “outright racial balancing” is “patently unconstitutional.”\nThe Justice Department declined to comment.\nTennessee is backed in the suit by Students for Fair Admissions, a conservative legal group that successfully challenged affirmative action in admissions at Harvard and the University of North Carolina. That suit led to a 2023 Supreme Court ruling that forbids universities from considering students’ race in admissions decisions.\nEdward Blum, president of Students for Fair Admissions, said Friday the group would decline to comment.\nMore than 500 colleges and universities are designated as Hispanic-Serving Institutions, making them eligible for the grant program. Congress appropriated about $350 million for the program in 2024. Colleges compete for the grants, which can go toward a range of uses, including building improvements and science programs.\nFormer President Joe Biden made Hispanic-serving universities a priority, signing an executive action last year that promised a new presidential advisory board and increased funding. President Donald Trump revoked the order his first day in office.\nTrump is taking steps to dismantle the Education Department and has called for massive funding cuts, yet his 2026 budget request preserved grants for Hispanic-serving universities and even asked Congress for a slight increase. Even so, there have been doubts about his administration’s commitment to the funding.\nA national association of Hispanic-serving universities filed a motion last month to intervene as a defendant in the Tennessee lawsuit, voicing concern that the federal government would not adequately represent the group’s members.\nThe Hispanic Association of Colleges and Universities said Trump’s agenda is “entirely adverse” to the group’s interests, citing the president’s aim to close the Education Department entirely. The administration is “on record denouncing programs like HSIs, that take account of and seek to redress ethnic or racial disparity,” the group wrote.\nTennessee and Students for Fair Admissions did not object to the group’s request to lead the legal defense.\nUnlike historically Black or Native American tribal colleges and universities, which receive their designations based on their missions, any college can receive the HSI label and grants if its Latino enrollment makes up at least 25% of the undergraduate student body.\nThe list of HSIs includes flagship campuses like the University of Texas at Austin and the University of Arizona, along with many community colleges and smaller institutions.\nIn its court filing, the national association argues the grants are constitutional and help put its members on an even playing field.\nThe group’s schools enroll 67% of the nation’s Latino undergraduate students, yet studies find those schools receive far less in state and federal funding than other institutions. Hispanic-serving universities are open to students of all races — as an example, the association pointed to Southern Adventist University, a private school in Tennessee whose student body is 28% Hispanic and 40% White.\nThe Justice Department generally has a duty to uphold the Constitution and federal legislation, but in rare cases it can refuse to defend laws it believes are unconstitutional. The Obama administration did so in 2011 when it refused to enforce the Defense of Marriage Act. During his first term, Trump did the same with the Affordable Care Act.\nThe Trump administration has fought to end diversity, equity and inclusion policies in government, education and business, arguing that they discriminate against White and Asian American people."
    },
    {
      "news_title": "Justice Department backs lawsuit seeking to end grants for Hispanic-serving colleges, calling them unconstitutional",
      "news_link": "https://www.cbsnews.com/news/justice-department-hispanic-colleges-grants-unconstitutional/",
      "bias": "Lean Left",
      "text": "Justice Department backs lawsuit seeking to end grants for Hispanic-serving colleges, calling them unconstitutional\nThe Trump administration said Friday it will not defend a decades-old grant program for colleges with large numbers of Hispanic students that is being challenged in court, declaring the government believes the funding is unconstitutional.\nIn a memo sent to Congress, the Justice Department said it agrees with a lawsuit attempting to strike down grants that are reserved for colleges and universities where at least a quarter of undergraduates are Hispanic. Congress created the program in 1998 after finding Latino students were attending college and graduating at far lower rates than white students.\nJustice Department officials argued the program provides an unconstitutional advantage based on race or ethnicity.\nThe state of Tennessee and an anti-affirmative action organization sued the U.S. Education Department in June, asking a judge to halt the Hispanic-Serving Institution program. Tennessee argued all of its public universities serve Hispanic students, but none meet the \"arbitrary ethnic threshold\" to be eligible for the grants. Those schools miss out on tens of millions of dollars because of discriminatory requirements, the lawsuit said.\nOn Friday, the Justice Department released a letter in which Solicitor General D. John Sauer notified Republican House Speaker Mike Johnson that the department \"has decided not to defend\" the program, saying certain aspects of it are unconstitutional. The letter, dated July 25, cited the 2023 Supreme Court decision outlawing affirmative action, which said \"outright racial balancing\" is \"patently unconstitutional.\"\nThe Justice Department declined to comment.\nTennessee is backed in the suit by Students for Fair Admissions, a conservative legal group that successfully challenged affirmative action in admissions at Harvard and the University of North Carolina. That suit led to a 2023 Supreme Court ruling that forbids universities from considering students' race in admissions decisions.\nEdward Blum, president of Students for Fair Admissions, said Friday the group would decline to comment.\nMore than 500 colleges and universities are designated as Hispanic-Serving Institutions, making them eligible for the grant program. Congress appropriated about $350 million for the program in 2024. Colleges compete for the grants, which can go toward a range of uses, from building improvements to science programs.\nFormer President Joe Biden made Hispanic-serving universities a priority, signing an executive action last year that promised a new presidential advisory board and increased funding. President Donald Trump revoked the order on his first day in office.\nTrump is taking steps to dismantle the Education Department and has called for massive funding cuts, yet his 2026 budget request preserved grants for Hispanic-serving colleges and even asked Congress for a slight increase. Even so, there have been doubts about his administration's commitment to the funding.\nA national association of Hispanic-serving universities filed a motion last month to intervene as a defendant in the Tennessee lawsuit, voicing concern that the federal government would not adequately represent the group's members.\nThe Hispanic Association of Colleges and Universities said Trump's agenda is \"entirely adverse\" to the group's interests, citing the president's aim to close the Education Department entirely. The administration is \"on record denouncing programs like HSIs, that take account of and seek to redress ethnic or racial disparity,\" the group wrote.\nTennessee and Students for Fair Admissions did not object to the group's request to lead the legal defense.\nUnlike historically Black or Native American tribal colleges and universities, which receive their designations based on their missions, any college can receive the HSI label and grants if its Latino enrollment makes up at least 25% of the undergraduate student body.\nThe list of HSIs includes flagship campuses like the University of Texas at Austin and the University of Arizona, along with many community colleges and smaller institutions.\nIn its court filing, the national association argues the grants are constitutional and help put its members on an even playing field.\nThe group's schools enroll 67% of the nation's Latino undergraduate students, yet studies find that those schools receive far less in state and federal funding than other institutions. Hispanic-serving universities are open to students of all races - as an example, the association pointed to Southern Adventist University, a private school in Tennessee whose student body is 28% Hispanic and 40% white.\nThe Justice Department generally has a duty to uphold the Constitution and federal legislation, but in rare cases it can refuse to defend laws it believes are unconstitutional. The Obama administration did so in 2011 when it refused to enforce the Defense of Marriage Act. During his first term, Trump did the same with the Affordable Care Act.\nThe Trump administration has fought to end diversity, equity and inclusion policies in government, education and business, arguing that they discriminate against white and Asian American people."
    },
    {
      "news_title": "DOJ says it won't defend Hispanic grant program",
      "news_link": "https://qconline.com/article_b0ef9216-b29a-58b4-84f5-250a0cc6da97.html",
      "bias": "Center",
      "text": "Country\nUnited States of America US Virgin Islands United States Minor Outlying Islands Canada Mexico, United Mexican States Bahamas, Commonwealth of the Cuba, Republic of Dominican Republic Haiti, Republic of Jamaica Afghanistan Albania, People's Socialist Republic of Algeria, People's Democratic Republic of American Samoa Andorra, Principality of Angola, Republic of Anguilla Antarctica (the territory South of 60 deg S) Antigua and Barbuda Argentina, Argentine Republic Armenia Aruba Australia, Commonwealth of Austria, Republic of Azerbaijan, Republic of Bahrain, Kingdom of Bangladesh, People's Republic of Barbados Belarus Belgium, Kingdom of Belize Benin, People's Republic of Bermuda Bhutan, Kingdom of Bolivia, Republic of Bosnia and Herzegovina Botswana, Republic of Bouvet Island (Bouvetoya) Brazil, Federative Republic of British Indian Ocean Territory (Chagos Archipelago) British Virgin Islands Brunei Darussalam Bulgaria, People's Republic of Burkina Faso Burundi, Republic of Cambodia, Kingdom of Cameroon, United Republic of Cape Verde, Republic of Cayman Islands Central African Republic Chad, Republic of Chile, Republic of China, People's Republic of Christmas Island Cocos (Keeling) Islands Colombia, Republic of Comoros, Union of the Congo, Democratic Republic of Congo, People's Republic of Cook Islands Costa Rica, Republic of Cote D'Ivoire, Ivory Coast, Republic of the Cyprus, Republic of Czech Republic Denmark, Kingdom of Djibouti, Republic of Dominica, Commonwealth of Ecuador, Republic of Egypt, Arab Republic of El Salvador, Republic of Equatorial Guinea, Republic of Eritrea Estonia Ethiopia Faeroe Islands Falkland Islands (Malvinas) Fiji, Republic of the Fiji Islands Finland, Republic of France, French Republic French Guiana French Polynesia French Southern Territories Gabon, Gabonese Republic Gambia, Republic of the Georgia Germany Ghana, Republic of Gibraltar Greece, Hellenic Republic Greenland Grenada Guadaloupe Guam Guatemala, Republic of Guinea, Revolutionary\nPeople's Rep'c of Guinea-Bissau, Republic of Guyana, Republic of Heard and McDonald Islands Holy See (Vatican City State) Honduras, Republic of Hong Kong, Special Administrative Region of China Hrvatska (Croatia) Hungary, Hungarian People's Republic Iceland, Republic of India, Republic of Indonesia, Republic of Iran, Islamic Republic of Iraq, Republic of Ireland Israel, State of Italy, Italian Republic Japan Jordan, Hashemite Kingdom of Kazakhstan, Republic of Kenya, Republic of Kiribati, Republic of Korea, Democratic People's Republic of Korea, Republic of Kuwait, State of Kyrgyz Republic Lao People's Democratic Republic Latvia Lebanon, Lebanese Republic Lesotho, Kingdom of Liberia, Republic of Libyan Arab Jamahiriya Liechtenstein, Principality of Lithuania Luxembourg, Grand Duchy of Macao, Special Administrative Region of China Macedonia, the former Yugoslav Republic of Madagascar, Republic of Malawi, Republic of Malaysia Maldives, Republic of Mali, Republic of Malta, Republic of Marshall Islands Martinique Mauritania, Islamic Republic of Mauritius Mayotte Micronesia, Federated States of Moldova, Republic of Monaco, Principality of Mongolia, Mongolian People's Republic Montserrat Morocco, Kingdom of Mozambique, People's Republic of Myanmar Namibia Nauru, Republic of Nepal, Kingdom of Netherlands Antilles Netherlands, Kingdom of the New Caledonia New Zealand Nicaragua, Republic of Niger, Republic of the Nigeria, Federal Republic of Niue, Republic of Norfolk Island Northern Mariana Islands Norway, Kingdom of Oman, Sultanate of Pakistan, Islamic Republic of Palau Palestinian Territory, Occupied Panama, Republic of Papua New Guinea Paraguay, Republic of Peru, Republic of Philippines, Republic of the Pitcairn Island Poland, Polish People's Republic Portugal, Portuguese Republic Puerto Rico Qatar, State of Reunion Romania, Socialist Republic of Russian Federation Rwanda, Rwandese Republic Samoa, Independent State of San Marino, Republic of Sao Tome and Principe, Democratic Republic of Saudi Arabia, Kingdom of Senegal, Republic of Serbia and Montenegro Seychelles, Republic of Sierra Leone, Republic of Singapore, Republic of Slovakia (Slovak Republic) Slovenia Solomon Islands Somalia, Somali Republic South Africa, Republic of South Georgia and the South Sandwich Islands Spain, Spanish State Sri Lanka, Democratic Socialist Republic of St. Helena St. Kitts and Nevis St. Lucia St. Pierre and Miquelon St. Vincent and the Grenadines Sudan, Democratic Republic of the Suriname, Republic of Svalbard & Jan Mayen Islands Swaziland, Kingdom of Sweden, Kingdom of Switzerland, Swiss Confederation Syrian Arab Republic Taiwan, Province of China Tajikistan Tanzania, United Republic of Thailand, Kingdom of Timor-Leste, Democratic Republic of Togo, Togolese Republic Tokelau (Tokelau Islands) Tonga, Kingdom of Trinidad and Tobago, Republic of Tunisia, Republic of Turkey, Republic of Turkmenistan Turks and Caicos Islands Tuvalu Uganda, Republic of Ukraine United Arab Emirates United Kingdom of Great Britain & N. Ireland Uruguay, Eastern Republic of Uzbekistan Vanuatu Venezuela, Bolivarian Republic of Viet Nam, Socialist Republic of Wallis and Futuna Islands Western Sahara Yemen Zambia, Republic of Zimbabwe"
    },
    {
      "news_title": "Trump DOJ won't defend major Hispanic college grant program, calling it unconstitutional",
      "news_link": "https://www.rawstory.com/trump-hispanic-college/",
      "bias": "Left",
      "text": "The Trump administration's Justice Department has declared it believes a decades-old Hispanic college grant program is unconstitutional and will not defend it from a legal challenge brought by the state of Tennessee.\nAccording to The Associated Press, the DOJ announced its intentions not to defend the Hispanic-Serving Institution program in a memo to Congress. The program, created in 1998 to address disparities in Hispanic college admittance and graduation rates, provides grants to colleges and universities with an undergraduate Hispanic proportion of 25 percent or more.\n\"The state of Tennessee and an anti-affirmative action organization sued the U.S. Education Department in June, asking a judge to halt the Hispanic-Serving Institution program,\" reported Collin Binkley and Jocelyn Gecker. \"Tennessee argued all of its public universities serve Hispanic students but none meet the 'arbitrary ethnic threshold' to be eligible for the grants. Those schools miss out on tens of millions of dollars because of discriminatory requirements, the suit said.\"\nTennessee is represented by Students for Fair Admissions, the same group that led the cases that led the Supreme Court to strike down affirmative action programs at Harvard and the University of North Carolina.\nThat decision prohibited schools, other than military institutions, from \"outright racial balancing,\" although it left open the possibility that some racial diversity programs could be constitutional if they centered on applicants' background or experience rather than strictly their membership in a racial group.\nAccording to the report, \"More than 500 colleges and universities are designated as Hispanic-Serving Institutions, making them eligible for the grant program. Congress appropriated about $350 million for the program in 2024. Colleges compete for the grants, which can go toward a range of uses, from building improvements to science programs.\" Former President Joe Biden pledged to seek increased funding for this program, but Trump revoked the executive order advocating this.\nThis comes at a moment when Trump is cratering with Hispanic voters in polling, after relying on a stronger-than-usual performance with them to secure his re-election in 2024."
    },
    {
      "news_title": "DOJ Deems Definition of HSIs Unconstitutional, Won’t Defend",
      "news_link": "https://www.insidehighered.com/news/institutions/minority-serving-institutions/2025/08/22/doj-deems-definition-hsis",
      "bias": "Lean Left",
      "text": "You have /5 articles left.\nSign up for a free account or log in.\nThe country’s roughly 600 Hispanic-serving institutions are in peril of losing hundreds of millions of dollars annually from the federal government, after the Department of Justice said it won’t defend the program against a lawsuit alleging the way HSIs are currently defined is unconstitutional. The suit challenges the requirement that a college or university’s undergraduate population must be at least a quarter Hispanic to receive HSI funding.\nU.S. solicitor general D. John Sauer wrote to House Speaker Mike Johnson July 25 that the DOJ “has determined that those provisions violate the equal-protection component of the Fifth Amendment’s Due Process Clause.” Federal law requires DOJ officers to notify Congress when they decide to refrain from defending a law on the grounds that it’s unconstitutional.\nCiting the 2023 U.S. Supreme Court ruling that banned affirmative action in student admissions, Sauer wrote that “the Supreme Court has explained that ‘[o]utright racial balancing’ is ‘patently unconstitutional’” and said “its precedents make clear that the government lacks any legitimate interest in differentiating among universities based on whether ‘a specified number of seats in each class’ are occupied by ‘individuals from the preferred ethnic groups.’”\nThe Washington Free Beacon, a conservative outlet, first reported on the letter Friday. The DOJ subsequently provided Inside Higher Ed with the letter but gave no further comment or interviews.\nThe Free Beacon wrote that “the letter likely spells the end for the HSI grants, which the Trump administration is now taking steps to wind down.” The Education Department wrote in an email, “We can confirm the Free Beacon’s reporting” but didn’t provide Inside Higher Ed an interview or answer further written questions.\nJust because the executive branch has given up defending the program doesn’t necessarily mean it’s over—or that the group Students for Fair Admissions and the state of Tennessee have won the lawsuit they filed in June. The Hispanic Association of Colleges and Universities moved to intervene in the case late last month, asking U.S. District Court judge Katherine A. Crytzer to add the group as a defendant. She has yet to rule, but the Education Department and education secretary Linda McMahon, the current defendants, didn’t oppose this intervention.\nThe legal complaint from Students for Fair Admissions and Tennessee asks Crytzer to declare the program’s ethnicity-based requirements unconstitutional, but not necessarily to end the program altogether. Students for Fair Admissions is the group whose suits against Harvard University and the University of North Carolina at Chapel Hill yielded the 2023 Supreme Court decision banning affirmative action in admissions. In the suit over the HSI program, that group and Tennessee’s attorney general, Jonathan Skrmetti, now argue that the admissions ruling means Tennessee colleges and universities can’t use affirmative action to increase Hispanic student enrollments in order to qualify for HSI funding.\nDeborah Santiago, co-founder and chief executive officer of Excelencia in Education, which promotes Latino student success, said Friday that the Education Department in June “opened a competition to award grants for this fiscal year for HSIs.”\n“There are proposals to the Department of Education right now that they said they were going to allocate,” Santiago said, noting that the program was set to dole out more than $350 million this fiscal year—money that institutions use for faculty development, facilities and other purposes.\n“The program doesn’t require that any of the money go to Hispanics at all,” she said. For a college or university to qualify for the program, at least half of the student body must be low-income, in addition to the requirement that a quarter be Hispanic.\n“The value of a program like this has really been investing in institutions that have a high concentration of low-income, first-generation students,” Santiago said."
    },
    {
      "news_title": "Trump to End Race-Based 'Hispanic-Serving Institution' Grants",
      "news_link": "https://americanfaith.com/trump-administration-to-end-hispanic-serving-institution-grants/",
      "bias": "Right",
      "text": "The Trump Administration is moving to end a $350 million-a-year federal program that funnels taxpayer dollars to so-called “Hispanic-Serving Institutions” (HSIs), determining the race-based initiative is unconstitutional. This decision will sunset one of the largest identity-driven grant programs in higher education and may set a precedent for dismantling similar schemes throughout the government.\nThe Department of Education reserves hundreds of millions exclusively for universities with at least 25 percent Hispanic enrollment, locking out schools that fail to meet the racial quota. In June, the state of Tennessee and Students for Fair Admissions challenged the program, arguing it incentivizes affirmative action, which the Supreme Court struck down in 2023.\nIn a letter to House Speaker Mike Johnson, Solicitor General D. John Sauer declared, “The Department of Justice has decided not to defend the constitutionality of certain provisions of the Higher Education Act of 1965. The Department of Justice has determined that those provisions violate the equal-protection component of the Fifth Amendment’s Due Process Clause.”\nA senior Education Department official confirmed the administration is reviewing three HSI grant programs “to determine the legal path forward.” Importantly, officials clarified that Historically Black Colleges and Universities (HBCUs) do not face the same constitutional problems because their status reflects history, not racial quotas. “The quota-based eligibility formula for HSI programs distinguishes them from HBCUs,” the official said.\nThis marks a sharp correction to decades of race-preferential policies that have skewed higher education. As Sauer made clear, “those provisions violate the equal-protection component of the Fifth Amendment’s Due Process Clause.”"
    },
    {
      "news_title": "Justice Dept. declines to defend grants for Hispanic-serving colleges, calling them unconstitutional",
      "news_link": "https://apnews.com/article/hispanic-colleges-trump-a795fc966590681f41410c2b3e268ac0",
      "bias": "Lean Left",
      "text": "Justice Dept. declines to defend grants for Hispanic-serving colleges, calling them unconstitutional\nJustice Dept. declines to defend grants for Hispanic-serving colleges, calling them unconstitutional\nWASHINGTON (AP) — The Trump administration said Friday it will not defend a decades-old grant program for colleges with large numbers of Hispanic students that is being challenged in court, declaring the government believes the funding is unconstitutional.\nIn a memo sent to Congress, the Justice Department said it agrees with a lawsuit attempting to strike down grants that are reserved for colleges and universities where at least a quarter of undergraduates are Hispanic. Congress created the program in 1998 after finding Latino students were going to college and graduating at far lower rates than white students.\nJustice Department officials argued the program provides an unconstitutional advantage based on race or ethnicity.\nThe state of Tennessee and an anti-affirmative action organization sued the U.S. Education Department in June, asking a judge to halt the Hispanic-Serving Institution program. Tennessee argued all of its public universities serve Hispanic students but none meet the “arbitrary ethnic threshold” to be eligible for the grants. Those schools miss out on tens of millions of dollars because of discriminatory requirements, the suit said.\nOn Friday, the Justice Department released a letter in which Solicitor General John Sauer notified Republican House Speaker Mike Johnson that the department “has decided not to defend” the program, saying certain aspects of it are unconstitutional. The letter, dated July 25, cited a 2023 Supreme Court decision that “outright racial balancing” is “patently unconstitutional.”\nThe Justice Department declined to comment.\nTennessee is backed in the suit by Students for Fair Admissions, a conservative legal group that successfully challenged affirmative action in admissions at Harvard and the University of North Carolina. That suit led to a 2023 Supreme Court ruling that forbids universities from considering students’ race in admissions decisions.\nEdward Blum, president of Students for Fair Admissions, said Friday the group would decline to comment.\nMore than 500 colleges and universities are designated as Hispanic-Serving Institutions, making them eligible for the grant program. Congress appropriated about $350 million for the program in 2024. Colleges compete for the grants, which can go toward a range of uses, from building improvements to science programs.\nFormer President Joe Biden made Hispanic universities a priority, signing an executive action last year that promised a new presidential advisory board and increased funding. President Donald Trump revoked the order his first day in office.\nTrump is taking steps to dismantle the Education Department and has called for massive funding cuts, yet his 2026 budget request preserved grants for Hispanic universities and even asked Congress for a slight increase. Even so, there have been doubts about his administration’s commitment to the funding.\nA national association of Hispanic universities filed a motion last month to intervene as a defendant in the Tennessee lawsuit, voicing concern that the federal government would not adequately represent the group’s members.\nThe Hispanic Association of Colleges and Universities said Trump’s agenda is “entirely adverse” to the group’s interests, citing the president’s aim to close the Education Department entirely. The administration is “on record denouncing programs like HSIs, that take account of and seek to redress ethnic or racial disparity,” the group wrote.\nTennessee and Students for Fair Admissions did not object to the group’s request to lead the legal defense.\nUnlike historically Black or Native American tribal colleges and universities, which receive their designations based on their missions, any college can receive the HSI label and grants if its Latino enrollment makes up at least 25% of the undergraduate student body.\nThe list of HSIs includes flagship campuses like the University of Texas at Austin and the University of Arizona, along with many community colleges and smaller institutions.\nIn its court filing, the national association argues the grants are constitutional and help put its members on an even playing field.\nThe group’s schools enroll 67% of the nation’s Latino undergraduate students, yet studies find those schools receive far less in state and federal funding than other institutions. Hispanic universities are open to students of all races — as an example, the association pointed to Southern Adventist University, a private school in Tennessee whose student body is 28% Hispanic and 40% white.\nThe Justice Department generally has a duty to uphold the Constitution and federal legislation, but in rare cases it can refuse to defend laws it believes are unconstitutional. The Obama administration did so in 2011 when it refused to enforce the Defense of Marriage Act. During his first term, Trump did the same with the Affordable Care Act.\nThe Trump administration has fought to end diversity, equity and inclusion policies in government, education and business, arguing that they discriminate against white and Asian American people.\n___\nThe Associated Press’ education coverage receives financial support from multiple private foundations. AP is solely responsible for all content. Find AP’s standards for working with philanthropies, a list of supporters and funded coverage areas at AP.org."
    },
    {
      "news_title": "Alert: Trump administration says grants for Hispanic-serving colleges are unconstitutional and it won't defend them in court",
      "news_link": "https://www.houstonchronicle.com/news/politics/article/alert-trump-administration-says-grants-for-20888649.php",
      "bias": "Center",
      "text": null
    },
    {
      "news_title": "Justice Dept. declines to defend grants for Hispanic-serving colleges",
      "news_link": "https://spectrumlocalnews.com/nyc/all-boroughs/news/2025/08/22/justice-department-declines-to-defend-grants-for-hispanic-serving-colleges",
      "bias": "Center",
      "text": "WASHINGTON — The Trump administration said Friday it will not defend a decades-old grant program for colleges with large numbers of Hispanic students that is being challenged in court, declaring the government believes the funding is unconstitutional.\nWhat You Need To Know\n- The Trump administration says it will not defend a decades-old grant program for heavily Hispanic universities that is being challenged in court, declaring that the government believes the funding is unconstitutional\n- In a memo sent Friday to Congress, the Justice Department said it agrees with a June lawsuit attempting to strike down grants that are reserved for colleges and universities where at least a quarter of undergraduates are Hispanic\n- Congress created the program in 1998 after finding that Latino students were going to college and graduating at far lower rates than white students\n- Justice Department officials argued the program provides an unconstitutional advantage based on race or ethnicity\nIn a memo sent to Congress, the Justice Department said it agrees with a lawsuit attempting to strike down grants that are reserved for colleges and universities where at least a quarter of undergraduates are Hispanic. Congress created the program in 1998 after finding Latino students were going to college and graduating at far lower rates than white students.\nJustice Department officials argued the program provides an unconstitutional advantage based on race or ethnicity.\nThe state of Tennessee and an anti-affirmative action organization sued the U.S. Education Department in June, asking a judge to halt the Hispanic-Serving Institution program. Tennessee argued all of its public universities serve Hispanic students but none meet the \"arbitrary ethnic threshold\" to be eligible for the grants. Those schools miss out on tens of millions of dollars because of discriminatory requirements, the suit said.\nOn Friday, the Justice Department released a letter dated July 25 in which Solicitor General John Sauer notified Republican House Speaker Mike Johnson that the department \"has decided not to defend\" the program, saying that certain aspects of it are unconstitutional. The letter cited a 2023 Supreme Court decision that racial balancing is \"patently unconstitutional.\"\nThe Justice Department did not immediately respond to a request for comment."
    },
    {
      "news_title": "Justicia de EE.UU. se aparta de defender subvenciones para las universidades con hispanos",
      "news_link": "https://bizrepublic.com/justicia-de-ee-uu-se-aparta-de-defender-subvenciones-para-las-universidades-con-hispanos/",
      "bias": "unknown",
      "text": "WASHINGTON, D.C. August 25, 2025 — El gobierno de Estados Unidos indicó que no defenderá un programa de décadas de antigüedad que paga subvenciones a universidades con un gran número de estudiantes hispanos, el cual está siendo impugnado en los tribunales, y señaló que cree que dicha financiación es inconstitucional.\nEn un memorando enviado al Congreso, el Departamento de Justicia expresó que está de acuerdo con una demanda que pretende anular las subvenciones reservadas para universidades y otras escuelas de nivel superior donde al menos una cuarta parte de los estudiantes son hispanos. El Congreso creó el programa en 1998 tras encontrar que los estudiantes latinos asistían a la universidad y se graduaban a tasas mucho más bajas que los estudiantes blancos no hispanos.\nLos funcionarios del Departamento de Justicia argumentaron que el programa proporciona una ventaja inconstitucional basada en la raza o etnia. El estado de Tennessee y una organización que se opone a las políticas de acción afirmativa demandaron al Departamento de Educación federal en junio, y solicitaron a un juez que detenga el programa de Instituciones al Servicio de los Hispanos. Tennessee argumentó que todas sus universidades públicas atienden a estudiantes hispanos, pero ninguna cumple con el “umbral étnico arbitrario” para ser elegible para las subvenciones.\nEsas escuelas pierden decenas de millones de dólares debido a requisitos discriminatorios, según la demanda. El viernes, el Departamento de Justicia publicó una carta en la que el procurador general John Sauer notificó al presidente de la Cámara de Representantes, el republicano Mike Johnson, que el departamento “ha decidido no defender” el programa, afirmando que ciertos aspectos del mismo son inconstitucionales.\nLa carta, fechada el 25 de julio, menciona una decisión de la Corte Suprema de 2023 que establece que el tratar de equilibrar las razas es “patentemente inconstitucional”. El Departamento de Justicia no respondió de momento a una solicitud de comentarios. Tennessee cuenta con el respaldo en la demanda de Students for Fair Admissions, un grupo legal conservador que impugnó con éxito la acción afirmativa en las admisiones de Harvard y la Universidad de Carolina del Norte.\nEsa demanda llevó a un fallo de la Corte Suprema en 2023 que prohíbe a las universidades considerar la raza de los estudiantes en las decisiones de admisión. Edward Blum, presidente de Students for Fair Admissions, dijo el viernes que el grupo no haría comentarios. Más de 500 colegios y universidades están designados como Instituciones al Servicio de los Hispanos, bajo lo cual califican para el programa de subvenciones.\nEl Congreso asignó alrededor de 350 millones de dólares para el programa en 2024. Las universidades compiten por las subvenciones, que pueden destinarse a una variedad de usos, desde mejoras en la infraestructura hasta programas de ciencias. El expresidente Joe Biden hizo que las universidades hispanas fueran una prioridad durante su gobierno y firmó una acción ejecutiva el año pasado que prometía una nueva junta asesora presidencial, así como un aumento de fondos. El presidente Donald Trump revocó la orden su primer día en el cargo.\nTrump está tomando medidas para desmantelar el Departamento de Educación y ha pedido recortes masivos de fondos, sin embargo, su solicitud de presupuesto para 2026 preservó las subvenciones para las universidades hispanas e incluso pidió al Congreso un ligero aumento. Aun así, ha habido dudas sobre el compromiso de su gobierno con la financiación.\nUna asociación nacional de universidades hispanas presentó una moción el mes pasado para intervenir como demandada en la demanda de Tennessee, expresando su preocupación de que el gobierno federal no representaría adecuadamente a los miembros del grupo. La Asociación Hispana de Colegios y Universidades dijo que la agenda de Trump es “totalmente adversa” a los intereses del grupo, citando el objetivo del presidente de cerrar por completo el Departamento de Educación.\nLa administración está “en contra de programas como las ISH, que tienen en cuenta y buscan remediar la disparidad étnica o racial”, escribió el grupo. Tennessee y Students for Fair Admissions no se opusieron a la solicitud del grupo para liderar la defensa legal.\nA diferencia de los colegios y universidades históricamente negros o tribales de indígenas norteamericanos, que reciben sus designaciones basadas en sus misiones, cualquier universidad puede recibir la etiqueta de ISH y subvenciones si su matrícula latina constituye al menos el 25% del cuerpo estudiantil de pregrado. La lista de ISH incluye campus emblemáticos como la Universidad de Texas en Austin y la Universidad de Arizona, junto con muchas universidades comunitarias y escuelas más pequeñas.\nEn su documento judicial, la asociación nacional argumenta que las subvenciones son constitucionales y ayudan a poner a sus miembros en igualdad de condiciones. Las escuelas del grupo inscriben al 67% de los estudiantes latinos de pregrado del país, sin embargo, los estudios encuentran que esas escuelas reciben mucho menos en fondos estatales y federales que otras instituciones.\nLas universidades hispanas están abiertas a estudiantes de todas las razas; como ejemplo, la asociación señaló a la Universidad Adventista del Sur, una escuela privada en Tennessee cuyo cuerpo estudiantil es 28% hispano y 40% blanco. El Departamento de Justicia generalmente tiene el deber de defender la Constitución y la legislación federal, pero en casos excepcionales puede negarse a defender leyes que considera inconstitucionales.\nEl gobierno del expresidente Barack Obama lo hizo en 2011 cuando se negó a hacer cumplir la Ley de Defensa del Matrimonio. Durante su primer mandato, Trump hizo lo mismo con la Ley de Cuidado de Salud Asequible. El gobierno de Trump ha luchado por acabar con las políticas de diversidad, equidad e inclusión en el gobierno, la educación y los negocios, argumentando que discriminan a las personas blancas y asiático-estadounidenses.\nCon información de Associated Press"
    },
    {
      "news_title": "Justice Department declines to defend grants for Hispanic-serving colleges, calling them unconstitutional - EUROPE SAYS",
      "news_link": "https://www.europesays.com/2353960/",
      "bias": "unknown",
      "text": "Washington\nAP\n—\nThe Trump administration said Friday it will not defend a decades-old grant program for colleges with large numbers of Hispanic students that is being challenged in court, declaring the government believes the funding is unconstitutional.\nIn a memo sent to Congress, the Justice Department said it agrees with a lawsuit attempting to strike down grants that are reserved for colleges and universities where at least a quarter of undergraduates are Hispanic. Congress created the program in 1998 after finding Latino students were going to college and graduating at far lower rates than White students.\nJustice Department officials argued the program provides an unconstitutional advantage based on race or ethnicity.\nThe state of Tennessee and an anti-affirmative action organization sued the US Education Department in June, asking a judge to halt the Hispanic-Serving Institution program. Tennessee argued all of its public universities serve Hispanic students but none meet the “arbitrary ethnic threshold” to be eligible for the grants. Those schools miss out on tens of millions of dollars because of discriminatory requirements, the suit said.\nOn Friday, the Justice Department released a letter in which Solicitor General John Sauer notified Republican House Speaker Mike Johnson that the department “has decided not to defend” the program, saying certain aspects of it are unconstitutional. The letter, dated July 25, cited a 2023 Supreme Court decision that “outright racial balancing” is “patently unconstitutional.”\nThe Justice Department declined to comment.\nTennessee is backed in the suit by Students for Fair Admissions, a conservative legal group that successfully challenged affirmative action in admissions at Harvard and the University of North Carolina. That suit led to a 2023 Supreme Court ruling that forbids universities from considering students’ race in admissions decisions.\nEdward Blum, president of Students for Fair Admissions, said Friday the group would decline to comment.\nMore than 500 colleges and universities are designated as Hispanic-Serving Institutions, making them eligible for the grant program. Congress appropriated about $350 million for the program in 2024. Colleges compete for the grants, which can go toward a range of uses, including building improvements and science programs.\nFormer President Joe Biden made Hispanic-serving universities a priority, signing an executive action last year that promised a new presidential advisory board and increased funding. President Donald Trump revoked the order his first day in office.\nTrump is taking steps to dismantle the Education Department and has called for massive funding cuts, yet his 2026 budget request preserved grants for Hispanic-serving universities and even asked Congress for a slight increase. Even so, there have been doubts about his administration’s commitment to the funding.\nA national association of Hispanic-serving universities filed a motion last month to intervene as a defendant in the Tennessee lawsuit, voicing concern that the federal government would not adequately represent the group’s members.\nThe Hispanic Association of Colleges and Universities said Trump’s agenda is “entirely adverse” to the group’s interests, citing the president’s aim to close the Education Department entirely. The administration is “on record denouncing programs like HSIs, that take account of and seek to redress ethnic or racial disparity,” the group wrote.\nTennessee and Students for Fair Admissions did not object to the group’s request to lead the legal defense.\nUnlike historically Black or Native American tribal colleges and universities, which receive their designations based on their missions, any college can receive the HSI label and grants if its Latino enrollment makes up at least 25% of the undergraduate student body.\nThe list of HSIs includes flagship campuses like the University of Texas at Austin and the University of Arizona, along with many community colleges and smaller institutions.\nIn its court filing, the national association argues the grants are constitutional and help put its members on an even playing field.\nThe group’s schools enroll 67% of the nation’s Latino undergraduate students, yet studies find those schools receive far less in state and federal funding than other institutions. Hispanic-serving universities are open to students of all races — as an example, the association pointed to Southern Adventist University, a private school in Tennessee whose student body is 28% Hispanic and 40% White.\nThe Justice Department generally has a duty to uphold the Constitution and federal legislation, but in rare cases it can refuse to defend laws it believes are unconstitutional. The Obama administration did so in 2011 when it refused to enforce the Defense of Marriage Act. During his first term, Trump did the same with the Affordable Care Act.\nThe Trump administration has fought to end diversity, equity and inclusion policies in government, education and business, arguing that they discriminate against White and Asian American people."
    },
    {
      "news_title": "Will the Hispanic-Serving Institution Program Survive?",
      "news_link": "https://digitalchew.com/2025/08/23/hispanic-institution-program-legal-battle/",
      "bias": "unknown",
      "text": "Key Takeaways\n- The Justice Department under the Trump administration won’t defend the Hispanic-Serving Institution Program in court.\n- Tennessee and an anti-affirmative action group sued over a 25 percent Hispanic enrollment rule.\n- More than 500 colleges rely on the program, which got $350 million in 2024.\n- A recent Supreme Court ruling against racial balancing shapes the legal fight.\n- Trump’s decision may further erode his support among Hispanic voters.\nWill the Hispanic-Serving Institution Program Survive?\nThe Justice Department has surprised many by saying it will not defend the Hispanic-Serving Institution Program. Under the Trump administration, officials called the decades-old program unconstitutional. Now a court fight looms, and the future of the grant program looks uncertain.\nWhy the Hispanic-Serving Institution Program Faces a Lawsuit\nTennessee filed a lawsuit against the U.S. Education Department this summer. The state argued that all its public universities serve Hispanic students. However, none reach the program’s required 25 percent Hispanic enrollment. As a result, Tennessee schools miss out on tens of millions in federal grants. An anti-affirmative action group joined the suit. They called the 25 percent rule an arbitrary ethnic threshold that discriminates against some students.\nStudents for Fair Admissions, the group behind the Harvard and UNC affirmative action cases, leads the challenge. In those cases, the Supreme Court barred outright racial balancing at most colleges. Tennessee and its allies now argue that the Hispanic-Serving Institution Program breaks the same rule.\nWhat the Hispanic-Serving Institution Program Does and Who It Helps\nCongress created the Hispanic-Serving Institution Program in 1998. Its goal was to close gaps in Hispanic college admissions and graduation rates. To qualify, a college must have at least 25 percent Hispanic undergraduates. Once approved, institutions compete for grants. In 2024, Congress set aside about $350 million for these awards.\nColleges use the funds for many purposes. They might improve campus buildings or buy lab equipment. They may also use the money to hire tutors or launch science programs. Overall, the grants aim to boost student success and support Hispanic learners.\nMore than 500 colleges and universities now hold Hispanic-Serving Institution status. Many small and rural campuses depend on the extra cash. Without those grants, programs for mentoring, tutoring, and advising could see steep cuts.\nSupreme Court Ruling Drives the Debate\nIn 2023, the Supreme Court ruled against racial balancing at Harvard and UNC. The justices said colleges cannot set fixed quotas based only on race. Yet they left room for programs that focus on an applicant’s background or experience. This decision reshaped the rules for all diversity efforts in higher education.\nNow, Tennessee and its allies say the Hispanic-Serving Institution Program is just another quota. They note the hard 25 percent rule selects colleges based strictly on ethnic makeup. Therefore, they claim it violates the ban on racial balancing. On the other side, supporters argue the program addresses real disparities. They say it helps schools with high Hispanic enrollment build capacity to support their students.\nPolitical Fallout and Hispanic Voter Impact\nThe timing of this decision matters. Trump won strong Hispanic support in key states in 2020 and again in early 2024. However, recent polls show his backing among Hispanic voters slipping. Critics say moves like pulling support for the Hispanic-Serving Institution Program deepen mistrust.\nMeanwhile, President Biden had vowed to boost funding for the program. He signed an executive order to seek more money. Shortly after taking office, Trump revoked that order. Now his DOJ refuses to defend the program itself in court. As a result, the debate over these grants has taken on a sharp political edge.\nLooking Ahead: An Uncertain Future\nWith the Justice Department stepping aside, a federal judge will decide the program’s fate. If the court rules against it, colleges could lose access to millions in funding. Students may see fewer support services and fewer chances to succeed.\nConversely, a victory for the Hispanic-Serving Institution Program could reinforce the use of targeted grants in higher education. It might also inspire similar aid programs for other underrepresented groups. Either way, this legal battle will shape the future of diversity initiatives on campus.\nIn addition, the case will send a message to Hispanic voters. For many, this program represents tangible support for their communities. Thus, the outcome could sway opinions and votes in coming elections.\nFAQs\nWhat is the Hispanic-Serving Institution Program?\nThis program gives federal grants to colleges where at least 25 percent of undergraduates identify as Hispanic. It aims to close gaps in admissions and graduation rates.\nWhy did the Justice Department refuse to defend it?\nThe Trump administration’s Justice Department called the program unconstitutional. Officials said the hard 25 percent rule amounts to racial balancing.\nWho benefits from these grants?\nMore than 500 colleges use the grants to improve facilities, hire tutors, and launch new academic programs. Hispanic students at those schools gain added support.\nHow could this case affect future diversity programs?\nIf courts strike down this program, other race-based or ethnicity-based aid efforts may face legal challenges. Alternatively, upholding it could encourage more targeted funding initiatives."
    },
    {
      "news_title": "Trump Admin Withdraws Support for Hispanic College Grants",
      "news_link": "https://balleralert.com/profiles/blogs/trump-admin-hispanic-college-grants/",
      "bias": "unknown",
      "text": "The Trump administration has confirmed it has no interest in backing grants for Hispanic-serving colleges. In fact, they’ve ruled them unconstitutional altogether, raising concerns for countless Hispanic students.\nAccording to CBS News, on Friday, the Department of Justice said it will no longer defend a federal grant program that supports schools where at least 25 percent of students are Hispanic. The move follows a lawsuit filed by Tennessee and the conservative group Students for Fair Admissions. The DOJ is now siding with them.\nIn a letter to Congress, Solicitor General D. John Sauer explained the department’s decision: “The program’s racial and ethnic preferences violate the Constitution.”\nTennessee’s lawsuit claims that schools in the state serve Hispanic students but miss out on funding because they don’t hit what it calls an “arbitrary” quota. The Hispanic Association of Colleges and Universities quickly responded, calling the move a direct threat to educational equity.\n“This administration is not interested in programs that address disparities,” the group said in court filings.\nMore than 500 schools rely on the program. With $350 million at stake, the future of support for Latino students now hangs in the balance.\nDiscover more from Baller Alert\nSubscribe to get the latest posts sent to your email."
    }
  ]
}