{
  "story_id": "GN_20250826_001637_7d1e74b1",
  "metadata": {
    "title": "Michael Faulkender, U.S. Treasury Department's No. 2 official, set to depart, WSJ reports",
    "timestamp": "2025-08-26T00:16:37.864818",
    "url": "https://ground.news/article/michael-faulkender-us-treasury-departments-no-2-official-set-to-depart-wsj-reports_f463ef"
  },
  "bias_distribution": {
    "total_sources": "14",
    "leaning_left": "1",
    "center": "4",
    "leaning_right": "5"
  },
  "perspective_summaries": {
    "left": [
      "Deputy Treasury Secretary Michael Faulkender is leaving the agency after less than five months since his Senate confirmation in late March.",
      "Treasury Secretary Scott Bessent thanked Faulkender for his dedication and support for important legislation, including the One Big Beautiful Bill and the GENIUS Act.",
      "Faulkender's departure follows a series of high-level changes within the Trump administration, including the removal of other officials in recent weeks.",
      "The reasons for Faulkender's departure are unclear, but it highlights a period of significant personnel changes within key economic agencies."
    ],
    "center": [
      "Deputy Treasury Secretary Michael Faulkender is leaving the agency after less than five months since his Senate confirmation in late March.",
      "Treasury Secretary Scott Bessent thanked Faulkender for his dedication and support for important legislation, including the One Big Beautiful Bill and the GENIUS Act.",
      "Faulkender's departure follows a series of high-level changes within the Trump administration, including the removal of other officials in recent weeks.",
      "The reasons for Faulkender's departure are unclear, but it highlights a period of significant personnel changes within key economic agencies."
    ],
    "right": [
      "Deputy Treasury Secretary Michael Faulkender is leaving the agency after less than five months since his Senate confirmation in late March.",
      "Treasury Secretary Scott Bessent thanked Faulkender for his dedication and support for important legislation, including the One Big Beautiful Bill and the GENIUS Act.",
      "Faulkender's departure follows a series of high-level changes within the Trump administration, including the removal of other officials in recent weeks.",
      "The reasons for Faulkender's departure are unclear, but it highlights a period of significant personnel changes within key economic agencies."
    ]
  },
  "sources": [
    {
      "news_title": "United States Deputy Treasury Secretary Resigns After Only Five Months",
      "news_link": "https://wltreport.com/2025/08/23/united-states-deputy-treasury-secretary-resigns-after-only/",
      "bias": "Far Right",
      "text": "This was not expected.\nThe second in command at the Treasury Department has resigned.\nU.S. Deputy Treasury Secretary Michael Faulkender has announced he will be resigning from his post.\nJust five months earlier Faulkender was confirmed by the Senate for his position.\nU.S. Treasury Secretary Scott Bessent had nothing but nice things to share about Faulkender following his departure, signaling that Faulkender left on good terms.\nCNBC reported more on Faukender’s departure:\nU.S. Deputy Treasury Secretary Michael Faulkender is leaving the Trump administration less than five months after being confirmed by the Senate, the Treasury Department said.\nFaulkender is the second Senate-confirmed official to leave the Treasury Department this month, following the departure of IRS Commissioner Billy Long, who said he was being tapped as ambassador to Iceland.\nU.S. Treasury Secretary Scott Bessent thanked Faulkender for his work at the department but gave no reason for his departure.“Since January, he has played a critical role in overseeing the U.S. Department of the Treasury’s operations and executing on President Trump’s bold economic agenda,” Bessent said in a statement. “His important work has supported the passage of the historic One Big Beautiful Bill and GENIUS Act, and the leveling of sanctions against our adversaries.”\nTrump nominated Faulkender, a University of Maryland finance professor, in December to serve as the No. 2 official at Treasury, where he had been assistant secretary of economic policy during Trump’s first term. He was confirmed by the Senate for the role on March 26.\nAt the end of the first Trump administration, Faulkender had returned to the University of Maryland’s Robert H. Smith School of Business, where he has been a finance professor since 2008.\nSCOOP: After his short service at @USTreasury as United States Deputy Treasury Secretary where he worked on the passage of President Trump's historic One Big Beautiful Bill and the GENIUS Act, Deputy Treasury Secretary Michael Faulkender @TreasuryDepSec is leaving the Treasury… pic.twitter.com/C5GJb3lazy\n— Laura Loomer (@LauraLoomer) August 22, 2025\nHere was Faulkender getting sworn in:\nYesterday, @TreasuryDepSec Michael Faulkender was ceremonially sworn in by @SecScottBessent. Dr. Faulkender played a critical role in the previous Trump administration as Assistant Secretary for Economic Policy, particularly during the COVID-19 pandemic. Most recently, he served… pic.twitter.com/cIT42Tv8jN\n— Treasury Department (@USTreasury) April 17, 2025\nThe Wall Street Journal reported Faulkender also served briefly as the acting commisioner of the IRS:\nAs deputy Treasury Secretary, Faulkender ran the department’s day-to-day operations and did a stint as acting commissioner of the Internal Revenue Service during the leadership turmoil at the tax agency. He is the second Senate-confirmed official to leave the Treasury Department this month, following the departure of IRS Commissioner Billy Long.\nThe Treasury Department didn’t provide a reason for this departure. In a statement, Treasury Secretary Scott Bessent thanked Faulkender for “his dedication and service,” citing his work on economic sanctions and the fiscal and cryptocurrency laws signed by Trump this year. Bessent said Faulkender has “played a critical role” in overseeing Treasury operations and “executing on President Trump’s bold economic agenda.”\nFaulkender is a longtime finance professor at the University of Maryland who worked in the Treasury Department during the first Trump administration, helping oversee economic responses to the pandemic. He didn’t respond to requests for comment.\nThis time around, he led the transition team focused on the Treasury Department and worked on the tax policies that became part of the tax and spending law that President Trump signed in July.\nJoin the conversation!\nPlease share your thoughts about this article below. We value your opinions, and would love to see you add to the discussion!"
    },
    {
      "news_title": "Trump Soured on Faulkender, Leading to Exit From Treasury",
      "news_link": "https://www.wsj.com/politics/treasury-michael-faulkender-depart-972160c7",
      "bias": "Center",
      "text": null
    },
    {
      "news_title": "Michael Faulkender, U.S. Treasury Department's No. 2 official, set to depart, WSJ reports",
      "news_link": "https://www.reuters.com/world/us/michael-faulkender-us-treasury-departments-no-2-official-set-depart-wsj-reports-2025-08-22/",
      "bias": "Center",
      "text": null
    },
    {
      "news_title": "No. 2 Treasury official departing after 5 months in role",
      "news_link": "https://thehill.com/homenews/administration/5466356-no-2-treasury-official-departing-after-five-months-in-role/",
      "bias": "Center",
      "text": null
    },
    {
      "news_title": "Treasury's No. 2 Jumps Ship Just Months After Confirmation",
      "news_link": "https://dailycaller.com/2025/08/22/michael-faulkender-treasury-leaves-agency/",
      "bias": "Right",
      "text": "Deputy Treasury Secretary Michael Faulkender is leaving the agency less than five months after being confirmed by the Senate.\nTwo anonymous sources confirmed to Politico on Friday that Faulkender, who was confirmed by the Senate in late March, is stepping down from his role at the Treasury Department, as The Wall Street Journal first reported. Faulkender’s departure from the Treasury Department comes two weeks after President Donald Trump removed former Internal Revenue Service (IRS) Commissioner Billy Long from his role on Aug. 8.\n“I would like to thank Deputy Secretary Faulkender for his dedication and service,” Treasury Secretary Scott Bessent said Friday in a statement provided to the Daily Caller News Foundation. “Since January, he has played a critical role in overseeing the U.S. Department of the Treasury’s operations and executing on President Trump’s bold economic agenda.”\n“His important work has supported the passage of the historic One Big Beautiful Bill and GENIUS Act, and the leveling of sanctions against our adversaries,” Bessent added. (RELATED: Scott Bessent Brutalizes Biden-Era Predecessor After She Invokes China In Attempt To Smear Trump)\nFaulkender previously served as a faculty member at the Wharton School at the University of Pennsylvania, the Kellogg School at Northwestern University and the Olin School at Washington University in St. Louis. He also served as chief economist at the Trump-aligned America First Policy Institute from 2022 until January 2025.\nAdditionally, Trump fired Commissioner of Labor Statistics (BLS) Erika McEntarfer on Aug. 1 shortly after the release of a disappointing July jobs report. The president announced on Aug. 11 that he selected conservative economist Dr. E.J. Antoni to replace McEntarfer as the next BLS commissioner.\nAll content created by the Daily Caller News Foundation, an independent and nonpartisan newswire service, is available without charge to any legitimate news publisher that can provide a large audience. All republished articles must include our logo, our reporter’s byline and their DCNF affiliation. For any questions about our guidelines or partnering with us, please contact licensing@dailycallernewsfoundation.org."
    },
    {
      "news_title": "High-Ranking Treasury Official Exits Less Than Five Months After Confirmation",
      "news_link": "https://www.tampafp.com/high-ranking-treasury-official-exits-less-than-five-months-after-confirmation/",
      "bias": "Lean Right",
      "text": "Deputy Treasury Secretary Michael Faulkender’s sudden departure adds to recent high-level turnover.\nDeputy Treasury Secretary Michael Faulkender is stepping down from his role, a surprising move that comes less than five months after his confirmation by the Senate. The departure, first reported by The Wall Street Journal and confirmed by two sources to Politico, marks another instance of high-level turnover within the Trump administration.\nFaulkender, who the Senate confirmed in late March, is the latest in a series of top officials to leave their posts. His exit follows the removal of former IRS Commissioner Billy Long on August 8 and the firing of Commissioner of Labor Statistics Erika McEntarfer on August 1.\nREAD: Trump Says Federal Anti-Crime Effort Will Eye Chicago, New York Following D.C. Operation\nTreasury Secretary Scott Bessent offered praise for Faulkender in a statement Friday to the Tampa Free Press.\n“I would like to thank Deputy Secretary Faulkender for his dedication and service,” Bessent said. “Since January, he has played a critical role in overseeing the U.S. Department of the Treasury’s operations and executing on President Trump’s bold economic agenda.” Bessent also highlighted Faulkender’s work in supporting the passage of the “historic One Big Beautiful Bill and GENIUS Act,” and imposing sanctions on “adversaries.”\nFaulkender’s background includes a distinguished academic career, with faculty positions at prestigious institutions like the Wharton School and the Kellogg School. He also served as chief economist at the Trump-aligned America First Policy Institute.\nREAD: DOJ Releases Ghislaine Maxwell Interview, Trump And Clinton Allegations Addressed\nThe recent string of personnel changes has been swift. Just two weeks before Faulkender’s departure, President Trump removed IRS Commissioner Billy Long. Additionally, the firing of Erika McEntarfer from the Bureau of Labor Statistics came shortly after a disappointing July jobs report. The president has since announced his pick to replace McEntarfer, naming conservative economist Dr. E.J. Antoni for the role.\nWhile the reasons for Faulkender’s sudden exit remain unclear, the move underscores a period of significant reshuffling within key economic and financial agencies of the administration.\nPlease make a small donation to the Tampa Free Press to help sustain independent journalism. Your contribution enables us to continue delivering high-quality, local, and national news coverage.\nConnect with us: Follow the Tampa Free Press on Facebook and Twitter for breaking news and updates.\nSign up: Subscribe to our free newsletter for a curated selection of top stories delivered straight to your inbox."
    },
    {
      "news_title": "WSJ: Michael Faulkender, Treasury's No. 2 Official, Set to Depart",
      "news_link": "https://www.newsmax.com/politics/michael-faulkender-treasury-trump-admin/2025/08/22/id/1223530/",
      "bias": "Right",
      "text": "Monday, 25 Aug 2025 13:58 PM\nU.S. Chief Justice John Roberts needs to order an independent review of federal court cybersecurity, Sen. Ron Wyden, D-O . . .\nMonday, 25 Aug 2025 13:06 PM\nPresident Donald Trump hosted South Korean President Lee Jae Myung at the White House on Monday, hailing him as a partne . . ."
    },
    {
      "news_title": "US Treasury's No. 2, Faulkender, leaving after less than 5 months - Finnoexpert",
      "news_link": "https://finnoexpert.com/us-treasurys-no-2-faulkender-leaving-after-less-than-5-months/",
      "bias": "unknown",
      "text": "US Treasury's No. 2, Faulkender, leaving after less than 5 months\nSource link\nUS Treasury's No. 2, Faulkender, leaving after less than 5 months\nMust read\n- Advertisement -\n- Advertisement -\nUS Treasury's No. 2, Faulkender, leaving after less than 5 months\nSource link"
    },
    {
      "news_title": "US Treasury's No.2 official to leave department months after Senate confirmation",
      "news_link": "https://www.tag24.com/politics/us-politics/us-treasurys-no-2-official-to-leave-department-months-after-senate-confirmation-3414181",
      "bias": "unknown",
      "text": "US Treasury's No.2 official to leave department months after Senate confirmation\nWashington DC - The US Treasury Department's second-in-command is leaving his position five months after being confirmed by the Senate, the agency said Friday.\nIt did not provide a reason for Michael Faulkender's departure, which comes shortly after another Senate-confirmed official – Internal Revenue Service Commissioner Billy Long – left the department.\nFaulkender, who was confirmed to his Treasury role in March, was formerly a professor at the University of Maryland and worked in President Donald Trump's first administration as well.\nAs deputy treasury secretary, he oversaw the formulation and implementation of Treasury policies.\nIn a statement, Treasury Secretary Scott Bessent thanked Faulkender \"for his dedication and service.\"\nBessent cited Faulkender's \"critical role\" in overseeing the Treasury Department's operations and \"executing on President Trump's bold economic agenda.\"\n\"His important work has supported the passage of the historic One Big Beautiful Bill and GENIUS Act, and the leveling of sanctions against our adversaries,\" Bessent added.\nThe Treasury chief was referring to Trump's flagship tax and spending bill, as well as a cryptocurrency bill that codifies the use of stablecoins – cryptocurrencies pegged to stable assets like the US dollar or US bonds.\nDuring the first Trump administration, Faulkender served as assistant secretary for economic policy, advising the Treasury chief on domestic and international economic issues.\nBessent is also serving as acting commissioner at the IRS, after Long's departure.\nCover photo: Andrew Harnik / GETTY IMAGES NORTH AMERICA / Getty Images via AFP"
    },
    {
      "news_title": "Treasury's Faulkender stepping down",
      "news_link": "https://www.accountingtoday.com/articles/treasurys-faulkender-stepping-down-as-bessent-lauds-his-service",
      "bias": "unknown",
      "text": "Deputy Treasury Secretary Michael Faulkender is stepping down from his post, after having played what Treasury Secretary Scott Bessent said was a \"critical role\" at the department.\n\"I would like to thank Deputy Secretary Faulkender for his dedication and service,\" Bessent said in a statement provided by the Treasury Department that didn't specify why Faulkender is leaving. \"He has played a critical role in overseeing the U.S. Department of the Treasury's operations and executing on President Trump's bold economic agenda.\"\nFaulkender didn't immediately respond to a call seeking comment. The Wall Street Journal earlier reported Faulkender's departure. Trump ally Laura Loomer\nFaulkender will return to academia, according to a person familiar with the matter. He had previously been a professor of finance at the University of Maryland's business school. He worked at the Treasury in various capacities during President Donald Trump's first term in office, and helped with the administration's response to the Covid-19 pandemic.\nFor a time earlier this year, Faulkender served as the acting commissioner of the Internal Revenue Service. Bessent put him in the post in April after a disagreement with Elon Musk over who should lead the agency. Bessent replaced Gary Shapley, who had been installed at the urging of Musk without Bessent's knowledge. Earlier this month, the Senate-confirmed head of the agency, former Representative Billy Long, was also replaced at the IRS, this time by Bessent himself, who will serve as acting commissioner until a replacement is found."
    },
    {
      "news_title": "Treasury’s Faulkender Stepping Down as Bessent Lauds His Service",
      "news_link": "https://news.bloombergtax.com/daily-tax-report/treasurys-faulkender-stepping-down-as-bessent-lauds-his-service",
      "bias": "unknown",
      "text": "Deputy Treasury Secretary\n“I would like to thank Deputy Secretary Faulkender for his dedication and service,” Bessent said in a statement provided by the Treasury Department that didn’t specify why Faulkender is leaving. “He has played a critical role in overseeing the US Department of the Treasury’s operations and executing on President Trump’s bold economic agenda.”\nFaulkender didn’t immediately respond to a call seeking comment. The Wall Street Journal earlier reported Faulkender’s departure. Trump ally ...\nLearn more about Bloomberg Tax or Log In to keep reading:\nLearn About Bloomberg Tax\nFrom research to software to news, find what you need to stay ahead.\nAlready a subscriber?\nLog in to keep reading or access research tools."
    }
  ]
}