{
  "story_id": "GN_20250825_212728_ed398e5b",
  "metadata": {
    "title": "Netanyahu says Israel to begin Gaza ceasefire negotiations to end war, release hostages",
    "timestamp": "2025-08-25T21:27:28.733835",
    "url": "https://ground.news/article/netanyahu-says-israel-to-begin-gaza-ceasefire-negotiations-to-end-war-release-hostages_9a880b"
  },
  "bias_distribution": {
    "total_sources": "207",
    "leaning_left": "40",
    "center": "44",
    "leaning_right": "23"
  },
  "perspective_summaries": {
    "left": [
      "Israeli Prime Minister Benjamin Netanyahu plans to begin negotiations for a ceasefire and the release of all hostages held in Gaza, stating, \"We are in the decision-making phase.\"",
      "Thousands of Palestinians have fled their homes in Gaza City due to continued Israeli military assaults, adding to the crisis, as reported by local hospitals.",
      "Hamas has accepted a proposed 60-day ceasefire, but the Israeli government demands the release of all 50 hostages before responding, as stated by Netanyahu's Office.",
      "International condemnation continues with calls for protests in Israel and reports of worsening hunger in Gaza, where at least two people died from starvation recently, according to the Hamas-run health ministry."
    ],
    "center": [
      "On Thursday, Israeli Prime Minister Benjamin Netanyahu announced plans to promptly begin talks aimed at securing the freedom of all hostages and bringing the conflict to a close as Israeli forces moved forward toward Gaza City.",
      "This follows the October 7, 2023 Hamas attack that killed about 1,200 people and abducted 251, igniting a conflict with ongoing Israeli military pressure on Gaza City.",
      "The Israel Defense Forces reported troops operating on Gaza City's outskirts with reinforcements en route, called up 60,000 reservists, and urged southward medical evacuations ahead of intensified operations.",
      "Netanyahu emphasized that the efforts to overcome Hamas and secure the release of all hostages are interconnected, while Hamas insists on a permanent ceasefire and the withdrawal of Israeli forces as conditions for freeing the remaining captives.",
      "Meanwhile, Israel's approval of the contested E1 West Bank settlement plan drew international condemnation for threatening a two-state solution amid protests and a worsening humanitarian crisis in Gaza."
    ],
    "right": [
      "Israeli Prime Minister Benjamin Netanyahu announced that negotiations for the release of hostages held in Gaza and ending the war will be under terms acceptable to Israel.",
      "Israeli military operations continue to advance in Gaza City with a plan to capture the area to defeat Hamas.",
      "Hamas has accepted a ceasefire proposal involving hostage releases, but Israel insists on the release of all hostages at once."
    ]
  },
  "sources": [
    {
      "news_title": "Netanyahu Orders Hostage Talks But Pushes Ahead With Gaza Assault",
      "news_link": "https://tippinsights.com/netanyahu-orders-hostage-talks-but-pushes-ahead-with-gaza-assault/",
      "bias": "Right",
      "text": "Israeli Prime Minister Benjamin Netanyahu announced Thursday that he has ordered “immediate negotiations” for the release of hostages and an end to the Gaza war, but only on terms acceptable to Israel, CNN reported.\nDespite the diplomatic signal, Netanyahu reaffirmed plans for a major military operation to seize Gaza City and defeat Hamas.\nThe UK, Australia and Japan are among 21 countries that have condemned Israel’s plans to build a controversial illegal settlement in the occupied West Bank, which they say renders a future two-state solution for Palestinians impossible.\n— Al Jazeera English (@AJEnglish) August 22, 2025\n🔴 LIVE updates: https://t.co/xbhRaukVLw pic.twitter.com/NOBu7B7b6T\nThe Israel Defense Forces confirmed they are already on the city’s outskirts, with residents reporting heavy shelling overnight that killed at least 18 Palestinians, including children sheltering at a school.\nThis marks Netanyahu’s first public acknowledgment of ceasefire talks since Hamas responded positively to a mediation proposal from Qatar and Egypt. Yet, he avoided mentioning the framework, which includes a 60-day ceasefire.\nIsraeli officials believe 50 hostages remain in Gaza, about 20 of whom are alive.\nThe humanitarian crisis is deepening. The UN-backed IPC confirmed famine in northern Gaza, underscoring the dire stakes as Israel mobilizes tens of thousands of reservists."
    },
    {
      "news_title": "Netanyahu says Israel to resume Gaza negotiations to end war and free hostages - West Hawaii Today",
      "news_link": "https://www.westhawaiitoday.com/2025/08/22/nation-world-news/netanyahu-says-israel-to-resume-gaza-negotiations-to-end-war-and-free-hostages/",
      "bias": "Lean Left",
      "text": "Netanyahu says Israel to resume Gaza negotiations to end war and free hostages\nCAIRO/JERUSALEM —Prime Minister Benjamin Netanyahu said on Thursday that Israel would immediately resume negotiations for the release of all hostages held in Gaza and an end to the nearly two-year-old war but on terms acceptable to Israel.\nIt was Netanyahu’s first response to a temporary ceasefire proposal put forward by Egypt and Qatar that Hamas accepted on Monday. Israel will dispatch negotiators to talks once a location is set, an Israeli official said.\nSpeaking to soldiers near Israel’s border with Gaza, Netanyahu said he was still set on approving plans for defeating Hamas and capturing Gaza City, the densely populated centre at the heart of the Palestinian enclave.\nThousands of Palestinians have left their homes as Israeli tanks have edged closer to Gaza City over the last 10 days.\n“At the same time I have issued instructions to begin immediate negotiations for the release of all our hostages and an end to the war on terms acceptable to Israel,” he said, adding: “We are in the decision-making phase.”\nIsrael’s plan to seize Gaza City was approved this month by the security cabinet, which Netanyahu chairs, even though many of Israel’s closest allies have urged the government to reconsider.\nHis latest remarks underscore the Israeli government view that any deal ensures the release of all 50 hostages captured in Israel in October 2023 and still held by militants in Gaza. Israeli officials believe around 20 are still alive.\nThe proposal on the table calls for a 60-day ceasefire and the release of 10 living hostages held in Gaza by Hamas militants and of 18 bodies. In turn, Israel would release about 200 long-serving Palestinian prisoners held by Israel.\nOnce the temporary ceasefire begins, the proposal is for Hamas and Israel to begin negotiations on a permanent ceasefire that would include the return of the remaining hostages.\nIn a sign of growing despair at conditions in Gaza, residents staged a rare show of protest against the war on Thursday.\nCarrying banners reading “Save Gaza, enough” and “Gaza is dying by the killing, hunger and oppression,” hundreds of people rallied in Gaza City in a march organised by several civil unions.\n“This is for a clear message: words are finished, and the time has come for action to stop the military operations, to stop the genocide against our people and to stop the massacres taking place daily,” said Palestinian journalist Tawfik Abu Jarad during the protest.\nThe Gaza health ministry said at least 70 people had been killed in Israeli fire in the enclave in the past 24 hours, including eight people in a house in Sabra suburb in Gaza City.\nA statement from the Palestinian Fatah movement said one of those killed in Sabra was a Fatah leader and former militant, along with seven members of his family. There was no immediate comment from the Israeli military.\nEven as the military begins its preparations to launch the assault on Gaza City, Israeli officials have indicated that there is time for a ceasefire to be reached.\nOn Wednesday, the military called up 60,000 reservists in a sign the government was pressing ahead with the plan, despite international condemnation. Such a call-up is likely to take weeks.\nNetanyahu is under pressure from some far-right members of his coalition to reject a temporary ceasefire and instead to continue the war and pursue the annexation of the territory.\nSome Palestinian families in Gaza City have left for shelters along the coast, while others have moved to central and southern parts of the enclave, according to residents there.\n“We are facing a bitter, bitter situation, to die at home or leave and die somewhere else. As long as this war continues, survival is uncertain,” said Rabah Abu Elias, 67, a father of seven.\n“In the news, they speak about a possible truce, on the ground, we only hear explosions and see deaths. To leave Gaza City or not isn’t an easy decision to make,” he told Reuters by phone.\nOn Thursday, Israeli military spokesperson Avichay Adraee wrote on X that the military had started making what he said were initial warning calls to medical and international organisations operating in Gaza’s north, telling them that Gaza City residents should start to prepare to move out of the city and towards the south.\nAdraee shared a recording of what he said was an Israeli officer telling a Gazan health ministry official that hospitals in southern Gaza should also prepare to receive patients from medical facilities in the north, who will be forced to evacuate.\nA Gaza health ministry official confirmed the phone call had taken place. The ministry rejected the Israeli request to shift medical resources south, warning it would cripple the already devastated health system and endanger over a million residents. It urged international bodies to intervene and protect lifesaving care.\nTwo more people have died of starvation and malnutrition in Gaza in the past 24 hours, the ministry said on Thursday. The new deaths raised the number of Palestinians who have died from such causes to 271, including 112 children, since the war began.\nIsrael disputes malnutrition and starvation figures posted by the Gaza health ministry."
    },
    {
      "news_title": "Israeli PM says negotiations to resume to end war in Gaza and free hostages",
      "news_link": "https://www.africanews.com/2025/08/22/israeli-pm-says-negotiations-to-resume-to-end-war-in-gaza-and-free-hostages/",
      "bias": "Lean Left",
      "text": "Israel\nIsraeli Prime Minister Benjamin Netanyahu on Thursday said negotiations would resume immediately for the release of all hostages and an end to the nearly two-year war in Gaza.\nSpeaking to soldiers near Israel's border with Gaza, he added that he was still set on approving plans for defeating Hamas and capturing Gaza City.\n\"We are in the decision-making stage. I have come to the Gaza division today to approve the plans that the army presented to me and the minister of defence for taking over Gaza City,” he said.\n“At the same time, I have instructed to begin immediate negotiations on the release of all our hostages and an end to the war, on terms acceptable to Israel.\"\nThousands of Palestinians have fled their home in recent days as Israeli tanks edged closer to the densely populated city.\nHis remarks came ahead of a high-level security meeting with defence chiefs and cabinet ministers to approving the operational plans.\n“We are at the decisive stage,” he said, underlining that “defeating Hamas and securing the release of all hostages go hand in hand.”\nIt was Netanyahu first response to a temporary ceasefire proposal, accepted by Hamas earlier this week, that was put forward by mediators from Qatar and Egypt.\nStill, he did not say to whom he had given the order to start negotiations.\nHe also avoided referring to the current proposal which begins with a 60-day ceasefire during which half of the remaining Israeli hostages are to be released.\nIsraeli officials believe that 50 people remain captive in Gaza, at least 20 of whom are thought to be alive.\nOnce the temporary ceasefire begins, the proposal calls for the two sides to begin negotiations on a permanent ceasefire that would include the return of the remaining hostages.\nThe plan to seize Gaza City was approved this month by the security cabinet, which Netanyahu chairs, even though many of Israel's closest allies have urged the government to reconsider.\nThe country has called up tens of thousands of reservists to take part in the impending military operation.\nOn Sunday, thousands of Israelis took part in a nationwide strike calling on Netanyahu to reach an agreement with Hamas to end the war and secure the release the remaining captives.\nResidents of Gaza City on Thursday staged a rare protest in a sign of growing despair at conditions in the enclave. Hundreds of people took part in a march organised by several civil unions.\n01:00\nWATCH: Hundreds join demonstration in Kenyan capital over war in Gaza\n01:13\nTurkish FM accuses Israel of seeking the 'erasure' of Palestine\n01:18\nKenyans rally in solidarity with Palestinians in Gaza\n01:01\nOver 500,000 in Gaza at risk as hunger deaths rise to 289\n00:59\nUK government to overhaul migrant appeals system to help reduce backlog\n01:52\nUN chief calls for immediate Gaza ceasefire amid Israeli offensive"
    },
    {
      "news_title": "Readers sound off on persecution of immigrants, Netanyahu’s plan and today’s pitchers",
      "news_link": "https://www.nydailynews.com/2025/08/22/readers-sound-off-on-persecution-of-immigrants-netanyahus-plan-and-todays-pitchers/",
      "bias": "Lean Left",
      "text": "Whatever its cause, your hate is yours to lose\nLos Angeles: Dear Stephen Miller and Laura Loomer: I’m not here to espouse any particular ideology, and as a fellow Jew, I believe everyone has the right to support their own beliefs or ideas. But when these beliefs have widespread consequences, most of which are deleterious, I feel the need to speak out.\nHow can two people so comfortably hate and persecute people when Jews have been the most reviled and persecuted people in history? What sect or branch of Judaism endorses, teaches or embraces abject hatred and bigotry of any kind? It is incomprehensible to be leaders and fermenters of such hatred in this sadly divided polarity that we are now surrounded by in our everyday lives. This behavior is unacceptable and frankly goes against all tenets and principles that Jews dedicate their lives to.\nHatred and bigotry are taught and passed down generationally. Therefore, you are not fully to blame for the ostensible hatred that seems to dominate your every waking moment. Please keep in mind that just like the Jews, people of other religions and cultures will always survive, but you have created a temporary and evanescent obstacle to the people who have been hated in this country for no other reason than looking and dressing differently, or praying in a different way than most Americans.\nAfter your 15 minutes of infamy have evaporated, in a fleeting moment, look in the mirror in a quasi-introspective episode and try to understand the egregious consequences that your espousal of this deep-seated hatred enables. If you can’t understand, then wipe that mirror clean and try again. Richard Levinson\nNoble newcomers\nStaten Island: It’s time to praise the good, hard-working immigrants. Detective First Class Didarul Islam inspired this letter. He lived and died a dedicated human being, giving the ultimate sacrifice — his life. Reminding me of my immigrant father-in-law, Felice DeFrancesco from Italy, who knew my future Uncle George before me as a deckhand on the Staten Island Ferry. Uncle George was an NYC police officer who traveled on the ferry daily to work. Felice was friendly and well-known to the travelers. One day, he jumped into the water to save someone who went overboard — never making headlines, only a family hero. Islam lived as a giver and go-getter to support his family. My father-in-law also worked a second job as a wooden boat corker on Staten Island, a skill long retired. The many innocent, non-criminal immigrants who’ve been imprisoned and often unlawfully separated from their families — what are we becoming? MaryAnn DeFrancesco\nTrump’s thugs\nDover, Del.: Let us be real as to why the ICE agents cover their faces. It is because some of them are the thugs who attacked the police officers who were protecting democracy against those who tried to hang Mike Pence. They were identified and prosecuted by real law enforcement and the great snoops who aided in their apprehensions. These criminals were then released by the Big Fat Lying Felon to beat and torture Americans and migrants while claiming to rid the nation of the same ones he allowed into the country while having his minions deny the bipartisan agreement to control the border. Chalky White\nUntrustworthy\nFar Rockaway: Voting for Zohran Mamdani? “A double-minded man is unstable in all his ways” (James 1:8, King James Version). Ora Reed\nParty in crisis\nCincinnati: The elected select have been flailing in opposition to President Trump for a decade. Instead of reading the tea leaves and accommodating some of his voter-tested, popular ideas like pragmatic politicians, the ideological purists keep political botanists busy conjuring new species of tea. Mamdani’s Democratic nomination for mayor in America’s largest city is just one additional absurd manifestation of Trump Derangement Syndrome. It is not just a few persuasive voices in Democratic legislative conferences who keep the members tightly confined to party kennels; all members appear affected with irrational hatred of the boisterous president. His ebullience contrasts with their depressive monologue. A cerement should be readied for the party that was once characterized by an honest, happy warrior named Hubert Humphrey, who knew how to lose with grace. Paul Bloustein\nFoes of the worker\nManhattan: No one should disagree with Voicer Ralph Palladino that establishment Democratic politicians should get out of the way, as the song goes, “if you can’t lend your hand.” Three quarters of a century ago, the Democratic Party conspired with the Republicans and liberals to oust Vito Marcantonio, the greatest champion for the working class and poor who New York has ever sent to Congress, from the seat he held for seven terms (with a two-year interruption in the late 1930s). Marcantonio was never a Democrat but captured most of East Harlem’s Democratic votes because the voters knew who he represented. Perhaps the Dem bigs who are reluctant to endorse Mamdani should shift their party affiliation to where they would feel more at home. They won’t be missed. Michele P. Brown\nPoking fun\nHoward Beach: Calif. Gov. Gavin Newsom’s imitations of Trump’s Truth Social postings is apparently getting under Trump’s and his MAGA allies’ skin. It’s about time someone showed how utterly ridiculous Trump sounds in his posts. Newsom’s posts have been hilarious and right on point. Newsom has the fighting spirit that the Democrats need. Go get him, Gavin! Barbara Berg\nTyrannical\nSouth River, N.J.: So, Emperor Frump wants to eliminate mail-in ballots because his bromance buddy Vladimir Putin says it’s bad. By doing so, he would be eliminating the voting rights of every serviceman and woman serving our country overseas. Brilliant idea, idiot! If you agree with him, you MAGA idiots must really love your (soon-to-be new) country Russia. You certainly have no love for America or the brave men and women who offer their lives to protect our country. Donald McSorley\nHe’s no hero\nHoward Beach: I can imagine that there are a few people reading this right now who will not acknowledge that Trump has told us several thousand lies over the last 10 years — some would say thousands and thousands of lies. I prefer to believe the latter. However, there can be none greater then the most recent I heard. It was a radio interview where he states that he and Bibi Netanyahu should be considered war heroes. Trump, a war hero. Ha! I have no idea whether Bibi can be considered a war hero. But I do know that there is no way on God’s green Earth that Trump can even be mentioned in the same paragraph as a war hero. Ed Sullivan\nSinister plan\nProvidence, R.I.: Re “Israel to call up reservists” (Aug. 21), which reports plans for “an expanded military operation in Gaza City”: Here is a theme song for Netanyahu and his henchmen: We’ll take control of the city / We’ll show the people no pity / The plan has cleared our committee / And that’s the real nitty-gritty! Felicia Nimue Ackerman\nInhospitable\nWhitestone: To Voicer Dominick Delasandro: You hit the nail on the head! After being born and bred and living in this city for more than 70 years, the cute morons who make these decisions make it easier to move out. Seems like the plan. Frank Basile\nGame changers\nBrooklyn: Voicer Arthur Martello wonders why, with all the advances in physical therapy and trainers, there are so few complete games these days. There are three reasons. One that he mentioned is analytics. Pitchers aren’t nearly as effective when they face a batting order for the third time. Another is that hitters in this day strike out and walk a lot more than in the past, thereby causing the pitcher to throw more pitches. And teams now have relievers whose job is to throw as hard as they can for one inning, and who are much more effective than a starter who is usually tired after throwing 90-100 pitches. Dennis Burge\nRevive it\nBloomfield, N.J.: Yes, please bring back the Justice Story. Eli Kelley"
    },
    {
      "news_title": "Netanyahu approves Gaza City assault despite ceasefire talks",
      "news_link": "https://www.newarab.com/news/netanyahu-approves-gaza-city-assault-despite-ceasefire-talks",
      "bias": "Lean Left",
      "text": "Breadcrumb\nNetanyahu approves Gaza City assault despite ceasefire talks\nIsraeli Prime Minister Benjamin Netanyahu on Thursday said he will give the final approval for the military's move to seize Gaza City, even as he announced that he had instructed \"negotiations\" for a possible ceasefire deal to begin\nThe call for renewed talks came a day after the defence ministry approved a plan authorising the call-up of roughly 60,000 reservists to help capture Gaza City, which is full of already displaced civilians.\n\"I have come to approve the 9Israeli military's) plans to take control of Gaza City and defeat Hamas,\" the prime minister said in a video statement filmed during a visit to the Gaza division's headquarters in Israel.\n\"At the same time, I have instructed to immediately begin negotiations for the release of all our hostages and the end of the war under conditions acceptable to Israel.\"\n\"These two matters - defeating Hamas and releasing all our hostages - go hand in hand,\" Netanyahu said, without providing details about what the next stage of talks would entail.\nMeditators have been waiting for days for an official Israeli response to their latest ceasefire proposal, which Hamas accepted earlier this week.\nPalestinian sources have said the new deal involves staggered hostage releases, while Israel has insisted that any deal see all the captives freed at once.\nIsrael's plans to expand the fighting and seize Gaza City have sparked international outcry as well as domestic opposition, with the Red Cross joining the condemnation on Thursday, calling the moves \"intolerable\".\nAhead of the offensive, the Israeli military said the call-up of the reservists would begin in early September, adding the second phase of operation \"Gideon's Chariots 2\" had begun.\nEarlier, Gaza City residents described relentless bombardments overnight.\n\"The house shakes with us all night long -- the sound of explosions, artillery, warplanes, ambulances, and cries for help is killing us,\" Ahmad al-Shanti told AFP.\nAnother resident, Amal Abdel-Aal, said she watched the heavy strikes on the area, a week after being displaced from her home in Gaza City's Al-Sabra neighbourhood.\n\"No one in Gaza has slept - not last night, not for a week. The artillery and air strikes in the east never stop. The sky flashes all night long,\" she added.\n'We are advancing'\nA group of AFP journalists near Israel's border with Gaza witnessed an air strike by a fighter jet on the northern outskirts of Gaza City on Thursday afternoon, with a massive explosion followed by a large plume of smoke rising into the sky.\nSeveral sporadic explosions were heard afterward but it was not possible to determine their origin.\nStrikes increased in pace later in the afternoon with several large explosions heard near the border.\n\"We are advancing with the efforts toward operations in Gaza City,\" military chief Eyal Zamir told troops on Thursday.\n\"We already have troops operating on the outskirts of the city, and more forces will join them later on.\"\nThe UN humanitarian agency has warned that the Israeli plan to expand military operations in Gaza City would have \"a horrific humanitarian impact\" on an already exhausted population.\nThe Israeli military said this week it had also begun informing medical personnel and aid groups in northern Gaza to start making evacuation plans and transferring their equipment to the south.\nThe Gaza health ministry, however, rejected that call on Thursday, saying it would not agree to \"any step that would undermine what remains of the health system after the systematic destruction carried out by the occupation authorities\".\nAwaiting a response\nIsrael and Hamas have held indirect negotiations throughout the nearly two-year conflict, paving the way for a pair of short ceasefires during which Israeli hostages were freed in exchange for Palestinian prisoners.\nSources from Hamas and its ally Islamic Jihad told AFP that the latest ceasefire proposal calls for the release of 10 hostages and 18 bodies from Gaza. The remaining hostages would be released in a second phase alongside talks for a wider settlement.\nGaza's civil defence agency said at least 48 people were killed on Thursday by Israeli attacks in various areas across the Palestinian territory, including several casualties in an air strike in Gaza City.\nIsrael's offensive has killed over 62,000 Palestinians, most of them civilians."
    },
    {
      "news_title": "Netanyahu now wants war’s end, ties it to Gaza takeover and hostage deal",
      "news_link": "https://www.livemint.com/news/world/netanyahu-now-wants-wars-end-ties-it-to-gaza-takeover-and-hostage-deal-11755820794584.html",
      "bias": "Center",
      "text": "Israeli Prime Minister Benjamin Netanyahu said on Thursday, August 21, that he visited the Gaza Division to approve the Israeli Defence Force's plans to seize control of Gaza City and defeat Hamas. He added that he had also instructed officials to begin immediate negotiations for the release of all hostages and to work toward ending the war under terms acceptable to Israel.\n\"I came today to the Gaza Division in order to approve the plans that the IDF presented to me and to the defense minister for taking control of Gaza City and for defeating Hamas,\" Netanyahu said. \"At the same time, I instructed to begin immediate negotiations for the release of all our hostages and for ending the war under conditions acceptable to Israel,\" he added.\nThe announcement by Netanyahu came several days after Hamas said it had agreed to a ceasefire proposal that would see half of the hostages released and kick off talks to end the war and free the rest. This also came just as Netanyahu has approved the plans for the military takeover of the Gaza city.\nAlthough Jerusalem had earlier approved the framework, Netanyahu has now insisted that Israel will halt fighting only as part of a comprehensive deal covering all 50 remaining captives. It remains unclear whether his Thursday remarks signaled any real shift in the negotiations.\nA spokesperson for the Prime Minister's Office told Times of Israel that there were no immediate plans to dispatch an Israeli delegation, while a senior official later clarified that envoys would be sent once a venue for the talks was decided.\nThe deal pushed by US Special Envoy Steve Witkoff, would commit the terror group to release 10 living hostages and the bodies of 18 of the slain hostages in exchange for a 60-day ceasefire and release of hundreds of Palestinian security prisoners.\nIt was proposed that during the ceasefire, talks would begin for a permanent end to the war and the release of the remaining 22 hostages, Times of Israel reported.\nIsrael had earlier approved a similar framework but has yet to respond to the offer. Netanyahu has not rejected the framework leaving open the possibility of both a negotiated settlement and a military escalation.\n(With agency inputs)"
    },
    {
      "news_title": "Netanyahu orders ‘immediate negotiations’ to release hostages as Israel advances Gaza City operation",
      "news_link": "https://www.cnn.com/2025/08/21/middleeast/netanyahu-orders-hostage-negotiations-latam-intl",
      "bias": "Lean Left",
      "text": "Israeli Prime Minister Benjamin Netanyahu says he has ordered negotiations for the release of all hostages and an end to the war in Gaza “on terms acceptable to Israel.”\nThe Israel military still intends to advance plans to take control of Gaza City, Netanyahu said.\nThe Israeli leader’s remarks came in a video recorded on Thursday, ahead of a high-level security meeting Netanyahu convened with defense chiefs and cabinet ministers focused on approving the operational plans to take Gaza City and “decisively defeat Hamas.”\nA spokesperson for the Israel Defense Forces (IDF) said the Israeli military is already on the outskirts of Gaza City, and local residents told CNN on Friday that the city was under under shelling all night. Multiple casualties have been reported, including several children killed in a strike on a school.\nNetanyahu stressed that Israel is now at a critical juncture.\n“We are at the decisive stage,” he said, underlining that “defeating Hamas and securing the release of all hostages go hand in hand.”\nThis is the first time Netanyahu has publicly addressed the Gaza war ceasefire talks since Hamas responded positively earlier this week to the latest proposal put forth by mediators from Qatar and Egypt.\nStill, the Israeli prime minister did not say to whom he had given the order to start immediate negotiations and avoided referring to the current proposal framework, which begins with a 60-day ceasefire during which half of the remaining Israeli hostages are to be released.\nIsraeli officials believe that 50 hostages remain in Gaza, at least 20 of whom are thought to be alive.\nIn his recent public statements and official briefings, Netanyahu has emphasized that Israel is seeking a comprehensive agreement that would secure the release of all hostages and meet Israel’s conditions for ending the war.\nHe continues to push forward plans for a massive assault on Gaza City, and on Wednesday instructed the military to shorten the timeline of the operation – despite concern from residents of Gaza City, who have described Israel’s plans as the “beginning of a new war.”\nThe humanitarian situation in the city – the largest in northern Gaza – is already dire.\nThe Integrated Food Security Phase Classification (IPC), a UN-backed program, said on Friday that famine has been confirmed in the Gaza Governorate, which includes Gaza City.\nMeanwhile, deadly strikes continue on daily basis. At least 18 Palestinians, including several children, have been killed in a series of Israeli strikes against a school in the city on Friday morning, according to Fares Afana, who heads the emergency services in northern Gaza.\nHe told CNN that the Omar Ibn Al-A’as school, which has been used as a shelter for displaced people, was targeted by artillery fire.\n“The school yard was packed with tents and residents, many of which are women and children,” Afana told CNN.\nIsrael has called up tens of thousands of reservists to take part in the impending military operation.\n“We are at the stage of decision,” Netanyahu said in a video address. “Today I came to the Gaza Division to approve the plans that the (Israel Defense Forces) presented to me and to the minister of defense for taking control of Gaza City and defeating Hamas.”\nAt the same time, Netanyahu refrained from making any official reference to the mediators’ proposal, leaving open the possibility of a partial agreement.\nTwo Israeli sources say that Netanyahu is managing the developments under tight secrecy and confidentiality.\nCNN’s Ibrahim Dahman and Kareem Khadder contributed reporting."
    },
    {
      "news_title": "Israel to resume negotiations for hostages and an end to the war in Gaza",
      "news_link": "https://www.businesslive.co.za/bd/world/middle-east/2025-08-21-israel-to-resume-negotiations-for-hostages-and-an-end-to-the-war-in-gaza/",
      "bias": "Lean Right",
      "text": "Israel to resume negotiations for hostages and an end to the war in Gaza\nIsraeli Prime Minister Netanyahu set on defeating Hamas and capturing Gaza City but will restart talks\n21 August 2025 - 22:51\nbyNidal Al-Mughrabi and Maayan Lubell\nSupport our award-winning journalism. The Premium package (digital only) is R30 for the first month and thereafter you pay R129 p/m now ad-free for all subscribers.\nIsrael's Prime Minister Benjamin Netanyahu. Picture: REUTERS/JACK GUEZ\nCairo/Jerusalem — Prime Minister Benjamin Netanyahu said on Thursday that Israel would immediately resume negotiations for the release of all hostages held in Gaza and an end to the nearly two-year-old war but on terms acceptable to Israel.\nIt was Netanyahu’s first response to a temporary ceasefire proposal put forward by Egypt and Qatar that Hamas accepted on Monday.\nSpeaking to soldiers near Israel’s border with Gaza, Netanyahu said he was still set on approving plans for defeating Hamas and capturing Gaza City, the densely populated centre at the heart of the Palestinian enclave.\nThousands of Palestinians have left their homes as Israeli tanks have edged closer to Gaza City over the past 10 days.\n“At the same time I have issued instructions to begin immediate negotiations for the release of all our hostages and an end to the war on terms acceptable to Israel,” he said, adding: “We are in the decision-making phase.”\nIsrael’s plan to seize Gaza City was approved this month by the security cabinet, which Netanyahu chairs, even though many of Israel’s closest allies have urged the government to reconsider.\nHis latest remarks underscore the Israeli government view that any deal ensures the release of all 50 hostages captured in Israel in October 2023 and still held by militants in Gaza. Israeli officials believe about 20 are still alive.\nThe proposal on the table calls for a 60-day ceasefire and the release of 10 living hostages held in Gaza by Hamas militants and of 18 bodies. In turn, Israel would release about 200 long-serving Palestinian prisoners held by Israel.\nOnce the temporary ceasefire begins, the proposal is for Hamas and Israel to begin negotiations on a permanent ceasefire that would include the return of the remaining hostages.\nIn a sign of growing despair at conditions in Gaza, residents staged a rare show of protest against the war on Thursday.\nCarrying banners reading “Save Gaza, enough” and “Gaza is dying by the killing, hunger and oppression,” hundreds of people rallied in Gaza City in a march organised by several civil unions.\n“This is for a clear message: words are finished, and the time has come for action to stop the military operations, to stop the genocide against our people and to stop the massacres taking place daily,” said Palestinian journalist Tawfik Abu Jarad during the protest.\nThe Gaza health ministry said at least 70 people had been killed in Israeli fire in the enclave in the past 24 hours, including eight people in a house in Sabra suburb in Gaza City.\nA statement from the Palestinian Fatah movement said one of those killed in Sabra was a Fatah leader and former militant, along with seven members of his family. There was no immediate comment from the Israeli military.\nEven as the military begins its preparations to launch the assault on Gaza City, Israeli officials have indicated that there is time for a ceasefire to be reached.\nOn Wednesday, the military called up 60,000 reservists in a sign the government was pressing ahead with the plan, despite international condemnation. Such a call-up is likely to take weeks.\nNetanyahu is under pressure from some far-right members of his coalition to reject a temporary ceasefire and instead to continue the war and pursue the annexation of the territory.\nSome Palestinian families in Gaza City have left for shelters along the coast, while others have moved to central and southern parts of the enclave, according to residents there.\n“We are facing a bitter, bitter situation, to die at home or leave and die somewhere else. As long as this war continues, survival is uncertain,” said Rabah Abu Elias, 67, a father of seven.\n“In the news, they speak about a possible truce, on the ground, we only hear explosions and see deaths. To leave Gaza City or not isn’t an easy decision to make,” he told Reuters by phone.\nOn Thursday, Israeli military spokesperson Avichay Adraee wrote on X that the military had started making what he said were initial warning calls to medical and international organisations operating in Gaza’s north, telling them that Gaza City residents should start to prepare to move out of the city and towards the south.\nAdraee shared a recording of what he said was an Israeli officer telling a Gazan health ministry official that hospitals in southern Gaza should also prepare to receive patients from medical facilities in the north, who will be forced to evacuate.\nA Gaza health ministry official confirmed the phone call had taken place. The ministry rejected the Israeli request to shift medical resources south, warning it would cripple the already devastated health system and endanger over a million residents. It urged international bodies to intervene and protect life-saving care.\nTwo more people have died of starvation and malnutrition in Gaza in the past 24 hours, the ministry said on Thursday. The new deaths raised the number of Palestinians who have died from such causes to 271, including 112 children, since the war began.\nIsrael disputes malnutrition and starvation figures posted by the Gaza health ministry.\nSupport our award-winning journalism. The Premium package (digital only) is R30 for the first month and thereafter you pay R129 p/m now ad-free for all subscribers.\nIsrael to resume negotiations for hostages and an end to the war in Gaza\nIsraeli Prime Minister Netanyahu set on defeating Hamas and capturing Gaza City but will restart talks\nCairo/Jerusalem — Prime Minister Benjamin Netanyahu said on Thursday that Israel would immediately resume negotiations for the release of all hostages held in Gaza and an end to the nearly two-year-old war but on terms acceptable to Israel.\nIt was Netanyahu’s first response to a temporary ceasefire proposal put forward by Egypt and Qatar that Hamas accepted on Monday.\nSpeaking to soldiers near Israel’s border with Gaza, Netanyahu said he was still set on approving plans for defeating Hamas and capturing Gaza City, the densely populated centre at the heart of the Palestinian enclave.\nThousands of Palestinians have left their homes as Israeli tanks have edged closer to Gaza City over the past 10 days.\n“At the same time I have issued instructions to begin immediate negotiations for the release of all our hostages and an end to the war on terms acceptable to Israel,” he said, adding: “We are in the decision-making phase.”\nIsrael’s plan to seize Gaza City was approved this month by the security cabinet, which Netanyahu chairs, even though many of Israel’s closest allies have urged the government to reconsider.\nHis latest remarks underscore the Israeli government view that any deal ensures the release of all 50 hostages captured in Israel in October 2023 and still held by militants in Gaza. Israeli officials believe about 20 are still alive.\nThe proposal on the table calls for a 60-day ceasefire and the release of 10 living hostages held in Gaza by Hamas militants and of 18 bodies. In turn, Israel would release about 200 long-serving Palestinian prisoners held by Israel.\nOnce the temporary ceasefire begins, the proposal is for Hamas and Israel to begin negotiations on a permanent ceasefire that would include the return of the remaining hostages.\nIn a sign of growing despair at conditions in Gaza, residents staged a rare show of protest against the war on Thursday.\nCarrying banners reading “Save Gaza, enough” and “Gaza is dying by the killing, hunger and oppression,” hundreds of people rallied in Gaza City in a march organised by several civil unions.\n“This is for a clear message: words are finished, and the time has come for action to stop the military operations, to stop the genocide against our people and to stop the massacres taking place daily,” said Palestinian journalist Tawfik Abu Jarad during the protest.\nThe Gaza health ministry said at least 70 people had been killed in Israeli fire in the enclave in the past 24 hours, including eight people in a house in Sabra suburb in Gaza City.\nA statement from the Palestinian Fatah movement said one of those killed in Sabra was a Fatah leader and former militant, along with seven members of his family. There was no immediate comment from the Israeli military.\nEven as the military begins its preparations to launch the assault on Gaza City, Israeli officials have indicated that there is time for a ceasefire to be reached.\nOn Wednesday, the military called up 60,000 reservists in a sign the government was pressing ahead with the plan, despite international condemnation. Such a call-up is likely to take weeks.\nNetanyahu is under pressure from some far-right members of his coalition to reject a temporary ceasefire and instead to continue the war and pursue the annexation of the territory.\nSome Palestinian families in Gaza City have left for shelters along the coast, while others have moved to central and southern parts of the enclave, according to residents there.\n“We are facing a bitter, bitter situation, to die at home or leave and die somewhere else. As long as this war continues, survival is uncertain,” said Rabah Abu Elias, 67, a father of seven.\n“In the news, they speak about a possible truce, on the ground, we only hear explosions and see deaths. To leave Gaza City or not isn’t an easy decision to make,” he told Reuters by phone.\nOn Thursday, Israeli military spokesperson Avichay Adraee wrote on X that the military had started making what he said were initial warning calls to medical and international organisations operating in Gaza’s north, telling them that Gaza City residents should start to prepare to move out of the city and towards the south.\nAdraee shared a recording of what he said was an Israeli officer telling a Gazan health ministry official that hospitals in southern Gaza should also prepare to receive patients from medical facilities in the north, who will be forced to evacuate.\nA Gaza health ministry official confirmed the phone call had taken place. The ministry rejected the Israeli request to shift medical resources south, warning it would cripple the already devastated health system and endanger over a million residents. It urged international bodies to intervene and protect life-saving care.\nTwo more people have died of starvation and malnutrition in Gaza in the past 24 hours, the ministry said on Thursday. The new deaths raised the number of Palestinians who have died from such causes to 271, including 112 children, since the war began.\nIsrael disputes malnutrition and starvation figures posted by the Gaza health ministry.\nReuters\nWould you like to comment on this article?\nSign up (it's quick and free) or sign in now.\nPlease read our Comment Policy before commenting.\nMost Read\nRelated Articles\nAid worker deaths surge to record high during Gaza war — UN\nIsrael calls up tens of thousands of reservists ahead of new Gaza offensive\nIsrael studies Hamas reply to Gaza ceasefire proposal\nPalestinians flee eastern Gaza City as planned Israeli offensive gathers ...\nPublished by Arena Holdings and distributed with the Financial Mail on the last Thursday of every month except December and January."
    },
    {
      "news_title": "Israeli Prime Minister Benjamin Netanyahu says he will push ahead with Gaza City takeover and renew ceasefire talks",
      "news_link": "https://www.chicagotribune.com/2025/08/21/netanyahu-gaza-city-takeover/",
      "bias": "Center",
      "text": "DEIR AL-BALAH, Gaza Strip — Israeli Prime Minister Benjamin Netanyahu said Thursday he will give final approval for the takeover of Gaza City while also restarting negotiations with Hamas aimed at returning all the remaining hostages and ending the war on Israel’s terms.\nThe wide-scale operation in Gaza City could start within days. Netanyahu’s approval was expected during a meeting with senior security officials late Thursday, but no decision was announced before midnight in Jerusalem. Hamas said earlier this week that it had agreed to a ceasefire proposal from Arab mediators, which — if accepted by Israel — could forestall the offensive.\nThe Israeli military has begun calling medical officials and international organizations in the northern Gaza Strip to encourage them to evacuate to the south ahead of the expanded operation. The military plans to call up 60,000 reservists and extend the service of 20,000 more.\nIsraeli strikes, meanwhile, killed at least 36 Palestinians Thursday across Gaza, according to local hospitals. A renewed offensive could bring even more casualties and displacement to the territory, where the war has already killed tens of thousands and where experts have warned of imminent famine.\nMany Israelis fear the operation could also doom the remaining 20 or so living hostages taken by Hamas-led fighters in the Oct. 7, 2023, attack that ignited the war.\nGaza City operation could begin in days\nDuring a visit to the military’s Gaza command in southern Israel, Netanyahu said he would approve the army’s plans to retake Gaza City and had instructed officials “to begin immediate negotiations” for the release of all hostages “and an end to the war on terms acceptable to Israel.”\n“These two things — defeating Hamas and releasing all our hostages — go hand in hand,” he said.\nIt appeared to mark Israel’s first public response to the latest ceasefire proposal drawn up by Egypt and Qatar. Egyptian and Hamas officials say it is almost identical to an earlier one that Israel accepted before the talks stalled last month.\nThe proposal would include the release of some of the hostages in exchange for Palestinians imprisoned by Israel, a pullback of Israeli forces and negotiations over a more lasting ceasefire.\nIsraeli troops have already begun more limited operations in Gaza City’s Zeitoun neighborhood and the built-up Jabaliya refugee camp, areas where they have carried out several previous large-scale raids over the course of the war, only to see fighters later regroup.\nThe military says it plans to operate in areas where ground troops have not yet entered and where it says Hamas still has military and governing capabilities.\nSo far, there has been little sign of Palestinians fleeing en masse, as they did when Israel carried out an earlier offensive in Gaza City in the opening weeks of the war. The military says it controls around 75% of Gaza, and residents say nowhere in the territory feels safe.\nProtests in Israel and Gaza\nHundreds gathered Thursday for a rare protest in Gaza City against the war and Israel’s plans to support the mass relocation of Palestinians to other countries.\nWomen and children held placards reading “Save Gaza” and “Stop the war, stop the savage attack, save us,” against a backdrop of destroyed buildings as Palestinian music played. Unlike in previous protests, there were no expressions of opposition to Hamas.\n“We want the war on Gaza to stop. We don’t want to migrate. Twenty-two months … it’s enough. Enough death. Enough destruction,” said Bisan Ghazal, a woman displaced from Gaza City.\nIn Israel, protesters marched Thursday night in Tel Aviv holding banners that read “The people will bring back the hostages” and “How much blood will be spilled?”\nAmong the demonstrators was Dudu Dotan, who said Netanyahu is endangering the remaining hostages by moving forward with the planned Gaza City offensive. Of the 50 still being held in Gaza, Israel believes about 20 hostages are still alive.\n“This way will not bring the hostages back,” Dotan said. “Every hostage he brought back, he brought back through deals. And every time he tried to bring them back with military force, he caused the hostages to be killed.”\nPlans for widening the offensive have also sparked international outrage, with many of Israel’s closest Western allies — but not the United States — calling on it to end the war.\nDozens killed across Gaza\nAt least 36 Palestinians were killed Thursday by Israeli fire across the Gaza Strip, including 14 who were seeking humanitarian aid, according to local hospitals. The military says it only targets fighters and blames civilian deaths on Hamas because it operates in densely populated areas.\nThe Israeli military said it killed several armed fighters in the Morag Corridor, a military zone where people seeking aid have repeatedly come under fire in recent weeks, according to witnesses and health officials. Nasser Hospital in southern Gaza had earlier reported that six people were killed in that area while seeking aid on Thursday. It was not possible to reconcile the two accounts.\nThe Media Freedom Coalition, which promotes press freedoms worldwide, called Thursday for Israel to allow independent foreign news organizations access to Gaza. Aside from rare guided tours, Israel has barred international media during the war, in which at least 184 Palestinian journalists and media workers have been killed.\n“Journalists and media workers play an essential role in putting the spotlight on the devastating reality of war,” said a statement signed by 27 of the coalition’s member countries.\nIsraeli strikes destroy evacuated tent camp\nIsraeli airstrikes also destroyed a tent camp in Deir al-Balah, the only city in Gaza that has been relatively unscathed in the war and where many have sought refuge. Residents said the Israeli military warned them to flee shortly before the strikes set the camp ablaze, and there were no reports of casualties.\nFamilies, many with children, could later be seen sifting through the ashes for the belongings they had managed to take with them during earlier evacuations.\nMohammad Kahlout, who had been displaced from northern Gaza, said they were given just five minutes to gather what they could and evacuate. “We are civilians, not terrorists. What did we do, and what did our children do, to be displaced again?”\nThe Gaza Health Ministry said Thursday that at least 62,192 Palestinians have been killed in the war. Another two people have died from malnutrition-related causes, bringing the total number of such deaths to 271, including 112 children, the Health Ministry said.\nThe ministry is part of the Hamas-run government and staffed by medical professionals. It does not say whether those killed by Israeli fire are civilians or combatants, but it says around half were women and children. The U.N. and many independent experts consider its figures to be the most reliable estimate of wartime casualties. Israel disputes its toll but has not provided its own.\nHamas-led fighters started the war when they attacked Israel on Oct. 7, 2023, killing some 1,200 people, mostly civilians, and abducting 251. Most of the hostages have been released in ceasefires or other deals. Hamas says it will only free the rest in exchange for a lasting ceasefire and an Israeli withdrawal.\nAbou Aljoud reported from Beirut, and Lidman reported from Jerusalem. Associated Press Writer Mari Yamaguchi contributed from Tokyo."
    },
    {
      "news_title": "Netanyahu: Israel to Begin Talks to End War, Release Hostages",
      "news_link": "https://www.newsmax.com/newsfront/netanyahu-ceasefire-talks/2025/08/21/id/1223422",
      "bias": "Right",
      "text": "Prime Minister Benjamin Netanyahu said Thursday that Israel will begin immediate negotiations for the release of all hostages held in Gaza and an end to the nearly two-year-old war on terms acceptable to Israel.\nSpeaking to soldiers serving in Gaza, Netanyahu said he was meeting commanders to approve plans for capturing Gaza City and defeating Hamas.\n\"At the same time I have issued instructions to begin immediate negotiations for the release of all our hostages and an end to the war on terms acceptable to Israel,\" he said, adding: \"We are in the decision-making phase.\"\nThe Israeli military maintained its pressure on Gaza City into Thursday.\nOn Wednesday, the military called up 60,000 reservists in a sign that the government was pressing ahead with the plan.\nCalling up tens of thousands of reservists is likely to take weeks, giving time for mediators to attempt to bridge gaps over a new temporary ceasefire proposal that Hamas has accepted, but the Israeli government has yet to officially respond to.\nThe proposal calls for a 60-day ceasefire and the release of 10 living hostages being held in Gaza by Hamas terrorists and of 18 bodies. In turn, Israel would release about 200 long-serving Palestinian prisoners held by Israel.\nThe Israeli government has stated that all of the remaining 50 hostages held by militants in Gaza must be released at once. Israeli officials believe that around 20 of them are still alive.\n© 2025 Thomson/Reuters. All rights reserved."
    },
    {
      "news_title": "Netanyahu Authorizes New Talks To Free All Hostages On 'Acceptable' Terms",
      "news_link": "https://www.zerohedge.com/geopolitical/netanyahu-authorizes-new-talks-free-all-hostages-acceptable-terms",
      "bias": "Right",
      "text": null
    },
    {
      "news_title": "Israel's Netanyahu OKs Gaza City takeover, hostage negotiations",
      "news_link": "https://www.upi.com/Top_News/World-News/2025/08/21/gaza-un-cease-fire/5641755804382/",
      "bias": "Center",
      "text": "Aug. 21 (UPI) -- Israeli Prime Minister Benjamin Netanyahu has approved the takeover of Gaza City by the Israel Defense Force and called for negotiating the release of hostages.\nTaking control of Gaza City, which is the largest city in Gaza, and negotiating for the release of remaining hostages held by Hamas will enable Israel to end the war in Gaza on its terms, Netanyahu said in a Thursday night video statement, Haaretz reported.\nNetanyahu visited the IDF's Gaza Division on Thursday as the war entered what he called a \"decisive stage,\" according to The Jerusalem Post.\n\"I arrived today at the Gaza Division to approve the plans presented by the IDF to me and the defense minister for the takeover of Gaza City and the defeat of Hamas,\" Netanyahu said.\nThe Israeli prime minister also ordered the \"immediate initiation of negotiations\" to release about 50 remaining hostages, most of whom are considered to be dead, and end the war.\n\"These two objectives -- defeating Hamas and securing the release of all our hostages -- go hand in hand,\" he said.\nNetanyahu was \"impressed\" with the military plans to take control of Gaza City, which he OK'd after reviewing them during a visit to IDF forces in southern Gaza, The Hill reported.\nIsrael extended the deployments of about 20,000 reservists and called up another 60,000 as the IDF undertakes its offensive in northern Gaza.\nThe Israeli military will have five divisions operating in Gaza when it reaches full strength after deploying the additional reservists, who won't be used in the Gaza City offensive.\nOnly active duty personnel will carry out the Gaza City military operation, an unnamed IDF official told The Hill.\nGaza City is home to about 1 million people, according to the United Nations, which has called for an immediate cease-fire to prevent a large loss of life.\nOfficials in Qatar and Egypt recently conveyed a cease-fire proposal that they said Hamas has accepted, but would not release all hostages.\nThe proposal also would require Israel to release Palestinian prisoners while negotiating a long-term truce and the withdrawal of IDF troops from some parts of Gaza.\nU.N. Secretary-General Antonio Guterres has called for an immediate cease-fire and a full release of all hostages held by Hamas.\n\"It is vital to reach immediately a cease-fire in Gaza and the unconditional release of all hostages,\" Guterres told reporters while at a Tokyo conference on Thursday.\nSuch actions are needed to \"avoid the massive death and destruction that a military operation against Gaza City would inevitably cause,\" Guterres said.\nThe IDF on Wednesday announced it had begun a military offensive against Az Zaytoun in Gaza City and Jabalya in northern Gaza with the aim of ridding the area of Hamas.\nThe United Nations reported shelling and continuous drone airstrikes, including against residential buildings, and the destruction of residential homes by IDF forces using explosives to target Hamas.\nThe IDF is using quadcopters and phone calls to warn Jabalya residents to evacuate the area while military operations are underway.\nThe IDF has \"totally destroyed\" parts of southern and southeast Gaza City while undertaking the city's \"systematic destruction,\" the U.N. said.\nThe military operations have displaced much of the local population in Jabalya and Gaza City as the IDF continues its military operations in other parts of Gaza, including Khan Younis.\nU.N. officials reported \"acute malnourishment [is] soaring among children in Gaza City,\" with 28.5% of those screened showing signs of malnourishment, the U.N. Relief and Works Agency reported.\nIDF actions in southern Gaza have \"crippled\" UNRWA's ability to provide aid for Gazans there, while its offensive in Gaza City and Jabalya endangers efforts in northern Gaza, according to the U.N."
    },
    {
      "news_title": "Netanyahu signals talks but holds back on sending delegation as Gaza City offensive l",
      "news_link": "https://www.ynetnews.com/article/s1dpvbrtxe",
      "bias": "Lean Left",
      "text": "Prime Minister Benjamin Netanyahu announced Thursday that he had instructed his government to begin “immediate negotiations” aimed at ending the war in Gaza and bringing home all hostages. But within hours, Israeli officials walked back the sense of urgency, underscoring instead Netanyahu’s satisfaction with military plans to retake Gaza City.\nThe initial statement, released during Netanyahu’s visit to the IDF’s Gaza Division headquarters in southern Israel, suggested a dramatic shift. Netanyahu pledged both to pursue negotiations with Hamas and to approve the army’s operational plans to capture Gaza City and “defeat Hamas.”\nYet in a series of subsequent briefings to reporters, an unnamed political source offered clarifications that appeared to temper expectations. First, the source said Israel would not, for now, send a delegation to Doha or Cairo, where Egyptian and Qatari mediators have been waiting for days for an Israeli response to Hamas’ acceptance of a partial ceasefire proposal.\nIn a second message, the source emphasized that Netanyahu was “impressed” by the army’s Gaza City plans and “pleased” with them. Finally, in a third clarification, the source said that once a venue for negotiations is set, Netanyahu would order an Israeli team to participate in talks — but only “on all hostages, both living and dead, and on ending the war on Israel’s terms.”\nThose terms, Netanyahu has repeatedly said, include dismantling Hamas’ military capabilities, returning all hostages, demilitarizing the Gaza Strip, maintaining Israeli security control there and installing an alternative civilian administration that is neither Hamas nor the Palestinian Authority.\nCritics said the prime minister’s statements reflected an effort to balance competing pressures. Hardline coalition partners, including Finance Minister Bezalel Smotrich and National Security Minister Itamar Ben-Gvir, are demanding a full-scale conquest of Gaza. Families of the roughly 50 hostages still held in Gaza, meanwhile, have pressed for a deal that could secure the release of some 20 believed to be alive.\nMediators in Egypt and Qatar say Hamas has already agreed to a framework similar to one Israel previously accepted, but has received no clear response from Jerusalem. And the Trump administration, which has sought to both destroy Hamas and end the war, is eager to claim progress before the U.S. election season intensifies.\nThe result, analysts said, is a strategy of delay. Israel has begun calling up tens of thousands of reservists in preparation for an expanded Gaza operation expected to stretch into 2026, even as Netanyahu signals openness to negotiations. Israeli officials acknowledge that threatening to seize Gaza City is itself a form of leverage. But once the offensive begins, it could be politically difficult for Netanyahu’s government to agree to a withdrawal, especially if the operation comes at heavy cost.\nFor now, Netanyahu’s message is twofold: yes to preparing for a military push, no to accepting Hamas’ partial proposal, and a carefully worded “yes” to negotiations — but only under conditions defined by Israel."
    },
    {
      "news_title": "Netanyahu says Israel to begin Gaza ceasefire negotiations, release hostages",
      "news_link": "https://www.channelnewsasia.com/world/netanyahu-says-israel-begin-gaza-ceasefire-negotiations-release-hostages-5307556",
      "bias": "Center",
      "text": "Netanyahu says Israel will resume Gaza negotiations to end war and free hostages\nCAIRO/JERUSALEM: Prime Minister Benjamin Netanyahu said on Thursday (Aug 21) that Israel would immediately resume negotiations for the release of all hostages held in Gaza and an end to the nearly two-year war, but on terms acceptable to Israel.\nIt was Netanyahu's first response to a temporary ceasefire proposal put forward by Egypt and Qatar that Hamas accepted on Monday. Israel will dispatch negotiators to talks once a location is set, an Israeli official said.\nSpeaking to soldiers near Israel's border with Gaza, Netanyahu said he was still set on approving plans for defeating Hamas and capturing Gaza City, the densely populated centre at the heart of the Palestinian enclave.\nThousands of Palestinians have left their homes as Israeli tanks have edged closer to Gaza City over the last 10 days.\n\"WE ARE IN THE DECISION-MAKING PHASE\"\n\"At the same time, I have issued instructions to begin immediate negotiations for the release of all our hostages and an end to the war on terms acceptable to Israel,\" he said, adding: \"We are in the decision-making phase.\"\nIsrael's plan to seize Gaza City was approved this month by the security cabinet, which Netanyahu chairs, even though many of Israel's closest allies have urged the government to reconsider.\nHis latest remarks underscore the Israeli government's view that any deal ensures the release of all 50 hostages captured in Israel in October 2023 and still held by militants in Gaza. Israeli officials believe around 20 are still alive.\nThe proposal on the table calls for a 60-day ceasefire and the release of 10 living hostages held in Gaza by Hamas militants and of 18 bodies. In turn, Israel would release about 200 long-serving Palestinian prisoners held by Israel.\nPALESTINIAN PROTESTS OVER CONDITIONS IN GAZA\nOnce the temporary ceasefire begins, the proposal is for Hamas and Israel to begin negotiations on a permanent ceasefire that would include the return of the remaining hostages.\nPalestinians staged a rare show of protest against the war on Thursday, in a growing sign of despair at the conditions in Gaza.\nCarrying banners reading \"Save Gaza, enough\" and \"Gaza is dying by the killing, hunger and oppression,\" hundreds of people rallied in Gaza City in a march organised by several civil unions.\n\"This is for a clear message: words are finished, and the time has come for action to stop the military operations, to stop the genocide against our people and to stop the massacres taking place daily,\" said Palestinian journalist Tawfik Abu Jarad during the protest.\nThe Gaza health ministry said at least 70 people had been killed in Israeli fire in the enclave in the past 24 hours, including eight people in a house in the Sabra suburb in Gaza City.\nA statement from the Palestinian Fatah movement said one of those killed in Sabra was a Fatah leader and former militant, along with seven members of his family. There was no immediate comment from the Israeli military.\nCEASEFIRE OR CAPTURE OF GAZA CITY?\nIsraeli officials are indicating that there is time for a ceasefire to be reached, even though its military begins its preparations to launch the assault on Gaza City,\nSome Palestinian families in Gaza City have left for shelters along the coast, while others have moved to central and southern parts of the enclave, according to residents there.\n\"We are facing a bitter, bitter situation: to die at home or leave and die somewhere else. As long as this war continues, survival is uncertain,\" said Rabah Abu Elias, 67, a father of seven.\n\"In the news, they speak about a possible truce, on the ground, we only hear explosions and see deaths. To leave Gaza City or not isn't an easy decision to make,\" he told Reuters by phone.\nOn Thursday, Israeli military spokesperson Avichay Adraee wrote on X that the military had started making what he said were initial warning calls to medical and international organisations operating in Gaza's north, telling them that Gaza City residents should start to prepare to move out of the city and towards the south.\nAdraee shared a recording of what he said was an Israeli officer telling a Gazan health ministry official that hospitals in southern Gaza should also prepare to receive patients from medical facilities in the north, who will be forced to evacuate.\nA Gaza health ministry official confirmed the phone call had taken place. The ministry rejected the Israeli request to shift medical resources south, warning it would cripple the already devastated health system and endanger over a million residents. It urged international bodies to intervene and protect lifesaving care.\nTwo more people have died of starvation and malnutrition in Gaza in the past 24 hours, the ministry said on Thursday. The new deaths raised the number of Palestinians who have died from such causes to 271, including 112 children, since the war began."
    },
    {
      "news_title": "Netanyahu: 'I approved taking control of Gaza City and hostage negotiations'",
      "news_link": "https://www.israelnationalnews.com/news/413658",
      "bias": "Lean Right",
      "text": null
    },
    {
      "news_title": "'Chetanyahu?': NBA star sucked into Gaza culture wars over workout video",
      "news_link": "https://forward.com/news/sports/763828/chet-holmgren-practice-video-outrage-israel/",
      "bias": "Lean Left",
      "text": "‘Chetanyahu?’: NBA star sucked into Gaza culture wars over workout video\nA clip of Chet Holmgren shooting three-pointers set off a legion of anti-Israel activists on X\nIt all started innocently enough: a video of NBA star Chet Holmgren practicing jump shots in an open gym.\nHolmgren doesn’t speak in the 11-second clip, which was posted Tuesday on X but appeared to originate on Snapchat. The caption, composed in ordinary hoop parlance, was affirming.\n“Chet back in the lab working on his 3 ball,” wrote Oklahoma City Thunder fan @SkyedOKC, who uploaded the video to X.\nWhat Holmgren does in the clip — making three three-pointers in a row from the left wing — is, as these videos go, unremarkable; for Holmgren, a lanky seven-footer known for his marksmanship, it is extremely basic. Yet this video has been viewed millions of times — it had 2.8 million impressions on X as of this writing — for reasons that will be obvious to most people who watch it: On the walls behind Holmgren are a pair of Israeli flags.\nwhat happened chetanyahu?\n— fei (@fyzzi04) August 21, 2025\nThe reaction was fierce. “Your boy’s a Zionist?” asked one commenter. “Delete this,” wrote another. “Now it’s a hate watch,” said a third. At least a dozen comments were variants of “F— Israel.” By Wednesday night, commenters had taken their outrage to Holmgren’s X profile, where a comment calling him “Chetanyahu” had accrued more than 7,000 likes.\nThe “lab” where Holmgren was working out is a Jewish school in Los Angeles whose gym has become popular among NBA players, for various reasons that have nothing to do with Israel — privacy and location, mainly. Shalhevet High School, which is Orthodox, has hosted many athletes with greater wattage than Holmgren, among them the LA Clippers’ James Harden and the Philadelphia 76ers’ Joel Embiid. LeBron James has been spotted practicing a couple miles away at Shalhevet’s Orthodox rival YULA.\nHolmgren, 23, has been working out at Shalhevet in the offseason since the summer before the 2022-23 season — that is, long before Oct. 7, 2023 — when, reporting an article about the trend of NBA players practicing at Orthodox high schools, this writer saw him there. That Holmgren has never posted about Israel or the war in Gaza, much less opined on a topic as complex and fraught and as irrelevant to his profession as Zionism, hardly matters. He has now been sucked into the vortex of Israel-Gaza discourse.\nThe backlash to Holmgren, apparently for not turning around and leaving the gym as soon as he saw the flags, reflects the sheer revulsion many people have to the Israeli flag as the country’s war in Gaza approaches the two-year mark. (The New York Knicks’ Isaiah Hartenstein — he’s not Jewish — is seen shooting in the same video but seems to have escaped criticism.)\nFor a professional athlete like Holmgren, who signed a five-year, $239 million contract extension last month, outrage over the court he’s shooting on is likely the only fallout from the war he will feel directly. For the people trolling him online, expressing that outrage might feel like their only recourse against the war, or just the safest one. And for a Jewish student who goes to that high school, it’s a reminder that the flag inside the gymnasium may mean something very different outside of it."
    },
    {
      "news_title": "Netanyahu: We Are Taking Control of Gaza City -- and Negotiating for All Hostages",
      "news_link": "https://www.breitbart.com/middle-east/2025/08/21/netanyahu-we-are-taking-control-of-gaza-city-and-negotiating-for-all-hostages/",
      "bias": "Right",
      "text": "Israeli Prime Minister Benjamin Netanyahu said Thursday that he had approved plans to take over the last Hamas stronghold in Gaza City — while also pursuing negotiations for the release of all Israeli hostages.\nIn a statement translated from Hebrew and released by the Government Press Office, Netanyahu, speaking during a visit to troops deployed to Gaza, said:\nI came here to approve the IDF plans for taking control of Gaza City and defeating Hamas. In parallel, I instructed to begin immediate negotiations for the release of all our hostages and the end of the war, on conditions that are acceptable for Israel.\nWe’re at the decisive stage. I came today to the Gaza Division in order to approve the plans that the IDF presented to me and to the Defense Minister for taking control of Gaza City and defeating Hamas.\nI greatly appreciate the mobilization of the reserve soldiers, and of course the regular army, for this essential cause.\nIn parallel, I have instructed to begin immediate negotiations for the release of all our hostages and the end of the war, on conditions that are acceptable for Israel.\nThose two things, the defeat of Hamas and the release of all our hostages, go hand in hand.\nRumors of a possible deal have swirled for days, after Hamas appeared to accept the terms of a deal it had rejected in May, when U.S. Special Envoy Steve Witkoff proposed a two-stage hostage release deal.\nNetanyahu, heeding the Israeli public, is now arguing that only a one-shot, complete deal will be acceptable.\nMilitary pressure appears to be playing a role in encouraging Hamas to negotiate — a reversal after it backed away from talks, following the decision by several western governments to recognize a Palestinian state, giving the terrorists what they want without compromises.\nJoel B. Pollak is Senior Editor-at-Large at Breitbart News and the host of Breitbart News Sunday on Sirius XM Patriot on Sunday evenings from 7 p.m. to 10 p.m. ET (4 p.m. to 7 p.m. PT). He is the author of The Zionist Conspiracy Wants You, now available on Amazon. He is a winner of the 2018 Robert Novak Journalism Alumni Fellowship. Follow him on Twitter at @joelpollak.\nPhoto: file\nCOMMENTS\nPlease let us know if you're having issues with commenting."
    },
    {
      "news_title": "Three days after Hamas' answer, Netanyahu orders to begin hostage talks",
      "news_link": "https://www.haaretz.com/israel-news/2025-08-21/ty-article/.premium/three-days-after-hamas-answer-netanyahu-orders-to-begin-hostage-talks/00000198-cdf5-dcce-a5bf-cdf714e80000",
      "bias": "Lean Left",
      "text": "Three Days After Hamas' Answer, Netanyahu Orders to Begin Hostage Talks\nPrime Minister Benjamin Netanyahu announced Thursday night that he has \"instructed to begin immediate negotiations for the release of all our hostages and an end to the war, on conditions that are acceptable for Israel.\""
    },
    {
      "news_title": "Netanyahu approves IDF's plans for Gaza City takeover, re-starting hostage talks",
      "news_link": "https://www.jpost.com/israel-news/defense-news/article-864954",
      "bias": "Center",
      "text": "Netanyahu approves IDF's plans for Gaza City takeover, re-starting hostage talks\nNetanyahu stated that in tandem, he directed \"the immediate initiation of negotiations\" for the release of all the hostages and ending the war in Gaza on Israel's terms.\nAn illustrative photo of Prime Minister Benjamin Netanyahu with hostage posters in the background. (photo credit: YONATAN SINDEL/FLASH90)ByAMICHAI STEIN, JERUSALEM POST STAFFUpdated:"
    },
    {
      "news_title": "Netanyahu Approves Gaza City Takeover Plan, Renewed Hostage Negotiations",
      "news_link": "https://www.theepochtimes.com/world/netanyahu-approves-gaza-city-takeover-plan-renewed-hostage-negotiations-5904266",
      "bias": "Lean Right",
      "text": "Israeli Prime Minister Benjamin Netanyahu on Aug. 21 announced he’s giving final approval for the Israel Defense Forces (IDF) proposal to take control of Gaza City, and had also approved renewed negotiations to free Israeli hostages held by terrorist group Hamas in Gaza and bring the state of armed conflict there to a close.\n“We’re at the decisive stage. I came today to the Gaza Division in order to approve the plans that the IDF presented to me and to the defense minister for taking control of Gaza City and defeating Hamas,” Netanyahu said in a recorded statement."
    },
    {
      "news_title": "Netanyahu says Israel to begin Gaza truce talks, approve Gaza City attack plan",
      "news_link": "https://newsaf.cgtn.com/news/2025-08-22/Netanyahu-says-Israel-to-begin-Gaza-truce-talks-1G1UpCQgYKI/p.html",
      "bias": "Lean Left",
      "text": "By continuing to browse our site you agree to our use of cookies, revised Privacy Policy and Terms of Use. You can change your cookie settings through your browser.\nCHOOSE YOUR LANGUAGE\nCHOOSE YOUR LANGUAGE\n互联网新闻信息许可证10120180008\nDisinformation report hotline: 010-85061466\nIsraeli Prime Minister Benjamin Netanyahu said on Thursday he had instructed officials to begin \"immediate negotiations\" for the release of hostages in Gaza and an end to the war, while also vowing to approve military plans to seize Gaza City."
    },
    {
      "news_title": "Netanyahu orders new talks to release all hostages, pushes ahead with Gaza City takeover",
      "news_link": "https://www.france24.com/en/video/20250821-netanyahu-orders-new-talks-to-release-all-hostages-pushes-ahead-with-gaza-city-takeover",
      "bias": "Center",
      "text": "One of your browser extensions seems to be blocking the video player from loading. To watch this content, you may need to disable it on this site.\nNetanyahu orders new talks to release all hostages, pushes ahead with Gaza City takeover\nIsraeli Prime Minister Benjamin Netanyahu on Thursday said he had ordered the beginning of immediate negotiations to release the remaining Israeli hostages in Gaza, rejecting a ceasefire proposal presented earlier this week. FRANCE 24's Noga Tarnopolsky reports from Jerusalem.\nRead less Read more\nAsia / Pacific"
    },
    {
      "news_title": "Netanyahu Says He'll Push For Gaza City Takeover Amid Renewed Ceasefire Talks",
      "news_link": "https://www.ndtv.com/world-news/benjamin-netanyahu-says-hell-push-for-gaza-city-takeover-amid-renewed-ceasefire-talks-9134360#publisher=newsstand",
      "bias": "Lean Right",
      "text": null
    },
    {
      "news_title": "Israel PM Benjamin Netanyahu To Approve Plans To Take Over Gaza City, Restart Negotiations Over Hostages | 🌎 LatestLY",
      "news_link": "https://www.latestly.com/socially/world/israel-pm-benjamin-netanyahu-to-approve-plans-to-take-over-gaza-city-restart-negotiations-over-hostages-7071268.html",
      "bias": "Right",
      "text": "Israeli Prime Minister Benjamin Netanyahu said Thursday, August 21, he will approve the takeover of Gaza City while also restarting negotiations with Hamas aimed at returning all of Israel’s remaining hostages. According to the AP, Benjamin Netanyahu will push for ending the war on Israel’s terms. \"We are at a decisive stage. I arrived today at the Gaza Division to approve the plans presented by the IDF to me and the defence minister for the takeover of Gaza City and the defeat of Hamas,\" Netanyahu said. US Slaps Sanctions on ICC Judges Over Arrest Warrant for Benjamin Netanyahu, France Expresses Dismay.\nIsrael PM Benjamin Netanyahu To Approve Plans To Take Over Gaza City\nNetanyahu says he will approve plans to take over Gaza City and also restart negotiations over hostages, reports AP\n— Press Trust of India (@PTI_News) August 21, 2025\n(SocialLY brings you all the latest breaking news, fact checks and information from social media world, including Twitter (X), Instagram and Youtube. The above post contains publicly available embedded media, directly from the user's social media account and the views appearing in the social media post do not reflect the opinions of LatestLY.)"
    },
    {
      "news_title": "Israeli PM Netanyahu set to give final approval for Gaza City takeover",
      "news_link": "https://www.siasat.com/israeli-pm-netanyahu-set-to-give-final-approval-for-gaza-city-takeover-3261771/",
      "bias": "Lean Left",
      "text": "Deir al-Balah: Israeli Prime Minister Benjamin Netanyahu was expected to give final approval Thursday for plans to take over Gaza City, an operation that could start within days. The widening of the 22-month offensive against Hamas appears to be proceeding despite protests in both Israel and the Palestinian enclave.\nNetanyahu was set to meet with top security officials to sign off on the plans, according to an Israeli official who was not authorised to brief the media and spoke on condition of anonymity. It was unclear whether they would discuss a ceasefire proposal from Arab mediators that Hamas says it has accepted.\nThe Israeli military began calling medical officials and international organisations in the northern Gaza Strip to encourage them to evacuate to the south ahead of the expanded operation. The military plans to call up 60,000 reservists and extend the service of 20,000 more.\nIsraeli strikes meanwhile killed at least 36 Palestinians across Gaza on Thursday, according to local hospitals. A renewed offensive could bring even more casualties and displacement to the territory, where the war has already killed tens of thousands and where experts have warned of imminent famine.\nMany Israelis fear it could also doom the remaining 20 or so living hostages taken by Hamas-led militants in the October 7, 2023 attack that ignited the war.\nGaza City operation could begin in days\nIsraeli troops have already begun more limited operations in the city’s Zeitoun neighbourhood and the built-up Jabaliya refugee camp, areas where they have carried out several previous major operations over the course of the war, only to see militants later regroup.\nThe military says it plans to operate in areas where ground troops have not yet entered and where it says Hamas still has military and governing capabilities.\nSo far, there has been little sign of Palestinians fleeing en masse, as they did when Israel carried out an earlier offensive in Gaza City in the opening weeks of the war. The military says it controls around 75 per cent of Gaza and residents say nowhere in the territory feels safe.\nHundreds gathered for a rare protest in Gaza City on Thursday against the war and Israel’s plans to support the mass relocation of Palestinians to other countries.\nWomen and children held placards reading “Save Gaza” and “Stop the war, stop the savage attack, save us,” against a backdrop of destroyed buildings as Palestinian music played. Unlike in previous protests, there were no expressions of opposition to Hamas.\n“We want the war on Gaza to stop. We don’t want to migrate. Twenty-two months … it’s enough. Enough death. Enough destruction,” said Bisan Ghazal, a woman displaced from Gaza City.\nProtests in Israel\nIn Israel, families of some of the 50 hostages still being held in Gaza gathered in Tel Aviv to condemn the expanded operation. Israel believes around 20 hostages are still alive.\n“Forty-two hostages were kidnapped alive and murdered in captivity due to military pressure and delay in signing a deal,” said Dalia Cusnir, whose brother-in-law, Eitan Horn, is still being held captive. Eitan’s brother, Iair Horn, was released during a ceasefire earlier this year.\n“Enough to sacrifice the hostages. Enough to sacrifice the soldiers, both regular and reservists. Enough to sacrifice the evacuees. Enough to sacrifice the younger generation in the country,” said Bar Goddard, the daughter of Meni Goddard, whose body is being held by Hamas.\nAdditional protests are planned for Thursday night in Tel Aviv.\nPlans for widening the offensive have also sparked international outrage, with many of Israel’s closest Western allies — but not the United States — calling on it to end the war.\n“I must reiterate that it is vital to reach immediately a ceasefire in Gaza, and the unconditional release of all hostages to avoid the massive death and destruction that a military operation against Gaza City would inevitably cause,” United Nations chief António Guterres said at a conference in Japan.\nDozens killed across Gaza\nAt least 36 Palestinians were killed by Israeli fire across the Gaza Strip on Thursday, including 14 who were seeking humanitarian aid, according to local hospitals.\nThe Israeli military said it killed several armed militants in the Morag Corridor, a military zone where people seeking aid have repeatedly come under fire in recent weeks, according to witnesses and health officials. Nasser Hospital in southern Gaza had earlier reported that six people were killed in that area while seeking aid on Thursday. It was not possible to reconcile the two accounts.\nThe Media Freedom Coalition, which promotes press freedoms worldwide, called Thursday for Israel to allow independent, foreign news organizations access to Gaza. Aside from rare guided tours, Israel has barred international media from the war, which has killed at least 184 Palestinian journalists and media workers.\n“Journalists and media workers play an essential role in putting the spotlight on the devastating reality of war,” said a statement signed by 27 of the coalition’s member countries.\nWitnesses, health officials and the UN human rights office say Israeli forces have killed hundreds of people since May as they headed toward sites run by the Gaza Humanitarian Foundation, an Israeli-backed American contractor, and in the chaos surrounding UN aid convoys, which are frequently attacked by looters and overrun by crowds.\nThe Israeli military says it has only fired warning shots at people who approach its forces. GHF says there has been almost no violence at the sites themselves, and that its armed contractors have only used pepper spray and fired into the air on some occasions to prevent deadly crowding.\nIsraeli strikes destroy evacuated tent camp\nIsraeli airstrikes also destroyed a tent camp in Deir al-Balah, the only city in Gaza that has been relatively unscathed in the war and where many have sought refuge. Residents said the Israeli military warned them to flee shortly before the strikes set the camp ablaze, and there were no reports of casualties.\nFamilies, many with children, could later be seen sifting through the ashes for the belongings they had managed to take with them during earlier evacuations.\nMohammad Kahlout, who had been displaced from northern Gaza, said they were given just five minutes to gather what they could and evacuate. “We are civilians, not terrorists. What did we do, and what did our children do, to be displaced again?”\nThe Gaza Health Ministry said Thursday that at least 62,192 Palestinians have been killed in the war. Another two people have died from malnutrition-related causes, bringing the total number of such deaths to 271, including 112 children, the Health Ministry said.\nThe ministry is part of the Hamas-run government and staffed by medical professionals. It does not say whether those killed by Israeli fire are civilians or combatants, but it says around half are women and children.\nThe UN and many independent experts consider its figures to be the most reliable estimate of wartime casualties. Israel disputes its toll but has not provided its own.\nHamas-led militants started the war when they attacked Israel on Oct. 7, 2023, killing some 1,200 people, mostly civilians, and abducting 251. Most of the hostages have been released in ceasefires or other deals. Hamas says it will only free the rest in exchange for a lasting ceasefire and an Israeli withdrawal."
    },
    {
      "news_title": "Netanyahu approves Gaza City attack, orders hostage negotiations",
      "news_link": "https://www.arabnews.com/node/2612587/middle-east",
      "bias": "Lean Right",
      "text": "Netanyahu approves Gaza City attack, orders hostage negotiations\nIsraeli PM claims he has ordered immediate negotiations for the release of hostages held in Gaza\nComments come after defense ministry approves call-up of 60,000 reservists to help capture Hamas’s last strongholds\nUpdated 22 August 2025\nAFP\nJERUSALEM: Israeli Prime Minister Benjamin Netanyahu on Thursday said he had ordered the beginning of immediate negotiations to release the remaining Israeli hostages in Gaza.\nThe announcement comes a day after the defense ministry approved a plan authorizing the call-up of roughly 60,000 reservists to help capture Hamas’s last major strongholds in Gaza City.\n“I have come to approve the IDF’s (military’s) plans to take control of Gaza City and defeat Hamas,” the prime minister said in a video statement during a visit with the Gaza division.\n“At the same time, I have instructed to immediately begin negotiations for the release of all our hostages and the end of the war under conditions acceptable to Israel.”\nMeditators have been waiting for days for an official Israeli response to their latest ceasefire proposal, after Hamas accepted the plan earlier this week.\n“I greatly appreciate the commitment of the reserve soldiers, and of course the regular army, for this vital mission,” said Netanyahu.\n“These two matters — defeating Hamas and releasing all our hostages — go hand in hand.”\nIsrael and Hamas have held indirect negotiations throughout the nearly two-year conflict, resulting in two short ceasefires during which Israeli hostages were freed in exchange for Palestinian prisoners.\nOf the 251 hostages seized during Hamas’s October 2023 attack on southern Israel that triggered the war, 49 are still in Gaza, including 27 the Israeli military says are dead.\nEgyptian farmers behind world’s perfumes face climate fight alone\nChild labor remains widespread in Egypt with 4.2 million children working in agriculture, industry and services, often in unsafe or exploitative conditions, according to a 2023 state study\nUpdated 49 min 1 sec ago\nAFP\nSHUBRA BALULA, Egypt: For years, Egyptian jasmine picker Wael Al-Sayed has collected blossoms by night in the Nile Delta, supplying top global perfume houses. But in recent summers, his basket has felt lighter and the once-rich fragrance is fading.\n“It’s the heat,” said Sayed, 45, who has spent nearly a decade working the fields in Shubra Balula, a quiet village about 100 kilometers (60 miles) north of Cairo and a key hub for Egypt’s jasmine industry.\nAs temperatures rise, he said, the flowers bloom less and his daily harvest has dropped from six kilograms to just two or three in the past two years.\nIn this fertile pocket of the delta, jasmine has sustained thousands of families like Sayed’s for generations, but rising temperatures, prolonged dry spells and climate-driven pests are putting that legacy at risk.\nFrom June to October, families, including children, traditionally head into the fields between midnight and dawn to hand-pick jasmine at peak fragrance.\nWith yields shrinking, some are leaving the trade entirely and those that have stayed now work longer hours.\nMore children are also being pulled in to help and often stay up all night to pick before going to school.\nChild labor remains widespread in Egypt with 4.2 million children working in agriculture, industry and services, often in unsafe or exploitative conditions, according to a 2023 state study.\nThis year, Sayed has brought two of his children — just nine and 10 years old — to join him and his wife on their 350-square-meter (3,800-square-foot) plot.\n“We have no other choice,” Sayed said.\nAccording to the country’s largest processor, A Fakhry & Co, Egypt produces nearly half the world’s jasmine concrete, a waxy extract from the plant that provides a vital base for designer fragrances and is a multi-million dollar export.\nIn the 1970s, Egypt produced 11 tons of jasmine concrete annually, according to the International Federation of Essential Oils and Aroma Trades.\nNow, A Fakhry & Co. says that’s down to 6.5 tons.\nAli Emara, 78, who has picked jasmine since the age of 12, said summers used to be hot, “but not like now.”\nMohamed Bassiouny, 56, and his four sons have seen their harvest halve from 15 to seven kilograms with pickers now taking over eight hours to fill a basket.\nThe region’s jasmine is highly sensitive to heat and humidity, said Karim Elgendy from Carboun Institute, a Dutch climate and energy think tank.\n“Higher temperatures can disrupt flowering, weaken oil concentration and introduce stress that reduces yield,” Elgendy told AFP.\nA 2023 report by the International Energy Agency found Egypt’s temperature rose 0.38C per decade (2000-2020), outpacing the global average.\nThe heat is affecting the strength of the jasmine’s scent, and with it the value of the oil extracted, said Badr Atef, manager of A Fakhry & Co.\nMeanwhile, pests such as spider mites and leaf worms are thriving in the hotter, drier conditions and compounding the strain.\nAlexandre Levet, CEO of the French Fragrance House in Grasse, France’s perfume capital, explained that the industry is facing the effects of climate change globally.\n“We have dozens of natural ingredients that are already suffering from climate change,” he said, explaining that new origins for products have emerged as local climates shift.\nWith the Nile Delta also vulnerable to the rising Mediterranean water levels, which affect soil salinity, jasmine farmers are on the front line of a heating planet.\nThe laborers are left “at the mercy of this huge system entirely on their own,” said rural sociologist Saker El Nour, with “no stake” in the industry that depends on their labor.\nGlobal brands charge up to $6,000 per kilogram of jasmine absolute, the pure aromatic oil derived from the concrete and used by perfumeries, but Egyptian pickers earn just 105 Egyptian pounds ($2) per kilogram.\nA ton of flowers yields only 2-3 kilograms of concrete and less than half that in pure essential oil — enough for around 100 perfume bottles.\n“What’s 100 pounds worth today? Nothing,” said Sayed.\nEgypt’s currency has lost more than two-thirds of its value since 2022, causing inflation to skyrocket and leaving families like Sayed’s scraping by.\nLast June, pickers staged a rare strike, demanding 150 pounds per kilogram. But with prices set by a handful of private processors and little government oversight, they only received an increase of 10 pounds.\nEvery year farmers earn less and less, while a heating planet threatens the community’s entire livelihood.\n“Villages like this may lose their viability altogether,” Elgendy said.\nFrankly Speaking: How former Israeli PM Olmert views the war\nOlmert warns the Gaza war is endangering Israel’s global standing, accuses Netanyahu of reckless policies driven by self-interest\nAsked whether Israel’s Smotrich and Ben-Gvir are terrorists, Olmert went even further, branding them “messianic” and “extremists”\nUpdated 24 August 2025\nArab News\nRIYADH: Former Israeli Prime Minister Ehud Olmert has been outspoken in his criticism of Benjamin Netanyahu. While stopping short of accusing his successor of committing genocide, he has repeatedly said that what is happening in Gaza constitutes war crimes.\nSpeaking to Katie Jensen, host of the Arab News current affairs program “Frankly Speaking,” Olmert said that although Israel’s response was justified following the Oct. 7, 2023, Hamas-led attack, the conflict had become untenable — and a “death trap for Israelis.”\n“The whole war which started after the ... violation of the temporary ceasefire agreement in March of 2025 is an illegitimate war,” said Olmert, who served as prime minister from 2006 to 2009.\n“And in the illegitimate war, which is opposed by the majority of the Israelis, over 70 percent, in which lots of Israeli soldiers will be killed, when there is a serious danger to the lives of the hostages, and there will be thousands of Palestinians killed for a war which has no objective, which can’t reach any goal, which will do nothing good for any party involved, such a war is a crime, and I’ve accused the Israeli government of doing it.”\nHe added that many Israelis now believe the war primarily serves Netanyahu’s personal interests rather than the families of the remaining hostages and the security of wider Israeli society.\n“This is what everyone says in Israel now,” he said. “This is an unneeded and unnecessary war, that there is not any national interest of Israel which can be served by continuing the war. And therefore, the inevitable conclusion is that it serves the personal interests of the prime minister. This is something which has been said by everyone.\n“Expanding the war now against Gaza, which is so densely populated with more than a million people and where Hamas is hiding inside the most densely populated areas with non-involved citizens, is a death trap for Israelis, for something which doesn’t serve any national interest is a crime, and you have to ask yourself: What does it serve? And therefore many people conclude that it serves a personal interest.”\nWhen asked by Jensen whether he still believes Netanyahu belongs in The Hague to face war crimes charges, Olmert said he did not recall making such a statement. This is despite a widely shared clip from an interview with UK broadcaster Piers Morgan on June 2, in which Olmert was asked directly whether Netanyahu should face trial in The Hague.\n“Look, there should be a voice. And if as a result of the fact that I was prime minister and I’m fairly well-known in the international community that people want to hear what I have to say, I have to say it. Yes,” Olmert told Morgan in the clip.\nAlthough he now appears to have walked back those comments, Olmert did endorse describing Israel’s Minister of National Security Itamar Ben-Gvir and Finance Minister Bezalel Smotrich as terrorists, calling them “messianic” and “extremists.”\nBen-Gvir has provoked outrage by leading Jewish prayers at Jerusalem’s Al-Aqsa Mosque, violating long-standing agreements and drawing condemnation from Palestinian, Arab, and international leaders.\nHe has also advocated for Israeli sovereignty over Gaza, and promoting mass “voluntary” Palestinian emigration. Western governments have sanctioned him for incitement to violence and past criminal convictions for supporting terrorism and racism.\nSmotrich, also sanctioned by Western states, has been criticized for inflammatory statements backing settlement expansion in the West Bank, incitement against Palestinians, and positions seen by EU partners and rights groups as undermining Palestinian rights and peace prospects.\nJensen teed up the issue with this question: “When we look at some of the comments from (Netanyahu’s) ministers, people like Smotrich, who said there is no such thing as Palestinian people — he stood under a map of ‘Greater Israel’ while saying that — he also said the Palestinian village of Huwara should be wiped out.\n“Or comments from Ben-Gvir, who went on Israeli television and said his right to move freely in the West Bank is more important than Palestinians’ freedom of movement … If we consider these men’s words and actions, in your view, are these men terrorists?”\nOlmert was unequivocal in his response.\n“Look, this is an easy part of the question,” he said. “Yes, they are in a way in the sense that Ben-Gvir was convicted for taking part in what is considered to be terrorist actions in the past. But I think that this situation is more, somewhat more complex.\n“Let’s face it. On one hand, there are these messianic groups, which are totally, totally unacceptable. For the majority of the Israelis, there’s no question about it. They are extreme, they are messianic.\n“Yes, indeed, they want to expel all the Palestinians from the West Bank and annex the West Bank. And so they want to do it in Gaza. But I think that the majority of the Israelis are against it.”\nUnlike Netanyahu, who has leaned into the rhetoric of his far-right ministers, Olmert said he would never have supported the notion of a “Greater Israel” — a political concept espoused by extremists that envisions expanding Israeli territory to include swathes of Palestine, Lebanon, Jordan, Syria, and even land between the Nile and the Euphrates.\nOlmert warned that such rhetoric and policies were costing Israel friends and allies.\n“There is a deep division between a major part of the public opinion, which is in favor of changing course, and a part which is now governed by the Netanyahus and the group of thugs which are known to be the cabinet ministers,” he said.\n“Now, what they are doing, they are causing a very big damage to the reputation of the state of Israel, to the integrity of the state of Israel, and to the perception of what Israel stands for.\n“And that causes a huge difficulty in the relations of Israel with the traditional friends of Israel, European countries, France, Germany, Great Britain, Canada, other countries. And it also creates difficulties that will become more and more difficult to deal with, with America.\n“And unfortunately also it creates difficulties with our very important friends in Egypt and Jordan, and also in the Emirates. And it certainly prevents the possible movement towards a normalization process with Saudi Arabia.”\nNetanyahu has faced corruption charges since 2019, including allegations of bribery, fraud, and breach of trust. His trial, which began in 2020, has been repeatedly delayed on security grounds. He denies all charges.\nThere are also outstanding arrest warrants issued by the International Criminal Court against Netanyahu and his former defense minister, Yoav Gallant, relating to alleged war crimes in Gaza. Israel itself faces charges of genocide at the International Court of Justice.\nOlmert himself resigned as prime minister in 2009 amid corruption allegations and was later convicted and imprisoned for bribery and breach of trust. Despite this, he insists his voice carries weight, arguing that most Israelis now oppose Netanyahu.\nIndeed, mass demonstrations across Israel in recent weeks opposing an expansion of the war in Gaza highlight a dramatic shift in public attitudes toward the trajectory of the right-wing coalition government.\n“Had I been prime minister, it would have been entirely different,” said Olmert. “I would have adopted what I represented at the time that I was prime minister, talking about the two-state solution, negotiating, (and) hopefully trying to force a Palestinian leadership to comply.”\nOlmert said the failure of the Israeli-Palestinian peace process to date could not be blamed entirely on Israel. He recalled that during his tenure he had offered the Palestinians a state, but says they rejected the proposal.\n“Let’s not forget that in 2008, 2009, when I was prime minister, I proposed to the president of the Palestinian Authority a comprehensive peace plan based on the (19)67 borders,” he said.\nHis plan included an Israeli withdrawal from much of the West Bank, land swaps for annexed settlements, a corridor linking Gaza and the West Bank, shared or international administration of Jerusalem’s holy sites, and the symbolic acceptance of a limited number of Palestinian refugees into Israel, with compensation and resettlement for the rest.\nThe Palestinians rejected the deal over concerns about the right of return, the rushed timetable for consideration, doubts over Olmert’s political survival, and dissatisfaction with the terms on Jerusalem and land allocation.\nRegardless of fault, the repeated collapse of peace efforts in this period culminated in the Oct. 7, 2023, Hamas-led attack and Israel’s ensuing war on Gaza, which has since killed at least 60,000 Palestinians and left the enclave devastated.\nOne of the war’s greatest scandals to date has been the creation of the Gaza Humanitarian Foundation in early 2025. Critics have denounced the GHF for sidelining UN-led relief mechanisms in favor of a US- and Israeli-backed scheme that placed military personnel and private US contractors in charge of distributing aid in militarized zones.\nReports have documented hundreds of deaths and injuries among Palestinians seeking food at GHF aid sites. Groups including Medecins Sans Frontieres described the locations as scenes of “orchestrated killing” and demanded the program’s immediate suspension.\nOlmert said he did not know whether Israelis had deliberately targeted civilians at GHF sites, but insisted it was Israel’s responsibility to feed Gazans.\n“I think that there is a lot of fake information about precisely the circumstances regarding the humanitarian supplies and how Hamas is trying to provoke in order to reach out for food for their own needs, knowing that Hamas is not particularly careful about the lives of Palestinians and … how much is it a result of very unacceptable practices of Israeli soldiers. I don’t know,” he said.\n“I say one thing and this is at the bottom line, which I think is what counts. Israel controls Gaza, we are in charge there. Therefore, it is incumbent upon Israel to provide the humanitarian needs in Gaza to everyone that needs it, effectively, comprehensively, and without the interference or the provocations of whoever wants to disturb it. This is our responsibility.”\nIsraeli bulldozers uproot hundreds of trees in West Bank village\n“They completely uprooted and leveled them under false pretenses,” he said, explaining he and other residents had already begun replanting the pulled-up trees\nUpdated 24 August 2025\nAFP\nAL-MUGHAYYIR: Israeli bulldozers uprooted hundreds of trees in the West Bank village of Al-Mughayyir on Sunday in the presence of the Israeli military, according to journalists who witnessed the scene.\nMost of the felled vegetation appeared to be olive trees, essential to the economy and culture of the West Bank, while olive groves have also long been a flashpoint for violent clashes between farmers and encroaching Israeli settlers.\nAbdelatif Mohammed Abu Aliya, a local farmer from the village near Ramallah, said he lost olive trees that were over 70 years old on about one hectare of land.\n“They completely uprooted and leveled them under false pretenses,” he said, explaining he and other residents had already begun replanting the pulled-up trees.\nAFP photographers on the ground saw overturned soil, olive trees lying on the ground, and several bulldozers operating on the hills surrounding the village.\nOne bulldozer had an Israeli flag, and Israeli military vehicles were parked nearby.\n“The goal is control and forcing people to leave. This is just the beginning — it will expand across the entire West Bank,” said Ghassan Abu Aliya, who leads a local agricultural association.\nResidents said the bulldozing began on Thursday.\nA Palestinian NGO reported 14 people had been arrested in the village over the past three days.\nWhen asked about the incident, the Israeli army said they were looking into the matter.\nIn a statement, the army said it had arrested a man from Al-Mughayyir, accusing him of being “responsible for a terrorist attack” nearby.\nOn Aug. 16, the Palestinian Authority reported that an 18-year-old man had been shot and killed by the Israeli army in the same village.\nThe army said its forces responded to stones thrown by “terrorists” but did not directly link the incident to the young man’s death.\nIn a video widely circulated in Israeli media on Friday, a senior military commander refers to the attack in Al-Mughayyir and vows to make “every village and every enemy ... pay a heavy price” for attacks against Israelis.\nAvi Bluth, the military’s top commander in the West Bank, says in the video that the villages of Palestinian attackers could face curfews, sieges, and terrain “shaping actions” with the aim of deterrence.\nJordan’s King Abdullah, foreign minister hold talks with US Congress delegation\nUpdated 24 August 2025\nArab News\nAMMAN: Jordan’s King Abdullah II on Sunday received a US Congress delegation, which included Sen. Jeanne Shaheen and Rep. Joe Wilson, for talks on relations and regional developments, the Jordan News Agency reported.\nThe discussions focused on the strategic partnership between Jordan and the US, as well as joint efforts to achieve peace and stability in the Middle East, JNA added.\nKing Abdullah stressed to the delegation the urgent need to reach an immediate ceasefire in Gaza and ensure the flow of humanitarian aid by all possible means to all areas of the enclave.\nHis Majesty King Abdullah II received a US Congress delegation, which included Senator Jeanne Shaheen and Representative Joe Wilson, for discussions covering #Jordan and the #US’ strategic partnership, and joint efforts to achieve peace and stability in the Middle East pic.twitter.com/NPUfiXwe3c\nHe reiterated Jordan’s rejection of Israel’s plan to consolidate its occupation of Gaza, expand military control over it, and increase settlement activity in the West Bank.\nThe king also underlined the importance of supporting Palestinians in securing their just and legitimate rights, foremost the establishment of an independent state on the basis of the two-state solution.\nHe further reaffirmed Jordan’s support for Syria’s efforts to safeguard its security, stability, sovereignty, and territorial integrity.\nIn a separate meeting, Foreign Minister Ayman Safadi held talks with Shaheen to also review regional developments.\nIsrael strikes on Yemeni capital Sanaa kill six, wound 86\nIsrael’s military said it struck the Asar and Hizaz power plants and a military site where the presidential palace is located\nThe strikes killed six people and injured 86 in a final toll, a Houthi Health Ministry spokesperson said on X.\nUpdated 25 August 2025\nAgencies\nSANAA/TEL AVIV: Israeli airstrikes hit Yemen’s capital on Sunday, days after the Houthi rebels fired a missile toward Israel that its military described as the first cluster bomb the rebels had launched at it since 2023.\nThe Iranian-backed Houthis said multiple areas across Sanaa were hit, while the Houthi-run health ministry said six people were killed and 86 others were wounded.\nThe rebels’ Al-Masirah satellite television reported a strike on an oil company, and video on social media showed a fireball erupting there.\nThe strikes are the latest in over a year of direct attacks and counterstrikes between Israel and Houthi militants in Yemen, part of a spillover from the war in Gaza.\nIsrael’s military said it struck the Asar and Hizaz power plants, calling them “a significant electricity supply facility for military activities,” along with a military site where the presidential palace is located.\nSanaa residents told The Associated Press they heard explosions close to a closed military academy and the presidential palace. They saw plumes of smoke near Sabeen Square, a central gathering place in the capital.\n“The sounds of explosions were very strong,” said Hussein Mohamed, who lives close to the presidential palace.\nAhmed Al-Mekhlafy said he felt the sheer force of the strikes. “The house was rocked, and the windows were shattered,” he told the AP by phone.\n“The strikes were conducted in response to repeated attacks by the Houthi terrorist regime against the State of Israel and its civilians, including the launching of surface-to-surface missiles and UAVs toward Israeli territory in recent days,” the Israeli military said in a statement.\nOn Friday, the Houthis said they had fired a ballistic missile toward Israel in their latest attack, which they said was in support of Palestinians in Gaza. An Israeli Air Force official said on Sunday the missile most likely carried several sub-munitions “intended to be detonated upon impact.”\n“This is the first time that this kind of missile has been launched from Yemen,” the official said.\nSince Israel’s war in Gaza against the Palestinian militant group Hamas began in October 2023, the Iran-aligned Houthis have attacked vessels in the Red Sea in what they describe as acts of solidarity with the Palestinians.\nThey have also frequently fired missiles toward Israel, most of which have been intercepted. Israel has responded with strikes on Houthi-controlled areas of Yemen, including the vital Hodeidah port.\nUnfazed\nAbdul Qader Al-Murtada, a senior Houthi official, said on Sunday the Houthis, who control much of Yemen’s population, would continue to act in solidarity with Palestinians in Gaza.\n“(Israel) must know that we will not abandon our brothers in Gaza, whatever the sacrifices,” he said on X.\nNasruddin Amer, deputy head of the Houthi media office, also vowed that the militia will continue its attacks on Israel, writing on social media that “our military operations supporting Gaza won’t stop, God willing, unless the aggression is stopped, and the siege is lifted.”\nThe Israeli strikes were the first to hit Yemen since a week ago, when Israel said it targeted energy infrastructure it believed was used by the rebels.\nThe latest strikes follow the Houthis’ claim of launching a newly equipped missile toward Israel on Friday, targeting the country’s largest airport, Ben Gurion. There was no reported damage or injuries. Israel’s military said it fragmented mid-air after several interception attempts.\nAn Israeli Air Force official, speaking on condition of anonymity in line with military regulations, called Friday’s projectile a new threat — a cluster munition, meant to detonate into multiple explosives on impact.\nThe use of cluster bombs makes interception more difficult and represents additional technology provided to the Houthis by Iran, the official asserted.\nThe official also said over 10 Israeli fighter jets carried out Sunday’s strikes.\nDefense Minister Israel Katz said in a statement that Israel continues to “impose an air and naval blockade,” without details. Prime Minister Benjamin Netanyahu said in televised remarks that the rebel group is “paying a heavy price for its aggression.”\nHouthi attacks over the past two years have upended shipping in the Red Sea, through which about $1 trillion of global goods passes each year. From November 2023 to December 2024, the Houthis targeted more than 100 commercial and naval ships with missiles and drones.\nThe rebels stopped the attacks during this year’s brief ceasefire in Gaza and later became the target of a weekslong airstrike campaign ordered by US President Donald Trump.\nIn May, the United States announced a deal with the Houthis to end the airstrikes in return for an end to attacks on shipping, although the rebels said the agreement did not include halting attacks on targets it believed were aligned with Israel.\nLast month, the Houthis said they would target merchant ships belonging to any company that does business with Israeli ports, regardless of nationality, as part of what they called a new phase of operations against Israel.\nIn May, Israeli airstrikes hit the Sanaa airport in a rare daytime attack that destroyed the terminal and left craters in its runway. At least six passenger planes were hit, including three belonging to Yemenia Airways, according to airport authorities."
    },
    {
      "news_title": "Benjamin Netanyahu says he will give approval for Gaza City takeover despite protests",
      "news_link": "https://www.irishexaminer.com/world/arid-41691612.html",
      "bias": "Lean Left",
      "text": "Benjamin Netanyahu says he will give approval for Gaza City takeover despite protests\nBenjamin Netanyahu has said he will give final approval for a takeover of Gaza City while also restarting negotiations with Hamas aimed at returning all of Israel’s remaining hostages and ending the war on Israel’s terms.\nThe wide-scale operation in Gaza City could start within days after the Israeli Prime Minister grants final approval at a meeting with senior security officials.\nHamas said earlier this week that it had agreed to a ceasefire proposal from Arab mediators which, if accepted by Israel, could forestall the offensive.\nThe widening of the 22-month military offensive against Hamas appears to be proceeding despite protests in Israel and the Palestinian enclave.\nThe Israeli military has been calling medical officials and international organisations in the northern Gaza Strip to encourage them to evacuate to the south ahead of the expanded operation. The military plans to call up 60,000 reservists and extend the service of 20,000 more.\nIsraeli strikes killed at least 36 Palestinians across Gaza on Thursday, according to local hospitals. A renewed offensive could bring even more casualties and displacement to the territory, where the war has already killed tens of thousands and where experts have warned of imminent famine.\nMany Israelis fear it could also doom the remaining 20 or so living hostages taken by Hamas-led militants in the October 7 2023 attack that ignited the war.\nIsraeli troops have already begun limited operations in Gaza City’s Zeitoun neighbourhood and the built-up Jabaliya refugee camp, where they have carried out several previous major operations over the course of the war, only to see militants later regroup.\nThe military says it plans to operate in areas where ground troops have not yet entered and where it says Hamas still has military and governing capabilities.\nThere has been little sign of Palestinians fleeing en masse, as they did when Israel carried out an earlier offensive in Gaza City in the opening weeks of the war. The military says it controls around 75% of Gaza and residents say nowhere in the territory feels safe.\nHundreds gathered in Gaza City on Thursday for a rare protest against the war and Israel’s plans to support the mass relocation of Palestinians to other countries.\nUnlike in previous protests, there were no expressions of opposition to Hamas.\nIn Israel, families of some of the 50 hostages still being held in Gaza gathered in Tel Aviv to condemn the expanded operation. Israel believes around 20 hostages are still alive.\n“Forty-two hostages were kidnapped alive and murdered in captivity due to military pressure and delay in signing a deal,” said Dalia Cusnir, whose brother-in-law Eitan Horn is still being held captive. Mr Horn’s brother Iair was released during a ceasefire earlier this year.\n“Enough to sacrifice the hostages. Enough to sacrifice the soldiers, both regular and reservists. Enough to sacrifice the evacuees. Enough to sacrifice the younger generation in the country,” said Bar Goddard, daughter of Meni Goddard, whose body is being held by Hamas.\nAdditional protests are planned for Thursday night in Tel Aviv.\nPlans for widening the offensive have sparked international outrage, with many of Israel’s closest western allies — but not the US — calling on it to end the war.\n“I must reiterate that it is vital to reach immediately a ceasefire in Gaza, and the unconditional release of all hostages to avoid the massive death and destruction that a military operation against Gaza City would inevitably cause,” United Nations chief Antonio Guterres said.\nAt least 36 Palestinians were killed by Israeli fire across the Gaza Strip on Thursday, including 14 who were seeking humanitarian aid, according to local hospitals.\nThe Israeli military said it killed several armed militants in the Morag Corridor, a military zone where people seeking aid have repeatedly come under fire in recent weeks, according to witnesses and health officials.\nNasser Hospital in southern Gaza had earlier reported that six people were killed in that area while seeking aid on Thursday. It was not possible to reconcile the two accounts.\nThe Media Freedom Coalition, which promotes press freedoms worldwide, called for Israel to allow independent, foreign news organisations access to Gaza. Aside from rare guided tours, Israel has barred international media from the war which has killed at least 184 Palestinian journalists and media workers.\n“Journalists and media workers play an essential role in putting the spotlight on the devastating reality of war,” said a statement signed by 27 of the coalition’s member countries.\nWitnesses, health officials and the UN human rights office say Israeli forces have killed hundreds of people since May as they headed towards sites run by the Gaza Humanitarian Foundation (GHF), an Israeli-backed American contractor, and in the chaos surrounding UN aid convoys, which are frequently attacked by looters and overrun by crowds.\nThe Israeli military says it has only fired warning shots at people who approach its forces. The GHF says there has been almost no violence at the sites, and that its armed contractors have only used pepper spray and fired into the air on some occasions to prevent deadly crowding.\nIsraeli air strikes also destroyed a tent camp in Deir al-Balah, the only city in Gaza that has been relatively unscathed in the war and where many have sought refuge. Residents said the military warned them to flee shortly before the strikes set the camp ablaze, and there were no reports of casualties.\nFamilies, many with children, could later be seen sifting through the ashes for the belongings they had managed to take with them during earlier evacuations.\nMohammad Kahlout, who had been displaced from northern Gaza, said they were given just five minutes to gather what they could and evacuate. “We are civilians, not terrorists. What did we do, and what did our children do, to be displaced again?”"
    },
    {
      "news_title": "Netanyahu orders start of immediate talks to release Gaza hostages",
      "news_link": "https://www.nzherald.co.nz/world/netanyahu-orders-talks-to-release-remaining-hostages-as-israel-plans-gaza-offensive/E2LGY5N5ZRCV5B5BNGJFUJVWBI/",
      "bias": "Center",
      "text": "Israeli Prime Minister Benjamin Netanyahu has ordered the beginning of immediate negotiations to release the remaining Israeli hostages in Gaza. Photo / Getty Images\nIsraeli Prime Minister Benjamin Netanyahu says he has ordered immediate negotiations aimed at freeing all the remaining hostages in Gaza, as Israeli troops hammered the territory’s largest city before a major planned offensive.\nThe call for renewed talks came a day after the Defence Ministry approved a plan authorising thecall-up of roughly 60,000 reservists to help capture Gaza City, home to Hamas’ final stronghold.\n“I have come to approve the IDF’s [military’s] plans to take control of Gaza City and defeat Hamas,” the Prime Minister said in a video statement filmed during a visit to the Gaza division’s headquarters in Israel.\n“At the same time, I have instructed to immediately begin negotiations for the release of all our hostages and the end of the war under conditions acceptable to Israel.”\n“These two matters – defeating Hamas and releasing all our hostages – go hand in hand,” Netanyahu said, without providing details about what the next stage of talks would entail.\nMediators have been waiting for days for an official Israeli response to their latest ceasefire proposal, which Hamas accepted earlier this week.\nPalestinian sources have said the new deal involves staggered hostage releases, while Israel has insisted that any deal see all the captives freed at once.\nIsrael’s plans to expand the fighting and seize Gaza City have sparked international outcry as well as domestic opposition, with the Red Cross joining the condemnation on Thursday, calling the moves “intolerable”.\nBefore the offensive, the Israeli military said the call-up of the reservists would begin in early September, adding the second phase of operation “Gideon’s Chariots” had begun.\nEarlier, Gaza City residents described relentless bombardments overnight.\n“The house shakes with us all night long - the sound of explosions, artillery, warplanes, ambulances, and cries for help is killing us,” Ahmad al-Shanti told AFP.\nAnother resident, Amal Abdel-Aal, said she watched the heavy strikes on the area, a week after being displaced from her home in Gaza City’s Al-Sabra neighbourhood.\n“No one in Gaza has slept - not last night, not for a week. The artillery and air strikes in the east never stop. The sky flashes all night long,” she added.\n‘We are advancing’\nA group of AFP journalists near Israel’s border with Gaza witnessed an air strike by a fighter jet on the northern outskirts of Gaza City on Thursday afternoon, with a massive explosion followed by a large plume of smoke rising into the sky.\nSeveral sporadic explosions were heard afterward but it was not possible to determine their origin.\nStrikes increased in pace later in the afternoon with several large explosions heard near the border.\n“We are advancing with the efforts toward operations in Gaza City,” military chief Eyal Zamir told troops on Thursday.\n“We already have troops operating on the outskirts of the city, and more forces will join them later on.”\nThe UN humanitarian agency has warned that the Israeli plan to expand military operations in Gaza City would have “a horrific humanitarian impact” on an already exhausted population.\nThe Israeli military said this week it had also begun informing medical personnel and aid groups in northern Gaza to start making evacuation plans and transferring their equipment to the south.\nThe Gaza health ministry, however, rejected that call on Thursday, saying it would not agree to “any step that would undermine what remains of the health system after the systematic destruction carried out by the occupation authorities”.\nAwaiting a response\nIsrael and Hamas have held indirect negotiations throughout the nearly two-year conflict, paving the way for a pair of short ceasefires during which Israeli hostages were freed in exchange for Palestinian prisoners.\nOf the 251 hostages seized during Hamas’ October 2023 attack on southern Israel that triggered the war, 49 are still in Gaza, including 27 the Israeli military says are dead.\nSources from Hamas and its ally Islamic Jihad told AFP that the latest ceasefire proposal calls for the release of 10 hostages and 18 bodies from Gaza. The remaining hostages would be released in a second phase alongside talks for a wider settlement.\nGaza’s civil defence agency said at least 48 people were killed on Thursday by Israeli attacks in various areas across the Palestinian territory, including several casualties in an air strike in Gaza City.\nHamas’ October 2023 attack on Israel resulted in the deaths of 1219 people, mostly civilians, according to an AFP tally based on official figures.\nIsrael’s offensive has killed over 62,000 Palestinians, most of them civilians, according to figures from the health ministry in Hamas-run Gaza, which the United Nations considers reliable.\nMedia restrictions in Gaza and difficulties in accessing many areas mean AFP is unable to independently verify the tolls and details provided by the civil defence agency or the Israeli military."
    },
    {
      "news_title": "Israel ramps up pressure on Gaza City as Palestinians flee ahead of occupation",
      "news_link": "https://www.independent.co.uk/news/world/middle-east/israel-gaza-city-palestine-netanyahu-war-b2811896.html",
      "bias": "Lean Left",
      "text": "Israel ramps up pressure on Gaza City as Palestinians face stark choice: ‘Die here or leave and die somewhere else’\nIsraeli PM signals restart of talks with Hamas over hostages – but will press ahead with assault on Gaza City\nThousands of Palestinians have fled their homes in Gaza City, as the Israeli military continues its assault on the enclave ahead of a planned occupation.\nIsrael’s prime minister, Benjamin Netanyahu, said he would give final approval for a full takeover, while also restarting negotiations with Hamas aimed at returning all of Israel's remaining hostages.\nThe widening of the 22-month offensive against Hamas appears to be proceeding despite protests in both Israel and the Palestinian enclave. Israeli strikes killed at least 36 Palestinians across Gaza on Thursday, according to local hospitals. A renewed offensive could bring even more casualties to and displacement from the territory, where the war has already killed tens of thousands and where experts warn of imminent famine.\nMilitary spokesperson Avichay Adraee said on X that Israeli forces had begun warning medical teams in northern Gaza that residents should prepare to move south.\nDescribing intense overnight shelling before a medical aid point was forced to close in the city on Tuesday, staff member Shireen Halasa said: “It was a terrifying night. The shelling did not stop for a single moment. My heart almost stopped. We were treating around 100 children daily, many suffering from severe malnutrition, but we were forced to close while running for our lives.”\nMeanwhile, a United Nations-backed hunger monitor is poised to declare famine in Gaza for the first time, a step it has taken only four times in nearly two decades.\nThe Integrated Food Security Phase Classification (IPC) has never before flagged famine in Gaza, but its latest analysis warns conditions have reached “worst-case scenario” levels. According to the Telegraph, the official declaration will be made tomorrow. The group warned in July that famine in Gaza was imminent.\nThe declaration will cover Gaza City and three surrounding towns, as well as several refugee camps, according to a briefing.\nIsraeli troops have established a foothold on the city’s outskirts, and an IDF spokesperson said on Wednesday that forces were already operating in Zeitoun and Jabalia as they laid the groundwork for a broader offensive.\nThousands of residents fled the Zeitoun and Sabra neighbourhoods after heavy overnight bombardment, while shelling also intensified in the Sabra and Tuffah areas. Around 75 per cent of Gaza is already largely destroyed and controlled by Israel.\n“We are facing a bitter, bitter situation: to die at home or leave and die somewhere else. As long as this war continues, survival is uncertain,\" said Rabah Abu Elias, 67, a father of seven. “In the news, they speak about a possible truce; on the ground, we only hear explosions and see deaths. To leave Gaza City or not isn’t an easy decision to make.”\nIsrael has said it will call up to 60,000 reservists for the new offensive and other heavily populated areas of the war-torn Gaza Strip.\nMr Netanyahu’s plan triggered local and global outrage when it was first announced, with UK prime minister Sir Keir Starmer saying it would “only bring more bloodshed”.\nHamas, in a statement on Telegram, accused Mr Netanyahu of obstructing the ceasefire deal in favour of continuing a “brutal war against innocent civilians in Gaza City”.\nHamas has accepted a 60-day ceasefire, which the Israeli government has yet to officially respond to. It calls for the release of 10 hostages held by Hamas and 18 bodies, in return for about 200 long-serving Palestinian prisoners held by Israel. The Israeli government has restated that all of the remaining 50 hostages must be released at once. Israeli officials believe that around 20 of them are still alive.\nIn Tel Aviv on Thursday evening, ahead of planned nationwide events, the Hostages and Missing Families Forum called on Israeli citizens to protest around the city’s Kirya military base to demand an end to the war.\n“Forty-two hostages were kidnapped alive and murdered in captivity due to military pressure and delay in signing a deal,” said Dalia Cusnir, whose brother-in-law, Eitan Horn, is still being held captive. Mr Horn’s brother Iair was released during a ceasefire earlier this year.\n“Enough to sacrifice the hostages. Enough to sacrifice the soldiers, both regular and reservists. Enough to sacrifice the evacuees. Enough to sacrifice the younger generation in the country,\" said Bar Godard, the daughter of Manny Godard, whose body is being held by Hamas.\nWomen and children held placards at a protest in Gaza City reading “Save Gaza” and “Stop the war, stop the savage attack, save us” against a backdrop of destroyed buildings as Palestinian music played.\n“We want the war on Gaza to stop. We don’t want to migrate. Twenty-two months — it’s enough. Enough death. Enough destruction,” said Bisan Ghazal, a woman displaced from Gaza City.\nMr Netanyahu is also under pressure from some ministers to reject a temporary ceasefire and pursue annexation of the territory. On Wednesday, the far-right finance minister, Bezalel Smotrich, announced the approval of a controversial settlement project in the E1 area of the occupied West Bank that he said would erase any prospect of a Palestinian state.\nIn response, foreign ministers from Europe, Australia, Canada and Japan issued a joint statement on Thursday condemning the plan. The UK Foreign Office summoned Israeli ambassador Tzipi Hotovely over Tel Aviv’s approval.\nAs the offensive escalates, the starvation crisis is continuing to unfold in Gaza. The enclave’s Hamas-run health ministry announced that at least two people died from starvation in the last 24 hours, and at least 18 people died while collecting aid.\nThe United Nations Palestinian refugee agency chief said the famine was “deliberate” and warned that malnourished children in Gaza could die without immediate emergency aid during Israel’s Gaza City operation. Only 250 of an expected 1,800 aid trucks entered Gaza over the past three days, Gaza’s government media office said.\nMore than 62,000 Palestinians have died since 7 October 2023, according to the health ministry, following Hamas’s massacre of some 1,200 people and the kidnapping of around 250 more.\nJoin our commenting forum\nJoin thought-provoking conversations, follow other Independent readers and see their replies\nComments"
    },
    {
      "news_title": "Netanyahu Says Israel to Begin Gaza Ceasefire Negotiations to End War, Release Hostages",
      "news_link": "https://www.usnews.com/news/world/articles/2025-08-21/netanyahu-says-israel-to-begin-gaza-ceasefire-negotiations-to-end-war-release-hostages",
      "bias": "Lean Left",
      "text": null
    },
    {
      "news_title": "Netanyahu says Israel to begin Gaza ceasefire negotiations to end war, release hostages",
      "news_link": "https://www.reuters.com/world/middle-east/netanyahu-says-israel-begin-gaza-ceasefire-negotiations-end-war-release-hostages-2025-08-21/",
      "bias": "Center",
      "text": null
    },
    {
      "news_title": "Netanyahu orders Gaza hostage talks as Israel plans city capture and Hamas defeat",
      "news_link": "https://www.indiatoday.in/world/story/israel-to-begin-gaza-ceasefire-negotiations-to-end-war-release-hostages-says-benjamin-netanyahu-2774939-2025-08-21",
      "bias": "Lean Right",
      "text": "Netanyahu orders Gaza hostage talks as Israel plans city capture and Hamas defeat\nNetanyahu says Israel will start immediate negotiations for hostage release and end the war on acceptable terms, while approving Gaza City capture plans and maintaining military pressure against Hamas.\nPrime Minister Benjamin Netanyahu on Thursday confirmed that Israel will start immediate negotiations for the release of all hostages held in Gaza, signalling a potential move toward ending the nearly two-year-old conflict on terms “acceptable to Israel.”\nSpeaking directly to soldiers in Gaza, Netanyahu said he had met commanders to approve plans for capturing Gaza City and defeating Hamas. “We are at the stage of decisive victory. I came today to the Gaza Division in order to approve the plans that the IDF presented to me and to the Defense Minister for taking control of the city of Gaza and for defeating Hamas,” he stated.\n“At the same time, I instructed to begin immediate negotiations for the release of all our hostages and for ending the war under conditions acceptable to Israel,” Netanyahu added, referring to the cabinet’s earlier decision that Israel will only agree to end the war if Hamas releases all hostages at once.\n“These two things — the defeat of Hamas and the release of all our hostages — go hand in hand,” he emphasized, praising the mobilization of reserve soldiers alongside the standing army for what he called a “vital mission.”\nThe Israeli military continues to press its operations in Gaza City, calling up 60,000 reservists as part of its broader strategy, despite international condemnation.\nWhile Hamas has accepted a proposal for a 60-day ceasefire, including the release of 10 living hostages and 18 bodies in exchange for about 200 Palestinian prisoners, Israel has yet to respond officially, insisting all remaining hostages be released at once.\n(With inputs from Reuters)"
    },
    {
      "news_title": "Gaza latest: Netanyahu says Israel will begin talks to free hostages and end war",
      "news_link": "https://news.sky.com/story/gaza-latest-israel-launches-first-stages-of-attack-on-gaza-city-13415481",
      "bias": "Center",
      "text": "The medical charity Medecins Sans Frontieres (MSF) has said it is \"outraged as the Israeli forces continue to attack healthcare workers and journalists with impunity\".\nJerome Grimaud, MSF emergency coordinator in Gaza, said in a statement that the charity \"denounce in the strongest possible terms Israel's horrendous attacks on the Nasser medical complex\".\nGrimaud noted that among the dead was Mariam Abu Dagga, a freelance photographer who frequently worked with MSF.\n\"We are heartbroken by her death. Mariam leaves behind a son who must now grow up without his mother. At least four other journalists were also killed today,\" Grimaud said.\nGrimaud noted that some MSF staff members were \"forced to shelter in the laboratory as Israel repeatedly struck the building amidst rescue efforts\".\n\"We are outraged as the Israeli forces continue to attack healthcare workers and journalists with impunity,\" Grimaud added."
    },
    {
      "news_title": "Netanyahu: Israel to begin Gaza ceasefire negotiations to end war, release hostages",
      "news_link": "https://english.alarabiya.net/News/middle-east/2025/08/21/netanyahu-israel-to-begin-gaza-ceasefire-negotiations-to-end-war-release-hostages",
      "bias": "Lean Right",
      "text": null
    },
    {
      "news_title": "Israel's Netanyahu set to give final approval for Gaza City takeover",
      "news_link": "https://www.latimes.com/world-nation/story/2025-08-21/israels-netanyahu-set-to-give-final-approval-for-gaza-city-takeover-despite-protests",
      "bias": "Lean Left",
      "text": "Israel’s Netanyahu set to give final approval for Gaza City takeover\n- Share via\nDEIR AL BALAH, Gaza Strip — Israeli Prime Minister Benjamin Netanyahu said Thursday he will give final approval for the takeover of Gaza City while also restarting negotiations with Hamas aimed at returning all the remaining hostages and ending the war on Israel’s terms.\nThe wide-scale operation in Gaza City could start within days after Netanyahu grants final approval at a meeting with senior security officials later Thursday. Hamas said earlier this week that it had agreed to a ceasefire proposal from Arab mediators, which — if accepted by Israel — could forestall the offensive.\nThe Israeli military has begun calling medical officials and international organizations in the northern Gaza Strip to encourage them to evacuate to the south ahead of the expanded operation. The military plans to call up 60,000 reservists and extend the service of 20,000 more.\nIsraeli strikes, meanwhile, killed at least 36 Palestinians Thursday across Gaza, according to local hospitals. A renewed offensive could bring even more casualties and displacement to the territory, where the war has already killed tens of thousands and where experts have warned of imminent famine.\nMany Israelis fear the operation could also doom the remaining 20 or so living hostages taken by Hamas-led militants in the Oct. 7, 2023, attack that ignited the war.\nGaza City operation could begin in days\nDuring a visit to the military’s Gaza command in southern Israel, Netanyahu said he would approve the army’s plans to retake Gaza City and had instructed officials “to begin immediate negotiations” for the release of all hostages “and an end to the war on terms acceptable to Israel.”\n“These two things — defeating Hamas and releasing all our hostages — go hand in hand,” he said.\nIt appeared to mark Israel’s first public response to the latest ceasefire proposal drawn up by Egypt and Qatar. Egyptian and Hamas officials say it is almost identical to an earlier one that Israel accepted before the talks stalled last month.\nThe proposal would include the release of some of the hostages in exchange for Palestinians imprisoned by Israel, a pullback of Israeli forces and negotiations over a more lasting ceasefire.\nIsraeli troops have already begun more limited operations in Gaza City’s Zeitoun neighborhood and the built-up Jabaliya refugee camp, areas where they have carried out several previous large-scale raids over the course of the war, only to see militants later regroup.\nThe military says it plans to operate in areas where ground troops have not yet entered and where it says Hamas still has military and governing capabilities.\nSo far, there has been little sign of Palestinians fleeing en masse, as they did when Israel carried out an earlier offensive in Gaza City in the opening weeks of the war. The military says it controls around 75% of Gaza, and residents say nowhere in the territory feels safe.\nProtests in Israel and Gaza\nHundreds gathered Thursday for a rare protest in Gaza City against the war and Israel’s plans to support the mass relocation of Palestinians to other countries.\nWomen and children held placards reading “Save Gaza” and “Stop the war, stop the savage attack, save us,” against a backdrop of destroyed buildings as Palestinian music played. Unlike in previous protests, there were no expressions of opposition to Hamas.\n“We want the war on Gaza to stop. We don’t want to migrate. Twenty-two months … it’s enough. Enough death. Enough destruction,” said Bisan Ghazal, a woman displaced from Gaza City.\nIn Israel, protesters marched Thursday night in Tel Aviv holding banners that read “The people will bring back the hostages” and “How much blood will be spilled?”\nAmong the demonstrators was Dudu Dotan, who said Netanyahu is endangering the remaining hostages by moving forward with the planned Gaza City offensive. Of the 50 still being held in Gaza, Israel believes about 20 hostages are still alive.\n“This way will not bring the hostages back,” Dotan said. “Every hostage he brought back, he brought back through deals. And every time he tried to bring them back with military force, he caused the hostages to be killed.”\nPlans for widening the offensive have also sparked international outrage, with many of Israel’s closest Western allies — but not the United States — calling on it to end the war.\nDozens killed across Gaza\nAt least 36 Palestinians were killed Thursday by Israeli fire across the Gaza Strip, including 14 who were seeking humanitarian aid, according to local hospitals. The military says it only targets militants and blames civilian deaths on Hamas because it operates in densely populated areas.\nThe Israeli military said it killed several armed militants in the Morag Corridor, a military zone where people seeking aid have repeatedly come under fire in recent weeks, according to witnesses and health officials. Nasser Hospital in southern Gaza had earlier reported that six people were killed in that area while seeking aid on Thursday. It was not possible to reconcile the two accounts.\nThe Media Freedom Coalition, which promotes press freedoms worldwide, called Thursday for Israel to allow independent foreign news organizations access to Gaza. Aside from rare guided tours, Israel has barred international media during the war, in which at least 184 Palestinian journalists and media workers have been killed.\n“Journalists and media workers play an essential role in putting the spotlight on the devastating reality of war,” said a statement signed by 27 of the coalition’s member countries.\nIsraeli strikes destroy evacuated tent camp\nIsraeli airstrikes also destroyed a tent camp in Deir al Balah, the only city in Gaza that has been relatively unscathed in the war and where many have sought refuge. Residents said the Israeli military warned them to flee shortly before the strikes set the camp ablaze, and there were no reports of casualties.\nFamilies, many with children, could later be seen sifting through the ashes for the belongings they had managed to take with them during earlier evacuations.\nMohammad Kahlout, who had been displaced from northern Gaza, said they were given just five minutes to gather what they could and evacuate. “We are civilians, not terrorists. What did we do, and what did our children do, to be displaced again?”\nThe Gaza Health Ministry said Thursday that at least 62,192 Palestinians have been killed in the war. Two more people have died from malnutrition-related causes, bringing the total number of such deaths to 271, including 112 children, the Health Ministry said.\nThe ministry is part of the Hamas-run government and staffed by medical professionals. It does not say whether those killed by Israeli fire are civilians or combatants, but it says around half were women and children. The U.N. and many independent experts consider its figures to be the most reliable estimate of wartime casualties. Israel disputes its toll but has not provided its own.\nHamas-led militants started the war when they attacked Israel on Oct. 7, 2023, killing some 1,200 people, mostly civilians, and abducting 251. Most of the hostages have been released in ceasefires or other deals. Hamas says it will free the rest only in exchange for a lasting ceasefire and an Israeli withdrawal.\nShurafa, Abou Aljoud and Lidman write for the Associated Press. Abou Aljoud reported from Beirut and Lidman reported from Jerusalem. Mari Yamaguchi contributed to this report from Tokyo.\nMore to Read\nSign up for Essential California\nThe most important California stories and recommendations in your inbox every morning.\nYou may occasionally receive promotional content from the Los Angeles Times."
    },
    {
      "news_title": "Israel will push ahead with Gaza City takeover, renewed ceasefire talks, says Netanyahu",
      "news_link": "https://www.thehindu.com/news/international/netanyahu-pushes-forward-with-gaza-city-operation-despite-opposition/article69960445.ece",
      "bias": "Lean Left",
      "text": "Israeli Prime Minister Benjamin Netanyahu said on Thursday (August 21, 2025) he will give final approval for the takeover of Gaza City while also restarting negotiations with Hamas aimed at returning all the remaining hostages and ending the war on Israel's terms.\nThe wide-scale operation in Gaza City could start within days after Mr. Netanyahu grants final approval at a meeting with senior security officials later on Thursday. Hamas said earlier this week that it had agreed to a ceasefire proposal from Arab mediators, which — if accepted by Israel — could forestall the offensive.\nThe Israeli military has begun calling medical officials and international organisations in the northern Gaza Strip to encourage them to evacuate to the south ahead of the expanded operation. The military plans to call up 60,000 reservists and extend the service of 20,000 more.\nIsraeli strikes meanwhile killed at least 36 Palestinians across Gaza on Thursday, according to local hospitals. A renewed offensive could bring even more casualties and displacement to the territory, where the war has already killed tens of thousands and where experts have warned of imminent famine.\nMany Israelis fear it could also doom the remaining 20 or so living hostages taken by Hamas-led militants in the October 7, 2023 attack that ignited the war.\nGaza City operation could begin in days\nDuring a visit to the military's Gaza command in southern Israel, Mr. Netanyahu said he would approve the Army's plans to retake Gaza City, and had instructed officials \"to begin immediate negotiations on the release of all our hostages and an end to the war on terms acceptable to Israel.”\n\"These two things — defeating Hamas and releasing all our hostages — go hand in hand,\" he said.\nIt appeared to mark Israel's first public response to the latest ceasefire proposal drawn up by Egypt and Qatar, which Egyptian and Hamas officials say is almost identical to an earlier one that Israel accepted before the talks stalled last month.\nThe proposal would include the release of some of the hostages in exchange for Palestinians imprisoned by Israel, a pullback of Israeli forces and negotiations over a more lasting ceasefire.\nIsraeli troops have meanwhile already begun more limited operations in Gaza City's Zeitoun neighbourhood and the built-up Jabaliya refugee camp, areas where they have carried out several previous large-scale raids over the course of the war, only to see militants later regroup.\nThe military says it plans to operate in areas where ground troops have not yet entered and where it says Hamas still has military and governing capabilities.\nSo far, there has been little sign of Palestinians fleeing en masse, as they did when Israel carried out an earlier offensive in Gaza City in the opening weeks of the war. The military says it controls around 75 per cent of Gaza and residents say nowhere in the territory feels safe.\nProtests in Israel and Gaza Hundreds gathered for a rare protest in Gaza City on Thursday against the war and Israel's plans to support the mass relocation of Palestinians to other countries.\nWomen and children held placards reading “Save Gaza” and “Stop the war, stop the savage attack, save us,” against a backdrop of destroyed buildings as Palestinian music played. Unlike in previous protests, there were no expressions of opposition to Hamas.\n“We want the war on Gaza to stop. We don't want to migrate. Twenty-two months … it's enough. Enough death. Enough destruction,” said Bisan Ghazal, a woman displaced from Gaza City.\nIn Israel, families of some of the 50 hostages still being held in Gaza gathered in Tel Aviv to condemn the expanded operation. Israel believes around 20 hostages are still alive.\n“Forty-two hostages were kidnapped alive and murdered in captivity due to military pressure and delay in signing a deal,\" said Dalia Cusnir, whose brother-in-law, Eitan Horn, is still being held captive. Eitan's brother, Iair Horn, was released during a ceasefire earlier this year.\nAdditional protests are planned for Thursday night in Tel Aviv.\nPlans for widening the offensive have also sparked international outrage, with many of Israel's closest Western allies — but not the United States — calling on it to end the war.\n“I must reiterate that it is vital to reach immediately a ceasefire in Gaza, and the unconditional release of all hostages to avoid the massive death and destruction that a military operation against Gaza City would inevitably cause,” United Nations chief António Guterres said at a conference in Japan.\nDozens killed across Gaza\nAt least 36 Palestinians were killed by Israeli fire across the Gaza Strip on Thursday, including 14 who were seeking humanitarian aid, according to local hospitals. The military says it only targets militants and blames civilian deaths on Hamas because it operates in densely populated areas.\nThe Israeli military said it killed several armed militants in the Morag Corridor, a military zone where people seeking aid have repeatedly come under fire in recent weeks, according to witnesses and health officials. Nasser Hospital in southern Gaza had earlier reported that six people were killed in that area while seeking aid on Thursday. It was not possible to reconcile the two accounts.\nThe Media Freedom Coalition, which promotes press freedoms worldwide, called Thursday for Israel to allow independent, foreign news organizations access to Gaza. Aside from rare guided tours, Israel has barred international media during the war, in which at least 184 Palestinian journalists and media workers have been killed.\n“Journalists and media workers play an essential role in putting the spotlight on the devastating reality of war,” said a statement signed by 27 of the coalition's member countries.\nIsraeli strikes destroy evacuated tent camp\nIsraeli airstrikes also destroyed a tent camp in Deir al-Balah, the only city in Gaza that has been relatively unscathed in the war and where many have sought refuge. Residents said the Israeli military warned them to flee shortly before the strikes set the camp ablaze, and there were no reports of casualties.\nFamilies, many with children, could later be seen sifting through the ashes for the belongings they had managed to take with them during earlier evacuations.\nMohammad Kahlout, who had been displaced from northern Gaza, said they were given just five minutes to gather what they could and evacuate. “We are civilians, not terrorists. What did we do, and what did our children do, to be displaced again?\"\nThe Gaza Health Ministry said Thursday that at least 62,192 Palestinians have been killed in the war. Another two people have died from malnutrition-related causes, bringing the total number of such deaths to 271, including 112 children, the Health Ministry said.\nThe Ministry is part of the Hamas-run government and staffed by medical professionals. It does not say whether those killed by Israeli fire are civilians or combatants, but it says around half are women and children. The UN and many independent experts consider its figures to be the most reliable estimate of wartime casualties. Israel disputes its toll but has not provided its own.\nHamas-led militants started the war when they attacked Israel on Oct. 7, 2023, killing some 1,200 people, mostly civilians, and abducting 251. Most of the hostages have been released in ceasefires or other deals. Hamas says it will only free the rest in exchange for a lasting ceasefire and an Israeli withdrawal.\nPublished - August 21, 2025 07:32 pm IST"
    },
    {
      "news_title": "Netanyahu says he will push ahead with Gaza City takeover and renewed ceasefire talks",
      "news_link": "https://apnews.com/article/israel-palestinians-hamas-gaza-war-hostages-protest-08-21-2025-8a99e26655548972bea7c53b0570c751",
      "bias": "Lean Left",
      "text": "Netanyahu says he will push ahead with Gaza City takeover and renewed ceasefire talks\nNetanyahu says he will push ahead with Gaza City takeover and renewed ceasefire talks\nDEIR AL-BALAH, Gaza Strip (AP) — Israeli Prime Minister Benjamin Netanyahu said Thursday he will give final approval for the takeover of Gaza City while also restarting negotiations with Hamas aimed at returning all the remaining hostages and ending the war on Israel’s terms.\nThe wide-scale operation in Gaza City could start within days. Netanyahu’s approval was expected during a meeting with senior security officials late Thursday, but no decision was announced before midnight in Jerusalem. Hamas said earlier this week that it had agreed to a ceasefire proposal from Arab mediators, which — if accepted by Israel — could forestall the offensive.\nThe Israeli military has begun calling medical officials and international organizations in the northern Gaza Strip to encourage them to evacuate to the south ahead of the expanded operation. The military plans to call up 60,000 reservists and extend the service of 20,000 more.\nIsraeli strikes, meanwhile, killed at least 36 Palestinians Thursday across Gaza, according to local hospitals. A renewed offensive could bring even more casualties and displacement to the territory, where the war has already killed tens of thousands and where experts have warned of imminent famine.\nAP correspondent Karen Chammas reports on more Palestinians killed whilst getting aid in Gaza by Israeli troops as Israel plans to send tens of thousands more into the besieged territory.\nMany Israelis fear the operation could also doom the remaining 20 or so living hostages taken by Hamas-led militants in the Oct. 7, 2023, attack that ignited the war.\nGaza City operation could begin in days\nDuring a visit to the military’s Gaza command in southern Israel, Netanyahu said he would approve the army’s plans to retake Gaza City and had instructed officials “to begin immediate negotiations” for the release of all hostages “and an end to the war on terms acceptable to Israel.”\n“These two things — defeating Hamas and releasing all our hostages — go hand in hand,” he said.\nIt appeared to mark Israel’s first public response to the latest ceasefire proposal drawn up by Egypt and Qatar. Egyptian and Hamas officials say it is almost identical to an earlier one that Israel accepted before the talks stalled last month.\nThe proposal would include the release of some of the hostages in exchange for Palestinians imprisoned by Israel, a pullback of Israeli forces and negotiations over a more lasting ceasefire.\nIsraeli troops have already begun more limited operations in Gaza City’s Zeitoun neighborhood and the built-up Jabaliya refugee camp, areas where they have carried out several previous large-scale raids over the course of the war, only to see militants later regroup.\nThe military says it plans to operate in areas where ground troops have not yet entered and where it says Hamas still has military and governing capabilities.\nSo far, there has been little sign of Palestinians fleeing en masse, as they did when Israel carried out an earlier offensive in Gaza City in the opening weeks of the war. The military says it controls around 75% of Gaza, and residents say nowhere in the territory feels safe.\nProtests in Israel and Gaza\nHundreds gathered Thursday for a rare protest in Gaza City against the war and Israel’s plans to support the mass relocation of Palestinians to other countries.\nWomen and children held placards reading “Save Gaza” and “Stop the war, stop the savage attack, save us,” against a backdrop of destroyed buildings as Palestinian music played. Unlike in previous protests, there were no expressions of opposition to Hamas.\n“We want the war on Gaza to stop. We don’t want to migrate. Twenty-two months … it’s enough. Enough death. Enough destruction,” said Bisan Ghazal, a woman displaced from Gaza City.\nIn Israel, protesters marched Thursday night in Tel Aviv holding banners that read “The people will bring back the hostages” and “How much blood will be spilled?”\nAmong the demonstrators was Dudu Dotan, who said Netanyahu is endangering the remaining hostages by moving forward with the planned Gaza City offensive. Of the 50 still being held in Gaza, Israel believes about 20 hostages are still alive.\n“This way will not bring the hostages back,” Dotan said. “Every hostage he brought back, he brought back through deals. And every time he tried to bring them back with military force, he caused the hostages to be killed.”\nPlans for widening the offensive have also sparked international outrage, with many of Israel’s closest Western allies — but not the United States — calling on it to end the war.\nDozens killed across Gaza\nAt least 36 Palestinians were killed Thursday by Israeli fire across the Gaza Strip, including 14 who were seeking humanitarian aid, according to local hospitals. The military says it only targets militants and blames civilian deaths on Hamas because it operates in densely populated areas.\nThe Israeli military said it killed several armed militants in the Morag Corridor, a military zone where people seeking aid have repeatedly come under fire in recent weeks, according to witnesses and health officials. Nasser Hospital in southern Gaza had earlier reported that six people were killed in that area while seeking aid on Thursday. It was not possible to reconcile the two accounts.\nThe Media Freedom Coalition, which promotes press freedoms worldwide, called Thursday for Israel to allow independent foreign news organizations access to Gaza. Aside from rare guided tours, Israel has barred international media during the war, in which at least 184 Palestinian journalists and media workers have been killed.\n“Journalists and media workers play an essential role in putting the spotlight on the devastating reality of war,” said a statement signed by 27 of the coalition’s member countries.\nIsraeli strikes destroy evacuated tent camp\nIsraeli airstrikes also destroyed a tent camp in Deir al-Balah, the only city in Gaza that has been relatively unscathed in the war and where many have sought refuge. Residents said the Israeli military warned them to flee shortly before the strikes set the camp ablaze, and there were no reports of casualties.\nFamilies, many with children, could later be seen sifting through the ashes for the belongings they had managed to take with them during earlier evacuations.\nMohammad Kahlout, who had been displaced from northern Gaza, said they were given just five minutes to gather what they could and evacuate. “We are civilians, not terrorists. What did we do, and what did our children do, to be displaced again?”\nThe Gaza Health Ministry said Thursday that at least 62,192 Palestinians have been killed in the war. Another two people have died from malnutrition-related causes, bringing the total number of such deaths to 271, including 112 children, the Health Ministry said.\nThe ministry is part of the Hamas-run government and staffed by medical professionals. It does not say whether those killed by Israeli fire are civilians or combatants, but it says around half were women and children. The U.N. and many independent experts consider its figures to be the most reliable estimate of wartime casualties. Israel disputes its toll but has not provided its own.\nHamas-led militants started the war when they attacked Israel on Oct. 7, 2023, killing some 1,200 people, mostly civilians, and abducting 251. Most of the hostages have been released in ceasefires or other deals. Hamas says it will only free the rest in exchange for a lasting ceasefire and an Israeli withdrawal.\n___\nAbou Aljoud reported from Beirut, and Lidman reported from Jerusalem. Associated Press Writer Mari Yamaguchi contributed from Tokyo.\n___\nFollow AP’s war coverage at https://apnews.com/hub/israel-hamas-war"
    },
    {
      "news_title": "Netanyahu to review Gaza City takeover plans with security chiefs",
      "news_link": "https://www.i24news.tv/en/news/israel-at-war/artc-netanyahu-s-cabinet-set-to-meet-to-approve-plans-for-full-gaza-takeover",
      "bias": "Lean Right",
      "text": "- i24NEWS\n- Israel-Hamas war\n- Netanyahu to review Gaza City takeover plans with security chiefs\nNetanyahu to review Gaza City takeover plans with security chiefs\nHe will be meeting on Thursday with Israel's Defense Minister, Chief of Staff, and other IDF chiefs as troops begin operating in Gaza City against international pressure\nRecommended -\nNetanyahu is expected to hold a small consultations today where he will be presented with operational plans for approval on the Gaza City takeover with Israel's defense minister, chief of staff, and other IDF chiefs.\nThe meetings are taking place after the IDF announced the first steps of the second phase of its operation to take over the Strip and disarm Hamas had begun on Wednesday, while the international community continues to pressure Israel to accept Hamas's proposal and stop the fighting.\n\"We have begun the preliminary operations and the first stages of the attack on Gaza City, and already now IDF forces are holding the outskirts of Gaza City,\" Brigadier General Effie Defrin, Israel's military spokesperson told reporters.\nThe operation saw the IDF call up tens of thousands of reservists, while the government considered a new ceasefire proposal, accepted by Hamas, to implement a 60-day pause of nearly two years of war, which began with Hamas's massacre on October 7, 2023.\nThe IDF told reporters reserve soldiers would not report for duty until September in order to create an interval that would give mediators some time to reach ceasefire terms both Hamas and Israel could agree to. But after Israeli troops clashed with Hamas fighters in Gaza on Wednesday, Netanyahu's cabinet said he sped up the timeline for taking control of and disarming Hamas's military capabilities.\nStatements have signaled Israel was pushing forward with its plan to take over Gaza City despite international criticism of the operation, saying it was likely to force the displacement of many more Palestinians.\nFamilies of the Israeli hostages also have protested against the operation, taking to the streets over the past week with hundreds of thousands of supporters, rallying against the operation they fear would endanger the lives of the remaining Israeli hostages.\n\"Netanyahu now wants less of a partial deal. He understands that a partial deal is not the right thing, and understands that it will be very difficult to resume fighting after a 60-day ceasefire,\" A senior Israeli government official said to Hebrew media.\nHe also said the US is also expecting the fighting to end, and Netanyahu is aware that he will have difficulty getting their backing if he tries to continue the fighting."
    },
    {
      "news_title": "Netanyahu Encourages Troops, Ponders Ceasefire as Hundreds of North American Jews Immigrate to Israel",
      "news_link": "https://cbn.com/news/israel/netanyahu-encourages-troops-ponders-ceasefire-hundreds-north-american-jews-immigrate",
      "bias": "Right",
      "text": "Netanyahu Encourages Troops, Ponders Ceasefire as Hundreds of North American Jews Immigrate to Israel\nTEL AVIV, Israel – Israeli Prime Minister Benjamin Netanyahu is weighing a ceasefire and hostage deal with Hamas, even as Israel's military presses its offensive in Gaza to eliminate the terrorists. At the same time, hundreds of Jews from North America are moving to Israel to start new lives despite the war.\nSince the last ceasefire ended in March, the Israel Defense Forces say they've eliminated more than 2,100 Hamas operatives, including senior commanders, and now control 75 percent of the Gaza Strip.\nDuring a visit to the IDF's Gaza Division, the prime minister praised the troops.\n\"First, on your behalf, that of the government of Israel, and for myself, deepest appreciation for the great achievements of the IDF in the war of redemption, the war on seven fronts. Second, I was impressed by the fighting spirit and determination to complete the defeat of Hamas and the release of all of our hostages,\" Netanyahu said.\nVideo footage from southern Gaza on Wednesday shows a rare Hamas attack, when 18 operatives tried to raid an IDF camp. Three soldiers were wounded, one seriously. Reports say the gunmen were trying to kidnap troops.\nIn Jerusalem, IDF leaders reviewed plans to capture Gaza City. The military operation called Gideon's Chariots II is being presented to Netanyahu, who ordered the city to be taken even faster.\nNetanyahu also commended U.S. Secretary of State Marco Rubio for imposing more sanctions on International Criminal Court judges for targeting Israeli leaders. Rubio called the court a \"national security threat.\"\nMeanwhile, Israeli Finance Minister Bezalel Smotrich announced a project to build 3,400 housing units in the E-1 Corridor, a disputed area of the West Bank just outside Jerusalem.\n\"The time has come to fully apply Israeli sovereignty over Judea and Samaria, the West Bank, to forever remove from the table the idea of dividing the land and to make sure that by September, Europe's hypocrite leaders will simply have nothing to recognize,\" Smotrich asserted.\n***Please sign up for CBN Newsletters and download the CBN News app to ensure you keep receiving the latest news from a distinctly Christian perspective.***\nWednesday also marked the first Aliyah flight since October 7th, 2023, bringing 225 Jewish Americans and Canadians to make Israel their home. They were greeted by an enthusiastic crowd, with music and dancing.\nDavid Tauber was a Philadelphia pediatrician. He's now moving his family to Israel.\nHe told CBN News, \"We’re fulfilling the dream of dreams. We are trying to come and rebuild the land and be part of the Jewish people who have been going through a lot the last couple of years. We’re actually building a history and being part of the future here in a real way.\"\nIn Hebrew, Ailyah means \"to ascend\" or \"go up,\" a reference to biblical times when Jews went up to Jerusalem for the Feasts. For some here, it's fulfilling a lifelong dream and a new beginning, even a chance to help out during war.\nLeah and Maya are relocating to Israel from St. Louis and Los Angeles. They told us, \"It's great. It's overwhelming. And it's really cool to see everyone out here like this.\"\nThe two will be enlisting in a program that helps IDF soldiers.\nLeah commented, \"It feels right. Home is home, and I think it feels the most right for me personally to come give back, and that is where I feel closest to my family and to myself.\"\nMaya agrees. \"I'm the same way,\" she said. \"I feel that is the right thing for me, and I feel very connected to Israel. It’s the place I want to be.\""
    },
    {
      "news_title": "Netanyahu orders ‘immediate negotiations’ to release hostages as Israel advances Gaza City operation - Egypt Independent",
      "news_link": "https://www.egyptindependent.com/netanyahu-orders-immediate-negotiations-to-release-hostages-as-israel-advances-gaza-city-operation/",
      "bias": "unknown",
      "text": "Israeli Prime Minister Benjamin Netanyahu says he has ordered negotiations for the release of all hostages and an end to the war in Gaza “on terms acceptable to Israel.”\nThe Israel military still intends to advance plans to take control of Gaza City, Netanyahu said.\nThe Israeli leader’s remarks came in a video recorded on Thursday, ahead of a high-level security meeting Netanyahu convened with defense chiefs and cabinet ministers focused on approving the operational plans to take Gaza City and “decisively defeat Hamas.”\nA spokesperson for the Israel Defense Forces (IDF) said the Israeli military is already on the outskirts of Gaza City, and local residents told CNN on Friday that the city was under under shelling all night. Multiple casualties have been reported, including several children killed in a strike on a school.\nNetanyahu stressed that Israel is now at a critical juncture.\n“We are at the decisive stage,” he said, underlining that “defeating Hamas and securing the release of all hostages go hand in hand.”\nThis is the first time Netanyahu has publicly addressed the Gaza war ceasefire talks since Hamas responded positively earlier this week to the latest proposal put forth by mediators from Qatar and Egypt.\nStill, the Israeli prime minister did not say to whom he had given the order to start immediate negotiations and avoided referring to the current proposal framework, which begins with a 60-day ceasefire during which half of the remaining Israeli hostages are to be released.\nIsraeli officials believe that 50 hostages remain in Gaza, at least 20 of whom are thought to be alive.\nIn his recent public statements and official briefings, Netanyahu has emphasized that Israel is seeking a comprehensive agreement that would secure the release of all hostages and meet Israel’s conditions for ending the war.\nHe continues to push forward plans for a massive assault on Gaza City, and on Wednesday instructed the military to shorten the timeline of the operation – despite concern from residents of Gaza City, who have described Israel’s plans as the “beginning of a new war.”\nThe humanitarian situation in the city – the largest in northern Gaza – is already dire.\nThe Integrated Food Security Phase Classification (IPC), a UN-backed program, said on Friday that famine has been confirmed in the Gaza Governorate, which includes Gaza City.\nMeanwhile, deadly strikes continue on daily basis. At least 18 Palestinians, including several children, have been killed in a series of Israeli strikes against a school in the city on Friday morning, according to Fares Afana, who heads the emergency services in northern Gaza.\nHe told CNN that the Omar Ibn Al-A’as school, which has been used as a shelter for displaced people, was targeted by artillery fire.\n“The school yard was packed with tents and residents, many of which are women and children,” Afana told CNN.\nIsrael has called up tens of thousands of reservists to take part in the impending military operation.\n“We are at the stage of decision,” Netanyahu said in a video address. “Today I came to the Gaza Division to approve the plans that the (Israel Defense Forces) presented to me and to the minister of defense for taking control of Gaza City and defeating Hamas.”\nAt the same time, Netanyahu refrained from making any official reference to the mediators’ proposal, leaving open the possibility of a partial agreement.\nTwo Israeli sources say that Netanyahu is managing the developments under tight secrecy and confidentiality.\nCNN’s Ibrahim Dahman and Kareem Khadder contributed reporting."
    },
    {
      "news_title": "Netanyahu Agrees to Gaza Truce Talks Amid Plans to Seize City",
      "news_link": "https://mediatalkafrica.com/229607/netanyahu-agrees-to-gaza-truce-talks-amid-plans-to-seize-city/",
      "bias": "unknown",
      "text": "Israeli Prime Minister Benjamin Netanyahu has announced that negotiations for the release of all hostages and an end to the nearly two-year war in Gaza will resume immediately. Speaking to soldiers near Israel’s border with Gaza, Netanyahu stated that he is still set on approving plans to defeat Hamas and capture Gaza City.\n“We are in the decision-making stage,” Netanyahu said. “I have come to the Gaza division today to approve the plans that the army presented to me and the minister of defence for taking over Gaza City.” He added that negotiations for the release of hostages and an end to the war will begin immediately, on terms acceptable to Israel.\nThis development comes as thousands of Palestinians have fled their homes in recent days, fearing an impending Israeli military operation. Israeli tanks have been edging closer to the densely populated city, and residents of Gaza City staged a rare protest on Thursday, expressing growing despair at the conditions in the enclave.\nNetanyahu’s remarks came ahead of a high-level security meeting with defence chiefs and cabinet ministers to approve operational plans. He emphasized that defeating Hamas and securing the release of all hostages go hand in hand, but did not specify who would be involved in the negotiations.\nThe Israeli prime minister’s statement is a response to a temporary ceasefire proposal, accepted by Hamas earlier this week, which was put forward by mediators from Qatar and Egypt. However, Netanyahu did not refer to the current proposal, which includes a 60-day ceasefire and the release of half of the remaining Israeli hostages.\nIsraeli officials believe that 50 people remain captive in Gaza, with at least 20 thought to be alive. The proposal calls for negotiations on a permanent ceasefire, including the return of remaining hostages, once the temporary ceasefire begins.\nThe plan to seize Gaza City was approved by the security cabinet, which Netanyahu chairs, despite many of Israel’s closest allies urging the government to reconsider. The country has called up tens of thousands of reservists to participate in the impending military operation.\nIn a nationwide strike on Sunday, thousands of Israelis called on Netanyahu to reach an agreement with Hamas to end the war and secure the release of the remaining captives.\nAs tensions continue to escalate, the international community is watching closely, with many calling for a peaceful resolution to the conflict. With Netanyahu’s latest statement, the situation remains uncertain, and the fate of the hostages and the future of Gaza City hang in the balance."
    },
    {
      "news_title": "Netanyahu says Israel to begin Gaza truce talks, approve Gaza City attack plan - South Asian Daily",
      "news_link": "https://southasiandaily.com/netanyahu-says-israel-to-begin-gaza-truce-talks-approve-gaza-city-attack-plan/",
      "bias": "unknown",
      "text": "Israeli Prime Minister Benjamin Netanyahu said he had instructed officials to begin “immediate negotiations” for the release of hostages in Gaza and an end to the war, while also vowing to approve military plans to seize Gaza City. “I came to approve the IDF’s (Israel Defense Forces) plans to take control of Gaza City and to defeat Hamas,” Netanyahu said on Thursday, during a visit to a military base near the Palestinian enclave. “At the same time, I instructed to begin immediate negotiations for the release of all our hostages and an end to the war on terms acceptable to Israel,” he said. Netanyahu did not say how or where the negotiations would begin, Xinhua news agency reported. Israel’s Ynet news site, citing a senior official, reported that no delegation is expected to depart for Doha or Cairo at this stage. An Israeli official told Xinhua on condition of anonymity that Netanyahu and his security cabinet were expected to convene on Thursday night to give final approval for the assault on the enclave’s largest city, The announcement came a day after the military mobilized 60,000 reservists and said 20,000 more would be called up in the coming days. Earlier this week, Hamas agreed to a proposal put forward by Egyptian and Qatari mediators for a temporary truce and the release of hostages. Israel has not yet publicly issued an official response. Meanwhile, Netanyahu also said earlier this week that Israel would agree to end the offensive only if five conditions were met: Hamas’s disarmament, the release of hostages, Gaza’s demilitarization, Israeli security control over the enclave, and the appointment of a non-Israeli body to run daily life there which, he stressed, would not be Hamas or the internationally recognized Palestinian Authority. Israeli forces continued bombardments of Gaza City overnight and carried out strikes elsewhere, killing at least 70 people and wounding 356 others, according to Gaza’s health authorities. The death toll from Israeli strikes and shootings since October 7, 2023, has risen to 62,192, with 157,114 others wounded, the authorities said. –IANS int/rs"
    },
    {
      "news_title": "Israel Will Resume Gaza Talks To End War, Secure Hostages’ Release: Netanyahu",
      "news_link": "https://stratnewsglobal.com/west-asia/israel-west-asia/israel-will-resume-gaza-talks-to-end-war-secure-hostages-release-netanyahu/",
      "bias": "unknown",
      "text": "Prime Minister Benjamin Netanyahu stated on Thursday that Israel would promptly restart negotiations aimed at securing the release of all hostages in Gaza and ending the nearly two-year war, but strictly under conditions acceptable to Israel.\nIt was Netanyahu’s first response to a temporary ceasefire proposal put forward by Egypt and Qatar that Hamas accepted on Monday. Israel will dispatch negotiators to talks once a location is set, an Israeli official said.\nSpeaking to soldiers near Israel’s border with Gaza, Netanyahu said he was still set on approving plans for defeating Hamas and capturing Gaza City, the densely populated centre at the heart of the Palestinian enclave.\nThousands of Palestinians have left their homes as Israeli tanks have edged closer to Gaza City over the last 10 days.\n“At the same time, I have issued instructions to begin immediate negotiations for the release of all our hostages and an end to the war on terms acceptable to Israel,” he said, adding: “We are in the decision-making phase.”\nGaza Takeover Plan\nIsrael’s plan to seize Gaza City was approved this month by the security cabinet, which Netanyahu chairs, even though many of Israel’s closest allies have urged the government to reconsider.\nHis latest remarks underscore the Israeli government’s view that any deal ensures the release of all 50 hostages captured in Israel in October 2023 and still held by militants in Gaza. Israeli officials believe around 20 are still alive.\nThe proposal on the table calls for a 60-day ceasefire and the release of 10 living hostages held in Gaza by Hamas militants and of 18 bodies. In turn, Israel would release about 200 long-serving Palestinian prisoners held by Israel.\nOnce the temporary ceasefire begins, the proposal is for Hamas and Israel to begin negotiations on a permanent ceasefire that would include the return of the remaining hostages.\nPalestinian Protests\nIn a sign of growing despair at conditions in Gaza, residents staged a rare show of protest against the war on Thursday.\nCarrying banners reading “Save Gaza, enough” and “Gaza is dying by the killing, hunger and oppression,” hundreds of people rallied in Gaza City in a march organised by several civil unions.\n“This is for a clear message: words are finished, and the time has come for action to stop the military operations, to stop the genocide against our people, and to stop the massacres taking place daily,” said Palestinian journalist Tawfik Abu Jarad during the protest.\nThe Gaza health ministry said at least 70 people had been killed in Israeli fire in the enclave in the past 24 hours, including eight people in a house in the Sabra suburb in Gaza City.\nA statement from the Palestinian Fatah movement said one of those killed in Sabra was a Fatah leader and former militant, along with seven members of his family. There was no immediate comment from the Israeli military.\nCeasefire Or Capture Of Gaza City?\nEven as the military begins its preparations to launch the assault on Gaza City, Israeli officials have indicated that there is time for a ceasefire to be reached.\nOn Wednesday, the military called up 60,000 reservists in a sign that the government was pressing ahead with the plan, despite international condemnation. Such a call-up is likely to take weeks.\nNetanyahu is under pressure from some far-right members of his coalition to reject a temporary ceasefire and instead continue the war and pursue the annexation of the territory.\nSome Palestinian families in Gaza City have left for shelters along the coast, while others have moved to central and southern parts of the enclave, according to residents there.\n“We are facing a bitter, bitter situation: to die at home or leave and die somewhere else. As long as this war continues, survival is uncertain,” said Rabah Abu Elias, 67, a father of seven.\n“In the news, they speak about a possible truce, but on the ground, we only hear explosions and see deaths. To leave Gaza City or not isn’t an easy decision to make,” he told Reuters by phone.\nEvacuation Warnings Issued\nOn Thursday, Israeli military spokesperson Avichay Adraee wrote on X that the military had started making what he said were initial warning calls to medical and international organisations operating in Gaza’s north, telling them that Gaza City residents should start to prepare to move out of the city and towards the south.\nAdraee shared a recording of what he said was an Israeli officer telling a Gazan health ministry official that hospitals in southern Gaza should also prepare to receive patients from medical facilities in the north, who will be forced to evacuate.\nA Gaza health ministry official confirmed the phone call had taken place. The ministry rejected the Israeli request to shift medical resources south, warning it would cripple the already devastated health system and endanger over a million residents. It urged international bodies to intervene and protect lifesaving care.\nTwo more people have died of starvation and malnutrition in Gaza in the past 24 hours, the ministry said on Thursday. The new deaths raised the number of Palestinians who have died from such causes to 271, including 112 children, since the war began.\nIsrael disputes the malnutrition and starvation figures posted by the Gaza health ministry.\n(With inputs from Reuters)"
    },
    {
      "news_title": "Israel says it will start talks to free all hostages as cabinet approves Gaza City assault",
      "news_link": "https://alkhaleejtoday.co/international/5855424/Israel-says-it-will-start-talks-to-free-all-hostages-as-cabinet-approves-Gaza-City-assault.html",
      "bias": "unknown",
      "text": "We show you our most important and recent visitors news details Israel says it will start talks to free all hostages as cabinet approves Gaza City assault in the following article\nHind Al Soulia - Riyadh - TEL AVIV — Israeli Prime Minister Benjamin Netanyahu has said he has instructed negotiations to begin for the release of all remaining hostages and an end to the war in Gaza on terms \"acceptable to Israel\".\nNetanyahu told Israeli troops on Thursday night that his cabinet had also approved plans for a massive assault on Gaza City in the north of the territory, despite widespread international and domestic opposition.\nHamas agreed to a proposal drawn up by Qatari and Egyptian mediators for a 60-day ceasefire on Monday, which according to Qatar would see the release of half of the remaining hostages in Gaza.\nBut responding for the first time, Netanyahu has not accepted the deal currently on the table.\nIsraeli media has cited an Israeli official as saying negotiators will be dispatched for renewed talks once a location has been determined.\nIn a video statement during a visit with the Gaza division's headquarters in Israel on Thursday night, Netanyahu said he had \"instructed to immediately begin negotiations for the release of all our hostages\".\n\"I have come to approve the IDF's (Israel Defense Forces) plans to take control of Gaza City and defeat Hamas,\" he said.\n\"These two matters— defeating Hamas and releasing all our hostages— go hand in hand,\" Netanyahu added, without providing details about what the next stage of talks would entail.\nIsraeli officials have this week been voicing opposition to a ceasefire deal that would only involve the partial release of hostages.\nOn Wednesday, Hamas accused Netanyahu of disregarding the mediators' ceasefire proposal and accused him of obstructing an agreement, according to a statement cited by Reuters.\nLast Saturday, Netanyahu's office put out a statement saying that Israel would only \"agree to a deal on condition that all the hostages are released in one go\", and that the conditions for ending the war included the disarming of Hamas, the demilitarisation of Gaza, Israeli control of the Gaza perimeter, and the installation of non-Hamas and non-Palestinian Authority governance.\nIsrael believes that only 20 of the 50 hostages are still alive after 22 months of war.\nMap of Gaza showing areas under Israeli military control or evacuation orders in pink, covering most of the territory— the title explains that the UN says it covers 86% of Gaza. The map highlights Gaza City in the north, Khan Younis in the centre, and Rafah in the south. A smaller inset map shows Gaza’s location relative to Israel and Jerusalem. Source OCHA (20 August)\nPalestinians said there had been heavy bombardment in eastern areas of Gaza City on Thursday, a day after the military said it had taken the first steps in the offensive.\nThe IDF has warned medical officials and international organisations to prepare for the planned evacuation of Gaza City's entire population of one million residents to shelters in the south before troops move in.\nGaza's Hamas-run health ministry said it rejected \"any step that would undermine what remains of the health system\". The UN and aid groups have vowed to stay to help those who cannot or choose not to move.\nNetanyahu announced Israel's intention to take control of the entire Gaza Strip after indirect talks with Hamas on a ceasefire and hostage release deal broke down last month.\nThe Israeli military launched a campaign in Gaza in response to the Hamas-led attack on southern Israel on 7 October 2023, in which about 1,200 people were killed and 251 others were taken hostage.\nAt least 62,192 people have been killed in Gaza since then, according to the territory's health ministry. The ministry's figures are quoted by the UN and others as the most reliable source of statistics available on casualties.— BBC\nThese were the details of the news Israel says it will start talks to free all hostages as cabinet approves Gaza City assault for this day. We hope that we have succeeded by giving you the full details and information. To follow all our news, you can subscribe to the alerts system or to one of our different systems to provide you with all that is new.\nIt is also worth noting that the original news has been published and is available at Saudi Gazette and the editorial team at AlKhaleej Today has confirmed it and it has been modified, and it may have been completely transferred or quoted from it and you can read and follow this news from its main source."
    },
    {
      "news_title": "Netanyahu Authorizes New Talks To Free All Hostages On ‘Acceptable’ Terms – altnews.org",
      "news_link": "https://altnews.org/2025/08/22/netanyahu-authorizes-new-talks-to-free-all-hostages-on-acceptable-terms/",
      "bias": "unknown",
      "text": "Netanyahu Authorizes New Talks To Free All Hostages On ‘Acceptable’ Terms\nJust as President Trump has of late highlighted the severe starvation crisis impacting Gaza’s children and vast majority of civilians, Israeli Prime Minister Benjamin Netanyahu on Thursday has confirmed that he has instructed negotiations to begin for the release of all remaining hostages.\nHe declared that he wants to end to the war in Gaza on terms “acceptable to Israel”. Still, his expanded ground operation will proceed, and while addressing Israeli troops he made clear that his cabinet approved plans for a large-scale assault on Gaza City.\nHis dispatching a negotiating team once again (to an as yet undetermined location – probably Doha) appears in immediate response to Hamas reportedly agreeing to a proposal drawn up by Qatari and Egyptian mediators for a 60-day ceasefire.\nAlso, huge protests against Netanyahu’s policies have persisted in Tel Aviv and other cities have only grown over the past days and week.\nNetanyahu did not yet accept the deal, and is at least ready to ‘talk’ about it – but this pattern of futile engagements in Qatar or Egypt has happened plenty of times before.\n“I have come to approve the IDF’s (Israel Defense Forces) plans to take control of Gaza City and defeat Hamas,” Netanyahu said.\n“These two matters – defeating Hamas and releasing all our hostages – go hand in hand,” Netanyahu added, without disclosing any further details.\nHe’s long come under fire domestically, and from the political opposition, for prioritizing a military solution ahead of the return of the hostages.\nIt’s not just Israeli media documenting starvation in Gaza. Trump himself said Gazan children are suffering from starvation and that only the “coldhearted” or “nuts” deny it.\nYet Bari Weiss and Free Press cling to their government’s line of denialism:pic.twitter.com/WQXqVni9nN https://t.co/T9bJOtxvyh\n— Glenn Greenwald (@ggreenwald) August 21, 2025\nMeanwhile, Israel and Mideast regional sources are reporting on a “classified Israeli military database shows the vast majority of Palestinians killed in Gaza are civilians, according to a joint investigation by The Guardian, +972 Magazine, and Local Call.” This figure is put at 83% of the war dead as being civilians.\n“Figures reviewed by the outlets revealed on Thursday indicate that, as of May 2025 – 19 months into Israel’s war on Gaza – Israeli military intelligence had listed 8,900 fighters from Hamas and Palestinian Islamic Jihad (PIJ) as confirmed or ‘probably’ dead,” according to the fresh reporting.\nLoading recommendations…"
    },
    {
      "news_title": "Israel PM orders start of hostage release talks",
      "news_link": "https://news.rthk.hk/rthk/en/component/k2/1819261-20250822.htm",
      "bias": "unknown",
      "text": "Israeli Prime Minister Benjamin Netanyahu on Thursday said he had ordered immediate negotiations aimed at freeing all the remaining hostages in Gaza, as Israeli troops hammered the territory's largest city ahead of a major planned offensive.\nThe call for renewed talks came a day after the defence ministry approved a plan authorising the call-up of roughly 60,000 reservists to help capture Gaza City, home to Hamas's final stronghold.\n\"I have come to approve the IDF's (military's) plans to take control of Gaza City and defeat Hamas,\" the prime minister said in a video statement filmed during a visit to the Gaza division's headquarters in Israel.\n\"At the same time, I have instructed to immediately begin negotiations for the release of all our hostages and the end of the war under conditions acceptable to Israel.\"\n\"These two matters -- defeating Hamas and releasing all our hostages – go hand in hand,\" Netanyahu said, without providing details about what the next stage of talks would entail.\nMeditators have been waiting for days for an official Israeli response to their latest ceasefire proposal, which Hamas accepted earlier this week.\nPalestinian sources have said the new deal involves staggered hostage releases, while Israel has insisted that any deal see all the captives freed at once.\nIsrael's plans to expand the fighting and seize Gaza City have sparked international outcry as well as domestic opposition, with the Red Cross joining the condemnation on Thursday, calling the moves \"intolerable\".\nAhead of the offensive, the Israeli military said the call-up of the reservists would begin in early September, adding the second phase of operation \"Gideon's Chariots\" had begun.\nEarlier, Gaza City residents described relentless bombardments overnight.\n\"The house shakes with us all night long – the sound of explosions, artillery, warplanes, ambulances, and cries for help is killing us,\" Ahmad al-Shanti told AFP.\nAnother resident, Amal Abdel-Aal, said she watched the heavy strikes on the area, a week after being displaced from her home in Gaza City's Al-Sabra neighbourhood.\n\"No one in Gaza has slept -- not last night, not for a week. The artillery and air strikes in the east never stop. The sky flashes all night long,\" she added. (AFP)"
    },
    {
      "news_title": "Netanyahu: Israel will start negotiations to release all hostages - World Stock Market",
      "news_link": "https://www.worldstockmarket.net/netanyahu-israel-will-start-negotiations-to-release-all-hostages/",
      "bias": "unknown",
      "text": "Benjamin Netanyahu said he had ordered the negotiations to launch the liberation of all the rest of the hostages and to end the Gaza war on “acceptable to Israel” terms. Netanyahu pointed out to Israeli troops on Thursday night that his cabinet had also approved plans for a mass business in the city of Gaza, in the northern part of the area, despite the large international and internal opposition. Hamas agreed on a proposal made by Qatarian and Egyptian mediators for a 60 -day truce on Monday, which, according to Qatar, would lead to the release of half of the rest of the hostages in Gaza. However, in response for the first time, Netanyahu has not accepted the deal currently on the table. Local media cited an Israeli official, according to which negotiators will be sent for new talks as soon as the site is set. In a video during his visit to the headquarters of the Gaza Directorate in Israel the […]\nSource: News Beast\nWith 6 years of experience, I bring to the table captivating and informative writing in the world news category. My expertise covers a range of industries, including tourism, technology, forex and stocks. From brief social media posts to in-depth articles, I am dedicated to creating compelling content for various platforms."
    },
    {
      "news_title": "Netanyahu Approves Plan to Control Gaza City post-War, as Reported by De Telegraaf – Archyde",
      "news_link": "https://www.archyde.com/netanyahu-approves-plan-to-control-gaza-city-post-war-as-reported-by-de-telegraaf/",
      "bias": "unknown",
      "text": "Israel Advances Offensive in Gaza City Amidst International Scrutiny\nTable of Contents\n- 1. Israel Advances Offensive in Gaza City Amidst International Scrutiny\n- 2. Escalation Following Rocket Attacks\n- 3. Netanyahu’s Strategic Objectives\n- 4. International Reactions and Concerns\n- 5. Impact on Regional Stability\n- 6. The History of the Israeli-Palestinian Conflict\n- 7. Frequently Asked Questions about the gaza Conflict\n- 8. What are the key details of NetanyahuS plan for controlling Gaza City post-war, as reported by De Telegraaf?\n- 9. Netanyahu Approves Plan to Control Gaza City Post-War, as Reported by De Telegraaf\n- 10. The De Telegraaf Report: A Deep Dive into Israel’s Post-Conflict Strategy for Gaza\n- 11. Key Components of the Gaza City Control Plan\n- 12. Implications for the Israeli-Palestinian Conflict\n- 13. Netanyahu’s Recent Statements & Context\n- 14. Challenges to Implementation\n- 15. Gaza Reconstruction: A Historical Outlook\n- 16. Keywords & Related Search Terms\nGaza City – Israel’s military has commenced a critically importent offensive operation within Gaza City, authorized by Prime Minister Benjamin Netanyahu.This action follows a period of escalated tensions and rocket attacks originating from the region. The offensive is intended to dismantle Hamas infrastructure and secure long-term control, according to official statements.\nEscalation Following Rocket Attacks\nThe current military operation was preceded by a significant rocket barrage launched towards Israel. Authorities reported a significant number of rockets were intercepted by defense systems, minimizing casualties and damage. However, the attacks prompted a swift and forceful response from Israeli forces. According to the NRC, the offensive was initiated shortly after the rocket attacks subsided.\nNetanyahu’s Strategic Objectives\nPrime Minister Netanyahu has publicly affirmed his commitment to achieving a decisive outcome in Gaza. He indicated the offensive aims to eliminate Hamas’s capabilities and establish lasting security for Israeli citizens. Reports suggest the plan includes a phased approach, beginning with targeted strikes and possibly extending to full-scale ground operations. The stated end goal is complete control of Gaza City following the cessation of hostilities.\nInternational Reactions and Concerns\nThe intensification of conflict has elicited a range of responses from the international community. The netherlands, along with other nations, has expressed concern regarding the escalating violence and the potential for civilian casualties. Criticism has been leveled at Israel’s tactics, particularly following attacks on densely populated areas within gaza City, as reported by NOT. Several nations are actively considering diplomatic measures to de-escalate the situation.\nImpact on Regional Stability\nThe conflict in Gaza has wider implications for regional stability. Observers worry about potential spillover effects into neighboring countries and the possibility of broader escalation. Wierd Duk, a prominent political analyst, stated that the current war is already significantly impacting societal structures.Negotiations are underway, with Israel seeking to secure the release of hostages held by hamas, according to Het Financieele Dagblad.\n| Key Actor | Role | Objective |\n|---|---|---|\n| Israel | Military Force | Eliminate Hamas, secure Control of Gaza City |\n| Hamas | militant Group | Resistance against Israeli Occupation |\n| Netanyahu | Prime minister | Authorize and Oversee Military operation |\n| International Community | Diplomatic Pressure | De-escalation and Protection of Civilians |\nDid You Know? The Gaza Strip has a population density of over 7,000 people per square kilometer, making it one of the moast densely populated areas in the world.\nSource: UNRWA (United Nations Relief and Works Agency for Palestine Refugees in the Near East)\nPro Tip: Staying informed about conflicts requires consulting multiple news sources to gain a comprehensive understanding of the situation.\nSource: Poynter Institute – Fact-Checking Resources\nWhat long-term effects will this offensive have on the people of Gaza? How can the international community contribute to a enduring resolution to this conflict?\nThe History of the Israeli-Palestinian Conflict\nThe Israeli-Palestinian conflict is a decades-long dispute rooted in competing claims to the same territory. It’s origins trace back to the late 19th and early 20th centuries, with the rise of Zionism and Arab nationalism. Key events, such as the 1948 Arab-Israeli War (often referred to as the ‘Nakba’ by Palestinians), the Six-Day War in 1967, and the ongoing Israeli occupation of Palestinian territories have shaped the conflict. Attempts at peace negotiations have been frequent but largely unsuccessful in achieving a lasting resolution. The core issues remain unresolved, including the status of Jerusalem, the right of return for Palestinian refugees, and the establishment of a sovereign Palestinian state.\nFrequently Asked Questions about the gaza Conflict\nShare your thoughts in the comments below and help us continue to provide insightful coverage.\nWhat are the key details of NetanyahuS plan for controlling Gaza City post-war, as reported by De Telegraaf?\nNetanyahu Approves Plan to Control Gaza City Post-War, as Reported by De Telegraaf\nThe De Telegraaf Report: A Deep Dive into Israel’s Post-Conflict Strategy for Gaza\nDutch newspaper de Telegraaf recently reported that Israeli Prime Minister Benjamin Netanyahu has approved a detailed plan for controlling Gaza City following the conclusion of the ongoing conflict.This plan, reportedly developed by the Israeli military and intelligence agencies, outlines a phased approach to security, governance, and reconstruction within the devastated city. The report comes amidst continued international scrutiny regarding the future of Gaza and the potential for a long-term Israeli presence. This article will dissect the key elements of the plan, potential challenges, and the broader geopolitical implications.\nKey Components of the Gaza City Control Plan\nThe De Telegraaf report details several core components of Netanyahu’s approved strategy:\nSecurity Dominance: The initial phase focuses on establishing complete Israeli security control over Gaza City.This includes dismantling Hamas infrastructure,neutralizing remaining militant cells,and preventing the re-emergence of organized resistance.This will likely involve a critically important and sustained military presence.\nPhased Withdrawal & Local Governance: The plan envisions a gradual withdrawal of Israeli forces as security stabilizes,replaced by a locally-appointed Palestinian management vetted and overseen by Israel. The specifics of this administration – its composition,powers,and accountability – remain unclear.\nReconstruction Efforts: Concurrent with security operations, a reconstruction program is planned, focusing on essential infrastructure like hospitals, schools, and housing. Funding sources and the role of international aid organizations are critical aspects of this phase.\nBorder Control: Strict control over the borders of Gaza City,including the Rafah crossing with Egypt,is a central element.Israel intends to maintain oversight of all goods and personnel entering and exiting the city to prevent the inflow of weapons and materials used for militant activities.\nIntelligence Gathering: A robust intelligence network will be established to monitor potential threats and maintain situational awareness. This will likely involve collaboration with local sources and advanced surveillance technologies.\nImplications for the Israeli-Palestinian Conflict\nThis plan represents a significant shift in Israel’s approach to Gaza. Previous operations have focused on short-term military objectives, while this plan outlines a long-term strategy for control and governance.\nPotential for Prolonged Occupation: Critics argue that the plan effectively amounts to a prolonged occupation of Gaza City, raising concerns about international law and the rights of the Palestinian population.\nImpact on Palestinian Authority: The plan’s reliance on a locally-appointed administration, rather than strengthening the Palestinian Authority (PA) in Ramallah, could further weaken the PA’s legitimacy and control.\nRegional Instability: The situation in Gaza has broader regional implications, potentially exacerbating tensions with Egypt and other neighboring countries.\nHumanitarian Concerns: The ongoing conflict and the planned control measures raise serious humanitarian concerns, including access to essential services, freedom of movement, and the protection of civilians.\nNetanyahu’s Recent Statements & Context\nRecent statements by Prime Minister Netanyahu, as reported by The Times of Israel on August 21, 2025, highlight his firm stance on Iran and his commitment to Israeli security. While not directly referencing the De Telegraaf report,his claim of a “historic victory” against Iran’s nuclear program and his emphasis on israel’s self-reliance suggest a willingness to pursue independent security strategies,even in the face of international pressure.His acknowledgement of a strong relationship with former President Trump also hints at a preference for unilateral action when necessary. This context is crucial for understanding the rationale behind the Gaza City control plan.\nChallenges to Implementation\nImplementing this plan will be fraught with challenges:\nHamas Resistance: despite significant setbacks,Hamas retains the capacity to launch attacks and disrupt security operations.\nPalestinian Opposition: Widespread Palestinian opposition to Israeli control could lead to civil unrest and further violence.\ninternational Pressure: The international community is likely to demand a clear path towards a two-state solution and oppose any long-term Israeli occupation.\nEconomic Costs: Maintaining a significant military presence and funding reconstruction efforts will be costly.\nLogistical Complexities: Governing a densely populated and war-torn city presents significant logistical challenges.\nGaza Reconstruction: A Historical Outlook\nPast reconstruction efforts in Gaza have faced numerous obstacles,including restrictions on the import of building materials,political infighting,and the ongoing conflict. Following the 2014 Gaza War, such as, international pledges of aid were slow to materialize, and reconstruction progress was hampered by Israeli blockades and Hamas’s diversion of resources. The success of the current reconstruction program will depend on overcoming these past failures and ensuring openness and accountability.\nGaza City\nNetanyahu\nIsrael-Palestine Conflict\nGaza Reconstruction\nHamas\nIsraeli occupation\nDe Telegraaf\nPost-War Gaza\nGaza Control Plan\npalestinian authority\nRafah Crossing\nIran Nuclear Program\nIsraeli Security\nBenjamin Netanyahu\n*"
    },
    {
      "news_title": "Netanyahu announces plans for ending Gaza war on Israeli terms – The Standard Newspaper",
      "news_link": "https://thestandardnewspaper.online/netanyahu-announces-plans-for-ending-gaza-war-on-israeli-terms/",
      "bias": "unknown",
      "text": "Midday news powered by Wanner Digital Media, Inc.\nIn Philippians 2, the Apostle Paul gives one\nBULLHEAD CITY — A Bullhead City woman died\nLAKE HAVASU CITY — A Lake Havasu City\nDear Editor, Do you remember the movie “Red\nDear Editor, Do you remember the movie “Red\nKINGMAN — Kingman Parks and Recreation will be\nMidday news powered by Wanner Digital Media, Inc.\nCelebrating 34 Years in Mohave County!\n(928) 753-1143\nnews@thestandardnewspaper.net\n221 E Beale St, Kingman, AZ 86401\n© 2024 Mohave County Newspapers. All Rights Reserved."
    },
    {
      "news_title": "Netanyahu Orders Immediate Talks to End War, Secure Hostages Amid Gaza Situation",
      "news_link": "https://loudfact.com/netanyahu-orders-immediate-talks-to-end-war-secure-hostages-amid-gaza-situation/",
      "bias": "unknown",
      "text": "Israeli Prime Minister Benjamin Netanyahu announced on Thursday that he would approve the military’s plan to take over Gaza City while simultaneously ordering the resumption of immediate negotiations to free all remaining hostages.\nMeanwhile, the Israeli army continued heavy strikes on Gaza’s largest city ahead of the planned major offensive.\n“I have come to approve the IDF’s (military’s) plans to take control of Gaza City and defeat Hamas,” Netanyahu said in a video statement. “At the same time, I have instructed to immediately begin negotiations for the release of all our hostages and the end of the war under conditions acceptable to Israel.”\nIsrael Mobilizes Reservists for Gaza Operation\nThe call for renewed negotiations follows the defense ministry’s approval to call up around 60,000 reservists to assist in taking over Gaza City, the final stronghold of Hamas.\nNetanyahu added:\n“These two matters – defeating Hamas and releasing all our hostages – go hand in hand.”\nMediators have been awaiting an official Israeli response after Hamas accepted the latest ceasefire proposal earlier this week. The proposal included the staggered release of hostages, but Israel insists all captives be released at once, according to Palestinian sources.\nHamas and International Reactions\nHamas condemned Israel’s Gaza takeover plan, calling it a blatant disregard for mediation efforts.\n“Today’s announcement by the terrorist occupation army of the start of an operation against Gaza City and its nearly one million residents and displaced persons… demonstrates… a blatant disregard for the efforts made by the mediators,” the group said in a statement.\nThe Red Cross also criticized the move, calling Israel’s actions “intolerable.”\nMilitary Operations Intensify\nIsraeli reservists are expected to be called up in early September, marking the second phase of Operation Gideon’s Chariots.\nAirstrikes on the northern outskirts of Gaza City on Thursday caused massive explosions and plumes of smoke.\n“We are advancing with the efforts toward operations in Gaza City,” military chief Eyal Zamir told troops. “We already have troops operating on the outskirts of the city, and more forces will join them later on.”\nThe Israeli military has informed medical personnel and air groups in northern Gaza to prepare for evacuation and transfer equipment south.\nHowever, the Gaza Health Ministry rejected these instructions, warning they would undermine the already strained health system.\nThe UN humanitarian agency has also cautioned that Israel’s expansion of military operations could have a “horrific humanitarian impact” on Gaza’s exhausted population."
    },
    {
      "news_title": "Israel Initiates Ceasefire Dialogue, Netanyahu Announces - The Global Herald",
      "news_link": "https://theglobalherald.com/news/israel-initiates-ceasefire-dialogue-netanyahu-announces/",
      "bias": "unknown",
      "text": "Table of Contents\nCeasefire Negotiations Set to Begin\nIsraeli Prime Minister Benjamin Netanyahu has announced that negotiations are set to commence regarding the release of hostages and a potential ceasefire in Gaza, stating that the terms must be “acceptable to Israel.”\nPlans for Military Action\nDuring a briefing with Israeli troops, Netanyahu revealed that his cabinet had approved a significant military campaign targeting Gaza City, despite facing considerable opposition both internationally and domestically.\nHamas’ Proposal for Ceasefire\nOn a related note, Hamas has agreed to a ceasefire proposal brokered by mediators from Qatar and Egypt. The plan, proposed on Monday, consists of a 60-day ceasefire that would potentially lead to the release of half of the hostages remaining in Gaza, according to Qatari officials.\nNetanyahu’s Response\nNetanyahu’s response to the proposal indicates a preference for a more comprehensive solution, as he has yet to accept the terms currently on the table.\nDetails from Netanyahu’s Address\nIn a video message from the headquarters of the Gaza division on Thursday night, Netanyahu stated that he has “instructed to immediately begin negotiations for the release of all our hostages.” He emphasized that military strategies are in place to capture Gaza City and defeat Hamas, asserting, “These two matters – defeating Hamas and releasing all our hostages – go hand in hand,” though he did not disclose specifics regarding the next talking points.\nOpposition to Partial Ceasefire\nIsraeli officials have expressed their discontent with a ceasefire deal that includes only a partial release of hostages. Reports suggest that only about 20 of the 50 remaining hostages are believed to be alive after nearly two years of conflict.\nMilitary Preparations for Evacuation\nAdditionally, Israeli military sources have communicated warnings to medical personnel and international organizations to prepare for the evacuation of approximately one million residents from Gaza City, ahead of an anticipated offensive operation."
    }
  ]
}